#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ НЕ УТКА
	МеханизмыДокумента.Добавить("МеждународныйУчет");
	//-- НЕ УТКА
	МеханизмыДокумента.Добавить("ОборотныеРегистрыУправленческогоУчета");
	МеханизмыДокумента.Добавить("УчетДоходовРасходов");
	МеханизмыДокумента.Добавить("УчетПрочихАктивовПассивов");
	МеханизмыДокумента.Добавить("РеестрДокументов");
	
	РасчетКурсовыхРазницЛокализация.ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента);
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * ТаблицаИмяРегистра - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.РасчетКурсовыхРазниц") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоСрокам(ТекстыЗапроса);
			ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоСрокам(ТекстыЗапроса);
		Иначе
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса);
			ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса);
		КонецЕсли;
		ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаФинансовыеИнструменты(ТекстыЗапроса);
		//++ НЕ УТ
		ТекстЗапросаВтТаблицаРезервыПоСомнительнымДолгам(ТекстыЗапроса);
		//-- НЕ УТ
		ТекстЗапросаВтТаблицаСуммыДисконтирования(ТекстыЗапроса);
		
		ТекстЗапросаВтТоварыКОформлениюОтчетовКомитенту(ТекстыЗапроса);
		ТекстЗапросаВтТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках(ТекстыЗапроса);
		ТекстЗапросаВтУслугиКОформлениюОтчетовПринципалу(ТекстыЗапроса);
		
		ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса);
		ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса);
		ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса);
		ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса);
		//++ НЕ УТ
		ТекстЗапросаВтИнвестицииВАренду(ТекстыЗапроса);
		//-- НЕ УТ
	
		// Таблицы on-line движений
		ТекстЗапросаТаблицаПрочиеДоходы(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(ТекстыЗапроса, Регистры);
		
		ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(ТекстыЗапроса, Регистры);
		
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
		
		РасчетКурсовыхРазницЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	РасчетКурсовыхРазницЛокализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);

КонецПроцедуры

// Добавляет команду создания документа "Расчет курсовых разниц".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
// 	Неопределено
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.РасчетКурсовыхРазниц) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РасчетКурсовыхРазниц.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.РасчетКурсовыхРазниц);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьНесколькоВалют";
	
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	РасчетКурсовыхРазницЛокализация.ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры);

КонецПроцедуры

// Возвращает регистры переоценки для заданной хозяйственной операции.
// Если хозяйственная операция не задана, то возвращаются все оперативные регистры переоцениваемые документом.
//
// Параметры:
//  Операция - ПеречислениеСсылка.ХозяйственныеОперации - хозяйственная операция для которой необходимо получить список регистров.
//	ИменаРегистров - Структура - структура с ранее заполненными именами регистров (для добавления новых регистров).
//
// Возвращаемое значение:
//  Структура из КлючИЗначение - в ключах структуры перечислены имена переоцениваемых регистров
//
Функция РегистрыРасчета(Операция = Неопределено, ИменаРегистров = Неопределено) Экспорт
	
	Если ИменаРегистров = Неопределено Тогда
		ИменаРегистров = Новый Структура;
	КонецЕсли;
	
	НоваяАрхитектура = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками ИЛИ Операция = Неопределено Тогда
		Если НоваяАрхитектура Тогда
			ИменаРегистров.Вставить("РасчетыСПоставщикамиПоСрокам");
		Иначе
			ИменаРегистров.Вставить("РасчетыСПоставщикамиПоДокументам");
		КонецЕсли;
	КонецЕсли;
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами ИЛИ Операция = Неопределено Тогда
		Если НоваяАрхитектура Тогда
			ИменаРегистров.Вставить("РасчетыСКлиентамиПоСрокам");
		Иначе
			ИменаРегистров.Вставить("РасчетыСКлиентамиПоДокументам");
		КонецЕсли;
	КонецЕсли;
		
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("ДенежныеСредстваБезналичные");
		ИменаРегистров.Вставить("ДенежныеСредстваНаличные");
		ИменаРегистров.Вставить("ДенежныеСредстваВКассахККМ");
		ИменаРегистров.Вставить("ДенежныеСредстваВПути");
		ИменаРегистров.Вставить("ДенежныеСредстваУПодотчетныхЛиц");
	КонецЕсли;
		
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов ИЛИ Операция = Неопределено Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") Тогда
			ИменаРегистров.Вставить("РасчетыПоФинансовымИнструментам");
		КонецЕсли;
		//++ НЕ УТ
		Если ПолучитьФункциональнуюОпцию("ИспользуетсяПередачаВАрендуСубарендуПоФСБУ25") Тогда
			ИменаРегистров.Вставить("ИнвестицииВАренду");
		КонецЕсли;
		//-- НЕ УТ
	КонецЕсли;
	//++ НЕ УТ
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("РасчетыПоФинансовымИнструментам");
	КонецЕсли;
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРезервовПоСомнительнымДолгам ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("РезервыПоСомнительнымДолгам");
	КонецЕсли;
	//-- НЕ УТ
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаСуммДисконтирования ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("ПроцентныеРасходыДисконтирования");
	КонецЕсли;
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКомитентом ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("ТоварыКОформлениюОтчетовКомитенту");
		ИменаРегистров.Вставить("ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках");
		ИменаРегистров.Вставить("УслугиКОформлениюОтчетовПринципалу");
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ДополнитьРегистрыРасчета(ИменаРегистров, Операция);
	
	Возврат ИменаРегистров;
	
КонецФункции

// Выполняет переоценку всего чего возможно в оперативном учете.
//	Переоцениваются:
//	- Остатки денежных средств.
//	- Взаиморасчеты с клиентами.
//	- Взаиморасчеты с поставщиками.
//	- Остатки по кредитам, депозитам, займам.
//
// Параметры:
//	Период - Дата - любая дата месяца за который необходимо провести переоценку
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//
Процедура ВыполнитьПереоценку(Период, Организация = Неопределено) Экспорт
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами);
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками);
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов);
	//++ НЕ УТ
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРезервовПоСомнительнымДолгам);
	//-- НЕ УТ
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаСуммДисконтирования);
	
КонецПроцедуры

// Выполняет переоценку остатков денежных средств.
//
// Параметры:
//	МассивОрганизаций - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации - Организация (список организаций) по которой необходимо выполнить переоценку.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//
Процедура ПереоценитьДенежныеСредства(МассивОрганизаций, Период) Экспорт
	
	Для Каждого Организация Из ОбщегоНазначенияУТКлиентСервер.Массив(МассивОрганизаций) Цикл
		ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет переоценку остатков наличных денежных средств в заданных кассах организации.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.Кассы, Массив из СправочникСсылка.Организации, Неопределено - Касса (список касс) по которой необходимо выполнить переоценку.
//	                   Если не задана, то для всех.
//
Процедура ПереоценитьКассыОрганизации(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств;
	РегистрыДляРасчета = Новый Структура("ДенежныеСредстваНаличные");
	Аналитика = Новый Структура("Кассы", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, РегистрыРасчета", Аналитика, РегистрыДляРасчета);
	
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	
КонецПроцедуры

// Выполняет переоценку остатков денежных средств у подотчетных лиц.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.ФизическиеЛица, Массив из СправочникСсылка.ФизическиеЛица, Неопределено - Физическое лицо (список лиц) у которых необходимо выполнить переоценку.
//	                   Если не задано, то для всех.
//
Процедура ПереоценитьДенежныеСредстваУПодотчетныхЛиц(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств;
	РегистрыДляРасчета = Новый Структура("ДенежныеСредстваУПодотчетныхЛиц");
	Аналитика = Новый Структура("ФизическиеЛица", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, РегистрыРасчета", Аналитика, РегистрыДляРасчета);
	
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	
КонецПроцедуры

// Выполняет переоценку взаиморасчетов с клиентами.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив из СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Неопределено - АналитикаУчетаПоПартнерам (список аналитик)
//	                   по которой необходимо выполнить переоценку. Если не задана, то для всех.
//	КоличествоОбработанныхЭлементов - Число - в переменную помещается количество записанных записей
//                                            в регистр РасчетыСКлиентамиПоДокументам при расчете курсовых разниц.
//
Процедура ПереоценитьРасчетыСКлиентами(Организация, Период, АналитикаРасчета = Неопределено, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, КоличествоОбработанныхЭлементов", Аналитика, КоличествоОбработанныхЭлементов);
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	КоличествоОбработанныхЭлементов = ПараметрыПереоценки.КоличествоОбработанныхЭлементов;
	
КонецПроцедуры

// Выполняет переоценку взаиморасчетов с поставщиками.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив из СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Неопределено - АналитикаУчетаПоПартнерам (список аналитик)
//	                   по которой необходимо выполнить переоценку. Если не задана, то для всех.
//	КоличествоОбработанныхЭлементов - Число - в переменную помещается количество записанных записей
//                                            в регистр РасчетыСПоставщикамиПоДокументам при расчете курсовых разниц.
//
Процедура ПереоценитьРасчетыСПоставщиками(Организация, Период, АналитикаРасчета = Неопределено, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, КоличествоОбработанныхЭлементов", Аналитика, КоличествоОбработанныхЭлементов);
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	КоличествоОбработанныхЭлементов = ПараметрыПереоценки.КоличествоОбработанныхЭлементов;
	
КонецПроцедуры

// Выполняет переоценку кредитов, депозитов, займов.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//  АналитикаРасчета - ПеречислениеСсылка.ТипыСуммГрафикаКредитовИДепозитов, Массив из ПеречислениеСсылка.ТипыСуммГрафикаКредитовИДепозитов, Неопределено - Типы сумм по которым необходимо провести переоценку.//	
//
Процедура ПереоценитьФинансовыеИнструменты(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	ПараметрыПереоценки = Новый Структура;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки.Вставить("АналитикаРасчета", Аналитика);
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов, ПараметрыПереоценки);
	
КонецПроцедуры
//++ НЕ УТ

// Выполняет переоценку аренды.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//  АналитикаРасчета - ПеречислениеСсылка.ТипыПлатежейПоАренде, Массив из ПеречислениеСсылка.ТипыПлатежейПоАренде, Неопределено - Типы сумм по которым необходимо провести переоценку.	
//
Процедура ПереоценитьАренду(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	ПараметрыПереоценки = Новый Структура;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки.Вставить("АналитикаРасчета", Аналитика);
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде, ПараметрыПереоценки);
	
КонецПроцедуры

// Выполняет переоценку резервов по сомнительным долгам.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив из СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Неопределено - Касса (список касс) по которой необходимо выполнить переоценку.
//	                   Если не задана, то для всех.
//
Процедура ПереоценитьРезервыПоСомнительнымДолгам(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРезервовПоСомнительнымДолгам;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета", Аналитика);
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	
КонецПроцедуры
//-- НЕ УТ

// Выполняет переоценку процентных расходов сумм дисконтирования.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив из СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Неопределено - Касса (список касс) по которой необходимо выполнить переоценку.
//	                   Если не задана, то для всех.
//
Процедура ПереоценитьСуммыДисконтирования(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаСуммДисконтирования;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета", Аналитика);
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	
КонецПроцедуры

// Выполняет переоценку расчетов с комитентом/комиссионером.
//
// Параметры:
//	МассивОрганизаций - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации - Организация (список организаций) по которой необходимо выполнить переоценку.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//
Процедура ПереоценитьРасчетыПоКомиссии(МассивОрганизаций, Период) Экспорт
	
	Для Каждого Организация Из ОбщегоНазначенияУТКлиентСервер.Массив(МассивОрганизаций) Цикл
		ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКомитентом);
	КонецЦикла;
	
КонецПроцедуры

// Отразить доходы и расходы от курсовых разниц при взаиморасчетах с партнерами в учете.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций)
//                по которой необходимо выполнить отражение курсовых разниц.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//
Процедура ОтразитьКурсовыеРазницыПоРасчетам(Организация, Период) Экспорт
	
	ПереоценитьРасчетыСПоставщиками(Организация, Период);
	ПереоценитьРасчетыСКлиентами(Организация, Период);
	
КонецПроцедуры

// Возвращает документы расчета курсовых разниц за указанный период (одни или произвольное число месяцев)
// в виде соответствия ДатаНачалаМесяца - ДокументРасчетаЭтогоМесяца.
// Количество документов равно количеству месяцев в указанном периоде.
// Если в каком-то из месяцев не найдется проведенного документа, то он будет создан.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация по которой необходимо получить документы расчета курсовых разниц
//	НачалоПериода - Дата - Дата начало периода выборки документов (будет приведена к началу месяца)
//	КонецПериода - Дата - Дата конца периода выборки документов (будет приведена к концу месяца)
//	ЭтоРасчетыСКлиентами - Булево - Если Истина, то отбирать документы переоценки по клиентам иначе по поставщикам
//
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - в ключах соответствия дата начала месяца, в значениях документ расчета курсовых разниц соответствующего месяца:
//		* Ключ - Дата - Дата переоценки.
//		* Значение - ДокументСсылка.РасчетКурсовыхРазниц - Регистратор.
//
Функция ДокументыПереоценки(Организация, НачалоПериода, КонецПериода, ЭтоРасчетыСКлиентами) Экспорт
	
	Если НачалоПериода <= Дата('19800101') ИЛИ НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		ВызватьИсключение НСтр("ru = 'Задана некорректная дата первого периода расчета курсовых разниц.';
								|en = 'Incorrect date of the first period of exchange difference calculation is specified.'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокументыПереоценки = Новый Соответствие;
	РазностьМесяцев = Месяц(КонецПериода) - Месяц(НачалоПериода) + 12*(Год(КонецПериода) - Год(НачалоПериода));
	Для ИндексМесяца = 0 По РазностьМесяцев Цикл
		НовыйМесяц = ДобавитьМесяц(НачалоПериода, ИндексМесяца);
		ДокументыПереоценки.Вставить(НачалоМесяца(НовыйМесяц));
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РасчетКурсовыхРазниц.Дата, МЕСЯЦ) КАК Дата,
	|	РасчетКурсовыхРазниц.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК РасчетКурсовыхРазниц
	|ГДЕ
	|	НЕ РасчетКурсовыхРазниц.ПометкаУдаления
	|	И РасчетКурсовыхРазниц.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетКурсовыхРазниц.Организация = &Организация
	|	И РасчетКурсовыхРазниц.ХозяйственнаяОперация = &ХозяйственнаяОперация");
	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	Если ЭтоРасчетыСКлиентами Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументыПереоценки[Выборка.Дата] = Выборка.Ссылка;
	КонецЦикла;
	
	ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	Для Каждого Регистратор Из ДокументыПереоценки Цикл
		Если Регистратор.Значение = Неопределено Тогда
			ОбъектДокумента = Документы.РасчетКурсовыхРазниц.СоздатьДокумент();
			ОбъектДокумента.Дата = КонецМесяца(Регистратор.Ключ);
			ОбъектДокумента.Организация = Организация;
			ОбъектДокумента.ХозяйственнаяОперация = ХозяйственнаяОперация;
			ОбъектДокумента.ПереоценкаПоДням = ПереоценкаПоДням;
			ОбъектДокумента.Проведен = Истина;
			ОбъектДокумента.Записать();
			ДокументыПереоценки[Регистратор.Ключ] = ОбъектДокумента.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДокументыПереоценки;
	
КонецФункции

// Возвращает документы расчета курсовых разниц за указанный период (одни или произвольное число месяцев)
// в виде индексированной таблицы значений документов в разрезе месяцев и организаций.
// В одном периоде для одной организации может быть только один документ расчета кусровых разниц.
// Если в каком-то из месяцев для какой-то организации не найдется проведенного документа, то он будет создан.
//
// Параметры:
//	МассивОрганизаций - Массив из СправочникСсылка.Организации - Массив организаций по которым необходимо получить документы расчета курсовых разниц
//	НачалоПериода - Дата - Дата начало периода выборки документов (будет приведена к началу месяца)
//	КонецПериода - Дата - Дата конца периода выборки документов (будет приведена к концу месяца)
//	ЭтоРасчетыСКлиентами - Булево - Если Истина, то отбирать документы переоценки по клиентам иначе по поставщикам
//
// Возвращаемое значение:
//	ТаблицаЗначений - в ключах соответствия дата начала месяца, в значениях документ расчета курсовых разниц соответствующего месяца:
//		* Дата - Дата - Период переоценки (Начало месяца).
//		* Организация - СправочникСсылка.Организации - владелец документа.
//		* Ссылка - ДокументСсылка.РасчетКурсовыхРазниц - документ расчета кусровых разниц.		
//
Функция ДокументыПереоценкиПоОрганизациям(МассивОрганизаций, НачалоПериода, КонецПериода, ЭтоРасчетыСКлиентами) Экспорт
	
	Если НачалоПериода <= Дата('19800101') ИЛИ НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		ВызватьИсключение НСтр("ru = 'Задана некорректная дата начала расчета курсовых разниц.
		|Возможно в регистре сведений ""Задания к закрытию месяца"" имеются даты ранее 01.01.1980';
		|en = 'An incorrect start date for calculating exchange differences is set.
		|The ""Jobs for month-end closing"" information register might contain dates earlier than 01/01/1980'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РасчетКурсовыхРазниц.Дата, МЕСЯЦ) КАК Дата,
	|	РасчетКурсовыхРазниц.Организация КАК Организация,
	|	РасчетКурсовыхРазниц.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК РасчетКурсовыхРазниц
	|ГДЕ
	|	НЕ РасчетКурсовыхРазниц.ПометкаУдаления
	|	И РасчетКурсовыхРазниц.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетКурсовыхРазниц.Организация В (&МассивОрганизаций)
	|	И РасчетКурсовыхРазниц.ХозяйственнаяОперация = &ХозяйственнаяОперация");
	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	Если ЭтоРасчетыСКлиентами Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	ДокументыПереоценки = Запрос.Выполнить().Выгрузить();
	
	ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	РазностьМесяцев = Месяц(КонецПериода) - Месяц(НачалоПериода) + 12*(Год(КонецПериода) - Год(НачалоПериода));
	Для ИндексМесяца = 0 По РазностьМесяцев Цикл
		Период = ДобавитьМесяц(НачалоМесяца(НачалоПериода), ИндексМесяца);
		Для Каждого Организация Из МассивОрганизаций Цикл
			СтруктураПоискаДокумента = Новый Структура("Дата, Организация", Период, Организация);
			НайденныеДокументы = ДокументыПереоценки.НайтиСтроки(СтруктураПоискаДокумента);// Массив из СтрокаТаблицыЗначений
			Если НайденныеДокументы.Количество() = 0 Тогда
				ОбъектДокумента = Документы.РасчетКурсовыхРазниц.СоздатьДокумент();
				ОбъектДокумента.Дата = КонецМесяца(Период);
				ОбъектДокумента.Организация = Организация;
				ОбъектДокумента.ХозяйственнаяОперация = ХозяйственнаяОперация;
				ОбъектДокумента.ПереоценкаПоДням = ПереоценкаПоДням;
				ОбъектДокумента.Проведен = Истина;
				ОбъектДокумента.Записать();
				
				НовыйДокумент = ДокументыПереоценки.Добавить();
				НовыйДокумент.Дата = Период;
				НовыйДокумент.Организация = Организация;
				НовыйДокумент.Ссылка = ОбъектДокумента.Ссылка;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	ДокументыПереоценки.Индексы.Добавить("Дата");
	ДокументыПереоценки.Индексы.Добавить("Организация");
	
	Возврат ДокументыПереоценки;
	
КонецФункции
//++ НЕ УТ

// Возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчете() Экспорт

	Возврат РасчетКурсовыхРазницЛокализация.ТекстОтраженияВРеглУчете();

КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, необходимых для отражения в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт

	Возврат РасчетКурсовыхРазницЛокализация.ТекстЗапросаВТОтраженияВРеглУчете();

КонецФункции
//-- НЕ УТ

#Область ФормированиеЗаданийКЗакрытиюМесяца

// Дополняет текст запроса механизма формирования заданий закрытия месяца.
//
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 	ТекстЗапроса - Строка - строка с текстом запроса.
// 	ТекстЗапросаВременныхТаблиц - Строка - строка с текстом запроса временных таблиц.
// 	ИменаВременныхТаблиц - Строка - массив имен создаваемых временных таблиц для последующего уничтожения.
Процедура ДополнитьТекстЗапросаЗаданийКЗакрытиюМесяца(Запрос, ТекстЗапроса, ТекстЗапросаВременныхТаблиц, ИменаВременныхТаблиц) Экспорт
	
	СоответствиеЗапросов = СоответствиеЗапросовКонтрольнымРегистрам(Запрос);
	
	Для Каждого ЭлементСоответствия Из СоответствиеЗапросов Цикл
		ЗакрытиеМесяцаСервер.ДополнитьНазванияТаблицДляЗаданий(Запрос, ЭлементСоответствия.Ключ);
		ЗакрытиеМесяцаСервер.ДополнитьТекстЗапросаЗаданий(ЭлементСоответствия.Ключ,
			ЭлементСоответствия.Значение,
			Запрос.МенеджерВременныхТаблиц.Таблицы,
			ТекстЗапроса,
			ТекстЗапросаВременныхТаблиц,
			ИменаВременныхТаблиц);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

#Область ПереоценкаДенежныхСредствИФинансовыхИнструментов

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
//
// Параметры:
// 	ТаблицаЭтапов - (См. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца)
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов);
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Использование_ПереоценкаДенежныхСредствИФинансовыхИнструментов");
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Оформление_ПереоценкаДенежныхСредствИФинансовыхИнструментов");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"Документы.РасчетКурсовыхРазниц.Выполнить_ПереоценкаДенежныхСредствИФинансовыхИнструментов");
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РасчетКурсовыхРазниц.Формы.ФормаСписка.ПолноеИмя(), Истина);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru = 'Мультивалютный учет не ведется';
				|en = 'Multicurrency accounting is not kept'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Отчеты.СправкаРасчетПереоценкиВалютныхСредств.ПолноеИмя() + ".Форма", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("ВсеОрганизации", ПараметрыОбработчика.ПараметрыРасчета.ВсеОрганизации);
	
	Если ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца(ПараметрыОбработчика,Истина,,,ДействиеПодробнее) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	АналитикаРасчета = Новый Структура("ТипыСумм", Новый Массив);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") Тогда
		РегистрыДляРасчета = РегистрыРасчета(
			Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов,
			РегистрыДляРасчета);
		АналитикаРасчета.ТипыСумм = ТипыСуммКредитовДепозитовЗаймов();
	//++ НЕ УТ
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользуетсяПередачаВАрендуСубарендуПоФСБУ25") Тогда
		РегистрыДляРасчета.Вставить("ИнвестицииВАренду");
	//-- НЕ УТ
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	ТребуетсяПереоценка = ТребуетсяПереоценка(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	ЕстьВалютныеОстатки = ЕстьВалютныеОстатки(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
		
	Если ТребуетсяПереоценка Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеВыполненСОшибками(
			ПараметрыОбработчика,
			НСтр("ru = 'Обнаружены курсовые разницы по регистрам учета денежных средств.';
				|en = 'Exchange differences are found in cash management registers.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию(),
			ДействиеПодробнее);
		
	ИначеЕсли НЕ ЕстьВалютныеОстатки Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет валютных остатков по регистрам учета денежных средств.';
				|en = 'No currency balance in cash management registers.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УстановитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", ТребуетсяПереоценка);
	
КонецПроцедуры

// Оформляет этап закрытия месяца для производство без заказов.
//
// Параметры:
//  ПараметрыОбработчика - см. ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыОбработчикаЭтапаЗакрытияМесяцаДляПроверки
//
Процедура Оформление_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ПараметрыОбработчика) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		ПараметрыОбработчика.ДанныеЭтапа.Наименование = НСтр("ru = 'Переоценка денежных средств';
															|en = 'Cash revaluation'");
	КонецЕсли;
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстВыполнить = НСтр("ru = 'Выполнить';
															|en = 'Run'");
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика);
	
КонецПроцедуры

Процедура Выполнить_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	НачалоРасчета = ЗакрытиеМесяцаСервер.НачалоРасчета(
		ПараметрыОбработчика.ДанныеЭтапа.Код,
		ПараметрыОбработчика.ПараметрыРасчета.КонецПериода,
		Неопределено,
		ПараметрыРасчета.МассивОрганизаций);
	
	ПервыйПроход  = Истина;
	
	ТребуетсяПереоценка = ЗакрытиеМесяцаСервер.ПолучитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", Ложь);
	ЕстьЗаданиеКРасчету = (НачалоРасчета <= ПараметрыРасчета.КонецПериода);
	
	Если ТребуетсяПереоценка И НЕ ЕстьЗаданиеКРасчету Тогда
		НачалоРасчета = ПараметрыРасчета.КонецПериода; // пересчитать только указанный месяц
	КонецЕсли;
	
	Пока НачалоРасчета <= ПараметрыРасчета.КонецПериода ИЛИ ТребуетсяПереоценка Цикл
		
		ОкончаниеПериода = КонецМесяца(НачалоРасчета);
		ДоступныеОрганизации = ЗакрытиеМесяцаСервер.ДоступныеДляРасчетаОрганизации(НачалоРасчета, ПараметрыРасчета.МассивОрганизаций);
		
		Если ЕстьЗаданиеКРасчету Тогда
			
			Если ПервыйПроход Тогда
				НомерЗаданияДоРасчета = ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания();
			КонецЕсли;
		
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(НомерЗаданияДоРасчета, ДоступныеОрганизации, ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ДанныеКПереоценкеЗаМесяц = ЗакрытиеМесяцаСервер.ЗаданияКРасчетуЗаМесяц(
					НачалоРасчета,
					ОкончаниеПериода,
					НомерЗаданияДоРасчета,
					ДоступныеОрганизации,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
						|%2';
						|en = 'An error occurred when calculating for the %1 period:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ДоступныеОрганизации,
					НачалоРасчета);
				
			КонецПопытки;
			
		Иначе
			
			ДанныеКПереоценкеЗаМесяц = Новый Структура("Организация", ДоступныеОрганизации);
			
		КонецЕсли;
		
		Попытка
			РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
			ОрганизацииКПереоценке = ТребуетсяПереоценка(
										ДоступныеОрганизации, ОкончаниеПериода, РегистрыДляРасчета,,Истина);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОрганизацииКПереоценке, ДанныеКПереоценкеЗаМесяц.Организация, Истина);
			
			ПереоценитьДенежныеСредства(ОрганизацииКПереоценке, НачалоРасчета);
		Исключение
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Переоценка денежных средств за период %1 завершилась с ошибкой:
					|%2';
					|en = 'Cash revaluation for period %1 is completed with error:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ДанныеКПереоценкеЗаМесяц.Организация,
				НачалоРасчета);
			
		КонецПопытки;
		
		Попытка
			ДополнительноеУсловие = Ложь;
			//++ НЕ УТ
			ДополнительноеУсловие = ПолучитьФункциональнуюОпцию("ИспользуетсяПередачаВАрендуСубарендуПоФСБУ25");
			//-- НЕ УТ
			Если ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов")
				ИЛИ ДополнительноеУсловие Тогда
				Для Каждого Организация Из ДанныеКПереоценкеЗаМесяц.Организация Цикл
					ПереоценитьФинансовыеИнструменты(Организация, НачалоРасчета);
				КонецЦикла;
			КонецЕсли;
		Исключение
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Переоценка финансовых инструментов за период %1 завершилась с ошибкой:
					|%2';
					|en = 'Revaluation of financial instruments for the %1 period completed with an error:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ДанныеКПереоценкеЗаМесяц.Организация,
				НачалоРасчета);
			
		КонецПопытки;
		
		СледующийМесяц = СледующийМесяцКРасчетуДенежныхСредств(НачалоРасчета, ДоступныеОрганизации);
		
		Если ЕстьЗаданиеКРасчету И ПараметрыОбработчика.ТаблицаПояснения.Количество() = 0 Тогда
			
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(
					НомерЗаданияДоРасчета,
					ДоступныеОрганизации,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьРасчет(
					СледующийМесяц,
					ПараметрыОбработчика.ДанныеЭтапа.Код,
					ДанныеКПереоценкеЗаМесяц.ВременныеТаблицы);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
						|%2';
						|en = 'An error occurred when calculating for the %1 period:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ДоступныеОрганизации,
					НачалоРасчета);
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если ЕстьЗаданиеКРасчету И ЗначениеЗаполнено(СледующийМесяц) Тогда
			НачалоРасчета = СледующийМесяц;
		Иначе
			Если ЕстьЗаданиеКРасчету Тогда
				НачалоРасчета = КонецМесяца(НачалоРасчета) + 1; // следующий месяц
			Иначе
				НачалоРасчета = ПараметрыРасчета.КонецПериода + 1; // выход из цикла
			КонецЕсли;
		КонецЕсли;
		
		ТребуетсяПереоценка = Ложь;
		ПервыйПроход = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// Вспомогательные методы этапа.

Функция СледующийМесяцКРасчетуДенежныхСредств(ПериодРасчета, МассивОрганизаций)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	МИНИМУМ(ДенежныеСредства.Месяц) КАК МесяцКРасчету
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВПути КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Касса.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Касса.ВалютаДенежныхСредств <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Касса.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Касса.ВалютаДенежныхСредств <> &ВалютаУпр)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.СуммаОстаток < 0
	|		И (ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ФинансовыеИнструменты.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам КАК ФинансовыеИнструменты
	|	ГДЕ
	|		(ФинансовыеИнструменты.Валюта <> ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ФинансовыеИнструменты.Валюта <> &ВалютаУпр)
	|		И ФинансовыеИнструменты.Период > &ОбработанныйМесяц
	|		И ФинансовыеИнструменты.ТипСуммы В (&ТипыСумм)
	|		И ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|			И ТипСуммы В (&ТипыСумм)
	|		) КАК ФинансовыеИнструменты
	|	ГДЕ
	|		ФинансовыеИнструменты.Валюта <> ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ФинансовыеИнструменты.Валюта <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ЗаданияКПереоценке.Месяц) КАК Месяц
	|	ИЗ
	|		РегистрСведений.ЗаданияКЗакрытиюМесяца КАК ЗаданияКПереоценке
	|	ГДЕ
	|		ЗаданияКПереоценке.Месяц > &ОбработанныйМесяц
	|		И ЗаданияКПереоценке.Организация В (&МассивОрганизаций)
	|		И ЗаданияКПереоценке.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов)
	|
	|	) КАК ДенежныеСредства
	|ИМЕЮЩИЕ 
	|	НЕ (МИНИМУМ(ДенежныеСредства.Месяц) ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("ВалютаУпр",                  Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ОбработанныйМесяц",          КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("СледующийМесяц",             КонецМесяца(ПериодРасчета) + 1);
	Запрос.УстановитьПараметр("НаКонецРассчитанногоМесяца", Новый Граница(КонецМесяца(ПериодРасчета), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций",          МассивОрганизаций);
	Запрос.УстановитьПараметр("ТипыСумм",                   ТипыСуммКредитовДепозитовЗаймов());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), НачалоМесяца(Выборка.МесяцКРасчету), Дата(1, 1, 1));
	
КонецФункции

#КонецОбласти

#Область ПереоценкаРасчетовСКомитентомКомиссионером

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
//
// Параметры:
// 	ТаблицаЭтапов - (См. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца)
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_ПереоценкаРасчетовСКомитентомКомиссионером(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.ПереоценкаРасчетовСКомитентом);
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Использование_ПереоценкаРасчетовСКомитентомКомиссионером");
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Оформление_ПереоценкаРасчетовСКомитентомКомиссионером");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"Документы.РасчетКурсовыхРазниц.Выполнить_ПереоценкаРасчетовСКомитентомКомиссионером");
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РасчетКурсовыхРазниц.Формы.ФормаСписка.ПолноеИмя(), Истина);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_ПереоценкаРасчетовСКомитентомКомиссионером(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru = 'Мультивалютный учет не ведется';
				|en = 'Multicurrency accounting is not kept'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриЗакупках")
		И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриЗакупкахБазовая")
		И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах")
		И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажахБазовая") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru = 'Комиссия при продаже/закупке не используется';
				|en = 'Sales/purchasing commission is not used'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Отчеты.СправкаРасчетПереоценкиВалютныхСредств.ПолноеИмя() + ".Форма", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("ВсеОрганизации", ПараметрыОбработчика.ПараметрыРасчета.ВсеОрганизации);
	
	Если ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца(ПараметрыОбработчика,Истина,,,ДействиеПодробнее) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКомитентом);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	АналитикаРасчета = Неопределено;
	ТребуетсяПереоценка = ТребуетсяПереоценка(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	ЕстьВалютныеОстатки = ЕстьВалютныеОстатки(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
		
	Если ТребуетсяПереоценка Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеВыполненСОшибками(
			ПараметрыОбработчика,
			НСтр("ru = 'Обнаружены курсовые разницы по расчетам с комитентом (принципалом).';
				|en = 'Exchange differences for consignor (principal) AR/AP are found.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию(),
			ДействиеПодробнее);
		
	ИначеЕсли НЕ ЕстьВалютныеОстатки Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет валютных расчетов с комитентом (принципалом).';
				|en = 'There are no currency AR/AP with the consignor (principal).'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УстановитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", ТребуетсяПереоценка);
	
КонецПроцедуры

// Оформляет этап закрытия месяца для производство без заказов.
//
// Параметры:
//  ПараметрыОбработчика - см. ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыОбработчикаЭтапаЗакрытияМесяцаДляПроверки
//
Процедура Оформление_ПереоценкаРасчетовСКомитентомКомиссионером(ПараметрыОбработчика) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		ПараметрыОбработчика.ДанныеЭтапа.Наименование = НСтр("ru = 'Переоценка расчетов с комитентом/комиссионером';
															|en = 'Revaluation of consignor/consignee AR/AP'");
	КонецЕсли;
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстВыполнить = НСтр("ru = 'Выполнить';
															|en = 'Run'");
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика);
	
КонецПроцедуры

Процедура Выполнить_ПереоценкаРасчетовСКомитентомКомиссионером(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	НачалоРасчета = ЗакрытиеМесяцаСервер.НачалоРасчета(
		ПараметрыОбработчика.ДанныеЭтапа.Код,
		ПараметрыОбработчика.ПараметрыРасчета.КонецПериода,
		Неопределено,
		ПараметрыРасчета.МассивОрганизаций);
	
	ПервыйПроход  = Истина;
	
	ТребуетсяПереоценка = ЗакрытиеМесяцаСервер.ПолучитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", Ложь);
	ЕстьЗаданиеКРасчету = (НачалоРасчета <= ПараметрыРасчета.КонецПериода);
	
	Если ТребуетсяПереоценка И НЕ ЕстьЗаданиеКРасчету Тогда
		НачалоРасчета = ПараметрыРасчета.КонецПериода; // пересчитать только указанный месяц
	КонецЕсли;
	
	Пока НачалоРасчета <= ПараметрыРасчета.КонецПериода ИЛИ ТребуетсяПереоценка Цикл
		
		ОкончаниеПериода = КонецМесяца(НачалоРасчета);
		ДоступныеОрганизации = ЗакрытиеМесяцаСервер.ДоступныеДляРасчетаОрганизации(НачалоРасчета, ПараметрыРасчета.МассивОрганизаций);
		
		Если ЕстьЗаданиеКРасчету Тогда
			
			Если ПервыйПроход Тогда
				НомерЗаданияДоРасчета = ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания();
			КонецЕсли;
		
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(НомерЗаданияДоРасчета, ДоступныеОрганизации, ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ДанныеКПереоценкеЗаМесяц = ЗакрытиеМесяцаСервер.ЗаданияКРасчетуЗаМесяц(
					НачалоРасчета,
					ОкончаниеПериода,
					НомерЗаданияДоРасчета,
					ДоступныеОрганизации,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
						|%2';
						|en = 'An error occurred when calculating for the %1 period:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ДоступныеОрганизации,
					НачалоРасчета);
				
			КонецПопытки;
			
		Иначе
			
			ДанныеКПереоценкеЗаМесяц = Новый Структура("Организация", ДоступныеОрганизации);
			
		КонецЕсли;
		
		Попытка
			РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКомитентом);
			ОрганизацииКПереоценке = ТребуетсяПереоценка(
										ДоступныеОрганизации, ОкончаниеПериода, РегистрыДляРасчета,,Истина);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОрганизацииКПереоценке, ДанныеКПереоценкеЗаМесяц.Организация, Истина);
			
			ПереоценитьРасчетыПоКомиссии(ОрганизацииКПереоценке, НачалоРасчета);
		Исключение
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Переоценка денежных средств за период %1 завершилась с ошибкой:
					|%2';
					|en = 'Cash revaluation for period %1 is completed with error:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ДанныеКПереоценкеЗаМесяц.Организация,
				НачалоРасчета);
			
		КонецПопытки;
		
		СледующийМесяц = КонецМесяца(НачалоРасчета) + 1;
		
		Если ЕстьЗаданиеКРасчету И ПараметрыОбработчика.ТаблицаПояснения.Количество() = 0 Тогда
			
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(
					НомерЗаданияДоРасчета,
					ДоступныеОрганизации,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьРасчет(
					СледующийМесяц,
					ПараметрыОбработчика.ДанныеЭтапа.Код,
					ДанныеКПереоценкеЗаМесяц.ВременныеТаблицы);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
						|%2';
						|en = 'An error occurred when calculating for the %1 period:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ДоступныеОрганизации,
					НачалоРасчета);
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если ЕстьЗаданиеКРасчету И ЗначениеЗаполнено(СледующийМесяц) Тогда
			НачалоРасчета = СледующийМесяц;
		Иначе
			Если ЕстьЗаданиеКРасчету Тогда
				НачалоРасчета = КонецМесяца(НачалоРасчета) + 1; // следующий месяц
			Иначе
				НачалоРасчета = ПараметрыРасчета.КонецПериода + 1; // выход из цикла
			КонецЕсли;
		КонецЕсли;
		
		ТребуетсяПереоценка = Ложь;
		ПервыйПроход = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ
#Область ПереоценкаАренды

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
//
// Параметры:
// 	ТаблицаЭтапов - (См. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца)
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_ПереоценкаАренды(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.ПереоценкаАренды);
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Использование_ПереоценкаАренды");
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Оформление_ПереоценкаАренды");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"Документы.РасчетКурсовыхРазниц.Выполнить_ПереоценкаАренды");
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РасчетКурсовыхРазниц.Формы.ФормаСписка.ПолноеИмя(), Истина);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_ПереоценкаАренды(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru = 'Мультивалютный учет не ведется';
				|en = 'Multicurrency accounting is not kept'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат;
		
	КонецЕсли;
	
	ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Отчеты.СправкаРасчетПереоценкиВалютныхСредств.ПолноеИмя() + ".Форма", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("ВсеОрганизации", ПараметрыОбработчика.ПараметрыРасчета.ВсеОрганизации);
	
	Если ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца(ПараметрыОбработчика,Истина,,,ДействиеПодробнее) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	АналитикаРасчета = Новый Структура("ТипыСумм", ТипыСуммПлатежейПоАренде());
	ТребуетсяПереоценка = ТребуетсяПереоценка(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	ЕстьВалютныеОстатки = ЕстьВалютныеОстатки(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
		
	Если ТребуетсяПереоценка Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеВыполненСОшибками(
			ПараметрыОбработчика,
			НСтр("ru = 'Обнаружены курсовые разницы по договорам аренды.';
				|en = 'Exchange differences under rental contracts are found.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию(),
			ДействиеПодробнее);
		
	ИначеЕсли НЕ ЕстьВалютныеОстатки Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет валютных остатков по договорам аренды.';
				|en = 'No currency balance under rental contracts.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УстановитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", ТребуетсяПереоценка);
	
КонецПроцедуры

// Оформляет этап закрытия месяца для производство без заказов.
//
// Параметры:
//  ПараметрыОбработчика - см. ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыОбработчикаЭтапаЗакрытияМесяцаДляПроверки
//
Процедура Оформление_ПереоценкаАренды(ПараметрыОбработчика) Экспорт
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстВыполнить = НСтр("ru = 'Выполнить';
															|en = 'Run'");
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика);
	
КонецПроцедуры

Процедура Выполнить_ПереоценкаАренды(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	НачалоРасчета = ЗакрытиеМесяцаСервер.НачалоРасчета(
		ПараметрыОбработчика.ДанныеЭтапа.Код,
		ПараметрыОбработчика.ПараметрыРасчета.КонецПериода,
		Неопределено,
		ПараметрыРасчета.МассивОрганизаций);
	
	ПервыйПроход  = Истина;
	
	ТребуетсяПереоценка = ЗакрытиеМесяцаСервер.ПолучитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", Ложь);
	ЕстьЗаданиеКРасчету = (НачалоРасчета <= ПараметрыРасчета.КонецПериода);
	
	Если ТребуетсяПереоценка И НЕ ЕстьЗаданиеКРасчету Тогда
		НачалоРасчета = ПараметрыРасчета.КонецПериода; // пересчитать только указанный месяц
	КонецЕсли;
	
	Пока НачалоРасчета <= ПараметрыРасчета.КонецПериода ИЛИ ТребуетсяПереоценка Цикл
		
		ОкончаниеПериода = КонецМесяца(НачалоРасчета);
		ДоступныеОрганизации = ЗакрытиеМесяцаСервер.ДоступныеДляРасчетаОрганизации(НачалоРасчета, ПараметрыРасчета.МассивОрганизаций);
		
		Если ЕстьЗаданиеКРасчету Тогда
			
			Если ПервыйПроход Тогда
				НомерЗаданияДоРасчета = ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания();
			КонецЕсли;
		
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(НомерЗаданияДоРасчета, ДоступныеОрганизации, ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ДанныеКПереоценкеЗаМесяц = ЗакрытиеМесяцаСервер.ЗаданияКРасчетуЗаМесяц(
					НачалоРасчета,
					ОкончаниеПериода,
					НомерЗаданияДоРасчета,
					ДоступныеОрганизации,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
						|%2';
						|en = 'An error occurred when calculating for the %1 period:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ДоступныеОрганизации,
					НачалоРасчета);
				
			КонецПопытки;
			
		Иначе
			
			ДанныеКПереоценкеЗаМесяц = Новый Структура("Организация", ДоступныеОрганизации);
			
		КонецЕсли;
		
		Попытка
			РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде);
			ОрганизацииКПереоценке = ТребуетсяПереоценка(ДоступныеОрганизации, ОкончаниеПериода,
										РегистрыДляРасчета, ТипыСуммПлатежейПоАренде(), Истина);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОрганизацииКПереоценке, ДанныеКПереоценкеЗаМесяц.Организация, Истина);
			Для Каждого Организация Из ОрганизацииКПереоценке Цикл
				ПереоценитьАренду(Организация, НачалоРасчета);
			КонецЦикла;
		Исключение
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Переоценка остатков по договорам аренды за период %1 завершилась с ошибкой:
					|%2';
					|en = 'An error occurred while revaluating balance under the rental contract for period %1:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ДанныеКПереоценкеЗаМесяц.Организация,
				НачалоРасчета);
			
		КонецПопытки;
		
		СледующийМесяц = СледующийМесяцКРасчетуАренды(НачалоРасчета, ДоступныеОрганизации);
		
		Если ЕстьЗаданиеКРасчету И ПараметрыОбработчика.ТаблицаПояснения.Количество() = 0 Тогда
			
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(
					НомерЗаданияДоРасчета,
					ДоступныеОрганизации,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьРасчет(
					СледующийМесяц,
					ПараметрыОбработчика.ДанныеЭтапа.Код,
					ДанныеКПереоценкеЗаМесяц.ВременныеТаблицы);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
						|%2';
						|en = 'An error occurred when calculating for the %1 period:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ДоступныеОрганизации,
					НачалоРасчета);
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если ЕстьЗаданиеКРасчету И ЗначениеЗаполнено(СледующийМесяц) Тогда
			НачалоРасчета = СледующийМесяц;
		Иначе
			Если ЕстьЗаданиеКРасчету Тогда
				НачалоРасчета = КонецМесяца(НачалоРасчета) + 1; // следующий месяц
			Иначе
				НачалоРасчета = ПараметрыРасчета.КонецПериода + 1; // выход из цикла
			КонецЕсли;
		КонецЕсли;
		
		ТребуетсяПереоценка = Ложь;
		ПервыйПроход = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// Вспомогательные методы этапа.

Функция СледующийМесяцКРасчетуАренды(ПериодРасчета, МассивОрганизаций)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	МИНИМУМ(ДенежныеСредства.Месяц) КАК МесяцКРасчету
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(ФинансовыеИнструменты.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам КАК ФинансовыеИнструменты
	|	ГДЕ
	|		(ФинансовыеИнструменты.Валюта <> ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация
	|			ИЛИ ФинансовыеИнструменты.Валюта <> &ВалютаУпр)
	|		И ФинансовыеИнструменты.Период > &ОбработанныйМесяц
	|		И ФинансовыеИнструменты.ТипСуммы В (&ТипыСумм)
	|		И ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|			И ТипСуммы В (&ТипыСумм)
	|		) КАК ФинансовыеИнструменты
	|	ГДЕ
	|		ФинансовыеИнструменты.Валюта <> ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация
	|			ИЛИ ФинансовыеИнструменты.Валюта <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ЗаданияКПереоценке.Месяц) КАК Месяц
	|	ИЗ
	|		РегистрСведений.ЗаданияКЗакрытиюМесяца КАК ЗаданияКПереоценке
	|	ГДЕ
	|		ЗаданияКПереоценке.Месяц > &ОбработанныйМесяц
	|		И ЗаданияКПереоценке.Организация В (&МассивОрганизаций)
	|		И ЗаданияКПереоценке.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов)
	|
	|	) КАК ДенежныеСредства
	|ИМЕЮЩИЕ 
	|	НЕ (МИНИМУМ(ДенежныеСредства.Месяц) ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("ВалютаУпр",                  Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ОбработанныйМесяц",          КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("СледующийМесяц",             КонецМесяца(ПериодРасчета) + 1);
	Запрос.УстановитьПараметр("НаКонецРассчитанногоМесяца", Новый Граница(КонецМесяца(ПериодРасчета), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций",          МассивОрганизаций);
	Запрос.УстановитьПараметр("ТипыСумм",                   ТипыСуммПлатежейПоАренде());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), НачалоМесяца(Выборка.МесяцКРасчету), Дата(1, 1, 1));
	
КонецФункции

#КонецОбласти
//-- НЕ УТ
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ЕСТЬNULL(ДанныеДокумента.Организация.ГоловнаяОрганизация, ДанныеДокумента.Организация) КАК ГоловнаяОрганизация,
	|	ДанныеДокумента.ХозяйственнаяОперация,
	|	ДанныеДокумента.ПереоценкаПоДням,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаДС,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаРасчетовСПоставщиками,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаРасчетовСКлиентами,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаФинансовыхИнструментов,
	|	НастройкиХозяйственныхОпераций.Ссылка КАК НастройкаХозяйственнойОперации,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления
	|
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|		ПО ДанныеДокумента.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	НачалоПериода = НачалоМесяца(Реквизиты.Дата);
	КонецПериода = КонецМесяца(Реквизиты.Дата);
	Запрос.УстановитьПараметр("НачалоПериода",                         НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",                          КонецПериода);
	Запрос.УстановитьПараметр("КонецМесяца",                           КонецПериода);
	Запрос.УстановитьПараметр("ГраницаНачалоПериода",                  Новый Граница(НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКонецПериода",                   Новый Граница(КонецПериода,  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",                           Реквизиты.Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",                   Реквизиты.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ЗаказПодразделение",                    Неопределено);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",                 Реквизиты.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("НастройкаХозяйственнойОперации",        Реквизиты.НастройкаХозяйственнойОперации);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",            Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета",        ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация));
	Запрос.УстановитьПараметр("ПереоценкаПоДням",                      Реквизиты.ПереоценкаПоДням);
	Запрос.УстановитьПараметр("ИспользоватьУчетПрочихДоходовРасходов", Константы.ИспользоватьУчетПрочихДоходовРасходов.Получить());
	Запрос.УстановитьПараметр("АналитикаРасчета",
		РегистрыСведений.АналитикаУчетаПоПартнерам.КлючиАналитикиПоОрганизации(Реквизиты.Организация));
	Запрос.УстановитьПараметр("Кассы",                                 Неопределено);
	Запрос.УстановитьПараметр("ПоВсемКассам",                          Истина);
	Запрос.УстановитьПараметр("ПодотчетныеЛица",                       Неопределено);
	Запрос.УстановитьПараметр("ПоВсемПодотчетнымЛицам",                Истина);
	Запрос.УстановитьПараметр("ОбеспечительныйПлатеж",                 Неопределено);
	Запрос.УстановитьПараметр("ХарактерДоговораАренды",                Перечисления.ХарактерыДоговоровФинансовыхИнструментов.Аренда);
	Запрос.УстановитьПараметр("ХарактерДоговораДепозит",               Перечисления.ХарактерыДоговоровФинансовыхИнструментов.Депозит);
	Запрос.УстановитьПараметр("ХарактерДоговораЗаймВыданный",          Перечисления.ХарактерыДоговоровФинансовыхИнструментов.ЗаймВыданный);
	Запрос.УстановитьПараметр("ТипыСумм",                              ТипыСуммКредитовДепозитовЗаймов());
	Запрос.УстановитьПараметр("ПоВсемТипамСумм",                       Ложь);
	Запрос.УстановитьПараметр("ЭтоАренда",                             Ложь);
	//++ НЕ УТ
	Запрос.УстановитьПараметр("ОбеспечительныйПлатеж",                 Перечисления.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж);
	Запрос.УстановитьПараметр("ОбратноеОтражениеРасходов",             ТипыСуммОбратногоОтраженияРасходов());
	//++ Локализация
	НачалоВступленияВСилу67ФЗ = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоВступленияВСилу67ФЗ();
	Запрос.УстановитьПараметр("НачалоВступленияВСилу67ФЗ",             НачалоВступленияВСилу67ФЗ);
	Запрос.УстановитьПараметр("ТипыСуммПереоценкиНУ",                  ТипыСуммКредитовДепозитовЗаймов());
	//-- Локализация
	Если Реквизиты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде Тогда
		Запрос.УстановитьПараметр("ЭтоАренда", Истина);
		Запрос.УстановитьПараметр("ТипыСумм", ТипыСуммПлатежейПоАренде());
		//++ Локализация
		Запрос.УстановитьПараметр("ТипыСуммПереоценкиНУ", ТипыСуммПереоценкиНУАренды());
		//-- Локализация
	КонецЕсли;
	Запрос.УстановитьПараметр("ИспользоватьРеглУчет",ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет"));
	//-- НЕ УТ
	Запрос.УстановитьПараметр("ПорядокОперации", ОперативныеВзаиморасчетыСервер.Порядок(КонецПериода,"",Тип("ДокументСсылка.РасчетКурсовыхРазниц"),"9","99"));
		
	ОплатаКлиента = Новый Массив;
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Запрос.УстановитьПараметр("ОплатаКлиента", ОплатаКлиента);
	
	ОплатаПоставщику = Новый Массив;
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Запрос.УстановитьПараметр("ОплатаПоставщику", ОплатаПоставщику);
	
	Запрос.УстановитьПараметр("ИменаРегистров", РегистрыРасчета(Реквизиты.ХозяйственнаяОперация));
	
	Запрос.УстановитьПараметр("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.РасчетКурсовыхРазниц"));
	Запрос.УстановитьПараметр("Номер", Реквизиты.Номер);
	Запрос.УстановитьПараметр("НомерНаПечать", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	Запрос.УстановитьПараметр("Комментарий", Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("Проведен", Реквизиты.Проведен);
	Запрос.УстановитьПараметр("ПометкаУдаления", Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Период", Реквизиты.Дата);
	Запрос.УстановитьПараметр("ПерезаполнениеРегистровНУ", Ложь);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоСрокам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыПоДокументам.ОбъектРасчетов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыПоДокументам.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РасчетыПоДокументам.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоСрокам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСПоставщиками";

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыПоДокументам.ОбъектРасчетов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыПоДокументам.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РасчетыПоДокументам.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСПоставщиками
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//++ НЕ УТ

//++ Локализация

Функция ТекстЗапросаВтТаблицаРасчетыНУ(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыНУ";
	
	МассивТекстовЗапроса = Новый Массив;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыПоДокументам.ОбъектРасчетов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.СуммаНУ КАК СуммаНУ
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыНУ
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиНУ КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	МассивТекстовЗапроса.Добавить(ТекстЗапроса);

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыПоДокументам.ОбъектРасчетов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.СуммаНУ КАК СуммаНУ
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиНУ КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	МассивТекстовЗапроса.Добавить(ТекстЗапроса);

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыПоДокументам.Договор.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	РасчетыПоДокументам.Договор КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.СуммаНУ КАК СуммаНУ
	|
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментамНУ КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- Локализация

//-- НЕ УТ

Функция ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСПоставщиками";

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	РасчетыПоДокументам.ЗаказПоставщику КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	-РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	-РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСПоставщиками
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказКлиента.Подразделение КАК Подразделение,
	|	РасчетыПоДокументам.ЗаказКлиента КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДатаПлатежа,
	|	РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	-РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	-РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваБезналичные";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.БанковскийСчет КАК БанковскийСчет,
	|	ДенежныеСредства.БанковскийСчет.Подразделение КАК Подразделение,
	|	ДенежныеСредства.БанковскийСчет.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваБезналичные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваНаличные";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Касса КАК Касса,
	|	ДенежныеСредства.Касса.Подразделение КАК Подразделение,
	|	ДенежныеСредства.Касса.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваНаличные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваВКассахККМ";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.КассаККМ КАК КассаККМ,
	|	ДенежныеСредства.КассаККМ.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваВКассахККМ
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваУПодотчетныхЛиц";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ДенежныеСредства.Подразделение КАК Подразделение,
	|	ДенежныеСредства.ЦельВыдачи КАК ЦельВыдачи,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваУПодотчетныхЛиц
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваВПути";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.НаправлениеДеятельности,
	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Договор КАК Договор,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -ДенежныеСредства.СуммаУпр
	|			ИНАЧЕ ДенежныеСредства.СуммаУпр
	|	КОНЕЦ) КАК СуммаУпр,
	|	СУММА(
	|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -ДенежныеСредства.СуммаРегл
	|			ИНАЧЕ ДенежныеСредства.СуммаРегл
	|		КОНЕЦ) КАК СуммаРегл,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ втДенежныеСредстваВПути
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредства.Период,
	|	ДенежныеСредства.Организация,
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.НаправлениеДеятельности,
	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ДенежныеСредства.ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент,
	|	ДенежныеСредства.Договор,
	|	ДенежныеСредства.Валюта,
	|	ДенежныеСредства.ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации";
	ТекстыЗапроса.Добавить(ТекстЗапроса, "втДенежныеСредстваВПути");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Подразделение КАК Подразделение,
	|	ДенежныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК Получатель,
	|	НЕОПРЕДЕЛЕНО КАК Отправитель,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Договор КАК Договор,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ДенежныеСредства.СуммаУпр
	|			ИНАЧЕ -ДенежныеСредства.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваВПути
	|ИЗ
	|	втДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.СуммаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Подразделение КАК Подразделение,
	|	ДенежныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК Получатель,
	|	НЕОПРЕДЕЛЕНО КАК Отправитель,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Договор КАК Договор,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ДенежныеСредства.СуммаРегл
	|			ИНАЧЕ -ДенежныеСредства.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	втДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.СуммаРегл <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаФинансовыеИнструменты(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаФинансовыеИнструменты";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ФинансовыеИнструменты.ВидДвижения,
	|	ФинансовыеИнструменты.Период КАК Период,
	|	ФинансовыеИнструменты.АналитикаУчетаПоПартнерам,
	|	ФинансовыеИнструменты.Договор КАК Договор,
	|	ФинансовыеИнструменты.Договор.Подразделение КАК Подразделение,
	|	ФинансовыеИнструменты.Договор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Договор) = ТИП(Справочник.ДоговорыКредитовИДепозитов)
	|		ТОГДА ВЫРАЗИТЬ(ФинансовыеИнструменты.Договор КАК Справочник.ДоговорыКредитовИДепозитов).ХарактерДоговора
	//++ НЕ УТ
	|		КОГДА ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Договор) = ТИП(Справочник.ДоговорыАренды)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Аренда)
	//-- НЕ УТ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ХарактерДоговора,
	|	ФинансовыеИнструменты.ТипСуммы КАК ТипСуммы,
	|	ФинансовыеИнструменты.Договор.ВалютаВзаиморасчетов КАК Валюта,
	|	ФинансовыеИнструменты.Сумма КАК Сумма,
	|	ФинансовыеИнструменты.СуммаУпр КАК СуммаУпр,
	|	ФинансовыеИнструменты.СуммаРегл КАК СуммаРегл,
	|	ФинансовыеИнструменты.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ФинансовыеИнструменты.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаФинансовыеИнструменты
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам КАК ФинансовыеИнструменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ФинансовыеИнструменты.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	(&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
	|		И ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Договор) = ТИП(Справочник.ДоговорыКредитовИДепозитов)
	//++ НЕ УТ
	|	ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде)
	|		И ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Договор) = ТИП(Справочник.ДоговорыАренды)
	//-- НЕ УТ
	|	) И ФинансовыеИнструменты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Аналитика.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//++ НЕ УТ

Функция ТекстЗапросаВтТаблицаРезервыПоСомнительнымДолгам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРезервыПоСомнительнымДолгам";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РезервыПоДолгам.ВидДвижения,
	|	РезервыПоДолгам.Период КАК Период,
	|	РезервыПоДолгам.АналитикаУчетаПоПартнерам,
	|	РезервыПоДолгам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЕСТЬNULL(РезервыПоДолгам.ОбъектРасчетов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(РезервыПоДолгам.ОбъектРасчетов.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	РезервыПоДолгам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РезервыПоДолгам.ТипСуммы КАК ТипСуммы,
	|	РезервыПоДолгам.Валюта КАК Валюта,
	|	РезервыПоДолгам.Сумма КАК Сумма,
	|	РезервыПоДолгам.СуммаУпр КАК СуммаУпр,
	|	РезервыПоДолгам.СуммаРегл КАК СуммаРегл,
	|	РезервыПоДолгам.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	РезервыПоДолгам.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаРезервыПоСомнительнымДолгам
	|ИЗ
	|	РегистрНакопления.РезервыПоСомнительнымДолгам КАК РезервыПоДолгам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО РезервыПоДолгам.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРезервовПоСомнительнымДолгам)
	|	И ТИПЗНАЧЕНИЯ(РезервыПоДолгам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РезервыПоДолгам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РезервыПоДолгам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- НЕ УТ

Функция ТекстЗапросаВтТаблицаСуммыДисконтирования(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаСуммыДисконтирования";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПроцентныеРасходы.ВидДвижения КАК ВидДвижения,
	|	ПроцентныеРасходы.Период КАК Период,
	|	ПроцентныеРасходы.АналитикаУчетаПоПартнерам,
	|	ПроцентныеРасходы.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ПроцентныеРасходы.ОбъектРасчетов.Договор КАК Договор,
	|	ПроцентныеРасходы.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ПроцентныеРасходы.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПроцентныеРасходы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ПроцентныеРасходы.Валюта КАК Валюта,
	|	ПроцентныеРасходы.СуммаДисконтирования КАК Сумма,
	|	ПроцентныеРасходы.СуммаДисконтированияУпр КАК СуммаУпр,
	|	ПроцентныеРасходы.СуммаДисконтированияРегл КАК СуммаРегл,
	|	ПроцентныеРасходы.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ПроцентныеРасходы.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаСуммыДисконтирования
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования КАК ПроцентныеРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ПроцентныеРасходы.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаСуммДисконтирования)
	|	И ПроцентныеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Аналитика.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ПроцентныеРасходы.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТоварыКОформлениюОтчетовКомитенту(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаТоварыКОформлениюОтчетовКомитенту";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыКОформлению.ВидДвижения КАК ВидДвижения,
	|	ТоварыКОформлению.Период КАК Период,
	|	ТоварыКОформлению.Организация КАК Организация,
	|	ТоварыКОформлению.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыКОформлению.ВидЗапасов КАК ВидЗапасов,
	|	ТоварыКОформлению.НомерГТД КАК НомерГТД,
	|	ТоварыКОформлению.ДокументПродажи КАК ДокументПродажи,
	|	ВидыЗапасов.Договор КАК Договор,
	|	ЕСТЬNULL(Договоры.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
	|	ЕСТЬNULL(Договоры.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
	|	ТоварыКОформлению.Валюта КАК Валюта,
	|	ТоварыКОформлению.СуммаВыручки КАК СуммаВыручки,
	|	ТоварыКОформлению.СуммаВыручкиРегл КАК СуммаВыручкиРегл,
	|	ТоварыКОформлению.СуммаВыручкиУпр КАК СуммаВыручкиУпр,
	|	ТоварыКОформлению.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ТоварыКОформлению.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаТоварыКОформлениюОтчетовКомитенту
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ТоварыКОформлению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ТоварыКОформлению.ВидЗапасов = ВидыЗапасов.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ВидыЗапасов.Договор = Договоры.Ссылка
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКомитентом)
	|	И ТоварыКОформлению.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТоварыКОформлению.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ТоварыКОформлению.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыКОформлению.ВидДвижения КАК ВидДвижения,
	|	ТоварыКОформлению.Период КАК Период,
	|	ТоварыКОформлению.Организация КАК Организация,
	|	ТоварыКОформлению.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлению.Характеристика КАК Характеристика,
	|	ТоварыКОформлению.ДокументПриобретения КАК ДокументПриобретения,
	|	ТоварыКОформлению.Назначение КАК Назначение,
	|	ТоварыКОформлению.НомерГТД КАК НомерГТД,
	|	Назначения.Договор КАК Договор,
	|	ЕСТЬNULL(Договоры.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
	|	ЕСТЬNULL(Договоры.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
	|	ТоварыКОформлению.Валюта КАК Валюта,
	|	ТоварыКОформлению.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыКОформлению.СуммаРегл КАК СуммаРегл,
	|	ТоварыКОформлению.СуммаУпр КАК СуммаУпр,
	|	ТоварыКОформлению.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ТоварыКОформлению.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках
	|ИЗ
	|	РегистрНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках КАК ТоварыКОформлению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ТоварыКОформлению.Назначение = Назначения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Назначения.Договор = Договоры.Ссылка
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКомитентом)
	|	И ТоварыКОформлению.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТоварыКОформлению.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ТоварыКОформлению.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтУслугиКОформлениюОтчетовПринципалу(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаУслугиКОформлениюОтчетовПринципалу";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УслугиКОформлению.ВидДвижения КАК ВидДвижения,
	|	УслугиКОформлению.Период КАК Период,
	|	УслугиКОформлению.Организация КАК Организация,
	|	УслугиКОформлению.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УслугиКОформлению.Соглашение КАК Соглашение,
	|	УслугиКОформлению.ДокументПродажи КАК ДокументПродажи,
	|	ЕСТЬNULL(ДокументРТУ.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
	|	ЕСТЬNULL(Договоры.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
	|	ЕСТЬNULL(Договоры.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
	|	УслугиКОформлению.Валюта КАК Валюта,
	|	УслугиКОформлению.СуммаВыручки КАК СуммаВыручки,
	|	УслугиКОформлению.СуммаВыручкиРегл КАК СуммаВыручкиРегл,
	|	УслугиКОформлению.СуммаВыручкиУпр КАК СуммаВыручкиУпр,
	|	УслугиКОформлению.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	УслугиКОформлению.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаУслугиКОформлениюОтчетовПринципалу
	|ИЗ
	|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу КАК УслугиКОформлению
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК Соглашения
	|		ПО УслугиКОформлению.Соглашение = Соглашения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДокументРТУ
	|		ПО УслугиКОформлению.ДокументПродажи = ДокументРТУ.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ДокументРТУ.Договор = Договоры.Ссылка
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКомитентом)
	|	И УслугиКОформлению.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И УслугиКОформлению.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(УслугиКОформлению.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ДолгРегл
	|		ИНАЧЕ ДанныеРегистра.ДолгРегл
	|	КОНЕЦ ДолгРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ДолгУпр
	|		ИНАЧЕ ДанныеРегистра.ДолгУпр
	|	КОНЕЦ ДолгУпр,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаРегл
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаРегл
	|	КОНЕЦ ПредоплатаРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаУпр
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаУпр
	|	КОНЕЦ ПредоплатаУпр,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДанныеРегистра.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ РасчетыСКлиентами
	|ИЗ
	|	ТаблицаРасчетыСКлиентами КАК ДанныеРегистра";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса = Неопределено, РасчетыСПоставщиками = Ложь)

	ИмяРегистра = "РасчетыСКлиентамиПоОбъектамРасчета";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасчетыСКлиентами", ТекстыЗапроса) Тогда
			Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
				ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоСрокам(ТекстыЗапроса);
			Иначе
				ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса);
			КонецЕсли;
		КонецЕсли;

		Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСКлиентами", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентами.Период КАК Период,
	|	РасчетыСКлиентами.Валюта КАК Валюта,
	|	СУММА(РасчетыСКлиентами.ДолгРегл) КАК ДолгРегл,
	|	СУММА(РасчетыСКлиентами.ДолгУпр) КАК ДолгУпр,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(РасчетыСКлиентами.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.Подразделение КАК Подразделение,
	|	Аналитика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	РасчетыСКлиентами.ИдентификаторФинЗаписи,
	|	РасчетыСКлиентами.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ РасчетыСКонтрагентамиПоОбъектамРасчета
	|ИЗ
	|	РасчетыСКлиентами
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.Период,
	|	РасчетыСКлиентами.Валюта,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.Подразделение,
	|	Аналитика.НаправлениеДеятельности,
	|	РасчетыСКлиентами.ОбъектРасчетов,
	|	Аналитика.Контрагент,
	|	Аналитика.Договор,
	|	РасчетыСКлиентами.ИдентификаторФинЗаписи,
	|	РасчетыСКлиентами.НастройкаХозяйственнойОперации";
	
	Если РасчетыСПоставщиками Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетыСКлиентами", "РасчетыСПоставщиками");
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, "РасчетыСКонтрагентамиПоОбъектамРасчета", "РасчетыСПоставщикамиПоОбъектамРасчета");
	Иначе
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, "РасчетыСКонтрагентамиПоОбъектамРасчета", "РасчетыСКлиентамиПоОбъектамРасчета");
	КонецЕсли;
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыСПоставщиками";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ДолгРегл
	|		ИНАЧЕ ДанныеРегистра.ДолгРегл
	|	КОНЕЦ ДолгРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ДолгУпр
	|		ИНАЧЕ ДанныеРегистра.ДолгУпр
	|	КОНЕЦ ДолгУпр,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаРегл
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаРегл
	|	КОНЕЦ ПредоплатаРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаУпр
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаУпр
	|	КОНЕЦ ПредоплатаУпр,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДанныеРегистра.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ РасчетыСПоставщиками
	|ИЗ
	|	ТаблицаРасчетыСПоставщиками КАК ДанныеРегистра";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса)

	ИмяРегистра = "РасчетыСПоставщикамиПоОбъектамРасчета";

	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасчетыСПоставщиками", ТекстыЗапроса) Тогда
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоСрокам(ТекстыЗапроса);
		Иначе
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;

	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСПоставщиками", ТекстыЗапроса) Тогда
		ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета( , Истина);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//++ НЕ УТ

//++ Локализация
Функция ТекстЗапросаВтРасчетыНУ(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыНУ";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.СуммаНУ
	|		ИНАЧЕ ДанныеРегистра.СуммаНУ
	|	КОНЕЦ СуммаНУ,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ РасчетыНУ
	|ИЗ
	|	ТаблицаРасчетыНУ КАК ДанныеРегистра";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыНУПоОбъектамРасчета(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыНУПоОбъектамРасчета";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасчетыНУ", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаРасчетыНУ(ТекстыЗапроса);
		КонецЕсли;

		Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыНУ", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыНУ(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	СУММА(ДанныеРегистра.СуммаНУ) КАК СуммаНУ,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	Аналитика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор
	|ПОМЕСТИТЬ РасчетыНУПоОбъектамРасчета
	|ИЗ
	|	РасчетыНУ КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ДанныеРегистра.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.Подразделение,
	|	Аналитика.НаправлениеДеятельности,
	|	ДанныеРегистра.ОбъектРасчетов,
	|	Аналитика.Контрагент,
	|	Аналитика.Договор";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- Локализация

Функция ТекстЗапросаВтИнвестицииВАренду(ТекстыЗапроса = Неопределено, РасчетыСПоставщиками = Ложь)

	ИмяРегистра = "ТаблицаИнвестицииВАренду";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИнвестицииВАренду.ВидДвижения КАК ВидДвижения,
	|	ИнвестицииВАренду.Период КАК Период,
	|	ИнвестицииВАренду.Организация КАК Организация,
	|	ИнвестицииВАренду.Договор КАК Договор,
	|	ИнвестицииВАренду.Валюта КАК Валюта,
	|	ИнвестицииВАренду.ОсновноеСредство КАК ОсновноеСредство,
	|	ИнвестицииВАренду.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(Договоры.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(Договоры.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|
	|	ИнвестицииВАренду.АрендныеПлатежи КАК Сумма,
	|	ИнвестицииВАренду.АрендныеПлатежиРегл КАК СуммаРегл,
	|	ИнвестицииВАренду.АрендныеПлатежиУпр КАК СуммаУпр,
	|	ЛОЖЬ КАК ЭтоПроцентныйДисконт,
	|	ИнвестицииВАренду.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ИнвестицииВАренду.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаИнвестицииВАренду
	|ИЗ
	|	РегистрНакопления.ИнвестицииВАренду КАК ИнвестицииВАренду
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|	ПО ИнвестицииВАренду.Договор = Договоры.Ссылка
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
	|	И ТИПЗНАЧЕНИЯ(ИнвестицииВАренду.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ИнвестицииВАренду.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИнвестицииВАренду.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнвестицииВАренду.ВидДвижения КАК ВидДвижения,
	|	ИнвестицииВАренду.Период КАК Период,
	|	ИнвестицииВАренду.Организация КАК Организация,
	|	ИнвестицииВАренду.Договор КАК Договор,
	|	ИнвестицииВАренду.Валюта КАК Валюта,
	|	ИнвестицииВАренду.ОсновноеСредство КАК ОсновноеСредство,
	|	ИнвестицииВАренду.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(Договоры.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(Договоры.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|
	|	ИнвестицииВАренду.ПроцентныйДисконт КАК Сумма,
	|	ИнвестицииВАренду.ПроцентныйДисконтРегл КАК СуммаРегл,
	|	ИнвестицииВАренду.ПроцентныйДисконтУпр КАК СуммаУпр,
	|	ИСТИНА КАК ЭтоПроцентныйДисконт,
	|	ИнвестицииВАренду.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ИнвестицииВАренду.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	РегистрНакопления.ИнвестицииВАренду КАК ИнвестицииВАренду
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|	ПО ИнвестицииВАренду.Договор = Договоры.Ссылка
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
	|	И ТИПЗНАЧЕНИЯ(ИнвестицииВАренду.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ИнвестицииВАренду.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИнвестицииВАренду.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- НЕ УТ

Процедура ДобавитьВременныеТаблицы(ТекстыЗапроса, ГруппаТаблиц = "") Экспорт
	
	Если ГруппаТаблиц = "ДенежныеСредства" ИЛИ ПустаяСтрока(ГруппаТаблиц) Тогда
		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваБезналичные", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваНаличные", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваВКассахККМ", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваУПодотчетныхЛиц", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваВПути", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаФинансовыеИнструменты", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаФинансовыеИнструменты(ТекстыЗапроса);
	КонецЕсли;
	//++ НЕ УТ
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРезервыПоСомнительнымДолгам", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРезервыПоСомнительнымДолгам(ТекстыЗапроса);
	КонецЕсли;
	//-- НЕ УТ

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаСуммыДисконтирования", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаСуммыДисконтирования(ТекстыЗапроса);
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаТоварыКОформлениюОтчетовКомитенту", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТоварыКОформлениюОтчетовКомитенту(ТекстыЗапроса);
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках(ТекстыЗапроса);
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаУслугиКОформлениюОтчетовПринципалу", ТекстыЗапроса) Тогда
		ТекстЗапросаВтУслугиКОформлениюОтчетовПринципалу(ТекстыЗапроса);
	КонецЕсли;
	
	Если ГруппаТаблиц = "РасчетыСПартнерами" ИЛИ ПустаяСтрока(ГруппаТаблиц) Тогда
		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСКлиентамиПоОбъектамРасчета", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса);
		КонецЕсли;
		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСПоставщикамиПоОбъектамРасчета", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;
	//++ НЕ УТ

	//++ Локализация
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыНУПоОбъектамРасчета", ТекстыЗапроса) Тогда
		ТекстЗапросаВтРасчетыНУПоОбъектамРасчета(ТекстыЗапроса);
	КонецЕсли;
	//-- Локализация

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаИнвестицииВАренду", ТекстыЗапроса) Тогда
		ТекстЗапросаВтИнвестицииВАренду(ТекстыЗапроса);
	КонецЕсли;
	//-- НЕ УТ
	
	РасчетКурсовыхРазницЛокализация.ДобавитьВременныеТаблицы(ТекстыЗапроса, ГруппаТаблиц);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаПрочиеДоходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ПрочиеДоходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СтатьяДоходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА &УправленческийУчетОрганизаций
	|			ТОГДА ВложенныйЗапрос.Сумма
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	|	СУММА(ВЫБОР
	|		КОГДА &ИспользоватьУчетПрочихДоходовРасходов
	|			ТОГДА ВложенныйЗапрос.СуммаРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//++ НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РезервыПоСомнительнымДолгам) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаРезервыПоСомнительнымДолгам КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаСуммыДисконтирования КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКомитентомКомиссионером) КАК АналитикаДоходов,
	|		Таблица.СуммаВыручкиУпр КАК Сумма,
	|		Таблица.СуммаВыручкиРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаТоварыКОформлениюОтчетовКомитенту КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКомитентомКомиссионером) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКомитентомКомиссионером) КАК АналитикаДоходов,
	|		Таблица.СуммаВыручкиУпр КАК Сумма,
	|		Таблица.СуммаВыручкиРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаУслугиКОформлениюОтчетовПринципалу КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//++ НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ИнвестицииВАренду) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаИнвестицииВАренду КАК Таблица
	|	ГДЕ
	|		НЕ Таблица.ЭтоПроцентныйДисконт
	|			И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ИнвестицииВАренду) КАК АналитикаДоходов,
	|		-Таблица.СуммаУпр КАК Сумма,
	|		-Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаИнвестицииВАренду КАК Таблица
	|	ГДЕ
	|		Таблица.ЭтоПроцентныйДисконт
	|			И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с клиентами
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаДоходов,
	|		Таблица.ДолгУпр КАК Сумма,
	|		Таблица.ДолгРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр > 0 ИЛИ Таблица.ДолгРегл > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	// Курсовые разницы от расчетов с клиентами: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаДоходов,
	|		-Таблица.ПредоплатаУпр КАК Сумма,
	|		-Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр < 0 ИЛИ Таблица.ПредоплатаРегл < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с поставщиками
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаДоходов,
	|		-Таблица.ДолгУпр КАК Сумма,
	|		-Таблица.ДолгРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр < 0 ИЛИ Таблица.ДолгРегл < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с поставщиками: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаДоходов,
	|		Таблица.ПредоплатаУпр КАК Сумма,
	|		Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр > 0 ИЛИ Таблица.ПредоплатаРегл > 0
	|И &ОбъединениеСТаблицамиЛокализации
	|
	|	) КАК ВложенныйЗапрос
	|
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	РасчетКурсовыхРазницЛокализация.ДополнитьОбъединениеТаблицЗапросаПрочиеДоходы(ТекстЗапроса);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(ТекстыЗапроса)

	ИмяРегистра = "ВтИсходныеПрочиеРасходы";
	
	ДобавитьВременныеТаблицы(ТекстыЗапроса);
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстОписаниеВтИсходныеПрочиеРасходы();
	ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаСНДС,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДСУпр,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаСНДСРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаБезНДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ВременнаяРазница,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//++ НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РезервыПоСомнительнымДолгам) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаРезервыПоСомнительнымДолгам КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.СуммаРегл КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаСуммыДисконтирования КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКомитентомКомиссионером) КАК АналитикаРасходов,
	|		Таблица.СуммаВыручкиУпр КАК СуммаУпр,
	|		Таблица.СуммаВыручкиРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаТоварыКОформлениюОтчетовКомитенту КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКомитентомКомиссионером) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКомитентомКомиссионером) КАК АналитикаРасходов,
	|		Таблица.СуммаВыручкиУпр КАК СуммаУпр,
	|		Таблица.СуммаВыручкиРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаУслугиКОформлениюОтчетовПринципалу КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//++ НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ИнвестицииВАренду) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаИнвестицииВАренду КАК Таблица
	|	ГДЕ
	|		НЕ Таблица.ЭтоПроцентныйДисконт
	|			И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ИнвестицииВАренду) КАК АналитикаРасходов,
	|		-Таблица.СуммаУпр КАК СуммаУпр,
	|		-Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаИнвестицииВАренду КАК Таблица
	|	ГДЕ
	|		Таблица.ЭтоПроцентныйДисконт
	|			И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Курсовые разницы от расчетов с клиентами
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаРасходов,
	|		-Таблица.ДолгУпр КАК СуммаУпр,
	|		-Таблица.ДолгРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл < 0 ИЛИ Таблица.ДолгУпр < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Курсовые разницы от расчетов с клиентами: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаРасходов,
	|		Таблица.ПредоплатаУпр КАК СуммаУпр,
	|		Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	//Курсовые разницы от расчетов с поставщиками
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаРасходов,
	|		Таблица.ДолгУпр КАК СуммаУпр,
	|		Таблица.ДолгРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл > 0 ИЛИ Таблица.ДолгУпр > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	//Курсовые разницы от расчетов с поставщиками: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаРасходов,
	|		-Таблица.ПредоплатаУпр КАК СуммаУпр,
	|		-Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|И &ОбъединениеСТаблицамиЛокализации
	|
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации
	|";
	
	РасчетКурсовыхРазницЛокализация.ДополнитьОбъединениеТаблицЗапросаИсходныеПрочиеРасходы(ТекстЗапроса);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПрочиеРасходы(ТекстыЗапроса)
	
	ИмяРегистра = "ВтПрочиеРасходы";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаВтПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса, Регистры = Неопределено)
	
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ДвиженияКонтрагентДоходыРасходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса, "РасчетыСПартнерами");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|
	|	РегистрАналитики.Партнер КАК Партнер,
	|	РегистрАналитики.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	ВложенныйЗапрос.Валюта КАК ВалютаВзаиморасчетов,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРеглБезНДС,
	|
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ИсточникГФУРасчетов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР 
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ДолгУпр < 0
	|			ТОГДА -Таблица.ДолгУпр
	|			ИНАЧЕ Таблица.ДолгУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР 
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ДолгРегл < 0
	|			ТОГДА -Таблица.ДолгРегл
	|			ИНАЧЕ Таблица.ДолгРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ Таблица.ПредоплатаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ Таблица.ПредоплатаРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ДолгУпр < 0
	|			ТОГДА -Таблица.ДолгУпр
	|			ИНАЧЕ Таблица.ДолгУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ДолгРегл < 0
	|			ТОГДА -Таблица.ДолгРегл
	|			ИНАЧЕ Таблица.ДолгРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ Таблица.ПредоплатаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ Таблица.ПредоплатаРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКредитыИЗаймыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКредитыИЗаймыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.Договор КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыЗаймыВыданныеПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыЗаймыВыданныеУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.Договор КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.ЗаймВыданный)
	//++ НЕ УТ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыАрендаПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыАрендаУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.Договор КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Аренда)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРезервыПоДолгамПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРезервыПоДолгамУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Таблица.ОбъектРасчетов) В(
	|					ТИП(Справочник.ДоговорыКонтрагентов),
	|					ТИП(Справочник.ДоговорыМеждуОрганизациями),
	|					ТИП(Справочник.ДоговорыКредитовИДепозитов),
	|					ТИП(Справочник.ДоговорыАренды))
	|			ТОГДА Таблица.ОбъектРасчетов
	|			ИНАЧЕ Таблица.ОбъектРасчетов.Договор
	|		КОНЕЦ КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РезервыПоСомнительнымДолгам) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаРезервыПоСомнительнымДолгам КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаУпр <> 0
	//-- НЕ УТ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаСуммыДисконтирования КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0 ИЛИ Таблица.СуммаУпр <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Договоры.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|
	|		Таблица.СуммаВыручкиУпр КАК СуммаУпр,
	|		Таблица.СуммаВыручкиРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаТоварыКОформлениюОтчетовКомитенту КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|			ПО Таблица.Договор = Договоры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО Аналитика.Партнер = Договоры.Партнер
	|			И Аналитика.Организация = Договоры.Организация
	|			И Аналитика.Контрагент = Договоры.Контрагент
	|			И Аналитика.Договор = Договоры.Ссылка
	|			И Аналитика.НаправлениеДеятельности = Договоры.НаправлениеДеятельности
	|	ГДЕ
	|		Таблица.СуммаВыручкиРегл <> 0 ИЛИ Таблица.СуммаВыручкиУпр <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Договоры.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|			ПО Таблица.Договор = Договоры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО Аналитика.Партнер = Договоры.Партнер
	|			И Аналитика.Организация = Договоры.Организация
	|			И Аналитика.Контрагент = Договоры.Контрагент
	|			И Аналитика.Договор = Договоры.Ссылка
	|			И Аналитика.НаправлениеДеятельности = Договоры.НаправлениеДеятельности
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0 ИЛИ Таблица.СуммаУпр <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Договоры.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|
	|		Таблица.СуммаВыручкиУпр КАК Сумма,
	|		Таблица.СуммаВыручкиРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаУслугиКОформлениюОтчетовПринципалу КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|			ПО Таблица.Договор = Договоры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО Аналитика.Партнер = Договоры.Партнер
	|			И Аналитика.Организация = Договоры.Организация
	|			И Аналитика.Контрагент = Договоры.Контрагент
	|			И Аналитика.Договор = Договоры.Ссылка
	|			И Аналитика.НаправлениеДеятельности = Договоры.НаправлениеДеятельности
	|	ГДЕ
	|		Таблица.СуммаВыручкиРегл <> 0 ИЛИ Таблица.СуммаВыручкиУпр <> 0
	|	) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитики
	|		ПО ВложенныйЗапрос.АналитикаУчетаПоПартнерам = РегистрАналитики.КлючАналитики
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	РегистрАналитики.Контрагент,
	|	РегистрАналитики.Партнер,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи
	//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|
	|	ВложенныйЗапрос.Партнер КАК Партнер,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	ВложенныйЗапрос.Валюта КАК ВалютаВзаиморасчетов,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРеглБезНДС,
	|
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ИсточникГФУРасчетов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыИнвестицииВАрендуПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыИнвестицииВАрендуУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ОбъектыРасчетов.Организация КАК Организация,
	|		ОбъектыРасчетов.Контрагент КАК Контрагент,
	|		ОбъектыРасчетов.Партнер КАК Партнер,
	|		Таблица.Договор КАК Договор,
	|		ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ИнвестицииВАренду) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ИнвестицииВАренду) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаИнвестицииВАренду КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО Таблица.Договор = ОбъектыРасчетов.Объект
	|	) КАК ВложенныйЗапрос
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Партнер,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи
	//-- НЕ УТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";


	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ДвиженияДенежныеСредстваДоходыРасходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса, "ДенежныеСредства");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Подразделение КАК ПодразделениеДоходовРасходов,
	|
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиДС,
	|	ВложенныйЗапрос.ДенежныеСредства КАК ДенежныеСредства,
	|	ВложенныйЗапрос.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	0 КАК СуммаВВалюте,
	|	
	|	ВложенныйЗапрос.ИсточникГФУДенежныхСредств КАК ИсточникГФУДенежныхСредств,
	|	ВложенныйЗапрос.ИсточникГФУДоходовРасходов КАК ИсточникГФУДоходовРасходов
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.БанковскийСчет КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|		Таблица.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Касса КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|		Таблица.Касса.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Касса КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток) 
	|		КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.КассаККМ КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|		Таблица.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.КассаККМ КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.ПодотчетноеЛицо КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.ПодотчетноеЛицо КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Контрагент КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваВПути) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Контрагент КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДепозитыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДепозитыУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток) 
	|		КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Договор КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Депозиты) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Договор КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Депозит)
	|И &ОбъединениеСТаблицамиЛокализации
	|
	|	) КАК ВложенныйЗапрос
	|
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|	И &ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.ДенежныеСредства,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.ТипДенежныхСредств,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.ИсточникГФУДенежныхСредств,
	|	ВложенныйЗапрос.ИсточникГФУДоходовРасходов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	РасчетКурсовыхРазницЛокализация.ДополнитьОбъединениеТаблицЗапросаДвиженияДенежныеСредстваДоходыРасходы(ТекстЗапроса);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&ИдентификаторМетаданных КАК ТипСсылки,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК МестоХранения,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	&Период КАК ДатаДокументаИБ,
	|	&Ссылка КАК Ссылка,
	|	&Номер КАК НомерДокументаИБ,
	|	НЕОПРЕДЕЛЕНО КАК Статус,
	|	НЕОПРЕДЕЛЕНО КАК Ответственный,
	|	НЕОПРЕДЕЛЕНО КАК Автор,
	|	ЛОЖЬ КАК ДополнительнаяЗапись,
	|	НЕОПРЕДЕЛЕНО КАК Дополнительно,
	|	&Комментарий КАК Комментарий,
	|	&Проведен КАК Проведен,
	|	&ПометкаУдаления КАК ПометкаУдаления,
	|	&Период КАК ДатаПервичногоДокумента,
	|	&НомерНаПечать КАК НомерПервичногоДокумента,
	|	0 КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	ЛОЖЬ КАК СторноИсправление,
	|	НЕОПРЕДЕЛЕНО КАК СторнируемыйДокумент,
	|	НЕОПРЕДЕЛЕНО КАК ИсправляемыйДокумент,
	|	&Период КАК ДатаОтраженияВУчете,
	|	НЕОПРЕДЕЛЕНО КАК Приоритет";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента = "Документ.РасчетКурсовыхРазниц";
	ЗначенияПараметров = Новый Структура;
	ЗначенияПараметров.Вставить("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.РасчетКурсовыхРазниц"));
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "";
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.';
								|en = 'In document %ПолноеИмяДокумента%, adaptation of request for generating records of register %ИмяРегистра% is not implemented.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
			ТекстЗапроса, ПолноеИмяДокумента, СинонимТаблицыДокумента, Ложь);
	Иначе
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
			ТекстЗапроса, ПолноеИмяДокумента, СинонимТаблицыДокумента);
	КонецЕсли;
	
	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметров;
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РасчетКурсовыхРазниц

Процедура ВыполнитьРасчетКурсовыхРазниц(ДокументСсылка, ИменаРегистров, АналитикаРасчета = Неопределено, КоличествоОбработанныхЭлементов = 0)
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	//++ НЕ УТ
	
	//++ Локализация
	Если ИменаРегистров.Свойство("РасчетыПоФинансовымИнструментамНУ") Тогда
		Запрос.УстановитьПараметр("ПерезаполнениеРегистровНУ", Истина);
		ИменаРегистров.Удалить("РасчетыПоФинансовымИнструментамНУ");
		ИменаРегистров.Вставить("РасчетыПоФинансовымИнструментам");
	ИначеЕсли ИменаРегистров.Свойство("РасчетПереоценкиВалютныхСредствНУ") Тогда
		ИменаРегистров.Удалить("РасчетПереоценкиВалютныхСредствНУ");
		ИменаРегистров = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
		ИменаРегистров.Удалить("ДенежныеСредстваУПодотчетныхЛиц");
	КонецЕсли;
	//-- Локализация
	
	//-- НЕ УТ
	Запрос.УстановитьПараметр("ИменаРегистров", ИменаРегистров);
	Если ТипЗнч(АналитикаРасчета) = Тип("Структура") Тогда
		АналитикаУчетаПоПартнерам = ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета);
		КлючиОрганизации = ПолучитьСсылкиСправочника("КлючиАналитикиУчетаПоПартнерам", АналитикаУчетаПоПартнерам, Запрос.Параметры.Организация);
		Если ЗначениеЗаполнено(КлючиОрганизации) Тогда
			Запрос.УстановитьПараметр("АналитикаРасчета", КлючиОрганизации);
		КонецЕсли;
		Кассы = ПолучитьАналитику("Кассы", АналитикаРасчета);
		Если ЗначениеЗаполнено(Кассы) Тогда
			Запрос.УстановитьПараметр("Кассы", Кассы);
			Запрос.УстановитьПараметр("ПоВсемКассам", НЕ ЗначениеЗаполнено(Кассы));
		КонецЕсли;
		ФизическиеЛица = ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета);
		Если ЗначениеЗаполнено(ФизическиеЛица) Тогда
			Запрос.УстановитьПараметр("ПодотчетныеЛица", ФизическиеЛица);
			Запрос.УстановитьПараметр("ПоВсемПодотчетнымЛицам", НЕ ЗначениеЗаполнено(ФизическиеЛица));
		КонецЕсли;
	КонецЕсли;
		
	Если НЕ Запрос.Параметры.ПерезаполнениеРегистровНУ Тогда
		ПодготовитьНаборыЗаписейКРасчету(ДокументСсылка, ИменаРегистров, АналитикаРасчета);
	КонецЕсли;
	РассчитатьКурсовыеРазницы(Запрос.Параметры, КоличествоОбработанныхЭлементов);
	
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницы(Знач Параметры, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	ВсеТипыДокументов = Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы());
	Если ВсеТипыДокументов.СодержитТип(ТипЗнч(Параметры)) Тогда
		ЗапросПараметров = Новый Запрос;
		ЗапросПараметров.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗаполнитьПараметрыИнициализации(ЗапросПараметров, Параметры);
		Параметры = ЗапросПараметров.Параметры;
	КонецЕсли;            
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru = 'Расчет курсовых разниц';
															|en = 'Exchange difference calculation'"), Параметры.ИменаРегистров);
	
	РасчетКурсовыхРазниц = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Документ.РасчетКурсовыхРазниц.МодульМенеджера.РасчетКурсовыхРазниц");
	
	Запрос = ИнициализироватьЗапросКурсовыхРазниц(Параметры);
	Если Запрос <> Неопределено Тогда
		ДниПереоценки = ДниПереоценки(Параметры);
		Для Каждого День Из ДниПереоценки Цикл
			
			МенеджерТаблиц = Новый МенеджерВременныхТаблиц;
			
			Запрос.МенеджерВременныхТаблиц = МенеджерТаблиц;
			Запрос.УстановитьПараметр("НачалоПериода", День.Дата);
			Запрос.УстановитьПараметр("КонецПериода" , КонецДня(День.Дата));
			Запрос.УстановитьПараметр("ГраницаНачалоПериода", Новый Граница(День.Дата, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("ГраницаКонецПериода" , Новый Граница(КонецДня(День.Дата), ВидГраницы.Включая));
			Запрос.УстановитьПараметр("ВсеДвижения", Истина);
			//++ НЕ УТ
			Если Параметры.ЭтоАренда Тогда
				Запрос.УстановитьПараметр("ТипыСумм", ТипыСуммОплатыПоАренде());
				Если КонецДня(День.Дата) = КонецМесяца(День.Дата) Тогда
					Запрос.УстановитьПараметр("ТипыСумм", ТипыСуммПлатежейПоАренде());
				КонецЕсли;
			КонецЕсли;
			//++ Локализация
			Запрос.УстановитьПараметр("ОстатокНачалоПериода", Новый Граница(День.Дата, ВидГраницы.Исключая));
			//-- Локализация
			
			//-- НЕ УТ
			
			Запрос.ВыполнитьПакет();
			
			Для Каждого Регистр Из Параметры.ИменаРегистров Цикл
				ВсегоЗаписано = ЗаписатьДвижения(Параметры.Ссылка, МенеджерТаблиц, Регистр.Ключ, День.Дата, Параметры);
				КоличествоОбработанныхЭлементов = КоличествоОбработанныхЭлементов + ВсегоЗаписано;
			КонецЦикла;
			
			МенеджерТаблиц.Закрыть();
			
		КонецЦикла;
	КонецЕсли;
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(РасчетКурсовыхРазниц, КоличествоОбработанныхЭлементов/1000);
	
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницыПоСрокам(Организация, Дата, Операция, ПереоценкаПоДням = Неопределено, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	МассивОрганизаций = Организация;
	Если Организация = Неопределено Тогда
		МассивОрганизаций = Справочники.Организации.ДоступныеОрганизации(Истина);
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(Организация);
	КонецЕсли;
	
	РасчетыСКлиентами = Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	
	ПараметрыПереоценки = ОперативныеВзаиморасчетыСервер.ПараметрыПереоценки(РасчетыСКлиентами, ПереоценкаПоДням);
	ОперативныеВзаиморасчетыСервер.ВыполнитьПереоценкуЗаПериод(МассивОрганизаций, НачалоМесяца(Дата), КонецМесяца(Дата), ПараметрыПереоценки);
	
КонецПроцедуры

// Определяет дни в которые необходимо переоценить текущие остатки для заданной хоз. операции:
// - для переоценки "На дату оплаты и на конец месяца" - дни в которые были оплаты в валюте и последнее число месяца.
// - для переоценки "На каждый день месяца" - дни в которые были оплаты в валюте и дни в которые менялся курс.
//
// Параметры:
//  <Параметры>  - структура с обязательными ключами:
//                 НачалоПериода - <Дата> - задает начало периода поиска дат переоценки.
//                 КонецПериода - <Дата> - задает конец периода поиска дат переоценки.
//                 Организация - <Справочник.Организации> - организация по которой необходимо переоценивать остатки.
//                 ПереоценкаПоДням - <Булево> - Истина - датами переоценки являются все даты изменения курсов валют и
//                                               даты оплат, иначе только даты оплаты.
//                 ХозяйственнаяОперация - <Перечисление.ХозяйственныеОперации> - задает регистр накопления о которому
//                                                                                определяются даты оплаты.
//                 АналитикаРасчета - <Массив> - ключи аналитики организации по которой необходимо переоценивать остатки.
//
// Возвращаемое значение:
//   ТаблицаЗначений - с одной колонкой "Дата" типа <Дата>.
//
Функция ДниПереоценки(Параметры)
	
	ОбъединитьВсе = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	
	ТекстЗапроса = "";
	Если Параметры.ИменаРегистров.Свойство("РасчетыСПоставщикамиПоСрокам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты поставщикам в валюте
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	ДАТАВРЕМЯ(1,1,1) КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыСКлиентамиПоСрокам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты клиентов в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта КАК Валюта,
		|	Расчеты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыСПоставщикамиПоДокументам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты поставщикам в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта КАК Валюта,
		|	Расчеты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ХозяйственнаяОперация В (&ОплатаПоставщику) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыСКлиентамиПоДокументам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты клиентов в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта КАК Валюта,
		|	Расчеты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ХозяйственнаяОперация В (&ОплатаКлиента) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваБезналичные") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Безналичные денежные средства
		|ВЫБРАТЬ
		|	БезналичныеДС.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
		|	БезналичныеДС.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК БезналичныеДС
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваНаличные") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Наличные денежные средства
		|ВЫБРАТЬ
		|	НаличныеДС.Касса.ВалютаДенежныхСредств КАК Валюта,
		|	НаличныеДС.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
		|				И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК НаличныеДС
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваВКассахККМ") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Денежные средства в кассах ККМ
		|ВЫБРАТЬ
		|	ДСвКассахККМ.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
		|	ДСвКассахККМ.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСвКассахККМ
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваВПути") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Денежные средства в пути
		|ВЫБРАТЬ
		|	ДСвПути.Валюта КАК Валюта,
		|	ДСвПути.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСвПути
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваУПодотчетныхЛиц") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Денежные средства у подотчетных лиц
		|ВЫБРАТЬ
		|	ДСуПодотчетныхЛиц.Валюта КАК Валюта,
		|	ДСуПодотчетныхЛиц.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
		|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСуПодотчетныхЛиц
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыПоФинансовымИнструментам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыПоФинансовымИнструментам.Договор.ВалютаВзаиморасчетов КАК Валюта,
		|	НАЧАЛОПЕРИОДА(РасчетыПоФинансовымИнструментам.Период, ДЕНЬ) КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыПоФинансовымИнструментам КАК РасчетыПоФинансовымИнструментам
		|ГДЕ
		|	РасчетыПоФинансовымИнструментам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РасчетыПоФинансовымИнструментам.АналитикаУчетаПоПартнерам.Организация = &Организация
		|	И (РасчетыПоФинансовымИнструментам.Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета
		|		ИЛИ РасчетыПоФинансовымИнструментам.Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
		|	И ТИПЗНАЧЕНИЯ(РасчетыПоФинансовымИнструментам.Регистратор) <> ТИП(Документ.НачисленияКредитовИДепозитов)
		|	И (РасчетыПоФинансовымИнструментам.ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|	И (&ВсеДвижения
		|		ИЛИ РасчетыПоФинансовымИнструментам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	//++ НЕ УТ
	
	Если Параметры.ИменаРегистров.Свойство("РезервыПоСомнительнымДолгам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	Резервы.Валюта КАК Валюта,
		|	Резервы.Период КАК Период
		|ИЗ
		|	РегистрНакопления.РезервыПоСомнительнымДолгам КАК Резервы
		|ГДЕ
		|	Резервы.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Резервы.Валюта <> &ВалютаУправленческогоУчета
		|	И (Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ИЛИ &ПереоценкаПоДням)
		|	И Резервы.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Резервы.Сумма <> 0";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ
	
	Если Параметры.ИменаРегистров.Свойство("ПроцентныеРасходыДисконтирования") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	СуммыДисконтирования.Валюта КАК Валюта,
		|	СуммыДисконтирования.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ПроцентныеРасходыДисконтирования КАК СуммыДисконтирования
		|ГДЕ
		|	СуммыДисконтирования.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СуммыДисконтирования.Валюта <> &ВалютаУправленческогоУчета
		|	И (СуммыДисконтирования.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ИЛИ &ПереоценкаПоДням)
		|	И СуммыДисконтирования.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И СуммыДисконтирования.СуммаДисконтирования <> 0";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ТоварыКОформлениюОтчетовКомитенту") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	ТоварыКОформлению.Валюта КАК Валюта,
		|	ТоварыКОформлению.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета
		|					ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ТоварыКОформлению
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|		ПО ТоварыКОформлению.ВидЗапасов = ВидыЗапасов.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ПО ВидыЗапасов.Договор = Договоры.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	ТоварыКОформлению.Валюта КАК Валюта,
		|	ТоварыКОформлению.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета
		|					ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ТоварыКОформлению
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО ТоварыКОформлению.Назначение = Назначения.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ПО Назначения.Договор = Договоры.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("УслугиКОформлениюОтчетовПринципалу") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	УслугиКОформлению.Валюта КАК Валюта,
		|	УслугиКОформлению.Период КАК Период
		|ИЗ
		|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета
		|					ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК УслугиКОформлению
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК Соглашения
		|		ПО УслугиКОформлению.Соглашение = Соглашения.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(Соглашения.ПереоцениватьУслугиКОтчетуКомитенту, ЛОЖЬ)";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	//++ НЕ УТ
	
	Если Параметры.ИменаРегистров.Свойство("ИнвестицииВАренду") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Инвестиции в аренду
		|ВЫБРАТЬ
		|	ИнвестицииВАренду.Валюта КАК Валюта,
		|	ИнвестицииВАренду.Период
		|ИЗ
		|	РегистрНакопления.ИнвестицииВАренду.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ИнвестицииВАренду
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ
	
	РасчетКурсовыхРазницЛокализация.ДополнитьДниПереоценки(Параметры.ИменаРегистров, ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапроса + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(втОборотыВалюты.Период, ДЕНЬ) КАК Дата
	|ИЗ
	|	втОборотыВалюты КАК втОборотыВалюты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КурсыВалют.Период
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ПереоценкаПоДням
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("ГраницаНачалоПериода", Новый Граница(Параметры.НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКонецПериода",  Новый Граница(Параметры.КонецПериода,  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВсеДвижения",  Истина);
	//++ НЕ УТ
	Если Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде Тогда
		Запрос.УстановитьПараметр("ВсеДвижения", Ложь);
		Запрос.УстановитьПараметр("ТипыСумм", ТипыСуммОплатыПоАренде());
	КонецЕсли;
	//-- НЕ УТ
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Возврат Выборка;
	
КонецФункции

Функция ИнициализироватьЗапросКурсовыхРазниц(Параметры)
	
	ТекстыЗапросов = Новый Массив; 
	
	#Область УХ_Встраивание
	// Код ERP
	//ТекстыЗапросов.Добавить(ТекстыЗапросаКурсовВалют());
	ТекстыЗапросов.Добавить(ИзменитьТекстЗапроса_ТекстыЗапросаКурсовВалют(ТекстыЗапросаКурсовВалют()));
	#КонецОбласти
	
	Для Каждого Регистр Из Параметры.ИменаРегистров Цикл
			
		Если Регистр.Ключ = "РасчетыСПоставщикамиПоДокументам" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиПоДокументам());
			
		ИначеЕсли Регистр.Ключ = "РасчетыСКлиентамиПоДокументам" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыРасчетыСКлиентамиПоДокументам());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваБезналичные" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваБезналичные());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваНаличные" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваНаличные());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваВКассахККМ" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваУПодотчетныхЛиц" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваУПодотчетныхЛиц());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваВПути" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваВПути());
			
		ИначеЕсли Регистр.Ключ = "РасчетыПоФинансовымИнструментам" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыРасчетыПоФинансовымИнструментам());
		//++ НЕ УТ
			
		ИначеЕсли Регистр.Ключ = "РезервыПоСомнительнымДолгам" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыРезервыПоСомнительнымДолгам());
		//-- НЕ УТ
		
		ИначеЕсли Регистр.Ключ = "ПроцентныеРасходыДисконтирования" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыПроцентныеРасходыДисконтирования());
			
		ИначеЕсли Регистр.Ключ = "ТоварыКОформлениюОтчетовКомитенту" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыТоварыКОформлениюОтчетовКомитенту());
			
		ИначеЕсли Регистр.Ключ = "ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках());
			
		ИначеЕсли Регистр.Ключ = "УслугиКОформлениюОтчетовПринципалу" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыУслугиКОформлениюОтчетовПринципалу());
		//++ НЕ УТ
			
		ИначеЕсли Регистр.Ключ = "ИнвестицииВАренду" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыИнвестицииВАренду());
		//-- НЕ УТ
		
		КонецЕсли;
	
		РасчетКурсовыхРазницЛокализация.ДополнитьЗапросКурсовыхРазниц(Регистр.Ключ, ТекстыЗапросов);
		
	КонецЦикла;
	
	Если ТекстыЗапросов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов);
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Возврат Запрос;
	
КонецФункции

Функция ТекстыЗапросаКурсовВалют()
	
	Возврат "ВЫБРАТЬ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.КурсЧислитель КАК КурсЧислитель,
	|	КурсВалюты.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыВалют
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|			&КонецПериода,
	|			БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.КурсЧислитель КАК КурсЧислитель,
	|	КурсВалюты.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыВалютУпр
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|		&КонецПериода,
	|		Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсДоговора.Договор КАК Договор,
	|	КурсДоговора.КурсЧислитель КАК КурсЧислитель,
	|	КурсДоговора.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыДоговоров
	|ИЗ
	|	РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&КонецПериода) КАК КурсДоговора
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиПоДокументам()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаПоПартнерам КАК КлючАналитики,
	|	Расчеты.ЗаказПоставщику КАК ОбъектРасчетов
	|ПОМЕСТИТЬ втАналитикаЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.ХозяйственнаяОперация В (&ОплатаПоставщику)
	|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И Расчеты.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику КАК Заказ,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток КАК Долг,
	|	ОстаткиДня.ДолгРеглОстаток КАК ДолгРегл,
	|	ОстаткиДня.ДолгУпрОстаток КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр
	|ПОМЕСТИТЬ втОстаткиНаКонецДня
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказПоставщику = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток <> 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток,
	|	ОстаткиДня.ДолгРеглОстаток,
	|	ОстаткиДня.ДолгУпрОстаток,
	|	0,
	|	0
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказПоставщику = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток = 0
	|	И (ОстаткиДня.ДолгРеглОстаток <> 0 ИЛИ ОстаткиДня.ДолгУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику,
	|	ОстаткиДня.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ОстаткиДня.ПредоплатаРеглОстаток,
	|	ОстаткиДня.ПредоплатаУпрОстаток
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|ГДЕ
	|	ОстаткиДня.КВозвратуОстаток = 0
	|	И ОстаткиДня.ПредоплатаОстаток = 0
	|	И (ОстаткиДня.ПредоплатаРеглОстаток <> 0 ИЛИ ОстаткиДня.ПредоплатаУпрОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - Остатки.ДолгРегл КАК ДолгРегл,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - Остатки.ДолгУпр КАК ДолгУпр
	|
	|ПОМЕСТИТЬ втНеРеализованныеКР
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|ГДЕ
	|	Остатки.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК ЗаказПоставщику,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	0 КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаРасчетов
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл < 0
	|		ТОГДА -Остатки.ПредоплатаРегл
	|		ИНАЧЕ Остатки.ПредоплатаРегл
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр < 0
	|		ТОГДА -Остатки.ПредоплатаУпр
	|		ИНАЧЕ Остатки.ПредоплатаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.ДолгРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.ЗаказПоставщику,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	СУММА(ТаблицаРасчетов.ДолгРегл) КАК ДолгРегл,
	|	СУММА(ТаблицаРасчетов.ДолгУпр) КАК ДолгУпр,
	|	СУММА(ТаблицаРасчетов.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(ТаблицаРасчетов.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация
	|ПОМЕСТИТЬ КурсовыеРазницыРасчетыСПоставщикамиПоДокументам
	|ИЗ
	|	ТаблицаРасчетов КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	ТаблицаРасчетов.ЗаказПоставщику,
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыРасчетыСКлиентамиПоДокументам()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаПоПартнерам КАК КлючАналитики,
	|	Расчеты.ЗаказКлиента КАК ОбъектРасчетов
	|ПОМЕСТИТЬ втАналитикаЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.ХозяйственнаяОперация В (&ОплатаКлиента)
	|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И Расчеты.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента КАК Заказ,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток КАК Долг,
	|	ОстаткиДня.ДолгРеглОстаток КАК ДолгРегл,
	|	ОстаткиДня.ДолгУпрОстаток КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр
	|ПОМЕСТИТЬ втОстаткиНаКонецДня
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|		И ОстаткиДня.ЗаказКлиента = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток <> 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток,
	|	ОстаткиДня.ДолгРеглОстаток,
	|	ОстаткиДня.ДолгУпрОстаток,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказКлиента = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток = 0
	|	И (ОстаткиДня.ДолгРеглОстаток <> 0 ИЛИ ОстаткиДня.ДолгУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента,
	|	ОстаткиДня.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ОстаткиДня.ПредоплатаРеглОстаток,
	|	ОстаткиДня.ПредоплатаУпрОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|ГДЕ
	|	ОстаткиДня.КВозвратуОстаток = 0
	|	И ОстаткиДня.ПредоплатаОстаток = 0
	|	И (ОстаткиДня.ПредоплатаРеглОстаток <> 0 ИЛИ ОстаткиДня.ПредоплатаУпрОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - Остатки.ДолгРегл КАК ДолгРегл,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - Остатки.ДолгУпр КАК ДолгУпр
	|ПОМЕСТИТЬ втНеРеализованныеКР
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|ГДЕ
	|	Остатки.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК ЗаказКлиента,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	0 КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаРасчетов
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл < 0
	|		ТОГДА -Остатки.ПредоплатаРегл
	|		ИНАЧЕ Остатки.ПредоплатаРегл
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр < 0
	|		ТОГДА -Остатки.ПредоплатаУпр
	|		ИНАЧЕ Остатки.ПредоплатаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.ДолгРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.ЗаказКлиента,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	СУММА(ТаблицаРасчетов.ДолгРегл) КАК ДолгРегл,
	|	СУММА(ТаблицаРасчетов.ДолгУпр) КАК ДолгУпр,
	|	СУММА(ТаблицаРасчетов.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(ТаблицаРасчетов.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация
	|ПОМЕСТИТЬ КурсовыеРазницыРасчетыСКлиентамиПоДокументам
	|ИЗ
	|	ТаблицаРасчетов КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	ТаблицаРасчетов.ЗаказКлиента,
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваБезналичные()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.БанковскийСчет КАК Счет
	|ПОМЕСТИТЬ СчетаЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.БанковскийСчет КАК БанковскийСчет,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|
	|ПОМЕСТИТЬ втОстаткиБезналичных
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗаДень
	|		ПО ОстаткиНаДень.БанковскийСчет = СчетаЗаДень.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ СчетаЗаДень.Счет ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация Организация,
	|	ОстаткиНаДень.БанковскийСчет КАК БанковскийСчет,
	|	-ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	-ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗаДень
	|		ПО ОстаткиНаДень.БанковскийСчет = СчетаЗаДень.Счет
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ СчетаЗаДень.Счет ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|;
	|
	//++ НЕ УТ
	
	//++ Локализация
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	СУММА(ОстаткиНаДень.ОстатокВВалюте) КАК ОстатокВВалюте,
	|	СУММА(ОстаткиНаДень.ОстатокРегл) КАК ОстатокРегл,
	|	ОстаткиНаДень.БанковскийСчет КАК БанковскийСчет,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период
	|ПОМЕСТИТЬ втОстаткиНаДеньПоСчетам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|		ОстаткиНаДень.СуммаОстаток КАК ОстатокВВалюте,
	|		ОстаткиНаДень.СуммаРеглОстаток КАК ОстатокРегл,
	|		ОстаткиНаДень.БанковскийСчет КАК БанковскийСчет,
	|		ОстаткиНаДень.Организация КАК Организация,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|				&ОстатокНачалоПериода,
	|				Организация = &Организация
	|					И БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета
	|		) КАК ОстаткиНаДень
	|			ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗаДень
	|				ПО ОстаткиНаДень.БанковскийСчет = СчетаЗаДень.Счет
	|	ГДЕ
	|		ОстаткиНаДень.СуммаОстаток <> 0
	|		И (НЕ СчетаЗаДень.Счет ЕСТЬ NULL
	|			ИЛИ &КонецПериода = &КонецМесяца
	|			ИЛИ &ПереоценкаПоДням)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДвиженияЗаДень.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.Сумма
	|			ИНАЧЕ -ДвиженияЗаДень.Сумма
	|		КОНЕЦ КАК ОстатокВВалюте,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.СуммаРегл
	|			ИНАЧЕ -ДвиженияЗаДень.СуммаРегл
	|		КОНЕЦ КАК ОстатокРегл,
	|		ДвиженияЗаДень.БанковскийСчет КАК БанковскийСчет,
	|		ДвиженияЗаДень.Организация КАК Организация,
	|		ДвиженияЗаДень.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваБезналичные КАК ДвиженияЗаДень
	|	ГДЕ
	|		ДвиженияЗаДень.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ТИПЗНАЧЕНИЯ(ДвиженияЗаДень.Регистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|		И ДвиженияЗаДень.Организация = &Организация
	|		И ДвиженияЗаДень.СуммаРегл <> 0
	|		И ДвиженияЗаДень.БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета
	|	) КАК ОстаткиНаДень
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНаДень.Валюта,
	|	ОстаткиНаДень.БанковскийСчет,
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.СтатьяДДС,
	|	ОстаткиНаДень.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	ОстаткиНаДень.ОстатокВВалюте КАК ОстатокВВалюте,
	|	ОстаткиНаДень.ОстатокРегл КАК ОстатокРегл,
	|	ЕСТЬNULL(КурсВалюты.КурсЧислитель, 1) КАК Курс,
	|	ЕСТЬNULL(КурсВалюты.КурсЗнаменатель, 1) КАК Кратность,
	|	ОстаткиНаДень.БанковскийСчет КАК БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО КАК Касса,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетУчета
	|ПОМЕСТИТЬ РасшифровкаРасчетаДенежныеСредстваБезналичные
	|ИЗ
	|	втОстаткиНаДеньПоСчетам КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ДенежныеСредства)
	|			И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НастройкиПоАналитике.АналитикаУчета = ОстаткиНаДень.БанковскийСчет
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасшифровкаРасчета.СчетУчета КАК СчетУчета,
	|	ВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ВидыСубконто.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВидыСубконтоДенежныеСредстваБезналичные
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасшифровкаРасчетаДенежныеСредстваБезналичные КАК РасшифровкаРасчета
	|			ПО РасшифровкаРасчета.СчетУчета = ВидыСубконто.Ссылка
	|;
	|
	//-- Локализация
	
	//-- НЕ УТ
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл < 0
	|		ТОГДА -Остатки.КурсоваяРазницаРегл
	|		ИНАЧЕ Остатки.КурсоваяРазницаРегл
	|	КОНЕЦ КАК КурсоваяРазницаРегл,
	|	0 КАК КурсоваяРазницаУпр,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаБезналичныхДС
	|ИЗ
	|	втОстаткиБезналичных КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.БанковскийСчет КАК БанковскийСчет,
	|	0 КАК КурсоваяРазницаРегл,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр < 0
	|		ТОГДА -Остатки.КурсоваяРазницаУпр
	|		ИНАЧЕ Остатки.КурсоваяРазницаУпр
	|	КОНЕЦ КАК КурсоваяРазницаУпр,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиБезналичных КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаБезналичныхДС.Валюта,
	|	ТаблицаБезналичныхДС.ВидДвижения,
	|	ТаблицаБезналичныхДС.Период КАК Период,
	|	ТаблицаБезналичныхДС.Организация,
	|	ТаблицаБезналичныхДС.БанковскийСчет,
	|	СУММА(ТаблицаБезналичныхДС.КурсоваяРазницаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаБезналичныхДС.КурсоваяРазницаУпр) КАК СуммаУпр,
	|	ТаблицаБезналичныхДС.ХозяйственнаяОперация,
	|	ТаблицаБезналичныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаБезналичныхДС.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваБезналичные
	|ИЗ
	|	ТаблицаБезналичныхДС КАК ТаблицаБезналичныхДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаБезналичныхДС.Валюта,
	|	ТаблицаБезналичныхДС.Период,
	|	ТаблицаБезналичныхДС.Организация,
	|	ТаблицаБезналичныхДС.БанковскийСчет,
	|	ТаблицаБезналичныхДС.ХозяйственнаяОперация,
	|	ТаблицаБезналичныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаБезналичныхДС.ВидДвижения,
	|	ТаблицаБезналичныхДС.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваНаличные()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Касса КАК Касса
	|ПОМЕСТИТЬ КассыЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Касса.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|
	|ПОМЕСТИТЬ втОстаткиНаличных
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыЗаДень
	|		ПО ОстаткиНаДень.Касса = КассыЗаДень.Касса
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Касса.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ КассыЗаДень.Касса ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Касса.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	-ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	-ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыЗаДень
	|		ПО ОстаткиНаДень.Касса = КассыЗаДень.Касса
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ КассыЗаДень.Касса ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	//++ НЕ УТ
	
	//++ Локализация
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	СУММА(ОстаткиНаДень.ОстатокВВалюте) КАК ОстатокВВалюте,
	|	СУММА(ОстаткиНаДень.ОстатокРегл) КАК ОстатокРегл,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период
	|ПОМЕСТИТЬ втОстаткиНаДеньВКассах
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиНаДень.Касса.ВалютаДенежныхСредств КАК Валюта,
	|		ОстаткиНаДень.СуммаОстаток КАК ОстатокВВалюте,
	|		ОстаткиНаДень.СуммаРеглОстаток КАК ОстатокРегл,
	|		ОстаткиНаДень.Касса КАК Касса,
	|		ОстаткиНаДень.Организация КАК Организация,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|				&ОстатокНачалоПериода,
	|				Организация = &Организация
	|					И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
	|					И Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета
	|		) КАК ОстаткиНаДень
	|			ЛЕВОЕ СОЕДИНЕНИЕ КассыЗаДень
	|				ПО ОстаткиНаДень.Касса = КассыЗаДень.Касса
	|	ГДЕ
	|		ОстаткиНаДень.СуммаОстаток <> 0
	|		И (НЕ КассыЗаДень.Касса ЕСТЬ NULL
	|			ИЛИ &КонецПериода = &КонецМесяца
	|			ИЛИ &ПереоценкаПоДням)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДвиженияЗаДень.Касса.ВалютаДенежныхСредств КАК Валюта,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.Сумма
	|			ИНАЧЕ -ДвиженияЗаДень.Сумма
	|		КОНЕЦ КАК ОстатокВВалюте,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.СуммаРегл
	|			ИНАЧЕ -ДвиженияЗаДень.СуммаРегл
	|		КОНЕЦ КАК ОстатокРегл,
	|		ДвиженияЗаДень.Касса КАК Касса,
	|		ДвиженияЗаДень.Организация КАК Организация,
	|		ДвиженияЗаДень.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваНаличные КАК ДвиженияЗаДень
	|	ГДЕ
	|		ДвиженияЗаДень.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ТИПЗНАЧЕНИЯ(ДвиженияЗаДень.Регистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|		И ДвиженияЗаДень.Организация = &Организация
	|		И ДвиженияЗаДень.СуммаРегл <> 0
	|		И ДвиженияЗаДень.Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета
	|	) КАК ОстаткиНаДень
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНаДень.Валюта,
	|	ОстаткиНаДень.Касса,
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.СтатьяДДС,
	|	ОстаткиНаДень.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	ОстаткиНаДень.ОстатокВВалюте КАК ОстатокВВалюте,
	|	ОстаткиНаДень.ОстатокРегл КАК ОстатокРегл,
	|	ЕСТЬNULL(КурсВалюты.КурсЧислитель, 1) КАК Курс,
	|	ЕСТЬNULL(КурсВалюты.КурсЗнаменатель, 1) КАК Кратность,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчет,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетУчета
	|ПОМЕСТИТЬ РасшифровкаРасчетаДенежныеСредстваНаличные
	|ИЗ
	|	втОстаткиНаДеньВКассах КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ДенежныеСредства)
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И НастройкиПоАналитике.АналитикаУчета = ОстаткиНаДень.Касса
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасшифровкаРасчета.СчетУчета КАК СчетУчета,
	|	ВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ВидыСубконто.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВидыСубконтоДенежныеСредстваНаличные
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасшифровкаРасчетаДенежныеСредстваНаличные КАК РасшифровкаРасчета
	|			ПО РасшифровкаРасчета.СчетУчета = ВидыСубконто.Ссылка
	|;
	|
	//-- Локализация
	
	//-- НЕ УТ
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Касса КАК Касса,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл < 0
	|		ТОГДА -Остатки.КурсоваяРазницаРегл
	|		ИНАЧЕ Остатки.КурсоваяРазницаРегл
	|	КОНЕЦ КАК КурсоваяРазницаРегл,
	|	0 КАК КурсоваяРазницаУпр,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаНаличныхДС
	|ИЗ
	|	втОстаткиНаличных КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Касса,
	|	0,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр < 0
	|		ТОГДА -Остатки.КурсоваяРазницаУпр
	|		ИНАЧЕ Остатки.КурсоваяРазницаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаличных КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНаличныхДС.Валюта,
	|	ТаблицаНаличныхДС.ВидДвижения,
	|	ТаблицаНаличныхДС.Период КАК Период,
	|	ТаблицаНаличныхДС.Организация,
	|	ТаблицаНаличныхДС.Касса,
	|	СУММА(ТаблицаНаличныхДС.КурсоваяРазницаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаНаличныхДС.КурсоваяРазницаУпр) КАК СуммаУпр,
	|	ТаблицаНаличныхДС.ХозяйственнаяОперация,
	|	ТаблицаНаличныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаНаличныхДС.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваНаличные
	|ИЗ
	|	ТаблицаНаличныхДС КАК ТаблицаНаличныхДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНаличныхДС.Валюта,
	|	ТаблицаНаличныхДС.Период,
	|	ТаблицаНаличныхДС.Организация,
	|	ТаблицаНаличныхДС.Касса,
	|	ТаблицаНаличныхДС.ХозяйственнаяОперация,
	|	ТаблицаНаличныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаНаличныхДС.ВидДвижения,
	|	ТаблицаНаличныхДС.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ КассыККМЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.КассаККМ КАК Касса,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|
	|ПОМЕСТИТЬ втОстаткиВКассахККМ
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|		&ГраницаКонецПериода,
	|		Организация = &Организация
	|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета 
	|				ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМЗаДень
	|		ПО ОстаткиНаДень.КассаККМ = КассыККМЗаДень.КассаККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО ИСТИНА
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ КассыККМЗаДень.КассаККМ ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|		ИЛИ ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.КассаККМ КАК Касса,
	|	-ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	-ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМЗаДень
	|		ПО ОстаткиНаДень.КассаККМ = КассыККМЗаДень.КассаККМ
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ КассыККМЗаДень.КассаККМ ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	//++ НЕ УТ
	
	//++ Локализация
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	СУММА(ОстаткиНаДень.ОстатокВВалюте) КАК ОстатокВВалюте,
	|	СУММА(ОстаткиНаДень.ОстатокРегл) КАК ОстатокРегл,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период
	|ПОМЕСТИТЬ втОстаткиНаДеньВКассахККМ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|		ОстаткиНаДень.СуммаОстаток КАК ОстатокВВалюте,
	|		ОстаткиНаДень.СуммаРеглОстаток КАК ОстатокРегл,
	|		ОстаткиНаДень.КассаККМ КАК Касса,
	|		ОстаткиНаДень.Организация КАК Организация,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|				&ОстатокНачалоПериода,
	|				Организация = &Организация
	|					И КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета
	|		) КАК ОстаткиНаДень
	|			ЛЕВОЕ СОЕДИНЕНИЕ КассыККМЗаДень КАК КассыЗаДень
	|				ПО ОстаткиНаДень.КассаККМ = КассыЗаДень.КассаККМ
	|	ГДЕ
	|		ОстаткиНаДень.СуммаОстаток <> 0
	|		И (НЕ КассыЗаДень.КассаККМ ЕСТЬ NULL
	|			ИЛИ &КонецПериода = &КонецМесяца
	|			ИЛИ &ПереоценкаПоДням)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДвиженияЗаДень.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.Сумма
	|			ИНАЧЕ -ДвиженияЗаДень.Сумма
	|		КОНЕЦ КАК ОстатокВВалюте,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.СуммаРегл
	|			ИНАЧЕ -ДвиженияЗаДень.СуммаРегл
	|		КОНЕЦ КАК ОстатокРегл,
	|		ДвиженияЗаДень.КассаККМ КАК Касса,
	|		ДвиженияЗаДень.Организация КАК Организация,
	|		ДвиженияЗаДень.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДвиженияЗаДень
	|	ГДЕ
	|		ДвиженияЗаДень.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ТИПЗНАЧЕНИЯ(ДвиженияЗаДень.Регистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|		И ДвиженияЗаДень.Организация = &Организация
	|		И ДвиженияЗаДень.СуммаРегл <> 0
	|		И ДвиженияЗаДень.КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета
	|	) КАК ОстаткиНаДень
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНаДень.Валюта,
	|	ОстаткиНаДень.Касса,
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.СтатьяДДС,
	|	ОстаткиНаДень.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	ОстаткиНаДень.ОстатокВВалюте КАК ОстатокВВалюте,
	|	ОстаткиНаДень.ОстатокРегл КАК ОстатокРегл,
	|	ЕСТЬNULL(КурсВалюты.КурсЧислитель, 1) КАК Курс,
	|	ЕСТЬNULL(КурсВалюты.КурсЗнаменатель, 1) КАК Кратность,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчет,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОперационнаяКасса) КАК СчетУчета
	|ПОМЕСТИТЬ РасшифровкаРасчетаДенежныеСредстваВКассахККМ
	|ИЗ
	|	втОстаткиНаДеньВКассахККМ КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасшифровкаРасчета.СчетУчета КАК СчетУчета,
	|	ВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ВидыСубконто.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВидыСубконтоДенежныеСредстваВКассахККМ
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасшифровкаРасчетаДенежныеСредстваВКассахККМ КАК РасшифровкаРасчета
	|			ПО РасшифровкаРасчета.СчетУчета = ВидыСубконто.Ссылка
	|;
	|
	//-- Локализация
	
	//-- НЕ УТ
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Касса КАК Касса,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл < 0
	|		ТОГДА -Остатки.КурсоваяРазницаРегл
	|		ИНАЧЕ Остатки.КурсоваяРазницаРегл
	|	КОНЕЦ КАК КурсоваяРазницаРегл,
	|	0 КАК КурсоваяРазницаУпр,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаДСВКассахККМ
	|ИЗ
	|	втОстаткиВКассахККМ КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Касса,
	|	0,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр < 0
	|		ТОГДА -Остатки.КурсоваяРазницаУпр
	|		ИНАЧЕ Остатки.КурсоваяРазницаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиВКассахККМ КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСВКассахККМ.Валюта,
	|	ТаблицаДСВКассахККМ.ВидДвижения,
	|	ТаблицаДСВКассахККМ.Период КАК Период,
	|	ТаблицаДСВКассахККМ.Организация,
	|	ТаблицаДСВКассахККМ.Касса КАК КассаККМ,
	|	СУММА(ТаблицаДСВКассахККМ.КурсоваяРазницаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСВКассахККМ.КурсоваяРазницаУпр) КАК СуммаУпр,
	|	ТаблицаДСВКассахККМ.ХозяйственнаяОперация,
	|	ТаблицаДСВКассахККМ.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСВКассахККМ.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваВКассахККМ
	|ИЗ
	|	ТаблицаДСВКассахККМ КАК ТаблицаДСВКассахККМ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСВКассахККМ.Валюта,
	|	ТаблицаДСВКассахККМ.Период,
	|	ТаблицаДСВКассахККМ.Организация,
	|	ТаблицаДСВКассахККМ.Касса,
	|	ТаблицаДСВКассахККМ.ХозяйственнаяОперация,
	|	ТаблицаДСВКассахККМ.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСВКассахККМ.ВидДвижения,
	|	ТаблицаДСВКассахККМ.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваУПодотчетныхЛиц()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ОборотыЗаДень.Подразделение КАК Подразделение,
	|	ОборотыЗаДень.ЦельВыдачи КАК ЦельВыдачи
	|
	|ПОМЕСТИТЬ ПодотчетникиЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|ГДЕ
	|	ОборотыЗаДень.СуммаОборот <> 0
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ОстаткиНаДень.Подразделение КАК Подразделение,
	|	ОстаткиНаДень.ЦельВыдачи КАК ЦельВыдачи,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр
	|
	|ПОМЕСТИТЬ втОстаткиУПодотчетныхЛиц
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодотчетникиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ПодотчетникиЗаДень.Организация
	|			И ОстаткиНаДень.ПодотчетноеЛицо = ПодотчетникиЗаДень.ПодотчетноеЛицо
	|			И ОстаткиНаДень.Подразделение = ПодотчетникиЗаДень.Подразделение
	|			И ОстаткиНаДень.ЦельВыдачи = ПодотчетникиЗаДень.ЦельВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток < 0
	|	И (НЕ ПодотчетникиЗаДень.ПодотчетноеЛицо ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.ПодотчетноеЛицо,
	|	ОстаткиНаДень.Подразделение,
	|	ОстаткиНаДень.ЦельВыдачи,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодотчетникиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ПодотчетникиЗаДень.Организация
	|			И ОстаткиНаДень.ПодотчетноеЛицо = ПодотчетникиЗаДень.ПодотчетноеЛицо
	|			И ОстаткиНаДень.Подразделение = ПодотчетникиЗаДень.Подразделение
	|			И ОстаткиНаДень.ЦельВыдачи = ПодотчетникиЗаДень.ЦельВыдачи
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ПодотчетникиЗаДень.ПодотчетноеЛицо ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.ЦельВыдачи КАК ЦельВыдачи,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДСУПодотчетныхЛиц
	|ИЗ
	|	втОстаткиУПодотчетныхЛиц КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.ПодотчетноеЛицо,
	|	Остатки.Подразделение,
	|	Остатки.ЦельВыдачи,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиУПодотчетныхЛиц КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСУПодотчетныхЛиц.Валюта,
	|	ТаблицаДСУПодотчетныхЛиц.ВидДвижения,
	|	ТаблицаДСУПодотчетныхЛиц.Период КАК Период,
	|	ТаблицаДСУПодотчетныхЛиц.Организация,
	|	ТаблицаДСУПодотчетныхЛиц.ПодотчетноеЛицо,
	|	ТаблицаДСУПодотчетныхЛиц.Подразделение,
	|	ТаблицаДСУПодотчетныхЛиц.ЦельВыдачи,
	|	СУММА(ТаблицаДСУПодотчетныхЛиц.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСУПодотчетныхЛиц.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДСУПодотчетныхЛиц.ХозяйственнаяОперация,
	|	ТаблицаДСУПодотчетныхЛиц.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСУПодотчетныхЛиц.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваУПодотчетныхЛиц
	|ИЗ
	|	ТаблицаДСУПодотчетныхЛиц КАК ТаблицаДСУПодотчетныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСУПодотчетныхЛиц.Валюта,
	|	ТаблицаДСУПодотчетныхЛиц.Период,
	|	ТаблицаДСУПодотчетныхЛиц.Организация,
	|	ТаблицаДСУПодотчетныхЛиц.ПодотчетноеЛицо,
	|	ТаблицаДСУПодотчетныхЛиц.Подразделение,
	|	ТаблицаДСУПодотчетныхЛиц.ЦельВыдачи,
	|	ТаблицаДСУПодотчетныхЛиц.ХозяйственнаяОперация,
	|	ТаблицаДСУПодотчетныхЛиц.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСУПодотчетныхЛиц.ВидДвижения,
	|	ТаблицаДСУПодотчетныхЛиц.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваВПути()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.Получатель КАК Получатель,
	|	ОборотыЗаДень.Отправитель КАК Отправитель,
	|	ОборотыЗаДень.ВидПереводаДенежныхСредств КАК ВидПеревода,
	|	ОборотыЗаДень.Контрагент КАК Контрагент
	|
	|ПОМЕСТИТЬ ДеньгиВПутиЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Получатель КАК Получатель,
	|	ОстаткиНаДень.Отправитель КАК Отправитель,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Контрагент КАК Контрагент,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.СуммаОстаток КАК Сумма,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|
	|ПОМЕСТИТЬ втОстаткиВПути
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньгиВПутиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ДеньгиВПутиЗаДень.Организация
	|			И ОстаткиНаДень.Получатель = ДеньгиВПутиЗаДень.Получатель
	|			И ОстаткиНаДень.Отправитель = ДеньгиВПутиЗаДень.Отправитель
	|			И ОстаткиНаДень.ВидПереводаДенежныхСредств = ДеньгиВПутиЗаДень.ВидПеревода
	|			И ОстаткиНаДень.Контрагент = ДеньгиВПутиЗаДень.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ ДеньгиВПутиЗаДень.Валюта ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Получатель КАК Получатель,
	|	ОстаткиНаДень.Отправитель КАК Отправитель,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Контрагент КАК Контрагент,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	-ОстаткиНаДень.СуммаОстаток КАК Сумма,
	|	-ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	-ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньгиВПутиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ДеньгиВПутиЗаДень.Организация
	|			И ОстаткиНаДень.Получатель = ДеньгиВПутиЗаДень.Получатель
	|			И ОстаткиНаДень.Отправитель = ДеньгиВПутиЗаДень.Отправитель
	|			И ОстаткиНаДень.ВидПереводаДенежныхСредств = ДеньгиВПутиЗаДень.ВидПеревода
	|			И ОстаткиНаДень.Контрагент = ДеньгиВПутиЗаДень.Контрагент
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ДеньгиВПутиЗаДень.Валюта ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	//++ НЕ УТ
	
	//++ Локализация
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	СУММА(ОстаткиНаДень.ОстатокВВалюте) КАК ОстатокВВалюте,
	|	СУММА(ОстаткиНаДень.ОстатокРегл) КАК ОстатокРегл,
	|	ОстаткиНаДень.Контрагент КАК Контрагент,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Получатель КАК Получатель,
	|	ОстаткиНаДень.Отправитель КАК Отправитель,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период
	|ПОМЕСТИТЬ втОстаткиНаДеньВПути
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиНаДень.Валюта КАК Валюта,
	|		ОстаткиНаДень.СуммаОстаток КАК ОстатокВВалюте,
	|		ОстаткиНаДень.СуммаРеглОстаток КАК ОстатокРегл,
	|		ОстаткиНаДень.Контрагент КАК Контрагент,
	|		ОстаткиНаДень.Договор КАК Договор,
	|		ОстаткиНаДень.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|		ОстаткиНаДень.Получатель КАК Получатель,
	|		ОстаткиНаДень.Отправитель КАК Отправитель,
	|		ОстаткиНаДень.Организация КАК Организация,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|				&ОстатокНачалоПериода,
	|				Организация = &Организация
	|					И Валюта <> &ВалютаРегламентированногоУчета
	|		) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньгиВПутиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ДеньгиВПутиЗаДень.Организация
	|			И ОстаткиНаДень.Получатель = ДеньгиВПутиЗаДень.Получатель
	|			И ОстаткиНаДень.Отправитель = ДеньгиВПутиЗаДень.Отправитель
	|			И ОстаткиНаДень.ВидПереводаДенежныхСредств = ДеньгиВПутиЗаДень.ВидПеревода
	|			И ОстаткиНаДень.Контрагент = ДеньгиВПутиЗаДень.Контрагент
	|	ГДЕ
	|		ОстаткиНаДень.СуммаОстаток <> 0
	|		И (НЕ ДеньгиВПутиЗаДень.Валюта ЕСТЬ NULL
	|			ИЛИ &КонецПериода = &КонецМесяца
	|			ИЛИ &ПереоценкаПоДням)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДвиженияЗаДень.Валюта КАК Валюта,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.Сумма
	|			ИНАЧЕ -ДвиженияЗаДень.Сумма
	|		КОНЕЦ КАК ОстатокВВалюте,
	|		ВЫБОР КОГДА ДвиженияЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДвиженияЗаДень.СуммаРегл
	|			ИНАЧЕ -ДвиженияЗаДень.СуммаРегл
	|		КОНЕЦ КАК ОстатокРегл,
	|		ДвиженияЗаДень.Контрагент КАК Контрагент,
	|		ДвиженияЗаДень.Договор КАК Договор,
	|		ДвиженияЗаДень.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|		ДвиженияЗаДень.Получатель КАК Получатель,
	|		ДвиженияЗаДень.Отправитель КАК Отправитель,
	|		ДвиженияЗаДень.Организация КАК Организация,
	|		ДвиженияЗаДень.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
	|		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВПути КАК ДвиженияЗаДень
	|	ГДЕ
	|		ДвиженияЗаДень.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ТИПЗНАЧЕНИЯ(ДвиженияЗаДень.Регистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|		И ДвиженияЗаДень.Организация = &Организация
	|		И ДвиженияЗаДень.СуммаРегл <> 0
	|		И ДвиженияЗаДень.Валюта <> &ВалютаРегламентированногоУчета
	|	) КАК ОстаткиНаДень
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНаДень.Валюта,
	|	ОстаткиНаДень.Контрагент,
	|	ОстаткиНаДень.Договор,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Получатель,
	|	ОстаткиНаДень.Отправитель,
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.СтатьяДДС,
	|	ОстаткиНаДень.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	ОстаткиНаДень.ОстатокВВалюте КАК ОстатокВВалюте,
	|	ОстаткиНаДень.ОстатокРегл КАК ОстатокРегл,
	|	ЕСТЬNULL(КурсВалюты.КурсЧислитель, 1) КАК Курс,
	|	ЕСТЬNULL(КурсВалюты.КурсЗнаменатель, 1) КАК Кратность,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО КАК Касса,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.Контрагент КАК Контрагент,
	|	ОстаткиНаДень.Получатель КАК Получатель,
	|	ОстаткиНаДень.Отправитель КАК Отправитель,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.СтатьяДДС КАК СтатьяДДС,
	|	ОстаткиНаДень.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОстаткиНаДень.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)
	|		КОГДА ОстаткиНаДень.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РеализацияИностраннойВалюты)
	|		КОГДА ОстаткиНаДень.Валюта = &ВалютаРегламентированногоУчета
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереводыВПути)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереводыВПутиВал)
	|	КОНЕЦ КАК СчетУчета
	|ПОМЕСТИТЬ РасшифровкаРасчетаДенежныеСредстваВПути
	|ИЗ
	|	втОстаткиНаДеньВПути КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасшифровкаРасчета.СчетУчета КАК СчетУчета,
	|	ВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ВидыСубконто.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВидыСубконтоДенежныеСредстваВПути
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасшифровкаРасчетаДенежныеСредстваВПути КАК РасшифровкаРасчета
	|			ПО РасшифровкаРасчета.СчетУчета = ВидыСубконто.Ссылка
	|;
	|
	//-- Локализация
	
	//-- НЕ УТ
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Получатель КАК Получатель,
	|	Остатки.Отправитель КАК Отправитель,
	|	Остатки.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.Договор КАК Договор,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл < 0
	|		ТОГДА -Остатки.КурсоваяРазницаРегл
	|		ИНАЧЕ Остатки.КурсоваяРазницаРегл
	|	КОНЕЦ КАК КурсоваяРазницаРегл,
	|	0 КАК КурсоваяРазницаУпр,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДСвПути
	|ИЗ
	|	втОстаткиВПути КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Получатель,
	|	Остатки.Отправитель,
	|	Остатки.ВидПереводаДенежныхСредств,
	|	Остатки.Контрагент,
	|	Остатки.Договор,
	|	0,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр < 0
	|		ТОГДА -Остатки.КурсоваяРазницаУпр
	|		ИНАЧЕ Остатки.КурсоваяРазницаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиВПути КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСвПути.Валюта,
	|	ТаблицаДСвПути.ВидДвижения,
	|	ТаблицаДСвПути.Период КАК Период,
	|	ТаблицаДСвПути.Организация,
	|	ТаблицаДСвПути.Получатель,
	|	ТаблицаДСвПути.Отправитель КАК Отправитель,
	|	ТаблицаДСвПути.ВидПереводаДенежныхСредств,
	|	ТаблицаДСвПути.Контрагент,
	|	ТаблицаДСвПути.Договор КАК Договор,
	|	СУММА(ТаблицаДСвПути.КурсоваяРазницаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСвПути.КурсоваяРазницаУпр) КАК СуммаУпр,
	|	ТаблицаДСвПути.ХозяйственнаяОперация,
	|	ТаблицаДСвПути.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСвПути.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваВПути
	|ИЗ
	|	ТаблицаДСвПути КАК ТаблицаДСвПути
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСвПути.Валюта,
	|	ТаблицаДСвПути.Период,
	|	ТаблицаДСвПути.Организация,
	|	ТаблицаДСвПути.Получатель,
	|	ТаблицаДСвПути.Отправитель,
	|	ТаблицаДСвПути.ВидПереводаДенежныхСредств,
	|	ТаблицаДСвПути.Контрагент,
	|	ТаблицаДСвПути.Договор,
	|	ТаблицаДСвПути.ХозяйственнаяОперация,
	|	ТаблицаДСвПути.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСвПути.ВидДвижения,
	|	ТаблицаДСвПути.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыРасчетыПоФинансовымИнструментам()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.Договор КАК Договор,
	|	ОборотыЗаДень.Договор.ХарактерДоговора КАК ХарактерДоговора,
	|	ОборотыЗаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.ТипСуммы КАК ТипСуммы,
	|	ОборотыЗаДень.Регистратор КАК ДокументОплаты,
	|	ОборотыЗаДень.МоментВремени КАК МоментВремени,
	|	СУММА(ВЫБОР КОГДА ОборотыЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА ОборотыЗаДень.Сумма
	|		ИНАЧЕ -ОборотыЗаДень.Сумма
	|	КОНЕЦ) КАК СуммаОборот,
	|	СУММА(ВЫБОР КОГДА ОборотыЗаДень.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА ОборотыЗаДень.СуммаРегл
	|		ИНАЧЕ -ОборотыЗаДень.СуммаРегл
	|	КОНЕЦ) КАК СуммаРеглОборот
	|ПОМЕСТИТЬ ДоговораЗаДеньПоДокументамОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам КАК ОборотыЗаДень
	|ГДЕ
	|	ОборотыЗаДень.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОборотыЗаДень.АналитикаУчетаПоПартнерам.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ОборотыЗаДень.Регистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ТИПЗНАЧЕНИЯ(ОборотыЗаДень.Регистратор) <> ТИП(Документ.НачисленияКредитовИДепозитов)
	|	И ОборотыЗаДень.СуммаРегл <> 0
	|	И (ОборотыЗаДень.Валюта <> &ВалютаУправленческогоУчета
	|		ИЛИ ОборотыЗаДень.Валюта <> &ВалютаРегламентированногоУчета)
	|	И (ОборотыЗаДень.ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
	|	И (ВЫБОР КОГДА ОборотыЗаДень.Договор.ХарактерДоговора = &ХарактерДоговораДепозит
	|				ИЛИ ОборотыЗаДень.Договор.ХарактерДоговора = &ХарактерДоговораЗаймВыданный
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОНЕЦ) = ОборотыЗаДень.ВидДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.Договор,
	|	ОборотыЗаДень.РасчетныйДокумент,
	|	ОборотыЗаДень.Валюта,
	|	ОборотыЗаДень.ТипСуммы,
	|	ОборотыЗаДень.Регистратор,
	|	ОборотыЗаДень.МоментВремени
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.Договор КАК Договор,
	|	ОборотыЗаДень.ТипСуммы КАК ТипСуммы,
	|	СУММА(ОборотыЗаДень.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ОборотыЗаДень.СуммаРеглОборот) КАК СуммаРеглОборот
	|ПОМЕСТИТЬ ДоговораЗаДень
	|ИЗ
	|	ДоговораЗаДеньПоДокументамОплаты КАК ОборотыЗаДень
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.Договор,
	|	ОборотыЗаДень.ТипСуммы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Договор,
	|	ТипСуммы
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ТипСуммы
	|ПОМЕСТИТЬ ЗаключенияДоговоровАренды
	|ГДЕ ЛОЖЬ
	//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Движения.Договор КАК Договор,
	|	Движения.ТипСуммы КАК ТипСуммы
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам КАК Движения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Движения.Регистратор) = ТИП(Документ.ЗаключениеДоговораАренды)
	|	И Движения.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж)
	|	И Движения.Период <= &КонецПериода
	|	И Движения.АналитикаУчетаПоПартнерам.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Договор,
	|	ТипСуммы
	//-- НЕ УТ
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КонецПериода КАК Период,
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	ОстаткиНаДень.СуммаОстаток КАК ОстатокВалюты,
	|	ОстаткиНаДень.СуммаРеглОстаток КАК ОстатокРегл,
	|	ОстаткиНаДень.СуммаУпрОстаток КАК ОстатокУпр,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаОборот, 0) КАК СуммаОборот,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглОборот, 0) КАК СуммаРеглОборот,
	|	ВЫБОР
	|		КОГДА ОстаткиНаДень.Договор.ХарактерДоговора = &ХарактерДоговораАренды
	//++ НЕ УТ
	|				И НЕ ОстаткиНаДень.Договор.УчитыватьПредметыАрендыВРеглУчете
	//-- НЕ УТ 
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаРеглОстаток
	|	КОНЕЦ КАК КурсоваяРазницаРегл,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.Договор.ХарактерДоговора = &ХарактерДоговораАренды
	//++ НЕ УТ 
	|				И НЕ ОстаткиНаДень.Договор.УчитыватьПредметыАрендыВУпрУчете
	//-- НЕ УТ 
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаУпрОстаток
	|	КОНЕЦ КАК КурсоваяРазницаУпр,
	|	КурсВалюты.КурсЧислитель КАК КурсЧислительРегл,
	|	КурсВалюты.КурсЗнаменатель КАК КурсЗнаменательРегл,
	|	КурсВалютыУпр.КурсЧислитель КАК КурсЧислительУпр,
	|	КурсВалютыУпр.КурсЗнаменатель КАК КурсЗнаменательУпр,
	|	ОстаткиНаДень.ТипСуммы КАК ТипСуммы,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОстаткиНаДень.Договор.ХарактерДоговора КАК ХарактерДоговора
	|
	|ПОМЕСТИТЬ втОстаткиСКурсом
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|			И (ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
	|			И (Валюта <> &ВалютаУправленческогоУчета
	|				ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|	ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|		И ОстаткиНаДень.Договор = ДоговораЗаДень.Договор
	|		И ОстаткиНаДень.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЗаключенияДоговоровАренды
	|	ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ЗаключенияДоговоровАренды.АналитикаУчетаПоПартнерам
	|		И ОстаткиНаДень.Договор = ЗаключенияДоговоровАренды.Договор
	|		И ОстаткиНаДень.ТипСуммы = ЗаключенияДоговоровАренды.ТипСуммы
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ ДоговораЗаДень.Договор ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	//++ НЕ УТ
	|	И (ОстаткиНаДень.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж)
	|			И НЕ ЗаключенияДоговоровАренды.Договор ЕСТЬ NULL
	|		ИЛИ ОстаткиНаДень.ТипСуммы <> ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж))
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КонецПериода КАК Период,
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	0 КАК ОстатокВалюты,
	|	ОстаткиНаДень.СуммаРеглОстаток КАК ОстатокРегл,
	|	ОстаткиНаДень.СуммаУпрОстаток КАК ОстатокУпр,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаОборот, 0) КАК СуммаОборот,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглОборот, 0) КАК СуммаРеглОборот,
	|	-ОстаткиНаДень.СуммаРеглОстаток КАК КурсоваяРазницаРегл,
	|	-ОстаткиНаДень.СуммаУпрОстаток КАК КурсоваяРазницаУпр,
	|	КурсВалюты.КурсЧислитель КАК КурсЧислительРегл,
	|	КурсВалюты.КурсЗнаменатель КАК КурсЗнаменательРегл,
	|	КурсВалютыУпр.КурсЧислитель КАК КурсЧислительУпр,
	|	КурсВалютыУпр.КурсЗнаменатель КАК КурсЗнаменательУпр,
	|	ОстаткиНаДень.ТипСуммы КАК ТипСуммы,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОстаткиНаДень.Договор.ХарактерДоговора КАК ХарактерДоговора
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|			И (ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
	|			И (Валюта <> &ВалютаУправленческогоУчета
	|				ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|	ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|		И ОстаткиНаДень.Договор = ДоговораЗаДень.Договор
	|		И ОстаткиНаДень.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|	И (НЕ ДоговораЗаДень.Договор ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.Договор,
	|	ОстаткиНаДень.ТипСуммы
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиНаДень.ОстатокВалюты КАК ОстатокВалюты,
	|	ОстаткиНаДень.ОстатокРегл КАК ОстатокРегл,
	|	ОстаткиНаДень.ОстатокУпр КАК ОстатокУпр,
	|	ОстаткиНаДень.КурсоваяРазницаРегл КАК КурсоваяРазницаРегл,
	|	ОстаткиНаДень.КурсоваяРазницаУпр КАК КурсоваяРазницаУпр,
	|	ОстаткиНаДень.СуммаОборот КАК СуммаОборот,
	|	ОстаткиНаДень.СуммаРеглОборот КАК СуммаРеглОборот,
	|	ОстаткиНаДень.КурсЧислительРегл КАК КурсЧислительРегл,
	|	ОстаткиНаДень.КурсЗнаменательРегл КАК КурсЗнаменательРегл,
	|	ОстаткиНаДень.КурсЧислительУпр КАК КурсЧислительУпр,
	|	ОстаткиНаДень.КурсЗнаменательУпр КАК КурсЗнаменательУпр,
	|	ОстаткиНаДень.ТипСуммы КАК ТипСуммы,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОстаткиНаДень.ХарактерДоговора КАК ХарактерДоговора,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиКредитовДепозитов
	|ИЗ
	|	втОстаткиСКурсом КАК ОстаткиНаДень
	|ГДЕ
	|	(ОстаткиНаДень.КурсоваяРазницаРегл <> 0 ИЛИ ОстаткиНаДень.КурсоваяРазницаУпр <> 0)
	|;
	//++ НЕ УТ

	//++ Локализация
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.Договор КАК Договор,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ЭтоДепозитИлиЗаймПолученный КАК ЭтоДепозитИлиЗаймПолученный,
	|	Остатки.Валюта КАК Валюта,
	|	Остатки.КурсЧислительРегл КАК КурсЧислительРегл,
	|	Остатки.КурсЗнаменательРегл КАК КурсЗнаменательРегл,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	СУММА(Остатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(Остатки.СуммаРеглОстаток) КАК СуммаРеглОстаток,
	|
	|	СУММА(Остатки.СуммаНУОстаток) КАК СуммаНУОстаток,
	|	СУММА(Остатки.ОтложенныйДоходОстаток) КАК ОтложенныйДоходОстаток,
	|	СУММА(Остатки.ОтложенныйРасходОстаток) КАК ОтложенныйРасходОстаток,
	|
	|	ВЫБОР КОГДА Остатки.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм) ТОГДА
	|		ВЫБОР Остатки.ТипСуммы
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиОсновнойДолг)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиКомиссия)
	|		КОНЕЦ// по ТипуСумм
	|	ИНАЧЕ
	|		ВЫБОР Остатки.ТипСуммы
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиОсновнойДолг)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиПроценты)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиКомиссия)
	|				
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ВыкупнаяСтоимость)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупнаяСтоимость)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ВыкупнаяСтоимостьАванс)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупнаяСтоимость)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.АрендныеОбязательства)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательства)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ОбеспечительныйПлатеж)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.УслугаПоАренде)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.УслугаПоАренде)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.УслугаПоАрендеАванс)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.УслугаПоАренде)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.Проценты)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НачислениеПроцентовПоАренде)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.НДС)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НДСПриАренде)
	|		КОНЕЦ// по ТипуСумм
	|	КОНЕЦ КАК ВидСчета,
	|	Остатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета
	|	
	|ПОМЕСТИТЬ втОстаткиСКурсомНУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Остатки.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|		Остатки.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|		Остатки.Договор КАК Договор,
	|		Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|		Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|		Остатки.ХарактерДоговора= &ХарактерДоговораДепозит
	|			ИЛИ Остатки.ХарактерДоговора = &ХарактерДоговораЗаймВыданный КАК ЭтоДепозитИлиЗаймПолученный,
	|		Остатки.Валюта КАК Валюта,
	|		Остатки.КурсЧислительРегл КАК КурсЧислительРегл,
	|		Остатки.КурсЗнаменательРегл КАК КурсЗнаменательРегл,
	|		Остатки.ТипСуммы КАК ТипСуммы,
	|		Остатки.ОстатокВалюты КАК СуммаОстаток,
	|		Остатки.ОстатокРегл КАК СуммаРеглОстаток,
	|
	|		0 КАК СуммаНУОстаток,
	|		0 КАК ОтложенныйДоходОстаток,
	|		0 КАК ОтложенныйРасходОстаток,
	|
	|		Остатки.Договор.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета
	|		
	|	ИЗ
	|		втОстаткиСКурсом КАК Остатки
	|	ГДЕ
	|		&НачалоПериода >= &НачалоВступленияВСилу67ФЗ
	|		И Остатки.ТипСуммы В (&ТипыСуммПереоценкиНУ)
	|		И Остатки.Валюта <> &ВалютаРегламентированногоУчета
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ОстаткиНУ.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		ОстаткиНУ.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|		ОстаткиНУ.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|		ОстаткиНУ.Договор КАК Договор,
	|		ОстаткиНУ.РасчетныйДокумент КАК РасчетныйДокумент,
	|		ОстаткиНУ.Договор.ХарактерДоговора КАК ХарактерДоговора,
	|		ОстаткиНУ.Договор.ХарактерДоговора= &ХарактерДоговораДепозит
	|			ИЛИ ОстаткиНУ.Договор.ХарактерДоговора = &ХарактерДоговораЗаймВыданный КАК ЭтоДепозитИлиЗаймПолученный,
	|		ОстаткиНУ.Валюта КАК Валюта,
	|		КурсВалюты.КурсЧислитель КАК КурсЧислительРегл,
	|		КурсВалюты.КурсЗнаменатель КАК КурсЗнаменательРегл,
	|		ОстаткиНУ.ТипСуммы КАК ТипСуммы,
	|		0 КАК СуммаОстаток,
	|		0 КАК СуммаРеглОстаток,
	|		
	|		ОстаткиНУ.СуммаНУОстаток КАК СуммаНУОстаток,
	|		ОстаткиНУ.ОтложенныйДоходОстаток КАК ОтложенныйДоходОстаток,
	|		ОстаткиНУ.ОтложенныйРасходОстаток КАК ОтложенныйРасходОстаток,
	|   	
	|		ОстаткиНУ.Договор.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментамНУ.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|			И (ТипСуммы В (&ТипыСуммПереоценкиНУ) ИЛИ &ПоВсемТипамСумм)
	|			И Валюта <> &ВалютаРегламентированногоУчета
	|		) КАК ОстаткиНУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|		ПО ОстаткиНУ.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНУ.Договор = ДоговораЗаДень.Договор
	|			И ОстаткиНУ.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|			ПО ОстаткиНУ.Валюта = КурсВалюты.Валюта
	|	ГДЕ
	|		&НачалоПериода >= &НачалоВступленияВСилу67ФЗ
	|		И (НЕ ДоговораЗаДень.Договор ЕСТЬ NULL
	|			ИЛИ &КонецПериода = &КонецМесяца
	|			ИЛИ &ПереоценкаПоДням)
	|) Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Организация,
	|	Остатки.Контрагент,
	|	Остатки.Договор,
	|	Остатки.РасчетныйДокумент,
	|	Остатки.ХарактерДоговора,
	|	Остатки.ЭтоДепозитИлиЗаймПолученный,
	|	Остатки.Валюта,
	|	Остатки.КурсЧислительРегл,
	|	Остатки.КурсЗнаменательРегл,
	|	Остатки.ТипСуммы,
	|	Остатки.ГруппаФинансовогоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Договор,
	|	ТипСуммы
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиСКурсом.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиСКурсом.Организация КАК Организация,
	|	ОстаткиСКурсом.Контрагент КАК Контрагент,
	|	ОстаткиСКурсом.Договор КАК Договор,
	|	ОстаткиСКурсом.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОстаткиСКурсом.ХарактерДоговора КАК ХарактерДоговора,
	|	ОстаткиСКурсом.ЭтоДепозитИлиЗаймПолученный КАК ЭтоДепозитИлиЗаймПолученный,
	|	ОстаткиСКурсом.Валюта КАК Валюта,
	|	ОстаткиСКурсом.КурсЧислительРегл КАК КурсЧислительРегл,
	|	ОстаткиСКурсом.КурсЗнаменательРегл КАК КурсЗнаменательРегл,
	|	ОстаткиСКурсом.ТипСуммы КАК ТипСуммы,
	|	ОстаткиСКурсом.СуммаОстаток КАК СуммаОстаток,
	|	ОстаткиСКурсом.СуммаРеглОстаток КАК СуммаРеглОстаток,
	|	
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаОборот, 0) КАК СуммаОборот,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглОборот, 0) КАК СуммаРеглОборот,
	|	
	|	ОстаткиСКурсом.СуммаНУОстаток КАК СуммаНУОстаток,
	|	ОстаткиСКурсом.ОтложенныйДоходОстаток КАК ОтложенныйДоходОстаток,
	|	ОстаткиСКурсом.ОтложенныйРасходОстаток КАК ОтложенныйРасходОстаток,
	|
	|	ОстаткиСКурсом.ВидСчета КАК ВидСчета,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета,
	|		ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, НЕОПРЕДЕЛЕНО)) КАК СчетУчета,
	|	ОстаткиСКурсом.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета
	|	
	|ПОМЕСТИТЬ втКРасчетуНУ
	|ИЗ
	|	втОстаткиСКурсомНУ ОстаткиСКурсом
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|	ПО ОстаткиСКурсом.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|		И ОстаткиСКурсом.Договор = ДоговораЗаДень.Договор
	|		И ОстаткиСКурсом.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО НастройкиПоОрганизации.ВидСчета = ОстаткиСКурсом.ВидСчета
	|			И НастройкиПоОрганизации.Организация = ОстаткиСКурсом.Организация
	|			И НастройкиПоОрганизации.АналитикаУчета = ОстаткиСКурсом.ГруппаФинансовогоУчета
	|			И НЕ НастройкиПоОрганизации.Долгосрочный
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО НастройкиПоАналитике.ВидСчета = ОстаткиСКурсом.ВидСчета
	|			И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НастройкиПоАналитике.АналитикаУчета = ОстаткиСКурсом.ГруппаФинансовогоУчета
	|			И НЕ НастройкиПоАналитике.Долгосрочный
	|;
	//-- Локализация

	//-- НЕ УТ
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл < 0
	|		ТОГДА -Остатки.КурсоваяРазницаРегл
	|		ИНАЧЕ Остатки.КурсоваяРазницаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.КурсоваяРазницаРегл КАК КурсоваяРазницаРеглРег,
	|	0 КАК КурсоваяРазницаУпрРег,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.Договор КАК Договор,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаКредитовДепозитов
	|ИЗ
	|	втОстаткиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаРегл <> 0
	//++ НЕ УТ
	|	И НЕ Остатки.ТипСуммы В (&ОбратноеОтражениеРасходов)
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	0 КАК СуммаРегл,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр < 0
	|		ТОГДА -Остатки.КурсоваяРазницаУпр
	|		ИНАЧЕ Остатки.КурсоваяРазницаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	0 КАК КурсоваяРазницаРеглРег,
	|	Остатки.КурсоваяРазницаУпр КАК КурсоваяРазницаУпрРег,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.Договор КАК Договор,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.КурсоваяРазницаУпр <> 0
	//++ НЕ УТ
	|	И НЕ Остатки.ТипСуммы В (&ОбратноеОтражениеРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаРегл > 0
	|		ТОГДА -Остатки.КурсоваяРазницаРегл
	|		ИНАЧЕ Остатки.КурсоваяРазницаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.КурсоваяРазницаРегл КАК КурсоваяРазницаРеглРег,
	|	0 КАК КурсоваяРазницаУпрРег,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.Договор КАК Договор,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	втОстаткиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.ТипСуммы В (&ОбратноеОтражениеРасходов)
	|	И Остатки.КурсоваяРазницаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	0 КАК СуммаРегл,
	|	ВЫБОР КОГДА Остатки.КурсоваяРазницаУпр > 0
	|		ТОГДА -Остатки.КурсоваяРазницаУпр
	|		ИНАЧЕ Остатки.КурсоваяРазницаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	0 КАК КурсоваяРазницаРеглРег,
	|	Остатки.КурсоваяРазницаУпр КАК КурсоваяРазницаУпрРег,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.Договор КАК Договор,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.ТипСуммы В (&ОбратноеОтражениеРасходов)
	|	И Остатки.КурсоваяРазницаУпр <> 0
	//-- НЕ УТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКредитовДепозитов.Валюта КАК Валюта,
	|	ТаблицаКредитовДепозитов.Период КАК Период,
	|	ТаблицаКредитовДепозитов.ВидДвижения КАК ВидДвижения,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ТаблицаКредитовДепозитов.КурсоваяРазницаРеглРег) КАК СуммаРеглРег,
	|	СУММА(ТаблицаКредитовДепозитов.КурсоваяРазницаУпрРег) КАК СуммаУпрРег,
	|	ТаблицаКредитовДепозитов.ТипСуммы КАК ТипСуммы,
	|	ТаблицаКредитовДепозитов.Договор КАК Договор,
	|	ТаблицаКредитовДепозитов.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКредитовДепозитов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТаблицаКредитовДепозитов.ХарактерДоговора КАК ХарактерДоговора,
	|	ТаблицаКредитовДепозитов.ХозяйственнаяОперация,
	|	ТаблицаКредитовДепозитов.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыРасчетыПоФинансовымИнструментам
	|ИЗ
	|	ТаблицаКредитовДепозитов КАК ТаблицаКредитовДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаКредитовДепозитов.Валюта,
	|	ТаблицаКредитовДепозитов.Период,
	|	ТаблицаКредитовДепозитов.АналитикаУчетаПоПартнерам,
	|	ТаблицаКредитовДепозитов.РасчетныйДокумент,
	|	ТаблицаКредитовДепозитов.Договор,
	|	ТаблицаКредитовДепозитов.ХарактерДоговора,
	|	ТаблицаКредитовДепозитов.ТипСуммы,
	|	ТаблицаКредитовДепозитов.ХозяйственнаяОперация,
	|	ТаблицаКредитовДепозитов.ВидДвижения,
	|	ТаблицаКредитовДепозитов.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

//++ НЕ УТ
Функция ТекстЗапросаКурсовыеРазницыРезервыПоСомнительнымДолгам()
	
	// переоцениваем только валюту упр.
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам КАК КлючАналитики,
	|	ОборотыЗаДень.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОборотыЗаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОборотыЗаДень.ТипСуммы КАК ТипСуммы
	|ПОМЕСТИТЬ АналитикаДня
	|ИЗ
	|	РегистрНакопления.РезервыПоСомнительнымДолгам.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета) И Валюта <> &ВалютаУправленческогоУчета
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.Валюта КАК Валюта,
	|	Остатки.СуммаОстаток КАК СуммаВВалюте,
	|	Остатки.СуммаРеглОстаток КАК СуммаРегл,
	|	Остатки.СуммаУпрОстаток КАК СуммаУпр,
	|	ЕСТЬNULL(
	|		ОбъектыРасчетов.Договор.ВариантКурсаДоговора, 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора
	|ПОМЕСТИТЬ втОстаткиНаДень
	|ИЗ
	|	РегистрНакопления.РезервыПоСомнительнымДолгам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета) И Валюта <> &ВалютаУправленческогоУчета
	|	) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО Остатки.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.СуммаВВалюте КАК ОстатокВалюты,
	|	0 КАК СуммаРегл,
	|	ОстаткиНаДень.СуммаУпр КАК СуммаУпр,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалюты.КурсЧислитель,1)
	|	КОНЕЦ                                                                       КАК КурсЧислительРегл,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалюты.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                       КАК КурсЗнаменательРегл,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.Валюта = &ВалютаУправленческогоУчета
	|			И ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалютыУпр.КурсЧислитель,1)
	|	КОНЕЦ                                                                       КАК КурсЧислительУпр,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.Валюта = &ВалютаУправленческогоУчета
	|			И ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалютыУпр.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                       КАК КурсЗнаменательУпр,
	|	ОстаткиНаДень.ТипСуммы КАК ТипСуммы,
	|	ОстаткиНаДень.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиРезервовСКурсами
	|ИЗ
	|	втОстаткиНаДень КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикаДня
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиНаДень.ОбъектРасчетов = АналитикаДня.ОбъектРасчетов
	|			И ОстаткиНаДень.РасчетныйДокумент = АналитикаДня.РасчетныйДокумент
	|			И ОстаткиНаДень.ТипСуммы = АналитикаДня.ТипСуммы
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыДоговоров КАК КурсДоговора
	|			ПО ОбъектыРасчетов.Договор = КурсДоговора.Договор
	|		ПО ОстаткиНаДень.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|ГДЕ
	|	ОстаткиНаДень.СуммаВВалюте <> 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ОстаткиНаДень.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстаткиРезервовСКурсами.Валюта КАК Валюта,
	|	втОстаткиРезервовСКурсами.Период КАК Период,
	|	втОстаткиРезервовСКурсами.ОстатокВалюты КАК ОстатокВалюты,
	|	втОстаткиРезервовСКурсами.СуммаРегл КАК СуммаРегл,
	|	ВЫРАЗИТЬ(втОстаткиРезервовСКурсами.ОстатокВалюты 
	|			* втОстаткиРезервовСКурсами.КурсЧислительРегл 
	|			/ втОстаткиРезервовСКурсами.КурсЗнаменательРегл 
	|			* втОстаткиРезервовСКурсами.КурсЗнаменательУпр 
	|			/ втОстаткиРезервовСКурсами.КурсЧислительУпр 
	|		КАК ЧИСЛО(31,2)) - втОстаткиРезервовСКурсами.СуммаУпр КАК СуммаУпр,
	|	втОстаткиРезервовСКурсами.ТипСуммы КАК ТипСуммы,
	|	втОстаткиРезервовСКурсами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	втОстаткиРезервовСКурсами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	втОстаткиРезервовСКурсами.РасчетныйДокумент КАК РасчетныйДокумент,
	|	втОстаткиРезервовСКурсами.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	втОстаткиРезервовСКурсами.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиРезервов
	|ИЗ
	|	втОстаткиРезервовСКурсами
	|ГДЕ
	|	ВЫРАЗИТЬ(втОстаткиРезервовСКурсами.ОстатокВалюты 
	|			* втОстаткиРезервовСКурсами.КурсЧислительРегл 
	|			/ втОстаткиРезервовСКурсами.КурсЗнаменательРегл 
	|			* втОстаткиРезервовСКурсами.КурсЗнаменательУпр 
	|			/ втОстаткиРезервовСКурсами.КурсЧислительУпр 
	|		КАК ЧИСЛО(31,2)) <> втОстаткиРезервовСКурсами.СуммаУпр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	0,
	|	0,
	|	-ОстаткиНаДень.СуммаУпр,
	|	ОстаткиНаДень.ТипСуммы,
	|	ОстаткиНаДень.ОбъектРасчетов,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент,
	|	&ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиНаДень КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикаДня
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиНаДень.ОбъектРасчетов = АналитикаДня.ОбъектРасчетов
	|			И ОстаткиНаДень.РасчетныйДокумент = АналитикаДня.РасчетныйДокумент
	|			И ОстаткиНаДень.ТипСуммы = АналитикаДня.ТипСуммы
	|ГДЕ
	|	ОстаткиНаДень.СуммаВВалюте = 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ОстаткиНаДень.СуммаУпр <> 0
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	0 КАК СуммаРегл,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	0 КАК СуммаРеглРег,
	|	Остатки.СуммаУпр КАК СуммаУпрРег,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРезервовПоДолгам
	|ИЗ
	|	втОстаткиРезервов КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезервовПоДолгам.Валюта,
	|	ТаблицаРезервовПоДолгам.Период КАК Период,
	|	ТаблицаРезервовПоДолгам.ВидДвижения КАК ВидДвижения,
	|	СУММА(ТаблицаРезервовПоДолгам.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаРезервовПоДолгам.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ТаблицаРезервовПоДолгам.СуммаРеглРег) КАК СуммаРеглРег,
	|	СУММА(ТаблицаРезервовПоДолгам.СуммаУпрРег) КАК СуммаУпрРег,
	|	ТаблицаРезервовПоДолгам.ТипСуммы КАК ТипСуммы,
	|	ТаблицаРезервовПоДолгам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТаблицаРезервовПоДолгам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаРезервовПоДолгам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТаблицаРезервовПоДолгам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаРезервовПоДолгам.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыРезервыПоСомнительнымДолгам
	|ИЗ
	|	ТаблицаРезервовПоДолгам КАК ТаблицаРезервовПоДолгам
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРезервовПоДолгам.Валюта,
	|	ТаблицаРезервовПоДолгам.Период,
	|	ТаблицаРезервовПоДолгам.АналитикаУчетаПоПартнерам,
	|	ТаблицаРезервовПоДолгам.ОбъектРасчетов,
	|	ТаблицаРезервовПоДолгам.РасчетныйДокумент,
	|	ТаблицаРезервовПоДолгам.ТипСуммы,
	|	ТаблицаРезервовПоДолгам.ХозяйственнаяОперация,
	|	ТаблицаРезервовПоДолгам.ВидДвижения,
	|	ТаблицаРезервовПоДолгам.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

//-- НЕ УТ
Функция ТекстЗапросаКурсовыеРазницыПроцентныеРасходыДисконтирования()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОборотыЗаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОборотыЗаДень.Валюта КАК Валюта
	|ПОМЕСТИТЬ ОборотыЗаДень
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			(Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	РасчетныйДокумент
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	ОстаткиНаДень.СуммаДисконтированияОстаток КАК СуммаДисконтированияОстаток,
	|	ОстаткиНаДень.СуммаДисконтированияРеглОстаток КАК СуммаДисконтированияРеглОстаток,
	|	ОстаткиНаДень.СуммаДисконтированияУпрОстаток КАК СуммаДисконтированияУпрОстаток,
	|	ОстаткиНаДень.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЕСТЬNULL(
	|		ОбъектыРасчетов.Договор.ВариантКурсаДоговора, 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора
	|
	|ПОМЕСТИТЬ втОстаткиНаДень
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Остатки(
	|		&ГраницаКонецПериода,
	|		АналитикаУчетаПоПартнерам.Организация = &Организация
	|		И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ОстаткиНаДень.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.СуммаДисконтированияОстаток КАК ОстатокВалюты,
	|	ОстаткиНаДень.СуммаДисконтированияРеглОстаток КАК ОстатокРегл,
	|	ОстаткиНаДень.СуммаДисконтированияУпрОстаток КАК ОстатокУпр,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалюты.КурсЧислитель,1)
	|	КОНЕЦ                                                                       КАК КурсЧислительРегл,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалюты.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                       КАК КурсЗнаменательРегл,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.Валюта = &ВалютаУправленческогоУчета
	|			И ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалютыУпр.КурсЧислитель,1)
	|	КОНЕЦ                                                                       КАК КурсЧислительУпр,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.Валюта = &ВалютаУправленческогоУчета
	|			И ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалютыУпр.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                       КАК КурсЗнаменательУпр,
	|	ОстаткиНаДень.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиСуммДисконтированияСКурсами
	|ИЗ
	|	втОстаткиНаДень КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОборотыЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ОборотыЗаДень.АналитикаУчетаПоПартнерам
	|		И ОстаткиНаДень.ОбъектРасчетов = ОборотыЗаДень.ОбъектРасчетов
	|		И ОстаткиНаДень.РасчетныйДокумент = ОборотыЗаДень.РасчетныйДокумент
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|			ЛЕВОЕ СОЕДИНЕНИЕ втКурсыДоговоров КАК КурсДоговора
	|				ПО ОбъектыРасчетов.Договор = КурсДоговора.Договор
	|		ПО ОстаткиНаДень.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|ГДЕ
	|	ОстаткиНаДень.СуммаДисконтированияОстаток <> 0
	|	И (НЕ ОборотыЗаДень.ОбъектРасчетов ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ОстаткиНаДень.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстаткиСуммДисконтированияСКурсами.Валюта КАК Валюта,
	|	втОстаткиСуммДисконтированияСКурсами.Период КАК Период,
	|	втОстаткиСуммДисконтированияСКурсами.ОстатокВалюты КАК ОстатокВалюты,
	|	ВЫРАЗИТЬ(втОстаткиСуммДисконтированияСКурсами.ОстатокВалюты 
	|		* втОстаткиСуммДисконтированияСКурсами.КурсЧислительРегл / втОстаткиСуммДисконтированияСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) 
	|		- втОстаткиСуммДисконтированияСКурсами.ОстатокРегл КАК СуммаРегл,
	|	ВЫРАЗИТЬ(втОстаткиСуммДисконтированияСКурсами.ОстатокВалюты 
	|		* втОстаткиСуммДисконтированияСКурсами.КурсЧислительРегл / втОстаткиСуммДисконтированияСКурсами.КурсЗнаменательРегл 
	|			* втОстаткиСуммДисконтированияСКурсами.КурсЗнаменательУпр / втОстаткиСуммДисконтированияСКурсами.КурсЧислительУпр КАК ЧИСЛО(31,2)) 
	|		- втОстаткиСуммДисконтированияСКурсами.ОстатокУпр КАК СуммаУпр,
	|	втОстаткиСуммДисконтированияСКурсами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	втОстаткиСуммДисконтированияСКурсами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	втОстаткиСуммДисконтированияСКурсами.РасчетныйДокумент КАК РасчетныйДокумент,
	|	втОстаткиСуммДисконтированияСКурсами.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	втОстаткиСуммДисконтированияСКурсами.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиСуммДисконтирования
	|ИЗ
	|	втОстаткиСуммДисконтированияСКурсами КАК втОстаткиСуммДисконтированияСКурсами
	|ГДЕ
	|	ВЫРАЗИТЬ(втОстаткиСуммДисконтированияСКурсами.ОстатокВалюты 
	|		* втОстаткиСуммДисконтированияСКурсами.КурсЧислительРегл / втОстаткиСуммДисконтированияСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) <> втОстаткиСуммДисконтированияСКурсами.ОстатокРегл
	|	ИЛИ ВЫРАЗИТЬ(втОстаткиСуммДисконтированияСКурсами.ОстатокВалюты 
	|		* втОстаткиСуммДисконтированияСКурсами.КурсЧислительРегл / втОстаткиСуммДисконтированияСКурсами.КурсЗнаменательРегл 
	|			* втОстаткиСуммДисконтированияСКурсами.КурсЗнаменательУпр / втОстаткиСуммДисконтированияСКурсами.КурсЧислительУпр КАК ЧИСЛО(31,2)) <> втОстаткиСуммДисконтированияСКурсами.ОстатокУпр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	0,
	|	-ОстаткиНаДень.СуммаДисконтированияРеглОстаток,
	|	-ОстаткиНаДень.СуммаДисконтированияУпрОстаток,
	|	ОстаткиНаДень.ОбъектРасчетов,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент,
	|	&ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ОборотыЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНаДень.ОбъектРасчетов = ОборотыЗаДень.ОбъектРасчетов
	|			И ОстаткиНаДень.РасчетныйДокумент = ОборотыЗаДень.РасчетныйДокумент
	|ГДЕ
	|	ОстаткиНаДень.СуммаДисконтированияОстаток = 0
	|	И (НЕ ОборотыЗаДень.ОбъектРасчетов ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаДисконтированияРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаДисконтированияУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.СуммаРегл КАК СуммаРеглРег,
	|	0 КАК СуммаУпрРег,
	|	Остатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаДисконтирования
	|ИЗ
	|	втОстаткиСуммДисконтирования КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	&КонецПериода,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	0,
	|	Остатки.СуммаУпр КАК СуммаУпрРег,
	|	Остатки.ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиСуммДисконтирования КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДисконтирования.Валюта,
	|	ТаблицаДисконтирования.Период КАК Период,
	|	ТаблицаДисконтирования.ВидДвижения,
	|	СУММА(ТаблицаДисконтирования.СуммаРегл) КАК СуммаДисконтированияРегл,
	|	СУММА(ТаблицаДисконтирования.СуммаУпр) КАК СуммаДисконтированияУпр,
	|	СУММА(ТаблицаДисконтирования.СуммаРеглРег) КАК СуммаРеглРегистра,
	|	СУММА(ТаблицаДисконтирования.СуммаУпрРег) КАК СуммаУпрРегистра,
	|	ТаблицаДисконтирования.ОбъектРасчетов,
	|	ТаблицаДисконтирования.АналитикаУчетаПоПартнерам,
	|	ТаблицаДисконтирования.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТаблицаДисконтирования.ХозяйственнаяОперация,
	|	ТаблицаДисконтирования.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыПроцентныеРасходыДисконтирования
	|ИЗ
	|	ТаблицаДисконтирования КАК ТаблицаДисконтирования
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДисконтирования.Валюта,
	|	ТаблицаДисконтирования.Период,
	|	ТаблицаДисконтирования.АналитикаУчетаПоПартнерам,
	|	ТаблицаДисконтирования.ОбъектРасчетов,
	|	ТаблицаДисконтирования.РасчетныйДокумент,
	|	ТаблицаДисконтирования.ХозяйственнаяОперация,
	|	ТаблицаДисконтирования.ВидДвижения,
	|	ТаблицаДисконтирования.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыТоварыКОформлениюОтчетовКомитенту()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаНоменклатуры КАК КлючАналитики,
	|	Расчеты.ВидЗапасов КАК ВидЗапасов,
	|	Расчеты.НомерГТД КАК НомерГТД,
	|	Расчеты.ДокументПродажи КАК ДокументПродажи
	|ПОМЕСТИТЬ втАналитикаЗаДеньТоварыКОформлению
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК Расчеты
	|ГДЕ
	|	Расчеты.Организация = &Организация
	|	И Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.СуммаВыручки <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.Организация КАК Организация,
	|	ОстаткиДня.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиДня.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиДня.НомерГТД КАК НомерГТД,
	|	ОстаткиДня.ДокументПродажи КАК ДокументПродажи,
	|	ВидыЗапасов.Договор КАК Договор,
	|	ЕСТЬNULL(Договоры.ВариантКурсаДоговора, НЕОПРЕДЕЛЕНО) КАК ВариантКурсаДоговора,
	|	ОстаткиДня.СуммаВыручкиОстаток КАК СуммаВыручки,
	|	ОстаткиДня.СуммаВыручкиРеглОстаток КАК СуммаВыручкиРегл,
	|	ОстаткиДня.СуммаВыручкиУпрОстаток КАК СуммаВыручкиУпр
	|ПОМЕСТИТЬ втОстаткиНаКонецДняТоварыКОформлению
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация В (&Организация)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ОстаткиДня.ВидЗапасов = ВидыЗапасов.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ВидыЗапасов.Договор = Договоры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДеньТоварыКОформлению КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаНоменклатуры = АналитикаДня.КлючАналитики
	|		И ОстаткиДня.ВидЗапасов = АналитикаДня.ВидЗапасов
	|		И ОстаткиДня.НомерГТД = АналитикаДня.НомерГТД
	|		И ОстаткиДня.ДокументПродажи = АналитикаДня.ДокументПродажи
	|ГДЕ
	|	ОстаткиДня.СуммаВыручкиОстаток <> 0
	|	И ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.Организация КАК Организация,
	|	ОстаткиДня.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиДня.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиДня.НомерГТД КАК НомерГТД,
	|	ОстаткиДня.ДокументПродажи КАК ДокументПродажи,
	|	ВидыЗапасов.Договор КАК Договор,
	|	ЕСТЬNULL(Договоры.ВариантКурсаДоговора, НЕОПРЕДЕЛЕНО) КАК ВариантКурсаДоговора,
	|	ОстаткиДня.СуммаВыручкиОстаток КАК СуммаВыручки,
	|	ОстаткиДня.СуммаВыручкиРеглОстаток КАК СуммаВыручкиРегл,
	|	ОстаткиДня.СуммаВыручкиУпрОстаток КАК СуммаВыручкиУпр
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация В (&Организация)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ОстаткиДня.ВидЗапасов = ВидыЗапасов.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ВидыЗапасов.Договор = Договоры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДеньТоварыКОформлению КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаНоменклатуры = АналитикаДня.КлючАналитики
	|		И ОстаткиДня.ВидЗапасов = АналитикаДня.ВидЗапасов
	|		И ОстаткиДня.НомерГТД = АналитикаДня.НомерГТД
	|		И ОстаткиДня.ДокументПродажи = АналитикаДня.ДокументПродажи
	|ГДЕ
	|	ОстаткиДня.СуммаВыручкиОстаток = 0
	|	И ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)
	|	И (ОстаткиДня.СуммаВыручкиРеглОстаток <> 0 ИЛИ ОстаткиДня.СуммаВыручкиУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов КАК ВидЗапасов,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	ВЫБОР КОГДА Остатки.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|			ТОГДА ВЫРАЗИТЬ(Остатки.СуммаВыручки * КурсыВалютПоДоговорам.КурсЧислитель / КурсыВалютПоДоговорам.КурсЗнаменатель КАК ЧИСЛО(31,2)) - Остатки.СуммаВыручкиРегл
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(Остатки.СуммаВыручки * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - Остатки.СуммаВыручкиРегл
	|	КОНЕЦ КАК СуммаВыручкиРегл,
	|	ВЫБОР КОГДА Остатки.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|					И Остатки.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА (ВЫРАЗИТЬ(Остатки.СуммаВыручки * КурсыВалютПоДоговорам.КурсЧислитель / КурсыВалютПоДоговорам.КурсЗнаменатель КАК ЧИСЛО(31,2))) - Остатки.СуммаВыручкиУпр
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(Остатки.СуммаВыручки * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - Остатки.СуммаВыручкиУпр
	|	КОНЕЦ КАК СуммаВыручкиУпр
	|ПОМЕСТИТЬ втНеРеализованныеКРТоварыКОформлению
	|ИЗ
	|	втОстаткиНаКонецДняТоварыКОформлению КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыДоговоров КАК КурсыВалютПоДоговорам
	|			ПО Остатки.Договор = КурсыВалютПоДоговорам.Договор
	|ГДЕ
	|	Остатки.СуммаВыручки <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов КАК ВидЗапасов,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА -Остатки.СуммаВыручкиРегл
	|		ИНАЧЕ Остатки.СуммаВыручкиРегл
	|	КОНЕЦ КАК СуммаВыручкиРегл,
	|	0 КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаРасчетовТоварыКОформлению
	|ИЗ
	|	втОстаткиНаКонецДняТоварыКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручки = 0 И Остатки.СуммаВыручкиРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов КАК ВидЗапасов,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	0 КАК СуммаВыручкиРегл,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА -Остатки.СуммаВыручкиУпр
	|		ИНАЧЕ Остатки.СуммаВыручкиУпр
	|	КОНЕЦ КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиНаКонецДняТоварыКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручки = 0 И Остатки.СуммаВыручкиУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.СуммаВыручкиРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов КАК ВидЗапасов,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА -Остатки.СуммаВыручкиРегл
	|		ИНАЧЕ Остатки.СуммаВыручкиРегл
	|	КОНЕЦ КАК СуммаВыручкиРегл,
	|	0 КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втНеРеализованныеКРТоварыКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручкиРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов КАК ВидЗапасов,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	0 КАК СуммаВыручкиРегл,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА -Остатки.СуммаВыручкиУпр
	|		ИНАЧЕ Остатки.СуммаВыручкиУпр
	|	КОНЕЦ КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втНеРеализованныеКРТоварыКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручкиУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.Организация КАК Организация,
	|	ТаблицаРасчетов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаРасчетов.ВидЗапасов КАК ВидЗапасов,
	|	ТаблицаРасчетов.НомерГТД КАК НомерГТД,
	|	ТаблицаРасчетов.ДокументПродажи КАК ДокументПродажи,
	|	СУММА(ТаблицаРасчетов.СуммаВыручкиРегл) КАК СуммаВыручкиРегл,
	|	СУММА(ТаблицаРасчетов.СуммаВыручкиУпр) КАК СуммаВыручкиУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	| 	ТаблицаРасчетов.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыТоварыКОформлениюОтчетовКомитенту
	|ИЗ
	|	ТаблицаРасчетовТоварыКОформлению КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.Организация,
	|	ТаблицаРасчетов.АналитикаУчетаНоменклатуры,
	|	ТаблицаРасчетов.ВидЗапасов,
	|	ТаблицаРасчетов.НомерГТД,
	|	ТаблицаРасчетов.ДокументПродажи,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	| 	ТаблицаРасчетов.НастройкаХозяйственнойОперации"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Номенклатура КАК Номенклатура,
	|	Расчеты.Характеристика КАК Характеристика,
	|	Расчеты.ДокументПриобретения КАК ДокументПриобретения,
	|	Расчеты.Назначение КАК Назначение,
	|	Расчеты.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ втАналитикаЗаДеньТоварыКОформлениюЗакупки
	|ИЗ
	|	РегистрНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках КАК Расчеты
	|ГДЕ
	|	Расчеты.Организация = &Организация
	|	И Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.СуммаСНДС <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.Организация КАК Организация,
	|	ОстаткиДня.Номенклатура КАК Номенклатура,
	|	ОстаткиДня.Характеристика КАК Характеристика,
	|	ОстаткиДня.ДокументПриобретения КАК ДокументПриобретения,
	|	ОстаткиДня.Назначение КАК Назначение,
	|	ОстаткиДня.НомерГТД КАК НомерГТД,
	|	Назначения.Договор КАК Договор,
	|	ЕСТЬNULL(Договоры.ВариантКурсаДоговора, НЕОПРЕДЕЛЕНО) КАК ВариантКурсаДоговора,
	|	ОстаткиДня.СуммаСНДСОстаток КАК СуммаСНДС,
	|	ОстаткиДня.СуммаРеглОстаток КАК СуммаРегл,
	|	ОстаткиДня.СуммаУпрОстаток КАК СуммаУпр
	|ПОМЕСТИТЬ втОстаткиНаКонецДняТоварыКОформлениюЗакупки
	|ИЗ
	|	РегистрНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация В (&Организация)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ОстаткиДня.Назначение = Назначения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Назначения.Договор = Договоры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДеньТоварыКОформлениюЗакупки КАК АналитикаДня
	|		ПО ОстаткиДня.Номенклатура = АналитикаДня.Номенклатура
	|		И ОстаткиДня.Характеристика = АналитикаДня.Характеристика
	|		И ОстаткиДня.ДокументПриобретения = АналитикаДня.ДокументПриобретения
	|		И ОстаткиДня.НомерГТД = АналитикаДня.НомерГТД
	|		И ОстаткиДня.Назначение = АналитикаДня.Назначение
	|ГДЕ
	|	ОстаткиДня.СуммаСНДСОстаток <> 0
	|	И ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)
	|	И (НЕ АналитикаДня.Номенклатура ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.Организация КАК Организация,
	|	ОстаткиДня.Номенклатура КАК Номенклатура,
	|	ОстаткиДня.Характеристика КАК Характеристика,
	|	ОстаткиДня.ДокументПриобретения КАК ДокументПриобретения,
	|	ОстаткиДня.Назначение КАК Назначение,
	|	ОстаткиДня.НомерГТД КАК НомерГТД,
	|	Назначения.Договор КАК Договор,
	|	ЕСТЬNULL(Договоры.ВариантКурсаДоговора, НЕОПРЕДЕЛЕНО) КАК ВариантКурсаДоговора,
	|	ОстаткиДня.СуммаСНДСОстаток КАК СуммаСНДС,
	|	ОстаткиДня.СуммаРеглОстаток КАК СуммаРегл,
	|	ОстаткиДня.СуммаУпрОстаток КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация В (&Организация)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ОстаткиДня.Назначение = Назначения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Назначения.Договор = Договоры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДеньТоварыКОформлениюЗакупки КАК АналитикаДня
	|		ПО ОстаткиДня.Номенклатура = АналитикаДня.Номенклатура
	|		И ОстаткиДня.Характеристика = АналитикаДня.Характеристика
	|		И ОстаткиДня.ДокументПриобретения = АналитикаДня.ДокументПриобретения
	|		И ОстаткиДня.НомерГТД = АналитикаДня.НомерГТД
	|		И ОстаткиДня.Назначение = АналитикаДня.Назначение
	|ГДЕ
	|	ОстаткиДня.СуммаСНДСОстаток = 0
	|	И ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)
	|	И (ОстаткиДня.СуммаРеглОстаток <> 0 ИЛИ ОстаткиДня.СуммаУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.Номенклатура ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.ДокументПриобретения КАК ДокументПриобретения,
	|	Остатки.Назначение КАК Назначение,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	ВЫБОР КОГДА Остатки.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|			ТОГДА ВЫРАЗИТЬ(Остатки.СуммаСНДС * КурсыВалютПоДоговорам.КурсЧислитель / КурсыВалютПоДоговорам.КурсЗнаменатель КАК ЧИСЛО(31,2)) - Остатки.СуммаРегл
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(Остатки.СуммаСНДС * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР КОГДА Остатки.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|					И Остатки.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА (ВЫРАЗИТЬ(Остатки.СуммаСНДС * КурсыВалютПоДоговорам.КурсЧислитель / КурсыВалютПоДоговорам.КурсЗнаменатель КАК ЧИСЛО(31,2))) - Остатки.СуммаУпр
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(Остатки.СуммаСНДС * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - Остатки.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр
	|ПОМЕСТИТЬ втНеРеализованныеКРТоварыКОформлениюЗакупки
	|ИЗ
	|	втОстаткиНаКонецДняТоварыКОформлениюЗакупки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыДоговоров КАК КурсыВалютПоДоговорам
	|			ПО Остатки.Договор = КурсыВалютПоДоговорам.Договор
	|ГДЕ
	|	Остатки.СуммаСНДС <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.ДокументПриобретения КАК ДокументПриобретения,
	|	Остатки.Назначение КАК Назначение,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаРасчетовТоварыКОформлениюЗакупки
	|ИЗ
	|	втОстаткиНаКонецДняТоварыКОформлениюЗакупки КАК Остатки
	|ГДЕ
	|	Остатки.СуммаСНДС = 0 И Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.ДокументПриобретения КАК ДокументПриобретения,
	|	Остатки.Назначение КАК Назначение,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	0 КАК СуммаВыручкиРегл,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиНаКонецДняТоварыКОформлениюЗакупки КАК Остатки
	|ГДЕ
	|	Остатки.СуммаСНДС = 0 И Остатки.СуммаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.СуммаРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.ДокументПриобретения КАК ДокументПриобретения,
	|	Остатки.Назначение КАК Назначение,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втНеРеализованныеКРТоварыКОформлениюЗакупки КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.ДокументПриобретения КАК ДокументПриобретения,
	|	Остатки.Назначение КАК Назначение,
	|	Остатки.НомерГТД КАК НомерГТД,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	0 КАК СуммаРегл,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втНеРеализованныеКРТоварыКОформлениюЗакупки КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта КАК Валюта,
	|	ТаблицаРасчетов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.Организация КАК Организация,
	|	ТаблицаРасчетов.Номенклатура КАК Номенклатура,
	|	ТаблицаРасчетов.Характеристика КАК Характеристика,
	|	ТаблицаРасчетов.ДокументПриобретения КАК ДокументПриобретения,
	|	ТаблицаРасчетов.Назначение КАК Назначение,
	|	ТаблицаРасчетов.НомерГТД КАК НомерГТД,
	|	ТаблицаРасчетов.Договор КАК Договор,
	|	ТаблицаРасчетов.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	СУММА(ТаблицаРасчетов.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаРасчетов.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	| 	ТаблицаРасчетов.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках
	|ИЗ
	|	ТаблицаРасчетовТоварыКОформлениюЗакупки КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.Организация,
	|	ТаблицаРасчетов.Номенклатура,
	|	ТаблицаРасчетов.Характеристика,
	|	ТаблицаРасчетов.ДокументПриобретения,
	|	ТаблицаРасчетов.Назначение,
	|	ТаблицаРасчетов.НомерГТД,
	|	ТаблицаРасчетов.Договор,
	|	ТаблицаРасчетов.ВариантКурсаДоговора,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	| 	ТаблицаРасчетов.НастройкаХозяйственнойОперации"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыУслугиКОформлениюОтчетовПринципалу()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаНоменклатуры КАК КлючАналитики,
	|	Расчеты.Соглашение КАК Соглашение,
	|	Расчеты.ДокументПродажи КАК ДокументПродажи
	|ПОМЕСТИТЬ втАналитикаЗаДеньУслугиКОформлению
	|ИЗ
	|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу КАК Расчеты
	|ГДЕ
	|	Расчеты.Организация = &Организация
	|	И Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.СуммаВыручки <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.Организация КАК Организация,
	|	ОстаткиДня.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиДня.Соглашение КАК Соглашение,
	|	ОстаткиДня.ДокументПродажи КАК ДокументПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный) КАК ВариантКурсаДоговора,
	|	ОстаткиДня.СуммаВыручкиОстаток КАК СуммаВыручки,
	|	ОстаткиДня.СуммаВыручкиРеглОстаток КАК СуммаВыручкиРегл,
	|	ОстаткиДня.СуммаВыручкиУпрОстаток КАК СуммаВыручкиУпр
	|ПОМЕСТИТЬ втОстаткиНаКонецДняУслугиКОформлению
	|ИЗ
	|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация В (&Организация)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК Соглашения
	|		ПО ОстаткиДня.Соглашение = Соглашения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДеньУслугиКОформлению КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаНоменклатуры = АналитикаДня.КлючАналитики
	|		И ОстаткиДня.Соглашение = АналитикаДня.Соглашение
	|		И ОстаткиДня.ДокументПродажи = АналитикаДня.ДокументПродажи
	|ГДЕ
	|	ОстаткиДня.СуммаВыручкиОстаток <> 0
	|	И ЕСТЬNULL(Соглашения.ПереоцениватьУслугиКОтчетуКомитенту, ЛОЖЬ)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.Организация КАК Организация,
	|	ОстаткиДня.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиДня.Соглашение КАК Соглашение,
	|	ОстаткиДня.ДокументПродажи КАК ДокументПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный) КАК ВариантКурсаДоговора,
	|	ОстаткиДня.СуммаВыручкиОстаток КАК СуммаВыручки,
	|	ОстаткиДня.СуммаВыручкиРеглОстаток КАК СуммаВыручкиРегл,
	|	ОстаткиДня.СуммаВыручкиУпрОстаток КАК СуммаВыручкиУпр
	|ИЗ
	|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация В (&Организация)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК Соглашения
	|		ПО ОстаткиДня.Соглашение = Соглашения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДеньУслугиКОформлению КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаНоменклатуры = АналитикаДня.КлючАналитики
	|		И ОстаткиДня.Соглашение = АналитикаДня.Соглашение
	|		И ОстаткиДня.ДокументПродажи = АналитикаДня.ДокументПродажи
	|ГДЕ
	|	ОстаткиДня.СуммаВыручкиОстаток = 0
	|	И ЕСТЬNULL(Соглашения.ПереоцениватьУслугиКОтчетуКомитенту, ЛОЖЬ)
	|	И (ОстаткиДня.СуммаВыручкиРеглОстаток <> 0 ИЛИ ОстаткиДня.СуммаВыручкиУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.Соглашение КАК Соглашение,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	Остатки.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	ВЫРАЗИТЬ(Остатки.СуммаВыручки * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - Остатки.СуммаВыручкиРегл КАК СуммаВыручкиРегл,
	|	ВЫРАЗИТЬ(Остатки.СуммаВыручки * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - Остатки.СуммаВыручкиУпр КАК СуммаВыручкиУпр
	|ПОМЕСТИТЬ втНеРеализованныеКРУслугиКОформлению
	|ИЗ
	|	втОстаткиНаКонецДняУслугиКОформлению КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|ГДЕ
	|	Остатки.СуммаВыручки <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.Соглашение КАК Соглашение,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА -Остатки.СуммаВыручкиРегл
	|		ИНАЧЕ Остатки.СуммаВыручкиРегл
	|	КОНЕЦ КАК СуммаВыручкиРегл,
	|	0 КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаРасчетовУслугиКОформлению
	|ИЗ
	|	втОстаткиНаКонецДняУслугиКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручки = 0 И Остатки.СуммаВыручкиРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.Соглашение КАК Соглашение,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	0 КАК СуммаВыручкиРегл,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА -Остатки.СуммаВыручкиУпр
	|		ИНАЧЕ Остатки.СуммаВыручкиУпр
	|	КОНЕЦ КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиНаКонецДняУслугиКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручки = 0 И Остатки.СуммаВыручкиУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.СуммаВыручкиРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.Соглашение КАК Соглашение,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА -Остатки.СуммаВыручкиРегл
	|		ИНАЧЕ Остатки.СуммаВыручкиРегл
	|	КОНЕЦ КАК СуммаВыручкиРегл,
	|	0 КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втНеРеализованныеКРУслугиКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручкиРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.Соглашение КАК Соглашение,
	|	Остатки.ДокументПродажи КАК ДокументПродажи,
	|	0 КАК СуммаВыручкиРегл,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА -Остатки.СуммаВыручкиУпр
	|		ИНАЧЕ Остатки.СуммаВыручкиУпр
	|	КОНЕЦ КАК СуммаВыручкиУпр,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаВыручкиУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыРасчетыСКомитентомПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втНеРеализованныеКРУслугиКОформлению КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВыручкиУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта КАК Валюта,
	|	ТаблицаРасчетов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.Организация КАК Организация,
	|	ТаблицаРасчетов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаРасчетов.Соглашение КАК Соглашение,
	|	ТаблицаРасчетов.ДокументПродажи КАК ДокументПродажи,
	|	СУММА(ТаблицаРасчетов.СуммаВыручкиРегл) КАК СуммаВыручкиРегл,
	|	СУММА(ТаблицаРасчетов.СуммаВыручкиУпр) КАК СуммаВыручкиУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	| 	ТаблицаРасчетов.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыУслугиКОформлениюОтчетовПринципалу
	|ИЗ
	|	ТаблицаРасчетовУслугиКОформлению КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.Организация,
	|	ТаблицаРасчетов.АналитикаУчетаНоменклатуры,
	|	ТаблицаРасчетов.Соглашение,
	|	ТаблицаРасчетов.ДокументПродажи,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	| 	ТаблицаРасчетов.НастройкаХозяйственнойОперации"
	+"
	|;
	|";
	
КонецФункции
//++ НЕ УТ

Функция ТекстЗапросаКурсовыеРазницыИнвестицииВАренду()
	
	// переоцениваем только валюту упр.
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.Договор КАК Договор,
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.ОсновноеСредство КАК ОсновноеСредство,
	|	ОборотыЗаДень.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета
	|ПОМЕСТИТЬ АналитикаДня
	|ИЗ
	|	РегистрНакопления.ИнвестицииВАренду.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета
	|				ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Договор,
	|	Валюта,
	|	ОсновноеСредство,
	|	ГруппаФинансовогоУчета
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Организация КАК Организация,
	|	Остатки.Договор КАК Договор,
	|	Остатки.Валюта КАК Валюта,
	|	Остатки.ОсновноеСредство КАК ОсновноеСредство,
	|	Остатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|
	|	Остатки.АрендныеПлатежиОстаток КАК АрендныеПлатежиВВалюте,
	|	Остатки.АрендныеПлатежиРеглОстаток КАК АрендныеПлатежиРегл,
	|	Остатки.АрендныеПлатежиУпрОстаток КАК АрендныеПлатежиУпр,
	|
	|	Остатки.ПроцентныйДисконтОстаток КАК ПроцентныйДисконтВВалюте,
	|	Остатки.ПроцентныйДисконтРеглОстаток КАК ПроцентныйДисконтРегл,
	|	Остатки.ПроцентныйДисконтУпрОстаток КАК ПроцентныйДисконтУпр,
	|
	|	ЕСТЬNULL(Договоры.ВариантКурсаДоговора, 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора
	|ПОМЕСТИТЬ втОстаткиНаДень
	|ИЗ
	|	РегистрНакопления.ИнвестицииВАренду.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета
	|				ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК Остатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Остатки.Договор = Договоры.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Договор,
	|	Валюта,
	|	ОсновноеСредство,
	|	ГруппаФинансовогоУчета
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.АрендныеПлатежиВВалюте КАК АрендныеПлатежиВВалюте,
	|	ОстаткиНаДень.АрендныеПлатежиРегл КАК АрендныеПлатежиРегл,
	|	ОстаткиНаДень.АрендныеПлатежиУпр КАК АрендныеПлатежиУпр,
	|	ОстаткиНаДень.ПроцентныйДисконтВВалюте КАК ПроцентныйДисконтВВалюте,
	|	ОстаткиНаДень.ПроцентныйДисконтРегл КАК ПроцентныйДисконтРегл,
	|	ОстаткиНаДень.ПроцентныйДисконтУпр КАК ПроцентныйДисконтУпр,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалюты.КурсЧислитель,1)
	|	КОНЕЦ                                                    КАК КурсЧислительРегл,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалюты.КурсЗнаменатель,1)
	|	КОНЕЦ                                                    КАК КурсЗнаменательРегл,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.Валюта = &ВалютаУправленческогоУчета
	|			И ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалютыУпр.КурсЧислитель,1)
	|	КОНЕЦ                                                    КАК КурсЧислительУпр,
	|	ВЫБОР 
	|		КОГДА ОстаткиНаДень.Валюта = &ВалютаУправленческогоУчета
	|			И ОстаткиНаДень.ВариантКурсаДоговора 
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
	|		ИНАЧЕ ЕСТЬNULL(КурсВалютыУпр.КурсЗнаменатель,1)
	|	КОНЕЦ                                                    КАК КурсЗнаменательУпр,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.ОсновноеСредство КАК ОсновноеСредство,
	|	ОстаткиНаДень.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиИнвестицийСКурсами
	|ИЗ
	|	втОстаткиНаДень КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикаДня
	|		ПО ОстаткиНаДень.Организация = АналитикаДня.Организация
	|			И ОстаткиНаДень.Договор = АналитикаДня.Договор
	|			И ОстаткиНаДень.Валюта= АналитикаДня.Валюта
	|			И ОстаткиНаДень.ОсновноеСредство = АналитикаДня.ОсновноеСредство
	|			И ОстаткиНаДень.ГруппаФинансовогоУчета = АналитикаДня.ГруппаФинансовогоУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютУпр КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыДоговоров КАК КурсДоговора
	|		ПО ОстаткиНаДень.Договор = КурсДоговора.Договор
	|ГДЕ
	|	(ОстаткиНаДень.АрендныеПлатежиВВалюте <> 0
	|		ИЛИ ОстаткиНаДень.ПроцентныйДисконтВВалюте <> 0)
	|	И (НЕ АналитикаДня.Организация ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И ОстаткиНаДень.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИнвестицийСКурсами.Валюта КАК Валюта,
	|	ОстаткиИнвестицийСКурсами.Период КАК Период,
	|
	|	ОстаткиИнвестицийСКурсами.АрендныеПлатежиВВалюте КАК АрендныеПлатежиВВалюте,
	|	ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.АрендныеПлатежиВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|		КАК ЧИСЛО(31,2)) - ОстаткиИнвестицийСКурсами.АрендныеПлатежиРегл КАК АрендныеПлатежиРегл,
	|	ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.АрендныеПлатежиВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|			* ОстаткиИнвестицийСКурсами.КурсЗнаменательУпр 
	|			/ ОстаткиИнвестицийСКурсами.КурсЧислительУпр 
	|		КАК ЧИСЛО(31,2)) - ОстаткиИнвестицийСКурсами.АрендныеПлатежиУпр КАК АрендныеПлатежиУпр,
	|
	|	ОстаткиИнвестицийСКурсами.ПроцентныйДисконтВВалюте КАК ПроцентныйДисконтВВалюте,
	|	ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.ПроцентныйДисконтВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|		КАК ЧИСЛО(31,2)) - ОстаткиИнвестицийСКурсами.ПроцентныйДисконтРегл КАК ПроцентныйДисконтРегл,
	|	ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.ПроцентныйДисконтВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|			* ОстаткиИнвестицийСКурсами.КурсЗнаменательУпр 
	|			/ ОстаткиИнвестицийСКурсами.КурсЧислительУпр 
	|		КАК ЧИСЛО(31,2)) - ОстаткиИнвестицийСКурсами.ПроцентныйДисконтУпр КАК ПроцентныйДисконтУпр,
	|
	|	ОстаткиИнвестицийСКурсами.Организация КАК Организация,
	|	ОстаткиИнвестицийСКурсами.Договор КАК Договор,
	|	ОстаткиИнвестицийСКурсами.ОсновноеСредство КАК ОсновноеСредство,
	|	ОстаткиИнвестицийСКурсами.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ОстаткиИнвестицийСКурсами.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ОстаткиИнвестицийСКурсами.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втКурсовыеРазницыИнвестиций
	|ИЗ
	|	втОстаткиИнвестицийСКурсами КАК ОстаткиИнвестицийСКурсами
	|ГДЕ
	|	ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.АрендныеПлатежиВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|		КАК ЧИСЛО(31,2)) <> ОстаткиИнвестицийСКурсами.АрендныеПлатежиРегл
	|	ИЛИ ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.АрендныеПлатежиВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|			* ОстаткиИнвестицийСКурсами.КурсЗнаменательУпр 
	|			/ ОстаткиИнвестицийСКурсами.КурсЧислительУпр 
	|		КАК ЧИСЛО(31,2)) <> ОстаткиИнвестицийСКурсами.АрендныеПлатежиУпр
	|
	|	ИЛИ ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.ПроцентныйДисконтВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|		КАК ЧИСЛО(31,2)) <> ОстаткиИнвестицийСКурсами.ПроцентныйДисконтРегл
	|	ИЛИ ВЫРАЗИТЬ(ОстаткиИнвестицийСКурсами.ПроцентныйДисконтВВалюте 
	|			* ОстаткиИнвестицийСКурсами.КурсЧислительРегл 
	|			/ ОстаткиИнвестицийСКурсами.КурсЗнаменательРегл 
	|			* ОстаткиИнвестицийСКурсами.КурсЗнаменательУпр 
	|			/ ОстаткиИнвестицийСКурсами.КурсЧислительУпр 
	|		КАК ЧИСЛО(31,2)) <> ОстаткиИнвестицийСКурсами.ПроцентныйДисконтУпр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|
	|	0 КАК АрендныеПлатежиВВалюте,
	|	-ОстаткиНаДень.АрендныеПлатежиРегл КАК АрендныеПлатежиРегл,
	|	-ОстаткиНаДень.АрендныеПлатежиУпр КАК АрендныеПлатежиУпр,
	|
	|	0 КАК ПроцентныйДисконтВВалюте,
	|	0 КАК ПроцентныйДисконтРегл,
	|	0 КАК ПроцентныйДисконтУпр,
	|
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.ОсновноеСредство КАК ОсновноеСредство,
	|	ОстаткиНаДень.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	&ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиНаДень КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикаДня
	|		ПО ОстаткиНаДень.Организация = АналитикаДня.Организация
	|			И ОстаткиНаДень.Договор = АналитикаДня.Договор
	|			И ОстаткиНаДень.Валюта= АналитикаДня.Валюта
	|			И ОстаткиНаДень.ОсновноеСредство = АналитикаДня.ОсновноеСредство
	|			И ОстаткиНаДень.ГруппаФинансовогоУчета = АналитикаДня.ГруппаФинансовогоУчета
	|ГДЕ
	|	ОстаткиНаДень.АрендныеПлатежиВВалюте = 0
	|	И (НЕ АналитикаДня.Организация ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.АрендныеПлатежиРегл <> 0 ИЛИ ОстаткиНаДень.АрендныеПлатежиУпр <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|
	|	0 КАК АрендныеПлатежиВВалюте,
	|	0 КАК АрендныеПлатежиРегл,
	|	0 КАК АрендныеПлатежиУпр,
	|
	|	0 КАК ПроцентныйДисконтВВалюте,
	|	-ОстаткиНаДень.ПроцентныйДисконтРегл КАК ПроцентныйДисконтРегл,
	|	-ОстаткиНаДень.ПроцентныйДисконтУпр КАК ПроцентныйДисконтУпр,
	|
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.ОсновноеСредство КАК ОсновноеСредство,
	|	ОстаткиНаДень.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	&ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиНаДень КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикаДня
	|		ПО ОстаткиНаДень.Организация = АналитикаДня.Организация
	|			И ОстаткиНаДень.Договор = АналитикаДня.Договор
	|			И ОстаткиНаДень.Валюта= АналитикаДня.Валюта
	|			И ОстаткиНаДень.ОсновноеСредство = АналитикаДня.ОсновноеСредство
	|			И ОстаткиНаДень.ГруппаФинансовогоУчета = АналитикаДня.ГруппаФинансовогоУчета
	|ГДЕ
	|	ОстаткиНаДень.ПроцентныйДисконтВВалюте = 0
	|	И (НЕ АналитикаДня.Организация ЕСТЬ NULL
	|		ИЛИ &КонецПериода = &КонецМесяца
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.ПроцентныйДисконтРегл <> 0 ИЛИ ОстаткиНаДень.ПроцентныйДисконтУпр <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.АрендныеПлатежиРегл <> 0 И Остатки.АрендныеПлатежиРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР КОГДА Остатки.АрендныеПлатежиРегл < 0
	|		ТОГДА -Остатки.АрендныеПлатежиРегл
	|		ИНАЧЕ Остатки.АрендныеПлатежиРегл
	|	КОНЕЦ КАК АрендныеПлатежиРегл,
	|	0 КАК АрендныеПлатежиУпр,
	|	0 КАК ПроцентныйДисконтРегл,
	|	0 КАК ПроцентныйДисконтУпр,
	|	ЛОЖЬ КАК ЭтоПроцентныйДисконт,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ОсновноеСредство КАК ОсновноеСредство,
	|	Остатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаИнвестицийВАренду
	|ИЗ
	|	втКурсовыеРазницыИнвестиций КАК Остатки
	|ГДЕ
	|	Остатки.АрендныеПлатежиРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.ПроцентныйДисконтРегл <> 0 И Остатки.ПроцентныйДисконтРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	0 КАК АрендныеПлатежиРегл,
	|	0 КАК АрендныеПлатежиУпр,
	|	ВЫБОР КОГДА Остатки.ПроцентныйДисконтРегл < 0
	|		ТОГДА -Остатки.ПроцентныйДисконтРегл
	|		ИНАЧЕ Остатки.ПроцентныйДисконтРегл
	|	КОНЕЦ КАК ПроцентныйДисконтРегл,
	|	0 КАК ПроцентныйДисконтУпр,
	|	ИСТИНА КАК ЭтоПроцентныйДисконт,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ОсновноеСредство КАК ОсновноеСредство,
	|	Остатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втКурсовыеРазницыИнвестиций КАК Остатки
	|ГДЕ
	|	Остатки.ПроцентныйДисконтРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.АрендныеПлатежиУпр <> 0 И Остатки.АрендныеПлатежиУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	0 КАК АрендныеПлатежиРегл,
	|	ВЫБОР КОГДА Остатки.АрендныеПлатежиУпр < 0
	|		ТОГДА -Остатки.АрендныеПлатежиУпр
	|		ИНАЧЕ Остатки.АрендныеПлатежиУпр
	|	КОНЕЦ КАК АрендныеПлатежиУпр,
	|	0 КАК ПроцентныйДисконтРегл,
	|	0 КАК ПроцентныйДисконтУпр,
	|	ЛОЖЬ КАК ЭтоПроцентныйДисконт,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ОсновноеСредство КАК ОсновноеСредство,
	|	Остатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втКурсовыеРазницыИнвестиций КАК Остатки
	|ГДЕ
	|	Остатки.АрендныеПлатежиУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.ПроцентныйДисконтУпр <> 0 И Остатки.ПроцентныйДисконтУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	0 КАК АрендныеПлатежиРегл,
	|	0 КАК АрендныеПлатежиУпр,
	|	0 КАК ПроцентныйДисконтРегл,
	|	ВЫБОР КОГДА Остатки.ПроцентныйДисконтУпр < 0
	|		ТОГДА -Остатки.ПроцентныйДисконтУпр
	|		ИНАЧЕ Остатки.ПроцентныйДисконтУпр
	|	КОНЕЦ КАК ПроцентныйДисконтУпр,
	|	ИСТИНА КАК ЭтоПроцентныйДисконт,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ОсновноеСредство КАК ОсновноеСредство,
	|	Остатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втКурсовыеРазницыИнвестиций КАК Остатки
	|ГДЕ
	|	Остатки.ПроцентныйДисконтУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИнвестицийВАренду.Валюта,
	|	ТаблицаИнвестицийВАренду.Период КАК Период,
	|	ТаблицаИнвестицийВАренду.ВидДвижения КАК ВидДвижения,
	|	СУММА(ТаблицаИнвестицийВАренду.АрендныеПлатежиРегл) КАК АрендныеПлатежиРегл,
	|	СУММА(ТаблицаИнвестицийВАренду.АрендныеПлатежиУпр) КАК АрендныеПлатежиУпр,
	|	СУММА(ТаблицаИнвестицийВАренду.ПроцентныйДисконтРегл) КАК ПроцентныйДисконтРегл,
	|	СУММА(ТаблицаИнвестицийВАренду.ПроцентныйДисконтУпр) КАК ПроцентныйДисконтУпр,
	|	ТаблицаИнвестицийВАренду.ЭтоПроцентныйДисконт КАК ЭтоПроцентныйДисконт,
	|	ТаблицаИнвестицийВАренду.Организация КАК Организация,
	|	ТаблицаИнвестицийВАренду.Договор КАК Договор,
	|	ТаблицаИнвестицийВАренду.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаИнвестицийВАренду.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ТаблицаИнвестицийВАренду.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаИнвестицийВАренду.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыИнвестицииВАренду
	|ИЗ
	|	ТаблицаИнвестицийВАренду КАК ТаблицаИнвестицийВАренду
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИнвестицийВАренду.Валюта,
	|	ТаблицаИнвестицийВАренду.Период,
	|	ТаблицаИнвестицийВАренду.ЭтоПроцентныйДисконт,
	|	ТаблицаИнвестицийВАренду.Организация,
	|	ТаблицаИнвестицийВАренду.Договор,
	|	ТаблицаИнвестицийВАренду.ОсновноеСредство,
	|	ТаблицаИнвестицийВАренду.ГруппаФинансовогоУчета,
	|	ТаблицаИнвестицийВАренду.ХозяйственнаяОперация,
	|	ТаблицаИнвестицийВАренду.ВидДвижения,
	|	ТаблицаИнвестицийВАренду.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции
//-- НЕ УТ

#КонецОбласти

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации, РегистрыДляРасчета)
	
	ВходящиеДанные = Новый Соответствие;
	ВходящиеДанные.Вставить(Метаданные.Документы.РасчетКурсовыхРазниц);
	Для Каждого Регистр Из РегистрыДляРасчета Цикл
		ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления[Регистр.Ключ]);
	КонецЦикла;
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаПоПартнерам);
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.ОтносительныеКурсыВалют);
	
	ЗакрытиеМесяцаСервер.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеЗаданийКЗакрытиюМесяцаСлужебные

Функция СоответствиеЗапросовКонтрольнымРегистрам(Запрос)
	
	СоответствиеТекстовЗапросов = Новый Соответствие();
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваБезналичные", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваБезналичные", "БанковскийСчет.ВалютаДенежныхСредств"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваВКассахККМ", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваВКассахККМ", "КассаККМ.ВалютаДенежныхСредств"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваВПути", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваВПути"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваНаличные", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваНаличные", "Касса.ВалютаДенежныхСредств"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваУПодотчетныхЛиц",
		ТекстЗапросаДенежныеСредства(Запрос, "ТаблицаИзмененийДенежныеСредстваУПодотчетныхЛиц"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийРасчетыПоФинансовымИнструментам",
		ТекстЗапросаРасчетыПоФинансовымИнструментам(Запрос));
	РасчетКурсовыхРазницЛокализация.ДополнитьСоответствиеЗапросовКонтрольнымРегистрам(Запрос, СоответствиеТекстовЗапросов);
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции

#Область ТекстыЗапросовЗаданийКЗакрытиюМесяца

Функция ТекстЗапросаДенежныеСредства(Запрос, ИмяВременнойТаблицы, ОбращениеКВалютномуПолю = "Валюта") Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов) КАК Операция,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Регистратор КАК Документ
	|ИЗ
	|	&ИмяВременнойТаблицы КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|	ПО ИСТИНА
	|ГДЕ
	|	ТипЗначения(Таблица.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		ИЛИ &ВалютаПереопределяемый <> Константы.ВалютаУправленческогоУчета
	|		ИЛИ &ВалютаПереопределяемый <> Таблица.Организация.ВалютаРегламентированногоУчета
	|";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВалютаПереопределяемый", "Таблица." + ОбращениеКВалютномуПолю);
	СтруктураТекстовЗапросов = ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов(ТекстЗапроса);
	Возврат СтруктураТекстовЗапросов;
	
КонецФункции

Функция ТекстЗапросаРасчетыПоФинансовымИнструментам(Запрос) Экспорт
	Если НЕ Запрос.Параметры.Свойство("ВалютаУпр") Тогда
		Запрос.УстановитьПараметр("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов) КАК Операция,
	|	Аналитика.Организация КАК Организация,
	|	ТаблицаИзменений.Регистратор КАК Документ
	|ИЗ
	|	ТаблицаИзмененийРасчетыПоФинансовымИнструментам КАК ТаблицаИзменений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ТаблицаИзменений.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ТаблицаИзменений.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> &ВалютаУпр
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> Аналитика.Организация.ВалютаРегламентированногоУчета)
	|	И (ТаблицаИзменений.Сумма <> 0
	|		ИЛИ ТаблицаИзменений.СуммаУпр <> 0
	|		ИЛИ ТаблицаИзменений.СуммаРегл <> 0)
	//++ НЕ УТ
	|	И ТИПЗНАЧЕНИЯ(ТаблицаИзменений.Договор) <> ТИП(Справочник.ДоговорыАренды)
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаАренды) КАК Операция,
	|	Аналитика.Организация КАК Организация,
	|	ТаблицаИзменений.Регистратор КАК Документ
	|ИЗ
	|	ТаблицаИзмененийРасчетыПоФинансовымИнструментам КАК ТаблицаИзменений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ТаблицаИзменений.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ТаблицаИзменений.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> &ВалютаУпр
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> Аналитика.Организация.ВалютаРегламентированногоУчета)
	|	И (ТаблицаИзменений.Сумма <> 0
	|		ИЛИ ТаблицаИзменений.СуммаУпр <> 0
	|		ИЛИ ТаблицаИзменений.СуммаРегл <> 0)
	//++ НЕ УТ
	|	И ТИПЗНАЧЕНИЯ(ТаблицаИзменений.Договор) = ТИП(Справочник.ДоговорыАренды)
	//-- НЕ УТ
	|";
	
	СтруктураТекстовЗапросов = ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов(ТекстЗапроса);
	Возврат СтруктураТекстовЗапросов

КонецФункции

#КонецОбласти

#КонецОбласти

#Область Прочее

Процедура ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки = Неопределено)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()) Тогда
		Возврат;
	КонецЕсли;
	
	#Область ИнициализацияПараметровПереоценки
	РегистрыДляРасчета = РегистрыРасчета(Операция);
	АналитикаРасчета = Неопределено;
	КоличествоОбработанныхЭлементов = 0;
	Если ЗначениеЗаполнено(ПараметрыПереоценки) Тогда
		Если ПараметрыПереоценки.Свойство("РегистрыРасчета") Тогда
			РегистрыДляРасчета = ПараметрыПереоценки.РегистрыРасчета;
		КонецЕсли;
		ПараметрыПереоценки.Свойство("АналитикаРасчета", АналитикаРасчета);
		Если ТипЗнч(АналитикаРасчета) = Тип("Структура") Тогда
			ВсеПустые = Истина;
			Для Каждого Аналитика Из АналитикаРасчета Цикл
				Если ТипЗнч(Аналитика.Значение) = Тип("Массив") Тогда
					Для Каждого Значение Из Аналитика.Значение Цикл
						Если ЗначениеЗаполнено(Значение) Тогда
							ВсеПустые = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ЗначениеЗаполнено(Аналитика.Значение) Тогда
					ВсеПустые = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ВсеПустые Тогда
				АналитикаРасчета = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыПереоценки.Свойство("КоличествоОбработанныхЭлементов") Тогда
			КоличествоОбработанныхЭлементов = ПараметрыПереоценки.КоличествоОбработанныхЭлементов;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	УправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Истина);
	НачатьТранзакцию();
	Попытка
		ВыполненРасчет = Ложь;
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов")
			И (Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами 
				ИЛИ Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками) Тогда
			РассчитатьКурсовыеРазницыПоСрокам(Организация, Период, Операция);
			ВыполненРасчет = Истина;
		КонецЕсли;
		
		//++ НЕ УТ
	
		//++ Локализация
		Если РегистрыДляРасчета.Свойство("РасчетыПоФинансовымИнструментам") 
			И (Операция = Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов
				ИЛИ Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде) Тогда
			ЗаполнитьДвиженияНУФинансовыхИнструментов(Организация, Период, Операция);
		КонецЕсли;
		//-- Локализация
	
		//-- НЕ УТ
		Если НЕ ВыполненРасчет И НЕ ТребуетсяПереоценка(Организация, Период, РегистрыДляРасчета, АналитикаРасчета)  Тогда
			УправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Ложь);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Документ.Ссылка КАК Ссылка,
		|	Документ.Организация КАК Организация
		|ПОМЕСТИТЬ втДокументПереоценки
		|ИЗ
		|	Документ.РасчетКурсовыхРазниц КАК Документ
		|ГДЕ
		|	Документ.ХозяйственнаяОперация = &Операция
		|	И НЕ Документ.ПометкаУдаления
		|	И Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Документ.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация,
		|	ЕСТЬNULL(Документ.Ссылка, НЕОПРЕДЕЛЕНО) КАК Документ
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДокументПереоценки КАК Документ
		|		ПО Организации.Ссылка = Документ.Организация
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И (Организации.Ссылка В (&Организация) ИЛИ (&ВсеОрганизации
		|			И Организации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОрганизацийПодразделений.Действует)))
		|	И (Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
		|		ИЛИ &УчитыватьУпрОрганизацию)");
		
		Запрос.УстановитьПараметр("Операция",       Операция);
		Запрос.УстановитьПараметр("НачалоПериода",  НачалоМесяца(Период));
		Запрос.УстановитьПараметр("КонецПериода",   КонецМесяца(Период));
		Запрос.УстановитьПараметр("Организация",    Организация);
		Запрос.УстановитьПараметр("ВсеОрганизации", НЕ ЗначениеЗаполнено(Организация));
		Запрос.УстановитьПараметр("УчитыватьУпрОрганизацию", ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюОрганизацию"));
		
		ПереоцениватьПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Документ) Тогда
				
				Если НЕ ВыполненРасчет Тогда
					ВыполнитьРасчетКурсовыхРазниц(Выборка.Документ, РегистрыДляРасчета, АналитикаРасчета, КоличествоОбработанныхЭлементов);
				КонецЕсли;
				
				ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления = Ложь;
				ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполненРасчет", Истина);// отключить повторный расчет при проведении
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			Иначе
				
				ДокументОбъект = Документы.РасчетКурсовыхРазниц.СоздатьДокумент();
				ДокументОбъект.Дата = КонецМесяца(Период);
				ДокументОбъект.Организация = Выборка.Организация;
				ДокументОбъект.ХозяйственнаяОперация = Операция;
				ДокументОбъект.ПереоценкаПоДням = ПереоцениватьПоДням;
				ДокументОбъект.Записать();
				
				Если НЕ ВыполненРасчет Тогда
					ВыполнитьРасчетКурсовыхРазниц(ДокументОбъект.Ссылка, РегистрыДляРасчета, АналитикаРасчета, КоличествоОбработанныхЭлементов);
				КонецЕсли;
				
				ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполненРасчет", Истина);// отключить повторный расчет при проведении
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		КонецЦикла;// По организациям
		
		УправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Ложь);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		УправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Ложь);
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ПараметрыПереоценки) И ПараметрыПереоценки.Свойство("КоличествоОбработанныхЭлементов") Тогда
		ПараметрыПереоценки.КоличествоОбработанныхЭлементов = КоличествоОбработанныхЭлементов;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьДвижения(ДокументСсылка, МенеджерТаблиц, ИмяРегистра, День, ДополнительныеПараметры)
	
	ВсегоЗаписано = 0;
	КурсовыеРазницы = МенеджерТаблиц.Таблицы["КурсовыеРазницы" + ИмяРегистра].ПолучитьДанные().Выгрузить();
	ЗаполнитьИдентификаторыФинЗаписей(КурсовыеРазницы, ДокументСсылка, ИмяРегистра, День);
	Если КурсовыеРазницы.Количество() > 0 Тогда
		Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей - 
		Набор.Отбор.Регистратор.Установить(ДокументСсылка);
		Набор.Загрузить(КурсовыеРазницы);
		Набор.Записать(Ложь);
		ВсегоЗаписано = КурсовыеРазницы.Количество();
	КонецЕсли;
	
	//++ НЕ УТ

	//++ Локализация
	Если ДополнительныеПараметры.ИспользоватьРеглУчет Тогда
		Если ИмяРегистра = "РасчетыПоФинансовымИнструментам" Тогда
			ЕщеДописано = ЗаписатьКурсовыеРазницыПоФинИнструментамНУ(ДокументСсылка, МенеджерТаблиц, День, ДополнительныеПараметры);
			ВсегоЗаписано = ВсегоЗаписано + ЕщеДописано;
			
		ИначеЕсли КурсовыеРазницы.Количество() > 0
				И (ИмяРегистра = "ДенежныеСредстваБезналичные"
					ИЛИ ИмяРегистра = "ДенежныеСредстваНаличные"
					ИЛИ ИмяРегистра = "ДенежныеСредстваВКассахККМ"
					ИЛИ ИмяРегистра = "ДенежныеСредстваВПути") Тогда
			ЕщеДописано = ЗаписатьРасшифровкуРасчетаКурсовыхРазниц(ДокументСсылка, МенеджерТаблиц, ИмяРегистра, День, ДополнительныеПараметры);
			ВсегоЗаписано = ВсегоЗаписано + ЕщеДописано;
		КонецЕсли;
	КонецЕсли;
	//-- Локализация

	//-- НЕ УТ
	Возврат ВсегоЗаписано;
	
КонецФункции
//++ НЕ УТ

//++ Локализация
Функция ЗаписатьКурсовыеРазницыПоФинИнструментамНУ(ДокументСсылка, МенеджерТаблиц, День, ДополнительныеПараметры)
	
	ВсегоЗаписано = 0;
	Депозит = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.Депозит;
	ЗаймВыданный = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.ЗаймВыданный;
	НаборЗаписейНУ = РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.СоздатьНаборЗаписей();
	НаборЗаписейНУ.Отбор.Регистратор.Установить(ДокументСсылка);
	РасчетПереоценкиНУ = РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ.СоздатьНаборЗаписей();
	РасчетПереоценкиНУ.Отбор.Регистратор.Установить(ДокументСсылка);
	НачалоПрименения67ФЗПоРасходам = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоПрименения67ФЗПоРасходам();

	ТипЧисло31_2 = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(31, 2));
	ДанныеДляРасчетаНУ = МенеджерТаблиц.Таблицы["втКРасчетуНУ"].ПолучитьДанные().Выгрузить();
	ДокументыОплаты = МенеджерТаблиц.Таблицы["ДоговораЗаДеньПоДокументамОплаты"].ПолучитьДанные().Выгрузить(); // ТаблицаЗначений
	ДокументыОплаты.Сортировать("МоментВремени УБЫВ");
	ДокументыОплаты.Колонки.Добавить("КурсоваяРазницаОплаты", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("ПризнаниеДохода", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("ПризнаниеРасхода", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("СуммаОстаток", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("СуммаНУОстаток", ТипЧисло31_2);
	ПоляПоиска = "АналитикаУчетаПоПартнерам, Договор, РасчетныйДокумент, Валюта, ТипСуммы";
	ДокументыОплаты.Индексы.Добавить(ПоляПоиска);
	СтруктураПоискаОплаты = Новый Структура(ПоляПоиска);
	Для Каждого ЗаписьНУ Из ДанныеДляРасчетаНУ Цикл

		АналитикаНУ = АналитикаКурсовыхНУ(ЗаписьНУ);
		АналитикаНУ.Период = КонецДня(День);
		АналитикаНУ.ДокументРегистратор = ДокументСсылка;

		КурсНаДату = ЗаписьНУ.КурсЧислительРегл / ЗаписьНУ.КурсЗнаменательРегл;
		СуммыНУ = РассчитатьСуммыНУ(КонецДня(День), КурсНаДату, ЗаписьНУ);
		
		Если КонецДня(День) = КонецМесяца(День) Тогда
			ДобавитьОборотНУ(НаборЗаписейНУ, АналитикаНУ, "СуммаНУ", СуммыНУ.КурсоваяРазницаОплаты);
			ДобавитьОборотНУ(НаборЗаписейНУ, АналитикаНУ, "СуммаНУ", СуммыНУ.КурсоваяРазницаОстатка);
		Иначе
			ДобавитьОборотНУ(НаборЗаписейНУ, АналитикаНУ, "СуммаНУ", СуммыНУ.КурсоваяРазницаНУ);
		КонецЕсли;
		ДобавитьОборотНУ(НаборЗаписейНУ, АналитикаНУ, "ОтложенныйДоход", СуммыНУ.ОтложенныйДоходОплата);
		ДобавитьОборотНУ(НаборЗаписейНУ, АналитикаНУ, "ОтложенныйРасход", СуммыНУ.ОтложенныйРасходОплата);
		ДобавитьОборотНУ(НаборЗаписейНУ, АналитикаНУ, "ОтложенныйДоход", СуммыНУ.ОтложенныйДоходОстаток);
		ДобавитьОборотНУ(НаборЗаписейНУ, АналитикаНУ, "ОтложенныйРасход", СуммыНУ.ОтложенныйРасходОстаток);

		//РасчетПереоценкиНУ
		Знак = ?(ЗаписьНУ.ЭтоДепозитИлиЗаймПолученный, 1, -1);
		Если КонецДня(День) = КонецМесяца(День) И Окр(СуммыНУ.КурсоваяРазницаОстатка,2) <> 0 Тогда
			НовСтр = РасчетПереоценкиНУ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, АналитикаНУ);
			НовСтр.Аналитика1 = АналитикаНУ.Контрагент; 
			НовСтр.Аналитика2 = АналитикаНУ.Договор; 
			НовСтр.Аналитика3 = АналитикаНУ.РасчетныйДокумент;

			НовСтр.ОстатокВВалюте = Макс(ЗаписьНУ.СуммаОстаток, -ЗаписьНУ.СуммаОстаток);
			ОстатокВРубляхНУ = ЗаписьНУ.СуммаНУОстаток + СуммыНУ.КурсоваяРазницаОплаты;
			НовСтр.ОстатокВРубляхНУ = Макс(ОстатокВРубляхНУ, -ОстатокВРубляхНУ);
			ОстатокПоКурсуПереоценки = КурсНаДату * ЗаписьНУ.СуммаОстаток;
			НовСтр.ОстатокПоКурсуПереоценки = Макс(ОстатокПоКурсуПереоценки, -ОстатокПоКурсуПереоценки);
			НовСтр.СуммаПереоценкиНУ = СуммыНУ.КурсоваяРазницаОстатка;
			НовСтр.ОстатокОД = Макс(ЗаписьНУ.ОтложенныйДоходОстаток, -ЗаписьНУ.ОтложенныйДоходОстаток);
			Если СуммыНУ.КурсоваяРазницаОстатка > 0 Тогда
				НовСтр.ОтложенныйДоход = СуммыНУ.КурсоваяРазницаОстатка;
			ИначеЕсли День >= НачалоПрименения67ФЗПоРасходам Тогда
				НовСтр.ОтложенныйРасход = -СуммыНУ.КурсоваяРазницаОстатка;
			КонецЕсли;
			Если День >= НачалоПрименения67ФЗПоРасходам Тогда
				НовСтр.ОстатокОР = Макс(ЗаписьНУ.ОтложенныйРасходОстаток, -ЗаписьНУ.ОтложенныйРасходОстаток);
			КонецЕсли;

			НовСтр.ЭтоТребование = Истина;
			НовСтр.Курс = ЗаписьНУ.КурсЧислительРегл;
			НовСтр.Кратность = ЗаписьНУ.КурсЗнаменательРегл;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтруктураПоискаОплаты, ЗаписьНУ);
		СтрокиОплаты = ДокументыОплаты.Скопировать(СтруктураПоискаОплаты);
		Если СтрокиОплаты.Количество() > 0 Тогда

			ОстаткиНУ = Новый Структура;
			ОстаткиНУ.Вставить("СуммаОстаток", ЗаписьНУ.СуммаОстаток);
			ОстаткиНУ.Вставить("СуммаНУОстаток", ЗаписьНУ.СуммаНУОстаток + СуммыНУ.КурсоваяРазницаОплаты);

			ВсегоОплатаЗаДень = СтрокиОплаты.Итог("СуммаОборот");
			ВсегоПризнаноДохода = -СуммыНУ.ПризнаниеДохода;
			ВсегоПризнаноРасхода = -СуммыНУ.ПризнаниеРасхода;
			КурсоваяРазницаОплаты = Макс(СуммыНУ.КурсоваяРазницаОплаты, -СуммыНУ.КурсоваяРазницаОплаты);
			ВсегоКурсоваяРазницаОплаты = КурсоваяРазницаОплаты;
			ЗнакКурсовой = 1;
			Если СуммыНУ.КурсоваяРазницаОплаты <> 0 Тогда
				ЗнакКурсовой = СуммыНУ.КурсоваяРазницаОплаты/КурсоваяРазницаОплаты;
			КонецЕсли;
			Для Индекс = 0 По СтрокиОплаты.Количество()-1 Цикл
				ПоследняяСтрока = Индекс = СтрокиОплаты.Количество()-1;
				Оплата = СтрокиОплаты[Индекс];

				Если ВсегоОплатаЗаДень <> 0 Тогда
					ДоляКурсовойРазницыОплаты = Окр(Оплата.СуммаОборот/ВсегоОплатаЗаДень * КурсоваяРазницаОплаты, 2);
					Оплата.КурсоваяРазницаОплаты = ЗнакКурсовой * ВзаиморасчетыСервер.СписатьСумму(ВсегоКурсоваяРазницаОплаты, ДоляКурсовойРазницыОплаты, ПоследняяСтрока);

					ПризнаниеДохода = Окр(Оплата.СуммаОборот/ВсегоОплатаЗаДень * (-СуммыНУ.ПризнаниеДохода), 2);
					Оплата.ПризнаниеДохода = -ВзаиморасчетыСервер.СписатьСумму(ВсегоПризнаноДохода, ПризнаниеДохода, ПоследняяСтрока);

					ПризнаниеРасхода = Окр(Оплата.СуммаОборот/ВсегоОплатаЗаДень * (-СуммыНУ.ПризнаниеРасхода),2);
					Оплата.ПризнаниеРасхода = -ВзаиморасчетыСервер.СписатьСумму(ВсегоПризнаноРасхода, ПризнаниеРасхода, ПоследняяСтрока);
				КонецЕсли;

				Оплата.СуммаОстаток = ОстаткиНУ.СуммаОстаток + (-Оплата.СуммаОборот);
				Оплата.СуммаНУОстаток = ОстаткиНУ.СуммаНУОстаток + (-Оплата.СуммаРеглОборот) - Оплата.КурсоваяРазницаОплаты;
				ОстаткиНУ.СуммаОстаток = Оплата.СуммаОстаток;
				ОстаткиНУ.СуммаНУОстаток = Оплата.СуммаНУОстаток;

			КонецЦикла; //по документам оплаты

			СтрокиОплаты.Сортировать("МоментВремени");

			Для Каждого Оплата Из СтрокиОплаты Цикл

				Если Окр(Оплата.КурсоваяРазницаОплаты,2) = 0 И Окр(Оплата.ПризнаниеДохода,2) = 0 И Окр(Оплата.ПризнаниеРасхода,2) = 0 Тогда
					Продолжить;
				КонецЕсли;

				НовСтр = РасчетПереоценкиНУ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, АналитикаНУ);
				НовСтр.Аналитика1 = АналитикаНУ.Контрагент; 
				НовСтр.Аналитика2 = АналитикаНУ.Договор; 
				НовСтр.Аналитика3 = АналитикаНУ.РасчетныйДокумент;
				НовСтр.ДокументОплаты = Оплата.ДокументОплаты;

				НовСтр.ОстатокВВалюте = Макс(Оплата.СуммаОстаток, -Оплата.СуммаОстаток);
				НовСтр.ОстатокВРубляхНУ = Макс(Оплата.СуммаНУОстаток, -Оплата.СуммаНУОстаток);
				ОстатокПоКурсуПереоценки = КурсНаДату * Оплата.СуммаОстаток;
				НовСтр.ОстатокПоКурсуПереоценки = Макс(ОстатокПоКурсуПереоценки, -ОстатокПоКурсуПереоценки);
				НовСтр.СуммаПереоценкиНУ = Оплата.КурсоваяРазницаОплаты;
				НовСтр.ПогашениеВВалюте = Макс(-Оплата.СуммаОборот, Оплата.СуммаОборот);
				НовСтр.ОстатокОД = ЗаписьНУ.ОтложенныйДоходОстаток;
				НовСтр.ОтложенныйДоход = Мин(-Оплата.ПризнаниеДохода, Оплата.ПризнаниеДохода);
				Если День >= НачалоПрименения67ФЗПоРасходам Тогда
					НовСтр.ОстатокОР = ЗаписьНУ.ОтложенныйРасходОстаток;
					НовСтр.ОтложенныйРасход = Мин(-Оплата.ПризнаниеРасхода, Оплата.ПризнаниеРасхода);
				КонецЕсли;

				НовСтр.ЭтоТребование = Истина;
				НовСтр.Курс = ЗаписьНУ.КурсЧислительРегл;
				НовСтр.Кратность = ЗаписьНУ.КурсЗнаменательРегл;

			КонецЦикла; //по документам оплаты

		ИначеЕсли ЗаписьНУ.СуммаОстаток = 0 И Окр(СуммыНУ.КурсоваяРазницаОплаты,2) <> 0 Тогда

			НовСтр = РасчетПереоценкиНУ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, АналитикаНУ);
			НовСтр.Аналитика1 = АналитикаНУ.Контрагент; 
			НовСтр.Аналитика2 = АналитикаНУ.Договор; 
			НовСтр.Аналитика3 = АналитикаНУ.РасчетныйДокумент;
			НовСтр.ДокументОплаты = АналитикаНУ.ДокументРегистратор;

			НовСтр.ОстатокВВалюте = ЗаписьНУ.СуммаОстаток;
			НовСтр.ОстатокВРубляхНУ = ЗаписьНУ.СуммаНУОстаток;
			НовСтр.СуммаПереоценкиНУ = СуммыНУ.КурсоваяРазницаОплаты;
			НовСтр.ПогашениеВВалюте = Макс(-ЗаписьНУ.СуммаОборот, ЗаписьНУ.СуммаОборот);

			НовСтр.ЭтоТребование = Истина;
			НовСтр.Курс = ЗаписьНУ.КурсЧислительРегл;
			НовСтр.Кратность = ЗаписьНУ.КурсЗнаменательРегл;	

		КонецЕсли;
	КонецЦикла;
	ВсегоЗаписано = ВсегоЗаписано + НаборЗаписейНУ.Количество();
	Если НаборЗаписейНУ.Количество() > 0 Тогда
		Если НаборЗаписейНУ.Количество() > 1 Тогда
			ОбщегоНазначенияУТ.СвернутьНаборЗаписей(НаборЗаписейНУ);
		КонецЕсли;
		НаборЗаписейНУ.Записать(Ложь);
	КонецЕсли;
	Если РасчетПереоценкиНУ.Количество() > 0 Тогда
		ОбщегоНазначенияУТ.СвернутьНаборЗаписей(РасчетПереоценкиНУ);
		РасчетПереоценкиНУ.Записать(Ложь);
	КонецЕсли;

	Возврат ВсегоЗаписано;
	
КонецФункции

Функция ЗаписатьРасшифровкуРасчетаКурсовыхРазниц(ДокументСсылка, МенеджерТаблиц, ИмяРегистра, День, ДополнительныеПараметры)
	
	ВсегоЗаписано = 0;
	РасчетПереоценкиНУ = РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ.СоздатьНаборЗаписей();
	РасчетПереоценкиНУ.Отбор.Регистратор.Установить(ДокументСсылка);
	ДанныеРасшифровки = МенеджерТаблиц.Таблицы["РасшифровкаРасчета" + ИмяРегистра].ПолучитьДанные().Выгрузить();
	ВидыСубконтоСчетов = МенеджерТаблиц.Таблицы["ВидыСубконто" + ИмяРегистра].ПолучитьДанные().Выгрузить();
	ПоляПоиска = "СчетУчета";
	ВидыСубконтоСчетов.Индексы.Добавить(ПоляПоиска);
	СтруктураПоиска = Новый Структура(ПоляПоиска);

	БанковскиеСчета = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.БанковскиеСчета;
	СтатьиДДС = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств;
	Контрагенты = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты;
	Договоры = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры;
	ОшибкиДанных = Новый Соответствие;
	ИспользоватьРеглУчет = Константы.ИспользоватьРеглУчет.Получить();

	Для Каждого Запись Из ДанныеРасшифровки Цикл

		Если ИспользоватьРеглУчет И НЕ ЗначениеЗаполнено(Запись.СчетУчета) Тогда
			Если ИмяРегистра = Метаданные.РегистрыНакопления.ДенежныеСредстваБезналичные.Имя Тогда
				ОбъектУчета = Запись.БанковскийСчет;
				Шаблон = НСтр("ru = 'Для банковского счета организации ""%1"" не указан счет учета.';
								|en = 'The ledger account is not specified for ""%1"" company bank account.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Запись.БанковскийСчет);
			ИначеЕсли ИмяРегистра = Метаданные.РегистрыНакопления.ДенежныеСредстваНаличные.Имя Тогда
				ОбъектУчета = Запись.Касса;
				Шаблон = НСтр("ru = 'Для кассы ""%1"" не указан счет учета.';
								|en = 'The ledger account is not specified for ""%1"" cash account.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Запись.Касса);
			ИначеЕсли ИмяРегистра = Метаданные.РегистрыНакопления.ДенежныеСредстваВКассахККМ.Имя Тогда
				ОбъектУчета = Запись.КассаККМ;
				Шаблон = НСтр("ru = 'Для кассы ККМ ""%1"" не указан счет учета.';
								|en = 'The ledger account is not specified for ""%1"" cash register.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Запись.КассаККМ);
			Иначе
				ОбъектУчета = Неопределено;
			КонецЕсли;
			ОшибкиДанных.Вставить(ОбъектУчета, ТекстСообщения);
		КонецЕсли;
		
		КурсНаДату = Запись.Курс/Запись.Кратность;
		КурсоваяРазница = Окр(Запись.ОстатокВВалюте * КурсНаДату - Запись.ОстатокРегл, 2);
		Если КурсоваяРазница = 0 Тогда
			Продолжить;
		КонецЕсли;

		НовСтр = РасчетПереоценкиНУ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Запись);
		НовСтр.ОстатокВВалюте = Макс(Запись.ОстатокВВалюте, -Запись.ОстатокВВалюте);

		ЗначенияСубконто = Новый Соответствие;
		ЗначенияСубконто.Вставить(БанковскиеСчета, Запись.БанковскийСчет);
		ЗначенияСубконто.Вставить(СтатьиДДС, Запись.СтатьяДДС);
		ЗначенияСубконто.Вставить(Контрагенты, Запись.Контрагент);
		ЗначенияСубконто.Вставить(Договоры, Запись.Договор);

		СтруктураПоиска.СчетУчета = Запись.СчетУчета;
		ВидыСубконто = ВидыСубконтоСчетов.Скопировать(СтруктураПоиска);
		ВидыСубконто.Сортировать("НомерСтроки");

		Для Каждого Вид Из ВидыСубконто Цикл
			Если Вид.НомерСтроки = 1 Тогда
				НовСтр.Аналитика1 = ЗначенияСубконто[Вид.ВидСубконто];
			ИначеЕсли Вид.НомерСтроки = 2 Тогда
				НовСтр.Аналитика2 = ЗначенияСубконто[Вид.ВидСубконто];
			ИначеЕсли Вид.НомерСтроки = 3 Тогда
				НовСтр.Аналитика3 = ЗначенияСубконто[Вид.ВидСубконто];
			КонецЕсли;
		КонецЦикла;

		НовСтр.Счет = Запись.СчетУчета;
		НовСтр.ОстатокВРубляхНУ = Макс(Запись.ОстатокРегл, -Запись.ОстатокРегл);
		НовСтр.ОстатокПоКурсуПереоценки = НовСтр.ОстатокВВалюте * КурсНаДату;
		НовСтр.СуммаПереоценкиНУ = КурсоваяРазница;
		Если ИмяРегистра = Метаданные.РегистрыНакопления.ДенежныеСредстваВПути.Имя Тогда
			НовСтр.Аналитика1 = Запись.СтатьяДДС;
			НовСтр.Аналитика2 = Запись.Получатель;
			НовСтр.Аналитика3 = Запись.Отправитель;
			Если НЕ ЗначениеЗаполнено(НовСтр.Аналитика3) Тогда
				НовСтр.Аналитика3 = Запись.Контрагент;
			КонецЕсли;
			НовСтр.Получатель = Неопределено;

		ИначеЕсли ИмяРегистра = Метаданные.РегистрыНакопления.ДенежныеСредстваНаличные.Имя Тогда
			НовСтр.Получатель = Запись.Касса;

		ИначеЕсли ИмяРегистра = Метаданные.РегистрыНакопления.ДенежныеСредстваВКассахККМ.Имя Тогда
			НовСтр.Аналитика1 = Запись.СтатьяДДС;
			НовСтр.Получатель = Запись.Касса;
		КонецЕсли;

	КонецЦикла;
	
	Если РасчетПереоценкиНУ.Количество() > 0 Тогда
		Попытка
			ВсегоЗаписано = ВсегоЗаписано + РасчетПереоценкиНУ.Количество();
			РасчетПереоценкиНУ.Записать(Ложь);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Если ОшибкиДанных.Количество() > 0 Тогда
				ТекстСообщения = "";
				Для Каждого Ошибка ИЗ ОшибкиДанных Цикл
					ТекстСообщения = ТекстСообщения + Ошибка.Значение + Символы.ПС;
				КонецЦикла;
				ТекстОшибки = ТекстСообщения + Символы.ПС + ТекстОшибки;
			КонецЕсли;
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЕсли;

	Возврат ВсегоЗаписано;
	
КонецФункции

Функция РассчитатьСуммыНУ(Период, КурсНаДату, ЗаписьНУ, Оплата = Неопределено)
	
	Если Оплата = Неопределено Тогда
		Оплата = Новый Структура("СуммаОборот,СуммаРеглОборот");
		ЗаполнитьЗначенияСвойств(Оплата, ЗаписьНУ);
	КонецЕсли;

	НачальныйОстатокСумма = ЗаписьНУ.СуммаОстаток + (-Оплата.СуммаОборот);
	НачальныйОстатокСуммаНУ = ЗаписьНУ.СуммаНУОстаток + (-Оплата.СуммаРеглОборот);//в регистр еще не записана курсовая разница

	КурсоваяРазницаОплаты = 0;
	КурсоваяРазницаОстатка = 0;
	ПризнаниеДохода = 0;
	ПризнаниеРасхода = 0;
	Если НачальныйОстатокСумма <> 0 Тогда
		КурсОстаткаНУ = НачальныйОстатокСуммаНУ/НачальныйОстатокСумма;
		Если Оплата.СуммаОборот <> 0 Тогда
			КурсОплаты = Оплата.СуммаРеглОборот/Оплата.СуммаОборот;
			КурсоваяРазницаОплаты = Окр(Оплата.СуммаОборот * (КурсОстаткаНУ - КурсОплаты), 2);
		КонецЕсли;
		КурсоваяРазницаОстатка = КурсНаДату * ЗаписьНУ.СуммаОстаток - (НачальныйОстатокСуммаНУ +(Оплата.СуммаОборот * КурсОстаткаНУ));
		ПризнаниеДохода = Окр(Оплата.СуммаОборот / НачальныйОстатокСумма * ЗаписьНУ.ОтложенныйДоходОстаток, 2);
		ПризнаниеРасхода = Окр(Оплата.СуммаОборот / НачальныйОстатокСумма * ЗаписьНУ.ОтложенныйРасходОстаток, 2);
	КонецЕсли;

	КурсоваяРазницаНУ = 0;
	ОтложенныйДоходОплата = 0; // реализованная
	ОтложенныйРасходОплата = 0;
	ОтложенныйДоходОстаток = 0; // не реализованная
	ОтложенныйРасходОстаток = 0;
	Если ЗаписьНУ.СуммаОстаток = 0 И Период = КонецМесяца(Период) Тогда
		КурсоваяРазницаНУ = -ЗаписьНУ.СуммаНУОстаток;
		КурсоваяРазницаОплаты = -ЗаписьНУ.СуммаНУОстаток;
		ОтложенныйДоходОплата = -ЗаписьНУ.ОтложенныйДоходОстаток;
		ОтложенныйРасходОплата = -ЗаписьНУ.ОтложенныйРасходОстаток;
	Иначе
		КурсоваяРазницаНУ = КурсоваяРазницаОплаты + ?(Период = КонецМесяца(Период), КурсоваяРазницаОстатка, 0);
		ОтложенныйДоходОплата = ПризнаниеДохода;
		ОтложенныйРасходОплата = ПризнаниеРасхода;
		ОтложенныйДоходОстаток = ?(Период = КонецМесяца(Период) И КурсоваяРазницаОстатка > 0, КурсоваяРазницаОстатка, 0);
		ОтложенныйРасходОстаток = ?(Период = КонецМесяца(Период) И КурсоваяРазницаОстатка < 0, -КурсоваяРазницаОстатка, 0);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("КурсоваяРазницаОплаты", КурсоваяРазницаОплаты);
	Результат.Вставить("КурсоваяРазницаОстатка", КурсоваяРазницаОстатка);
	Результат.Вставить("КурсоваяРазницаНУ", КурсоваяРазницаНУ);
	Результат.Вставить("ПризнаниеДохода", ПризнаниеДохода);
	Результат.Вставить("ПризнаниеРасхода", ПризнаниеРасхода);
	Результат.Вставить("ОтложенныйДоходОплата", ОтложенныйДоходОплата);
	Результат.Вставить("ОтложенныйРасходОплата", ОтложенныйРасходОплата);
	Результат.Вставить("ОтложенныйДоходОстаток", ОтложенныйДоходОстаток);
	Результат.Вставить("ОтложенныйРасходОстаток", ОтложенныйРасходОстаток);

	Возврат Результат;
	
КонецФункции

Функция АналитикаКурсовыхНУ(Данные = Неопределено)
	
	Аналитика = Новый Структура;
	Аналитика.Вставить("Период");
	Аналитика.Вставить("АналитикаУчетаПоПартнерам");
	Аналитика.Вставить("ОбъектРасчетов");
	Аналитика.Вставить("РасчетныйДокумент");
	Аналитика.Вставить("Валюта");
	Аналитика.Вставить("ТипСуммы");
	Аналитика.Вставить("Счет");
	Аналитика.Вставить("Организация");
	Аналитика.Вставить("Контрагент");
	Аналитика.Вставить("Договор");
	Аналитика.Вставить("ДокументОплаты");
	Аналитика.Вставить("ДокументРегистратор");
	
	Если Данные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Аналитика, Данные);
		Аналитика.Счет = Данные.СчетУчета;
	КонецЕсли;
	
	Возврат Аналитика;
	
КонецФункции

Процедура ДобавитьОборотНУ(НаборЗаписейНУ, Аналитика, ИмяРесурса, СуммаНУ)
	
	НачалоПрименения67ФЗПоРасходам = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоПрименения67ФЗПоРасходам();
	ЗаписьРазрешена = ИмяРесурса <> "ОтложенныйРасход" 
						ИЛИ ИмяРесурса = "ОтложенныйРасход" 
							И Аналитика.Период >= НачалоПрименения67ФЗПоРасходам;
	
	Если Окр(СуммаНУ, 2) <> 0 И ЗаписьРазрешена Тогда
		НовСтр = НаборЗаписейНУ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Аналитика);
		НовСтр[ИмяРесурса] = СуммаНУ;
		Если НовСтр[ИмяРесурса] < 0 Тогда
			НовСтр[ИмяРесурса] = -НовСтр[ИмяРесурса];
			НовСтр.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//-- Локализация

//-- НЕ УТ

// В отдельных случаях расчет курсовых разниц по регистру "РасчетыПоФинансовымИнструментам" может не транслироваться в МФУ.
// Если в МФУ используется выделение долгосрочных активов и обязательств, то сумма финансового инструмента может учитываться
// на долгосрочном счете, а сумма рассчитанной курсовой разницы будет отражена на краткосрочном счете, как и все операции по
// финансовым иснструментам. После этого регламентная операция закрытия месяца по расчету курсовых разниц в регистре "Международный"
// сформирует еще одну проводку по краткосрочному счету для "нейтрализации" проводки расчета курсовой разницы из оперконтура.
// Чтобы избавиться от лишних оборотов и развернутого сальда на счетах доходов - расходов, движения расчета курсовых разниц
// по регистру "РасчетыПоФинансовымИнструментам" при использовании деления задолженностей по срокам обращения не транслируются в МФУ.
//
Процедура ЗаполнитьИдентификаторыФинЗаписей(КурсовыеРазницы, ДокументСсылка, ИмяРегистра, День)
	
	ОбщегоНазначенияУТ.ДобавитьИдентификаторСтрокВТаблицу(КурсовыеРазницы, "ИдентификаторФинЗаписи", "Строка");
	
	//++ НЕ УТКА
	Если ИмяРегистра = "РасчетыПоФинансовымИнструментам" Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Организация");
		Если МеждународныйУчетПоДаннымФинансовыхРегистров.ИспользуетсяВыделениеДолгосрочныхАктивовОбязательств(Организация, День) Тогда
			КурсовыеРазницы.ЗаполнитьЗначения(ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи(), "ИдентификаторФинЗаписи");
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТКА
	
КонецПроцедуры

// Есть валютные остатки.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации
//  Период - Дата
//  РегистрыДляРасчета - Неопределено, Структура - в ключах которой указаны регистры для расчета:
// 	* РасчетыСПоставщикамиПоДокументам 
// 	* РасчетыСКлиентамиПоДокументам 
// 	* ДенежныеСредстваБезналичные 
// 	* ДенежныеСредстваНаличные 
// 	* ДенежныеСредстваВКассахККМ 
// 	* ДенежныеСредстваВПути 
// 	* ДенежныеСредстваУПодотчетныхЛиц 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РезервыПоСомнительнымДолгам 
// 	* ПроцентныеРасходыДисконтирования 
//  АналитикаРасчета - Неопределено, Структура - Аналитика расчета:
// * ТипыСумм - Массив из ПеречислениеСсылка.ТипыГрафиковФинансовыхИнструментов, ПеречислениеСсылка.ТипыПлатежейПоАренде
// 
// Возвращаемое значение:
//  Булево - Есть валютные остатки
Функция ЕстьВалютныеОстатки(Организация, Период, РегистрыДляРасчета = Неопределено, АналитикаРасчета = Неопределено) Экспорт
	
	ТекстЗапросаВТ = "";
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РезервыПоСомнительнымДолгам") Тогда
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"ВЫБРАТЬ
		|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
		|	АналитикаУчетаПоПартнерам.Организация КАК Организация
		|ПОМЕСТИТЬ втКлючиАналитикиПоПартнерам
		|ИЗ
		|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|ГДЕ
		|	(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|	И (АналитикаУчетаПоПартнерам.КлючАналитики В (&АналитикаУчетаПоПартнерам) ИЛИ &ПоВсемАналитикам)"
		+ РазделительПакетовЗапроса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РегистрыДляРасчета) Тогда
		РегистрыДляРасчета = РегистрыРасчета();
	КонецЕсли;
	Разделитель = Символы.ПС+Символы.ПС;
	ОБЪЕДИНИТЬ = Разделитель+"ОБЪЕДИНИТЬ ВСЕ"+Разделитель;
	ТекстЗапроса = "";
	
	#Область РасчетыСПоставщикамиПоДокументам
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоДокументам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыСКлиентамиПоДокументам
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоДокументам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыСПоставщикамиПоСрокам
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоСрокам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыСКлиентамиПоСрокам
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоСрокам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваБезналичные
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваБезналичные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваБезналичные"" КАК ПредметПереоценки,
		|	Остатки.БанковскийСчет КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (БанковскийСчет В (&БанковскиеСчета) ИЛИ &ПоВсемСчетам)
		|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваНаличные
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваНаличные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК ПредметПереоценки,
		|	Остатки.Касса КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваВКассахККМ
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваВКассахККМ") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВКассахККМ"" КАК ПредметПереоценки,
		|	Остатки.КассаККМ КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (КассаККМ В (&КассыККМ) ИЛИ &ПоВсемКассамККМ)
		|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|			ИЛИ КассаККМ.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваУПодотчетныхЛиц
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваУПодотчетныхЛиц") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваУПодотчетныхЛиц"" КАК ПредметПереоценки,
		|	Остатки.ПодотчетноеЛицо КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ПодотчетноеЛицо В (&ФизическиеЛица) ИЛИ &ПоВсемФизЛицам)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваВПути
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваВПути") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВПути"" КАК ПредметПереоценки,
		|	Остатки.ВидПереводаДенежныхСредств КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыПоФинансовымИнструментам
	Если РегистрыДляРасчета.Свойство("РасчетыПоФинансовымИнструментам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыПоФинансовымИнструментам"" КАК ПредметПереоценки,
		|	Остатки.Договор КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
		|		&ГраницаКонецПериода,
		|		(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|			И (Договор.ВалютаВзаиморасчетов <> &ВалютаУпрУчета
		|				ИЛИ Договор.ВалютаВзаиморасчетов <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	//++ НЕ УТ
	
	#Область РезервыПоСомнительнымДолгам
	Если РегистрыДляРасчета.Свойство("РезервыПоСомнительнымДолгам") Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РезервыПоСомнительнымДолгам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РезервыПоСомнительнымДолгам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ТоварыКОформлениюОтчетовКомитенту
	Если РегистрыДляРасчета.Свойство("ТоварыКОформлениюОтчетовКомитенту") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ТоварыКОформлениюОтчетовКомитенту"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета
		|				ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках
	Если РегистрыДляРасчета.Свойство("ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета
		|				ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	
	#Область УслугиКОформлениюОтчетовПринципалу
	Если РегистрыДляРасчета.Свойство("УслугиКОформлениюОтчетовПринципалу") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""УслугиКОформлениюОтчетовПринципалу"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета
		|				ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	//++ НЕ УТ
	
	#Область ИнвестицииВАренду
	Если РегистрыДляРасчета.Свойство("ИнвестицииВАренду") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ИнвестицииВАренду"" КАК ПредметПереоценки,
		|	Остатки.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	РегистрНакопления.ИнвестицииВАренду.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	#КонецОбласти
	//-- НЕ УТ
	
	РасчетКурсовыхРазницЛокализация.ДополнитьПроверкуЕстьВалютныеОстатки(РегистрыДляРасчета, ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапросаВТ + ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату",              КонецМесяца(Период));
	Запрос.УстановитьПараметр("ГраницаКонецПериода", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаУпрУчета",      Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации",      НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемАналитикам",    НЕ ЗначениеЗаполнено(Запрос.Параметры.АналитикаУчетаПоПартнерам));
	Запрос.УстановитьПараметр("БанковскиеСчета",     ПолучитьАналитику("БанковскиеСчета", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемСчетам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.БанковскиеСчета));
	Запрос.УстановитьПараметр("Кассы",               ПолучитьАналитику("Кассы", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.Кассы));
	Запрос.УстановитьПараметр("КассыККМ",            ПолучитьАналитику("КассыККМ", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассамККМ",     НЕ ЗначениеЗаполнено(Запрос.Параметры.КассыККМ));
	Запрос.УстановитьПараметр("ФизическиеЛица",      ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемФизЛицам",      НЕ ЗначениеЗаполнено(Запрос.Параметры.ФизическиеЛица));
	Запрос.УстановитьПараметр("ТипыСумм",            ПолучитьАналитику("ТипыСумм", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемТипамСумм",     НЕ ЗначениеЗаполнено(Запрос.Параметры.ТипыСумм));
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

// Требуется переоценка.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации - 
//  Период - Дата
//   РегистрыДляРасчета - Неопределено, Структура - в ключах которой указаны регистры для расчета:
// 	* РасчетыСПоставщикамиПоДокументам 
// 	* РасчетыСКлиентамиПоДокументам 
// 	* ДенежныеСредстваБезналичные 
// 	* ДенежныеСредстваНаличные 
// 	* ДенежныеСредстваВКассахККМ 
// 	* ДенежныеСредстваВПути 
// 	* ДенежныеСредстваУПодотчетныхЛиц 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РезервыПоСомнительнымДолгам 
// 	* ПроцентныеРасходыДисконтирования 
//  АналитикаРасчета - Структура, Массив, Неопределено - Аналитика расчета:
// * ТипыСумм - Массив из ПеречислениеСсылка.ТипыГрафиковФинансовыхИнструментов, ПеречислениеСсылка.ТипыПлатежейПоАренде -
//  ВернутьОрганизацииКПереоценке - Булево - Вернуть организации к переоценке
//  ДляОтладки - Неопределено - Для отладки
// 
// Возвращаемое значение:
//  Булево, Массив из СправочникСсылка.Организации - Требуется переоценка
Функция ТребуетсяПереоценка(Организация, Период, РегистрыДляРасчета = Неопределено, АналитикаРасчета = Неопределено, ВернутьОрганизацииКПереоценке = Ложь, ДляОтладки = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РегистрыДляРасчета) Тогда
		РегистрыДляРасчета = РегистрыРасчета();
	КонецЕсли;
	
	#Область ВременныеТаблицыАналитикаКурсыВалют
	ТекстЗапросаВТ = "";
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыПоФинансовымИнструментам")
		ИЛИ РегистрыДляРасчета.Свойство("РезервыПоСомнительнымДолгам")
		ИЛИ РегистрыДляРасчета.Свойство("ПроцентныеРасходыДисконтирования") Тогда
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
		|	АналитикаУчетаПоПартнерам.Организация КАК Организация,
		//++ НЕ УТ

		//++ Локализация
		|	ВЫБОР 
		|		КОГДА НастройкиУчетаНалогаНаПрибыль.ДатаНезависимогоПризнанияДоходовРасходов ЕСТЬ NULL
		|			ИЛИ НастройкиУчетаНалогаНаПрибыль.ДатаНезависимогоПризнанияДоходовРасходов = ДАТАВРЕМЯ(1,1,1)
		|		ТОГДА
		|			ДАТАВРЕМЯ(3000,1,1)
		|		ИНАЧЕ
		|			НастройкиУчетаНалогаНаПрибыль.ДатаНезависимогоПризнанияДоходовРасходов
		|	КОНЕЦ КАК ДатаНачалаПрименения67ФЗ,
		//-- Локализация

		//-- НЕ УТ
		|	АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
		|	АналитикаУчетаПоПартнерам.Договор                                    КАК Договор,
		|	ЕСТЬNULL(
		|		АналитикаУчетаПоПартнерам.Договор.ВариантКурсаДоговора, 
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный))            КАК ВариантКурсаДоговора

		|ПОМЕСТИТЬ втКлючиАналитикиПоПартнерам
		|ИЗ
		|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		//++ НЕ УТ

		//++ Локализация
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(&НаДату,) КАК НастройкиУчетаНалогаНаПрибыль
		|	ПО АналитикаУчетаПоПартнерам.Организация = НастройкиУчетаНалогаНаПрибыль.Организация
		//-- Локализация

		//-- НЕ УТ
		|ГДЕ
		|	(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|	И (АналитикаУчетаПоПартнерам.КлючАналитики В (&АналитикаУчетаПоПартнерам) ИЛИ &ПоВсемАналитикам)
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючАналитики
		|;
		|
		|"
	КонецЕсли;
	
	ТекстЗапросаВТ = ТекстЗапросаВТ + 
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Период,
	|	КурсыВалютСрезПоследних.БазоваяВалюта,
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.КурсЧислитель,
	|	КурсыВалютСрезПоследних.КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсы
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&НаДату,) КАК КурсыВалютСрезПоследних"
	+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапросаВТ = ТекстЗапросаВТ + 
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсВалютРасчетовПоДоговорамСрезПоследних.Период,
	|	КурсВалютРасчетовПоДоговорамСрезПоследних.Договор,
	|	КурсВалютРасчетовПоДоговорамСрезПоследних.КурсЧислитель,
	|	КурсВалютРасчетовПоДоговорамСрезПоследних.КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыПоДоговорам
	|ИЗ
	|	РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&НаДату,) КАК КурсВалютРасчетовПоДоговорамСрезПоследних"
	+" 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";    	
		
	#Область УХ_Встраивание
	ТекстЗапросаВТ = ВзаиморасчетыВстраиваниеУХ.ЗаменитьТекстЗапроса_ТребуетсяПереоценка(ТекстЗапросаВТ, РегистрыДляРасчета);
	#КонецОбласти   
	
	#КонецОбласти
	
	Разделитель = Символы.ПС+Символы.ПС;
	ОБЪЕДИНИТЬ = Разделитель+"ОБЪЕДИНИТЬ ВСЕ"+Разделитель;
	ТекстЗапроса = "";
	#Область РасчетыСПоставщикамиПоДокументам
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоДокументам"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.ДолгОстаток КАК ДолгОстаток,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК ДолгКурсРазнРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ДолгОстатокРеглРасчет,
		|	Остатки.ДолгРеглОстаток КАК ОстатокРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК ДолгКурсРазнУпр,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ДолгОстатокУпрРасчет,
		|	Остатки.ДолгУпрОстаток КАК ДолгОстатокУпр,
		|
		|	Остатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток КАК ПредоплатаКурсРазнРегл,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ПредоплатаОстатокРеглРасчет,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ПредоплатаОстатокРегл,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток КАК ПредоплатаКурсРазнУпр,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ПредоплатаОстатокУпрРасчет,
		|	Остатки.ПредоплатаУпрОстаток КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ЗаказПоставщику КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.ДолгОстаток = 0 И (Остатки.ДолгРеглОстаток <> 0 ИЛИ Остатки.ДолгУпрОстаток <> 0))
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И Остатки.КВозвратуОстаток = 0 И (Остатки.ПредоплатаРеглОстаток <> 0 ИЛИ Остатки.ПредоплатаУпрОстаток <> 0))";
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыСКлиентамиПоДокументам
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоДокументам"" КАК РегистрНакопления,
		|	Остатки.ДолгОстаток КАК ДолгОстаток,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК КурсРазнРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.ДолгРеглОстаток КАК ОстатокРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК КурсРазнУпр,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.ДолгУпрОстаток КАК ОстатокУпр,
		|
		|	Остатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток КАК ПредоплатаКурсРазнРегл,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ПредоплатаОстатокРеглРасчет,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ПредоплатаОстатокРегл,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток КАК ПредоплатаКурсРазнУпр,
		|	Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ПредоплатаОстатокУпрРасчет,
		|	Остатки.ПредоплатаУпрОстаток КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ЗаказКлиента КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.ДолгОстаток = 0 И (Остатки.ДолгРеглОстаток <> 0 ИЛИ Остатки.ДолгУпрОстаток <> 0))
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И Остатки.КВозвратуОстаток = 0 И (Остатки.ПредоплатаРеглОстаток <> 0 ИЛИ Остатки.ПредоплатаУпрОстаток <> 0))";
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыСПоставщикамиПоСрокам
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам") Тогда
		
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""РасчетыСПоставщикамиПоСрокам""  КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.ДолгОстаток               КАК ДолгОстаток,
		|	Остатки.ДолгУпрОстаток            КАК ДолгУпрОстаток,
		|	Остатки.ДолгРеглОстаток           КАК ДолгРеглОстаток,
		|	Остатки.ПредоплатаОстаток         КАК ПредоплатаОстаток,
		|	Остатки.ПредоплатаУпрОстаток      КАК ПредоплатаУпрОстаток,
		|	Остатки.ПредоплатаРеглОстаток     КАК ПредоплатаРеглОстаток,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация             КАК Организация,
		//++ НЕ УТ

		//++ Локализация
		|	Аналитика.ДатаНачалаПрименения67ФЗ КАК ДатаНачалаПрименения67ФЗ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	Остатки.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	Аналитика.ВариантКурсаДоговора    КАК ВариантКурсаДоговора,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсРегл.КурсЧислитель
		|	КОНЕЦ                             КАК КурсЧислительРегл,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсРегл.КурсЗнаменатель
		|	КОНЕЦ                             КАК КурсЗнаменательРегл,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсУпр.КурсЧислитель
		|	КОНЕЦ                             КАК КурсЧислительУпр,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсУпр.КурсЗнаменатель
		|	КОНЕЦ                             КАК КурсЗнаменательУпр
		|
		|ПОМЕСТИТЬ втРасчетыСПоставщикамиПоСрокамОстаткиСКурсами
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыПоДоговорам КАК КурсДоговора
		|		ПО Аналитика.Договор = КурсДоговора.Договор
		|
		|ГДЕ
		|	Аналитика.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
		|"
		+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Остатки.РегистрНакопления         КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.ДолгОстаток КАК ДолгОстаток,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ДолгРеглОстаток КАК КурсРазнРегл,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК ОстатокРеглРасчет,
		|	Остатки.ДолгРеглОстаток КАК ОстатокРегл,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ДолгУпрОстаток КАК КурсРазнУпр,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК ОстатокУпрРасчет,
		|	Остатки.ДолгУпрОстаток КАК ОстатокУпр,
		|
		|	Остатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ПредоплатаРеглОстаток КАК ПредоплатаКурсРазнРегл,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК ПредоплатаОстатокРеглРасчет,
		|	Остатки.ПредоплатаРеглОстаток КАК ПредоплатаОстатокРегл,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ПредоплатаУпрОстаток КАК ПредоплатаКурсРазнУпр,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК ПредоплатаОстатокУпрРасчет,
		|	Остатки.ПредоплатаУпрОстаток КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	ВЫБОР КОГДА ОстаткиНУ.СуммаНУОстаток ЕСТЬ NULL 
		|		ТОГДА 0
		|		ИНАЧЕ Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл
		|	КОНЕЦ КАК ОстатокНУРасчет,
		|	ЕСТЬNULL(ОстаткиНУ.СуммаНУОстаток,""NULL"") КАК ОстатокНУ,
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.Организация               КАК Организация,
		|	Остатки.ОбъектРасчетов            КАК Объект,
		|	Остатки.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаВозникновения
		|ИЗ
		|	втРасчетыСПоставщикамиПоСрокамОстаткиСКурсами КАК Остатки
		//++ НЕ УТ

		//++ Локализация
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиНУ.Остатки(
		|		&ГраницаКонецПериода,
		|		Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
		|	) КАК ОстаткиНУ
		|	ПО Остатки.АналитикаУчетаПоПартнерам = ОстаткиНУ.АналитикаУчетаПоПартнерам
		|	И Остатки.ОбъектРасчетов = ОстаткиНУ.ОбъектРасчетов
		|	И Остатки.Валюта = ОстаткиНУ.Валюта
		|	И Остатки.РасчетныйДокумент = ОстаткиНУ.РасчетныйДокумент
		//-- Локализация

		//-- НЕ УТ
		|
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.ДолгОстаток = 0 И (Остатки.ДолгРеглОстаток <> 0 ИЛИ Остатки.ДолгУпрОстаток <> 0))
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И (Остатки.ПредоплатаРеглОстаток <> 0 ИЛИ Остатки.ПредоплатаУпрОстаток <> 0))
		//++ НЕ УТ

		//++ Локализация
		|	ИЛИ (ЕСТЬNULL(ОстаткиНУ.СуммаНУОстаток, 0) <> 0
		|			И Остатки.ДатаНачалаПрименения67ФЗ <= &НаДату 
		|			И (ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) > 0.01
		|				ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) < -0.01)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиНУ"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	0 КАК ДолгОстаток,
		|	0 КАК ДолгКурсРазнРегл,
		|	0 КАК ДолгОстатокРеглРасчет,
		|	Остатки.ДолгОстаток КАК ДолгОстатокРегл,
		|	0 КАК ДолгКурсРазнУпр,
		|	0 КАК ДолгОстатокУпрРасчет,
		|	0 КАК ДолгОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		|
		|	0 КАК ОстатокНУРасчет,
		|	ОстаткиНУ.СуммаНУОстаток КАК ОстатокНУ,
		|	-ОстаткиНУ.СуммаНУОстаток КАК КурсРазнНУ,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ОбъектРасчетов КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиНУ.Остатки(
		|		&ГраницаКонецПериода,
		|		Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
		|	) КАК ОстаткиНУ
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
		|	) КАК Остатки
		|	ПО ОстаткиНУ.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам
		|	И ОстаткиНУ.ОбъектРасчетов = Остатки.ОбъектРасчетов
		|	И ОстаткиНУ.Валюта = Остатки.Валюта
		|	И ОстаткиНУ.РасчетныйДокумент = Остатки.РасчетныйДокумент
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО ОстаткиНУ.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|ГДЕ
		|	Остатки.ДолгОстаток = 0 И ОстаткиНУ.СуммаНУОстаток <> 0
		//-- Локализация

		//-- НЕ УТ
		|";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыСКлиентамиПоСрокам
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам") Тогда
		
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""РасчетыСКлиентамиПоСрокам""     КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.ДолгОстаток               КАК ДолгОстаток,
		|	Остатки.ДолгУпрОстаток            КАК ДолгУпрОстаток,
		|	Остатки.ДолгРеглОстаток           КАК ДолгРеглОстаток,
		|	Остатки.ПредоплатаОстаток         КАК ПредоплатаОстаток,
		|	Остатки.ПредоплатаУпрОстаток      КАК ПредоплатаУпрОстаток,
		|	Остатки.ПредоплатаРеглОстаток     КАК ПредоплатаРеглОстаток,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация             КАК Организация,
		//++ НЕ УТ

		//++ Локализация
		|	Аналитика.ДатаНачалаПрименения67ФЗ КАК ДатаНачалаПрименения67ФЗ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	Остатки.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	Аналитика.ВариантКурсаДоговора      КАК ВариантКурсаДоговора,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсРегл.КурсЧислитель
		|	КОНЕЦ                             КАК КурсЧислительРегл,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсРегл.КурсЗнаменатель
		|	КОНЕЦ                             КАК КурсЗнаменательРегл,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсУпр.КурсЧислитель
		|	КОНЕЦ                             КАК КурсЧислительУпр,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсУпр.КурсЗнаменатель
		|	КОНЕЦ                             КАК КурсЗнаменательУпр
		|
		|ПОМЕСТИТЬ втРасчетыСКлиентамиПоСрокамОстаткиСКурсами
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыПоДоговорам КАК КурсДоговора
		|		ПО Аналитика.Договор = КурсДоговора.Договор
		|
		|ГДЕ
		|	Аналитика.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
		|"
		+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Остатки.РегистрНакопления         КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.ДолгОстаток КАК ДолгОстаток,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ДолгРеглОстаток КАК ДолгКурсРазнРегл,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК ДолгОстатокРеглРасчет,
		|	Остатки.ДолгРеглОстаток КАК ДолгОстатокРегл,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ДолгУпрОстаток КАК ДолгКурсРазнУпр,
		|	Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК ДолгОстатокУпрРасчет,
		|	Остатки.ДолгУпрОстаток КАК ДолгОстатокУпр,
		|
		|	Остатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ПредоплатаРеглОстаток КАК ПредоплатаКурсРазнРегл,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК ПредоплатаОстатокРеглРасчет,
		|	Остатки.ПредоплатаРеглОстаток КАК ПредоплатаОстатокРегл,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ПредоплатаУпрОстаток КАК ПредоплатаКурсРазнУпр,
		|	Остатки.ПредоплатаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК ПредоплатаОстатокУпрРасчет,
		|	Остатки.ПредоплатаУпрОстаток КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	ВЫБОР КОГДА ОстаткиНУ.СуммаНУОстаток ЕСТЬ NULL 
		|		ТОГДА 0
		|		ИНАЧЕ Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл
		|	КОНЕЦ КАК ОстатокНУРасчет,
		|	ЕСТЬNULL(ОстаткиНУ.СуммаНУОстаток,""NULL"") КАК ОстатокНУ,
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.Организация               КАК Организация,
		|	Остатки.ОбъектРасчетов            КАК Объект,
		|	Остатки.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаВозникновения
		|ИЗ
		|	втРасчетыСКлиентамиПоСрокамОстаткиСКурсами КАК Остатки
		//++ НЕ УТ

		//++ Локализация
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиНУ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК ОстаткиНУ
		|	ПО Остатки.АналитикаУчетаПоПартнерам = ОстаткиНУ.АналитикаУчетаПоПартнерам
		|	И Остатки.ОбъектРасчетов = ОстаткиНУ.ОбъектРасчетов
		|	И Остатки.Валюта = ОстаткиНУ.Валюта
		|	И Остатки.РасчетныйДокумент = ОстаткиНУ.РасчетныйДокумент
		//-- Локализация

		//-- НЕ УТ
		|
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ДолгУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ДолгРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.ДолгОстаток = 0 И (Остатки.ДолгРеглОстаток <> 0 ИЛИ Остатки.ДолгУпрОстаток <> 0))
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И (Остатки.ПредоплатаРеглОстаток <> 0 ИЛИ Остатки.ПредоплатаУпрОстаток <> 0))
		//++ НЕ УТ

		//++ Локализация
		|	ИЛИ (ЕСТЬNULL(ОстаткиНУ.СуммаНУОстаток, 0) <> 0 
		|			И Остатки.ДатаНачалаПрименения67ФЗ <= &НаДату 
		|			И (ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) > 0.01
		|				ИЛИ ВЫРАЗИТЬ(Остатки.ДолгОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) < -0.01)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиНУ"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	0 КАК ДолгОстаток,
		|	0 КАК ДолгОстатокРеглРасчет,
		|	Остатки.ДолгОстаток КАК ДолгОстатокРегл,
		|	0 КАК ДолгКурсРазнРегл,
		|	0 КАК ДолгОстатокУпрРасчет,
		|	0 КАК ДолгОстатокУпр,
		|	0 КАК ДолгКурсРазнУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|
		|	0 КАК ОстатокНУРасчет,
		|	ОстаткиНУ.СуммаНУОстаток КАК ОстатокНУ,
		|	-ОстаткиНУ.СуммаНУОстаток КАК КурсРазнНУ,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ОбъектРасчетов КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиНУ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК ОстаткиНУ
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|	ПО ОстаткиНУ.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам
		|	И ОстаткиНУ.ОбъектРасчетов = Остатки.ОбъектРасчетов
		|	И ОстаткиНУ.Валюта = Остатки.Валюта
		|	И ОстаткиНУ.РасчетныйДокумент = Остатки.РасчетныйДокумент
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО ОстаткиНУ.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|ГДЕ
		|	Остатки.ДолгОстаток = 0 И ОстаткиНУ.СуммаНУОстаток <> 0
		//-- Локализация

		//-- НЕ УТ
		|";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваБезналичные
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваБезналичные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваБезналичные"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.БанковскийСчет КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (БанковскийСчет В (&БанковскиеСчета) ИЛИ &ПоВсемСчетам)
		|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.БанковскийСчет.ВалютаДенежныхСредств = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.СуммаОстаток = 0 И (Остатки.СуммаРеглОстаток <> 0 ИЛИ Остатки.СуммаУпрОстаток <> 0))";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваНаличные
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваНаличные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.Касса КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Касса.ВалютаДенежныхСредств = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.СуммаОстаток = 0 И (Остатки.СуммаРеглОстаток <> 0 ИЛИ Остатки.СуммаУпрОстаток <> 0))";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваВКассахККМ
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваВКассахККМ") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВКассахККМ"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.КассаККМ КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (КассаККМ В (&КассыККМ) ИЛИ &ПоВсемКассамККМ)
		|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ КассаККМ.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.КассаККМ.ВалютаДенежныхСредств = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.СуммаОстаток = 0 И (Остатки.СуммаРеглОстаток <> 0 ИЛИ Остатки.СуммаУпрОстаток <> 0))";
	КонецЕсли;
	#КонецОбласти
	
	#Область ДенежныеСредстваУПодотчетныхЛиц
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваУПодотчетныхЛиц") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваУПодотчетныхЛиц"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.ЦельВыдачи КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.ПодотчетноеЛицо КАК ДенежныеСредства,
		|	Остатки.Подразделение КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ПодотчетноеЛицо В (&ФизическиеЛица) ИЛИ &ПоВсемФизЛицам)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.СуммаОстаток < 0
		|	И (ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) < -0.01)
		|	ИЛИ (Остатки.СуммаОстаток = 0 И (Остатки.СуммаРеглОстаток <> 0 ИЛИ Остатки.СуммаУпрОстаток <> 0))";
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыПоФинансовымИнструментам
	Если РегистрыДляРасчета.Свойство("РасчетыПоФинансовымИнструментам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыПоФинансовымИнструментам"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокНУРасчет,
		|	ОстаткиНУ.СуммаНУОстаток КАК ОстатокНУ,
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.Договор КАК Договор,
		|	Остатки.ТипСуммы КАК ТипСуммы,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
		|		&ГраницаКонецПериода,
		|		(ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|		И (Договор.ВалютаВзаиморасчетов <> &ВалютаУпрУчета
		|				ИЛИ Договор.ВалютаВзаиморасчетов <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		//++ НЕ УТ

		//++ Локализация
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоФинансовымИнструментамНУ.Остатки(
		|		&ГраницаКонецПериода,
		|		(ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|		И Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
		|	) КАК ОстаткиНУ
		|	ПО Остатки.АналитикаУчетаПоПартнерам = ОстаткиНУ.АналитикаУчетаПоПартнерам
		|		И Остатки.Договор = ОстаткиНУ.Договор
		|		И Остатки.ТипСуммы = ОстаткиНУ.ТипСуммы
		|		И Остатки.РасчетныйДокумент = ОстаткиНУ.РасчетныйДокумент
		|		И Остатки.Валюта = ОстаткиНУ.Валюта
		//-- Локализация

		//-- НЕ УТ
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	(ВЫБОР
		|		КОГДА Остатки.Договор.ХарактерДоговора = &ХарактерДоговораАренды
		//++ НЕ УТ 
		|				И НЕ Остатки.Договор.УчитыватьПредметыАрендыВУпрУчете
		//-- НЕ УТ
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|			ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	КОНЕЦ
		//++ НЕ УТ

		//++ Локализация
		|	ИЛИ (ЕСТЬNULL(ОстаткиНУ.СуммаНУОстаток, 0) <> 0
		|			И Аналитика.ДатаНачалаПрименения67ФЗ <= &НаДату
		|			И (ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) > 0.01
		|				ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - ОстаткиНУ.СуммаНУОстаток КАК ЧИСЛО(31,2)) < -0.01)
		|		)
		//-- Локализация

		//-- НЕ УТ
		|	ИЛИ ВЫБОР
		|		КОГДА Остатки.Договор.ХарактерДоговора = &ХарактерДоговораАренды
		//++ НЕ УТ 
		|				И НЕ Остатки.Договор.УчитыватьПредметыАрендыВРеглУчете
		//-- НЕ УТ
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|			ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	КОНЕЦ)
		|	И (Остатки.ТипСуммы В (&ОбеспечительныйПлатеж) И Остатки.СуммаОстаток = 0 ИЛИ Остатки.ТипСуммы НЕ В (&ОбеспечительныйПлатеж))
		//++ НЕ УТ

		//++ Локализация
		|	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыПоФинансовымИнструментамНУ"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	0 КАК СуммаОстаток,
		|	0 КАК КурсРазнРегл,
		|	0 КАК ОстатокРеглРасчет,
		|	0 КАК ОстатокРегл,
		|	0 КАК КурсРазнУпр,
		|	0 КАК ОстатокУпрРасчет,
		|	0 КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		|
		|	0 КАК ОстатокНУРасчет,
		|	ОстаткиНУ.СуммаНУОстаток КАК ОстатокНУ,
		|	-ОстаткиНУ.СуммаНУОстаток КАК КурсРазнНУ,
		|	ОстаткиНУ.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	ОстаткиНУ.Договор КАК Договор,
		|	ОстаткиНУ.ТипСуммы КАК Типсуммы,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	 РегистрНакопления.РасчетыПоФинансовымИнструментамНУ.Остатки(
		|		&ГраницаКонецПериода,
		|		(ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|		И (Договор.ВалютаВзаиморасчетов <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК ОстаткиНУ
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
		|		&ГраницаКонецПериода,
		|		(ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|		И (Договор.ВалютаВзаиморасчетов <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|	ПО ОстаткиНУ.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам
		|		И ОстаткиНУ.Договор = Остатки.Договор
		|		И ОстаткиНУ.ТипСуммы = Остатки.ТипСуммы
		|		И ОстаткиНУ.РасчетныйДокумент = Остатки.РасчетныйДокумент
		|		И ОстаткиНУ.Валюта = Остатки.Валюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО ОстаткиНУ.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|ГДЕ
		|	Остатки.СуммаОстаток = 0
		|	И ОстаткиНУ.СуммаНУОстаток <> 0
		|	И (Остатки.ТипСуммы В (&ОбеспечительныйПлатеж) И Остатки.СуммаОстаток = 0 ИЛИ Остатки.ТипСуммы НЕ В (&ОбеспечительныйПлатеж))
		//-- Локализация

		//-- НЕ УТ
		|";
	КонецЕсли;
	#КонецОбласти
	//++ НЕ УТ

	//++ Локализация
	#Область РезервыПоСомнительнымДолгам
	Если РегистрыДляРасчета.Свойство("РезервыПоСомнительнымДолгам") Тогда
		
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""РезервыПоСомнительнымДолгам""   КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.СуммаОстаток              КАК СуммаОстаток,
		|	Остатки.СуммаУпрОстаток           КАК СуммаУпрОстаток,
		|	Остатки.СуммаРеглОстаток          КАК СуммаРеглОстаток,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ТипСуммы                  КАК ТипСуммы,
		|	Аналитика.Организация             КАК Организация,
		|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	Остатки.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	Аналитика.ВариантКурсаДоговора      КАК ВариантКурсаДоговора,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсРегл.КурсЧислитель
		|	КОНЕЦ                             КАК КурсЧислительРегл,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсРегл.КурсЗнаменатель
		|	КОНЕЦ                             КАК КурсЗнаменательРегл,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсУпр.КурсЧислитель
		|	КОНЕЦ                             КАК КурсЧислительУпр,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсУпр.КурсЗнаменатель
		|	КОНЕЦ                             КАК КурсЗнаменательУпр
		|
		|ПОМЕСТИТЬ втРезервыПоСомнительнымДолгамОстаткиСКурсами
		|
		|ИЗ
		|	РегистрНакопления.РезервыПоСомнительнымДолгам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыПоДоговорам КАК КурсДоговора
		|		ПО Аналитика.Договор = КурсДоговора.Договор
		|
		|ГДЕ
		|	Аналитика.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
		|"
		+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Остатки.РегистрНакопления         КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.СуммаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК ОстатокРеглРасчет,
		|	Остатки.СуммаРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК ОстатокУпрРасчет,
		|	Остатки.СуммаУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|
		|	0                                 КАК ОстатокНУРасчет,
		|	0                                 КАК ОстатокНУ,
		|	0                                 КАК КурсРазнНУ,
		|
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ТипСуммы                  КАК ТипСуммы,
		|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	Остатки.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаВозникновения
		|ИЗ
		|	втРезервыПоСомнительнымДолгамОстаткиСКурсами КАК Остатки
		|
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.СуммаОстаток = 0 И Остатки.СуммаУпрОстаток <> 0)
		|";
		
	КонецЕсли;
	#КонецОбласти
	//-- Локализация

	//-- НЕ УТ
	
	#Область ПроцентныеРасходыДисконтирования
	Если РегистрыДляРасчета.Свойство("ПроцентныеРасходыДисконтирования") Тогда
		
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ПроцентныеРасходыДисконтирования""    КАК РегистрНакопления,
		|	Остатки.Валюта                          КАК Валюта,
		|	Остатки.СуммаДисконтированияОстаток     КАК СуммаДисконтированияОстаток,
		|	Остатки.СуммаДисконтированияУпрОстаток  КАК СуммаДисконтированияУпрОстаток,
		|	Остатки.СуммаДисконтированияРеглОстаток КАК СуммаДисконтированияРеглОстаток,
		|	Остатки.АналитикаУчетаПоПартнерам       КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ОбъектРасчетов                  КАК ОбъектРасчетов,
		|	Остатки.РасчетныйДокумент               КАК РасчетныйДокумент,
		|	Аналитика.ВариантКурсаДоговора          КАК ВариантКурсаДоговора,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсРегл.КурсЧислитель
		|	КОНЕЦ                                   КАК КурсЧислительРегл,
		|	ВЫБОР 
		|		КОГДА Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсРегл.КурсЗнаменатель
		|	КОНЕЦ                                   КАК КурсЗнаменательРегл,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсУпр.КурсЧислитель
		|	КОНЕЦ                                   КАК КурсЧислительУпр,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Аналитика.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсУпр.КурсЗнаменатель
		|	КОНЕЦ                                   КАК КурсЗнаменательУпр
		|
		|ПОМЕСТИТЬ втПроцентныеРасходыДисконтированияОстаткиСКурсами
		|
		|ИЗ
		|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыПоДоговорам КАК КурсДоговора
		|		ПО Аналитика.Договор = КурсДоговора.Договор
		|
		|ГДЕ
		|	Аналитика.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
		|"
		+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Остатки.РегистрНакопления         КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.СуммаДисконтированияОстаток КАК СуммаОстаток,
		|	Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.СуммаДисконтированияРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК ОстатокРеглРасчет,
		|	Остатки.СуммаДисконтированияРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.СуммаДисконтированияУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК ОстатокУпрРасчет,
		|	Остатки.СуммаДисконтированияУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0                                 КАК ОстатокНУРасчет,
		|	0                                 КАК ОстатокНУ,
		|	0                                 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО                      КАК Организация,
		|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	Остатки.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаВозникновения
		|ИЗ
		|	втПроцентныеРасходыДисконтированияОстаткиСКурсами КАК Остатки
		|
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.СуммаДисконтированияУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.СуммаДисконтированияУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.СуммаДисконтированияРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.СуммаДисконтированияОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.СуммаДисконтированияРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ (Остатки.СуммаДисконтированияОстаток = 0 И (Остатки.СуммаДисконтированияРеглОстаток <> 0 ИЛИ Остатки.СуммаДисконтированияУпрОстаток <> 0))
		|";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ТоварыКОформлениюОтчетовКомитенту
	Если РегистрыДляРасчета.Свойство("ТоварыКОформлениюОтчетовКомитенту") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ТоварыКОформлениюОтчетовКомитенту"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаВыручкиОстаток КАК СуммаОстаток,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаВыручкиРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаВыручкиРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаВыручкиУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаВыручкиУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнУпр,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Остатки.Организация КАК Организация,
		|	Остатки.ВидЗапасов КАК ВидЗапасов,
		|	Остатки.ДокументПродажи КАК ДокументПродажи,
		|	Остатки.НомерГТД КАК НомерГТД,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета
		|				ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|		ПО Остатки.ВидЗапасов = ВидыЗапасов.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ПО ВидыЗапасов.Договор = Договоры.Ссылка
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)
		|	И (ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаВыручкиУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаВыручкиУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаВыручкиРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаВыручкиРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|		ИЛИ (Остатки.СуммаВыручкиОстаток = 0 И (Остатки.СуммаВыручкиРеглОстаток <> 0 ИЛИ Остатки.СуммаВыручкиУпрОстаток <> 0)))";
	КонецЕсли;
	#КонецОбласти
	
	#Область ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках
	Если РегистрыДляРасчета.Свойство("ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаСНДСОстаток КАК СуммаОстаток,
		|	Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		|	0 КАК ПредоплатаКурсРазнУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Организация КАК Организация,
		|	Остатки.Назначение КАК Назначение,
		|	Остатки.ДокументПриобретения КАК ДокументПриобретения,
		|	Остатки.Характеристика КАК Характеристика,
		|	Остатки.НомерГТД КАК НомерГТД
		|ИЗ
		|	РегистрНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета
		|				ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО Остатки.Назначение = Назначения.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ПО Назначения.Договор = Договоры.Ссылка
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	ЕСТЬNULL(Договоры.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ)
		|	И (ВЫРАЗИТЬ(Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаСНДСОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|		ИЛИ (Остатки.СуммаСНДСОстаток = 0 И (Остатки.СуммаРеглОстаток <> 0 ИЛИ Остатки.СуммаУпрОстаток <> 0)))";
	КонецЕсли;
	#КонецОбласти
	
	#Область УслугиКОформлениюОтчетовПринципалу
	Если РегистрыДляРасчета.Свойство("УслугиКОформлениюОтчетовПринципалу") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""УслугиКОформлениюОтчетовПринципалу"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаВыручкиОстаток КАК СуммаОстаток,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаВыручкиРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокРеглРасчет,
		|	Остатки.СуммаВыручкиРеглОстаток КАК ОстатокРегл,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаВыручкиУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель КАК ОстатокУпрРасчет,
		|	Остатки.СуммаВыручкиУпрОстаток КАК ОстатокУпр,
		|
		|	0 КАК ПредоплатаОстаток,
		|	0 КАК ПредоплатаОстатокРеглРасчет,
		|	0 КАК ПредоплатаОстатокРегл,
		|	0 КАК ПредоплатаКурсРазнРегл,
		|	0 КАК ПредоплатаОстатокУпрРасчет,
		|	0 КАК ПредоплатаОстатокУпр,
		|	0 КАК ПредоплатаКурсРазнУпр,
		//++ НЕ УТ

		//++ Локализация
		|	0 КАК ОстатокНУРасчет,
		|	0 КАК ОстатокНУ,
		|	0 КАК КурсРазнНУ,
		//-- Локализация

		//-- НЕ УТ
		|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Остатки.Организация КАК Организация,
		|	Остатки.Соглашение КАК Соглашение,
		|	Остатки.ДокументПродажи КАК ДокументПродажи,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета
		|				ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК Соглашения
		|		ПО Остатки.Соглашение = Соглашения.Ссылка
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	ЕСТЬNULL(Соглашения.ПереоцениватьУслугиКОтчетуКомитенту, ЛОЖЬ)
		|	И (ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаВыручкиУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаВыручкиУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаВыручкиРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|		ИЛИ ВЫРАЗИТЬ(Остатки.СуммаВыручкиОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаВыручкиРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|		ИЛИ (Остатки.СуммаВыручкиОстаток = 0 И (Остатки.СуммаВыручкиРеглОстаток <> 0 ИЛИ Остатки.СуммаВыручкиУпрОстаток <> 0)))";
	КонецЕсли;
	#КонецОбласти
	//++ НЕ УТ
	
	#Область ИнвестицииВАренду
	Если РегистрыДляРасчета.Свойство("ИнвестицииВАренду") Тогда
		
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ИнвестицииВАренду""                   КАК РегистрНакопления,
		|	Остатки.Валюта                          КАК Валюта,
		|	Остатки.АрендныеПлатежиОстаток          КАК АрендныеПлатежиОстаток,
		|	Остатки.АрендныеПлатежиУпрОстаток       КАК АрендныеПлатежиУпрОстаток,
		|	Остатки.АрендныеПлатежиРеглОстаток      КАК АрендныеПлатежиРеглОстаток,
		|	Остатки.ПроцентныйДисконтОстаток        КАК ПроцентныйДисконтОстаток,
		|	Остатки.ПроцентныйДисконтУпрОстаток     КАК ПроцентныйДисконтУпрОстаток,
		|	Остатки.ПроцентныйДисконтРеглОстаток    КАК ПроцентныйДисконтРеглОстаток,
		|	Остатки.Организация                     КАК Организация,
		|	Остатки.Договор                         КАК Договор,
		|	Остатки.ОсновноеСредство                КАК ОсновноеСредство,
		|	Остатки.ГруппаФинансовогоУчета          КАК ГруппаФинансовогоУчета,
		|	Договоры.ВариантКурсаДоговора           КАК ВариантКурсаДоговора,
		|	ВЫБОР 
		|		КОГДА Договоры.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсРегл.КурсЧислитель
		|	КОНЕЦ                                   КАК КурсЧислительРегл,
		|	ВЫБОР 
		|		КОГДА Договоры.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсРегл.КурсЗнаменатель
		|	КОНЕЦ                                   КАК КурсЗнаменательРегл,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Договоры.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЧислитель,1)
		|		ИНАЧЕ КурсУпр.КурсЧислитель
		|	КОНЕЦ                                   КАК КурсЧислительУпр,
		|	ВЫБОР 
		|		КОГДА Остатки.Валюта = &ВалютаУпрУчета
		|			И Договоры.ВариантКурсаДоговора 
		|				= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
		|		ТОГДА ЕСТЬNULL(КурсДоговора.КурсЗнаменатель,1)
		|		ИНАЧЕ КурсУпр.КурсЗнаменатель
		|	КОНЕЦ                                   КАК КурсЗнаменательУпр
		|
		|ПОМЕСТИТЬ втИнвестицииВАрендуОстаткиСКурсами
		|
		|ИЗ
		|	РегистрНакопления.ИнвестицииВАренду.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|	ПО Остатки.Договор = Договоры.Ссылка
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКурсыПоДоговорам КАК КурсДоговора
		|		ПО Остатки.Договор = КурсДоговора.Договор
		|
		|ГДЕ
		|	Договоры.ВариантКурсаДоговора <> ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
		|"
		+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Остатки.РегистрНакопления         КАК РегистрНакопления,
		|	Остатки.Валюта                    КАК Валюта,
		|	Остатки.АрендныеПлатежиОстаток КАК АрендныеПлатежиОстаток,
		|	Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.АрендныеПлатежиРеглОстаток КАК АрендныеПлатежиКурсРазнРегл,
		|	Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК АрендныеПлатежиОстатокРеглРасчет,
		|	Остатки.АрендныеПлатежиРеглОстаток КАК АрендныеПлатежиОстатокРегл,
		|	Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.АрендныеПлатежиУпрОстаток КАК АрендныеПлатежиКурсРазнУпр,
		|	Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК АрендныеПлатежиОстатокУпрРасчет,
		|	Остатки.АрендныеПлатежиУпрОстаток КАК АрендныеПлатежиОстатокУпр,
		|	
		|	Остатки.ПроцентныйДисконтОстаток КАК ПроцентныйДисконтОстаток,
		|	Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ПроцентныйДисконтРеглОстаток КАК ПроцентныйДисконтКурсРазнРегл,
		|	Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл КАК ПроцентныйДисконтОстатокРеглРасчет,
		|	Остатки.ПроцентныйДисконтРеглОстаток КАК ПроцентныйДисконтОстатокРегл,
		|	Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ПроцентныйДисконтУпрОстаток КАК ПроцентныйДисконтКурсРазнУпр,
		|	Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр КАК ПроцентныйДисконтОстатокУпрРасчет,
		|	Остатки.ПроцентныйДисконтУпрОстаток КАК ПроцентныйДисконтОстатокУпр,
		//++ Локализация
		|	0                                 КАК ОстатокНУРасчет,
		|	0                                 КАК ОстатокНУ,
		|	0                                 КАК КурсРазнНУ,
		//-- Локализация
		|	Остатки.ГруппаФинансовогоУчета    КАК ГруппаФинансовогоУчета,
		|	Остатки.Организация               КАК Организация,
		|	Остатки.ОсновноеСредство          КАК ОсновноеСредство,
		|	Остатки.Договор                   КАК Договор,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО                      КАК ДатаВозникновения
		|ИЗ
		|	втИнвестицииВАрендуОстаткиСКурсами КАК Остатки
		|
		|ГДЕ
		|	ВЫРАЗИТЬ(Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.АрендныеПлатежиУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.АрендныеПлатежиУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.АрендныеПлатежиРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.АрендныеПлатежиОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.АрендныеПлатежиРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ПроцентныйДисконтРеглОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл - Остатки.ПроцентныйДисконтРеглОстаток КАК ЧИСЛО(31,2)) < -0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ПроцентныйДисконтУпрОстаток КАК ЧИСЛО(31,2)) > 0.01
		|	ИЛИ ВЫРАЗИТЬ(Остатки.ПроцентныйДисконтОстаток * Остатки.КурсЧислительРегл / Остатки.КурсЗнаменательРегл * Остатки.КурсЗнаменательУпр / Остатки.КурсЧислительУпр - Остатки.ПроцентныйДисконтУпрОстаток КАК ЧИСЛО(31,2)) < -0.01
		|";
		
	КонецЕсли;
	#КонецОбласти
	//-- НЕ УТ
	
	РасчетКурсовыхРазницЛокализация.ДополнитьПроверкуТребуетсяПереоценка(РегистрыДляРасчета, ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТ + ТекстЗапроса;
	Если ВернутьОрганизацииКПереоценке Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1", "РАЗЛИЧНЫЕ");
	КонецЕсли;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату",              КонецМесяца(Период));
	Запрос.УстановитьПараметр("ГраницаКонецПериода", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаУпрУчета",      Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации",      НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемАналитикам",    НЕ ЗначениеЗаполнено(Запрос.Параметры.АналитикаУчетаПоПартнерам));
	Запрос.УстановитьПараметр("БанковскиеСчета",     ПолучитьАналитику("БанковскиеСчета", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемСчетам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.БанковскиеСчета));
	Запрос.УстановитьПараметр("Кассы",               ПолучитьАналитику("Кассы", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.Кассы));
	Запрос.УстановитьПараметр("КассыККМ",            ПолучитьАналитику("КассыККМ", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассамККМ",     НЕ ЗначениеЗаполнено(Запрос.Параметры.КассыККМ));
	Запрос.УстановитьПараметр("ФизическиеЛица",      ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемФизЛицам",      НЕ ЗначениеЗаполнено(Запрос.Параметры.ФизическиеЛица));
	Запрос.УстановитьПараметр("ТипыСумм",            ПолучитьАналитику("ТипыСумм", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемТипамСумм",     НЕ ЗначениеЗаполнено(Запрос.Параметры.ТипыСумм));
	
	Запрос.УстановитьПараметр("ХарактерДоговораАренды", Перечисления.ХарактерыДоговоровФинансовыхИнструментов.Аренда);
	Запрос.УстановитьПараметр("ОбеспечительныйПлатеж", Неопределено);
	//++ НЕ УТ
	Запрос.УстановитьПараметр("ОбеспечительныйПлатеж", Перечисления.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж);
	//-- НЕ УТ
	
	Если ДляОтладки <> Неопределено Тогда
		ДляОтладки.Вставить("ТребуетсяПереоценка", Запрос);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если ВернутьОрганизацииКПереоценке Тогда
		КурсовыеРазницы = РезультатЗапроса.Выгрузить();// нерассчитанные курсовые разницы
		КурсовыеРазницы.Свернуть("Организация");
		Организации = КурсовыеРазницы.ВыгрузитьКолонку("Организация");
		Возврат Организации;
	КонецЕсли;
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Требуется переоценка взаиморасчетов.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации, Массив Из СправочникСсылка.Организации - 
//  Период - Дата - Число месяца переоценки
//  АналитикаРасчета - Неопределено - Аналитика расчета
// 
// Возвращаемое значение:
//  Булево, Массив из СправочникСсылка.Организации - Требуется переоценка взаиморасчетов
Функция ТребуетсяПереоценкаВзаиморасчетов(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	РегистрыДляРасчета = Новый Структура;
	Если НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		РегистрыДляРасчета.Вставить("РасчетыСПоставщикамиПоДокументам");
		РегистрыДляРасчета.Вставить("РасчетыСКлиентамиПоДокументам");
	Иначе
		РегистрыДляРасчета.Вставить("РасчетыСПоставщикамиПоСрокам");
		РегистрыДляРасчета.Вставить("РасчетыСКлиентамиПоСрокам");
	КонецЕсли;
	
	Возврат ТребуетсяПереоценка(Организация, Период, РегистрыДляРасчета, АналитикаРасчета);
	
КонецФункции

Процедура УдалитьДвиженияАналитики(ДокументСсылка, ИмяРегистра, АналитикаРасчета)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("Кассы", АналитикаРасчета));
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор = &Регистратор
	|	И НЕ (ДанныеРегистра.Касса В (&АналитикаРасчета))
	|	И &ВсеКромеАналитикиРасчета";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДенежныеСредстваНаличные", ИмяРегистра);
	АналитикаУчетаПоПартнерам = ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ТипыСумм = ПолучитьАналитику("ТипыСумм", АналитикаРасчета);
	Если ИмяРегистра = "РасчетыСКлиентамиПоДокументам" ИЛИ ИмяРегистра = "РасчетыСПоставщикамиПоДокументам" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "АналитикаУчетаПоПартнерам");
		Запрос.УстановитьПараметр("АналитикаРасчета", АналитикаУчетаПоПартнерам);
		
	ИначеЕсли ИмяРегистра = "РасчетыПоФинансовымИнструментам" Тогда
		Если ЗначениеЗаполнено(АналитикаУчетаПоПартнерам) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "АналитикаУчетаПоПартнерам");
			Запрос.УстановитьПараметр("АналитикаРасчета", АналитикаУчетаПоПартнерам);
			Если ЗначениеЗаполнено(ТипыСумм) Тогда
				ТекстЗапроса = СтрЗаменить(
									ТекстЗапроса, 
									"&ВсеКромеАналитикиРасчета", 
									"&ВсеКромеАналитикиРасчета
									|	И НЕ (ДанныеРегистра.ТипСуммы В (&ТипыСумм))");
				Запрос.УстановитьПараметр("ТипыСумм", ТипыСумм);
			КонецЕсли;
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "ТипСуммы");
			Запрос.УстановитьПараметр("АналитикаРасчета", ТипыСумм);
		КонецЕсли;
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваБезналичные" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "БанковскийСчет");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("БанковскиеСчетаОрганизаций", АналитикаРасчета));
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваВКассахККМ" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "КассаККМ");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("КассыККМ", АналитикаРасчета));
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваВПути" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "Получатель");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("БанковскиеСчетаОрганизаций,Кассы,КассыККМ", АналитикаРасчета));
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваУПодотчетныхЛиц" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "ПодотчетноеЛицо");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета));
	//++ НЕ УТ
	
	//++ Локализация
	ИначеЕсли ИмяРегистра = "РасчетПереоценкиВалютныхСредствНУ" Тогда // только при переоценке денежных средств
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "Аналитика1");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления", "РегистрСведений");
		Запрос.УстановитьПараметр("АналитикаРасчета", АналитикаУчетаПоПартнерам);
	//-- Локализация
	
	//-- НЕ УТ
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ЗаменитьЗапросОчисткиДвиженийАналитики(ИмяРегистра, ТекстЗапроса);
	
	// Получим новый набор движений - набор без движений которые надо удалить
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВсеКромеАналитикиРасчета", ЗначениеЗаполнено(Запрос.Параметры.АналитикаРасчета));
	ДвиженияРегистра = Запрос.Выполнить().Выгрузить();
	
	Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей - 
	Набор.Отбор.Регистратор.Установить(ДокументСсылка);
	Набор.Загрузить(ДвиженияРегистра);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
	
КонецПроцедуры

Процедура ПодготовитьНаборыЗаписейКРасчету(ДокументСсылка, РегистрыДляРасчета, АналитикаРасчета)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.РасчетКурсовыхРазниц");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	Для Каждого Регистр Из РегистрыДляРасчета Цикл
		Если Регистр.Ключ = "РасчетыСКлиентамиПоСрокам" ИЛИ Регистр.Ключ = "РасчетыСПоставщикамиПоСрокам" Тогда
			Продолжить;
		КонецЕсли;
		ЭлементБлокировки = Блокировка.Добавить(СтрШаблон("РегистрНакопления.%1.НаборЗаписей", Регистр.Ключ));
		ЭлементБлокировки.УстановитьЗначение("Регистратор", ДокументСсылка);
	КонецЦикла;
	//++ НЕ УТ
	
	//++ Локализация
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваБезналичные")
			ИЛИ РегистрыДляРасчета.Свойство("ДенежныеСредстваНаличные")
			ИЛИ РегистрыДляРасчета.Свойство("ДенежныеСредстваВКассахККМ")
			ИЛИ РегистрыДляРасчета.Свойство("ДенежныеСредстваВПути") Тогда
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РасчетПереоценкиВалютныхСредствНУ.НаборЗаписей");
		ЭлементБлокировки.УстановитьЗначение("Регистратор", ДокументСсылка);
		Если АналитикаРасчета = Неопределено Тогда
			Набор = РегистрыСведений["РасчетПереоценкиВалютныхСредствНУ"].СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей -
			Набор.Отбор.Регистратор.Установить(ДокументСсылка);
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
		Иначе
			УдалитьДвиженияАналитики(ДокументСсылка, "РасчетПереоценкиВалютныхСредствНУ", АналитикаРасчета);
		КонецЕсли;
	КонецЕсли;
	//-- Локализация
	
	//-- НЕ УТ
	Блокировка.Заблокировать();
	
	Для Каждого Регистр Из РегистрыДляРасчета Цикл
		Если Регистр.Ключ = "РасчетыСКлиентамиПоСрокам" ИЛИ Регистр.Ключ = "РасчетыСПоставщикамиПоСрокам" Тогда
			Продолжить;
		КонецЕсли;
		Если АналитикаРасчета = Неопределено Тогда
			Набор = РегистрыНакопления[Регистр.Ключ].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей -
			Набор.Отбор.Регистратор.Установить(ДокументСсылка);
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
		Иначе
			УдалитьДвиженияАналитики(ДокументСсылка, Регистр.Ключ, АналитикаРасчета);
		КонецЕсли;
	КонецЦикла;
	//++ НЕ УТ
	
	//++ Локализация
	РегистрыДляРасчета.Удалить("РасчетПереоценкиВалютныхСредствНУ");
	//-- Локализация
	
	//-- НЕ УТ
	
КонецПроцедуры

//Удаляет записи по полю ДокументРегистратор в регистре накопления РасчетыСКлиентамиПоСрокам, РасчетыСПоставщикамиПоСрокам
//
// Параметры:
//  ДокументРегистратор - ДокументСсылка - Ссылка документа по которому необходимо удалить записи в регистре накопления
//  ИмяРегистра - Строка - Имя регистра накопления. Может принимать значения РасчетыСКлиентамиПоСрокам, РасчетыСПоставщикамиПоСрокам
//
Процедура УдалитьДвиженияРегистровПоСрокам(ДокументРегистратор, ИмяРегистра) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыПоСрокам.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ втРегистраторы
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|ГДЕ
	|	РасчетыПоСрокам.ДокументРегистратор = &ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегистраторы КАК РегистраторыРасчета
	|	ПО РасчетыПоСрокам.Регистратор = РегистраторыРасчета.Ссылка
	|ГДЕ
	|	РасчетыПоСрокам.ДокументРегистратор <> &ДокументРегистратор
	|ИТОГИ ПО
	|	Регистратор";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетыСКлиентамиПоСрокам", ИмяРегистра);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	
	ВыборкаПоДокументам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДокументам.Следующий() Цикл
		Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей - 
		Набор.Отбор.Регистратор.Установить(ВыборкаПоДокументам.Регистратор);
		Выборка = ВыборкаПоДокументам.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСсылкиСправочника(ИмяСправочника, МассивСсылок, Организация = Неопределено)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Спр.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Спр
	|ГДЕ
	|	Спр.Ссылка В(&МассивСсылок)
	|	И ИСТИНА";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации", ИмяСправочника);
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИСТИНА", "Спр.Организация = &Организация");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МассивСсылок", ?(МассивСсылок = Неопределено, Новый Массив, МассивСсылок));
	МассивКлючейОрганизации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивКлючейОрганизации;
	
КонецФункции

Функция ПолучитьАналитику(ИмяАналитики, АналитикаРасчета)
	
	Результат = Неопределено;
	Если ТипЗнч(АналитикаРасчета) = Тип("Структура") Тогда
		АналитикаРасчета.Свойство(ИмяАналитики, Результат);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция РазделительПакетовЗапроса()
	
	Возврат "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

Функция ТипыСуммКредитовДепозитовЗаймов()
	Результат = Новый Массив;
	Для Инд = 0 По Метаданные.Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ЗначенияПеречисления.Количество() - 1 Цикл
		Результат.Добавить(Перечисления.ТипыСуммГрафикаКредитовИДепозитов[Инд]);
	КонецЦикла;
	Возврат Результат;
КонецФункции
//++ НЕ УТ

//++ Локализация
Процедура ЗаполнитьДвиженияНУФинансовыхИнструментов(Организация, Период, ХозяйственнаяОперация, ДатаНачалаПересчета = Неопределено, Регистратор = Неопределено) Экспорт
	
	НачалоВступленияВСилу67ФЗ = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоВступленияВСилу67ФЗ();
	ИспользоватьРеглУчет = ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет");
	Если НачалоМесяца(Период) < НачалоВступленияВСилу67ФЗ ИЛИ НЕ ИспользоватьРеглУчет Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Организация) = Тип("Массив") Тогда
		МассивОрганизаций = Организация;
		Если МассивОрганизаций.Количество() = 1 Тогда
			НачалоПрименения67ФЗПоДоходам = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоПрименения67ФЗПоДоходам(МассивОрганизаций[0]);
		Иначе
			НачалоПрименения67ФЗПоДоходам = НачалоВступленияВСилу67ФЗ;
		КонецЕсли;
	Иначе
		МассивОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
		НачалоПрименения67ФЗПоДоходам = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоПрименения67ФЗПоДоходам(Организация);
	КонецЕсли;

	НачалоПериода = НачалоМесяца(Период);
	Если ДатаНачалаПересчета <> Неопределено Тогда
		НачалоПериода = НачалоМесяца(ДатаНачалаПересчета);
	ИначеЕсли НачалоМесяца(Период) = НачалоПрименения67ФЗПоДоходам Тогда //это месяц перехода
		НачалоПериода = НачалоГода(НачалоПрименения67ФЗПоДоходам);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АналитикиУчетаПоПартнерам.Ссылка КАК Ссылка,
	|	АналитикиУчетаПоПартнерам.Организация КАК Организация,
	|	АналитикиУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ПОМЕСТИТЬ ВтАналитикиУчетаПоПартнерам
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|ГДЕ
	|	АналитикиУчетаПоПартнерам.Организация В(&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.Месяц КАК Месяц,
	|	Обороты.Период КАК Период,
	|	Обороты.ВидДвижения КАК ВидДвижения,
	|	Обороты.ДокументРегистратор КАК ДокументРегистратор,
	|	Обороты.Организация КАК Организация,
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.Договор КАК Договор,
	|	Обороты.ТипСуммы КАК ТипСуммы,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(Обороты.Сумма) КАК Сумма,
	|	СУММА(Обороты.СуммаРегл) КАК СуммаРегл
	|ПОМЕСТИТЬ втОстаткиИОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачалоВступленияВСилу67ФЗ КАК Месяц,
	|		&ДатаВводаОстатковНУ КАК Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРегистратор,
	|		Аналитика.Организация КАК Организация,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.Договор КАК Договор,
	|		Расчеты.ТипСуммы КАК ТипСуммы,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		Расчеты.СуммаОстаток КАК Сумма,
	|		Расчеты.СуммаРеглОстаток КАК СуммаРегл
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|				&НачалоПериода,
	|				АналитикаУчетаПоПартнерам В 
	|					(ВЫБРАТЬ 
	|						Аналитика.Ссылка
	|					ИЗ
	|						ВтАналитикиУчетаПоПартнерам КАК Аналитика)
	|				И ТипСуммы В (&ТипыСуммПереоценкиНУ)
	|				И НЕ (АналитикаУчетаПоПартнерам, Валюта) В (
	|					ВЫБРАТЬ 
	|						Аналитика.Ссылка,
	|						Аналитика.ВалютаРегламентированногоУчета
	|					ИЗ
	|						ВтАналитикиУчетаПоПартнерам КАК Аналитика)
	|		) КАК Расчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
	|	ГДЕ
	|		&НачалоПериода = &НачалоВступленияВСилу67ФЗ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоВступленияВСилу67ФЗ КАК Месяц,
	|		&ДатаВводаОстатковНУ КАК Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРегистратор,
	|		Аналитика.Организация КАК Организация,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.Договор КАК Договор,
	|		Расчеты.ТипСуммы КАК ТипСуммы,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		0 КАК Сумма,
	|		-Расчеты.СуммаНУ КАК СуммаРегл
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментамНУ КАК Расчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
	|	ГДЕ
	|		&НачалоПериода = &НачалоВступленияВСилу67ФЗ
	|		И Расчеты.Период < &НачалоПериода
	|		И Расчеты.ТипСуммы В (&ТипыСуммПереоценкиНУ)
	|		И Расчеты.Валюта <> Аналитика.ВалютаРегламентированногоУчета
	|		И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|		И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) <> ТИП(Документ.ВводОстатковПоФинансовымИнструментам)
	|		И Расчеты.СуммаНУ <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Расчеты.Период, МЕСЯЦ) КАК Месяц,
	|		Расчеты.Период КАК Период,
	|		Расчеты.ВидДвижения КАК ВидДвижения,
	|		Расчеты.Регистратор КАК ДокументРегистратор,
	|		Аналитика.Организация КАК Организация,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.Договор КАК Договор,
	|		Расчеты.ТипСуммы КАК ТипСуммы,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		Расчеты.Сумма КАК Сумма,
	|		Расчеты.СуммаРегл КАК СуммаРегл
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам КАК Расчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
	|	ГДЕ
	|		&НачалоПериода >= &НачалоВступленияВСилу67ФЗ
	|		И Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Расчеты.ТипСуммы В (&ТипыСуммПереоценкиНУ)
	|		И Расчеты.Валюта <> Аналитика.ВалютаРегламентированногоУчета
	|		И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|		И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) <> ТИП(Документ.ВводОстатковПоФинансовымИнструментам)
	|		И Расчеты.СуммаРегл <> 0) КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Месяц,
	|	Обороты.Период,
	|	Обороты.ВидДвижения,
	|	Обороты.ДокументРегистратор,
	|	Обороты.Организация,
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.Договор,
	|	Обороты.ТипСуммы,
	|	Обороты.Валюта,
	|	Обороты.РасчетныйДокумент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(РасчетыКР.Дата, МЕСЯЦ) КАК Период,
	|	РасчетыКР.Организация КАК Организация,
	|	РасчетыКР.Ссылка КАК Ссылка,
	|	РасчетыКР.Проведен КАК Проведен,
	|	РасчетыКР.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ втРегистраторы
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК РасчетыКР
	|ГДЕ
	|	РасчетыКР.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыКР.ХозяйственнаяОперация = &Операция
	|	И РасчетыКР.Организация В (&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыКР.Период КАК Период,
	|	РасчетыКР.Организация КАК Организация,
	|	РасчетыКР.Ссылка КАК Ссылка,
	|	РасчетыКР.Проведен КАК Проведен
	|ПОМЕСТИТЬ втРегистраторыКурсовыхРазниц
	|ИЗ
	|	втРегистраторы КАК РасчетыКР
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Обороты.Месяц КАК Месяц,
	|	Обороты.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Ссылка,
	|	ЛОЖЬ КАК Проведен
	|ИЗ
	|	втОстаткиИОбороты КАК Обороты
	|	ЛЕВОЕ СОЕДИНЕНИЕ втРегистраторы КАК Регистраторы
	|	ПО Обороты.Месяц = Регистраторы.Период
	|		И Обороты.Организация = Регистраторы.Организация
	|ГДЕ
	|	Регистраторы.Период ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистраторыКурсовыхРазниц.Период КАК Месяц,
	|	Обороты.Период КАК Период,
	|	Обороты.ВидДвижения КАК ВидДвижения,
	|	РегистраторыКурсовыхРазниц.Ссылка КАК Регистратор,
	|	РегистраторыКурсовыхРазниц.Проведен КАК Проведен,
	|	ЕСТЬNULL(Обороты.ДокументРегистратор, НЕОПРЕДЕЛЕНО) КАК ДокументРегистратор,
	|	ЕСТЬNULL(Обороты.Организация, РегистраторыКурсовыхРазниц.Организация) КАК Организация,
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.Договор КАК Договор,
	|	Обороты.ТипСуммы КАК ТипСуммы,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЕСТЬNULL(Обороты.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(Обороты.СуммаРегл, 0) КАК СуммаРегл
	|ИЗ
	|	втРегистраторыКурсовыхРазниц КАК РегистраторыКурсовыхРазниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиИОбороты КАК Обороты
	|		ПО Обороты.Месяц = РегистраторыКурсовыхРазниц.Период
	|			И Обороты.Организация = РегистраторыКурсовыхРазниц.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Месяц
	|
	|ИТОГИ
	|	МАКСИМУМ(Проведен)
	|ПО
	|	Месяц,
	|	Организация,
	|	Регистратор
	|";
	#КонецОбласти

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоВступленияВСилу67ФЗ", НачалоВступленияВСилу67ФЗ);
	Запрос.УстановитьПараметр("ДатаВводаОстатковНУ", НачалоВступленияВСилу67ФЗ-1);
	Запрос.УстановитьПараметр("МассивОрганизаций", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Операция", ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ТипыСуммПереоценкиНУ", ТипыСуммКредитовДепозитовЗаймов());
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде Тогда
		Запрос.УстановитьПараметр("ТипыСуммПереоценкиНУ", ТипыСуммПереоценкиНУАренды());
	КонецЕсли;
	
	ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	РегистрыДляРасчета = Новый Структура("РасчетыПоФинансовымИнструментамНУ");
	
	Месяцы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Месяцы.Следующий() Цикл
		Организации = Месяцы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Организации.Следующий() Цикл
			Регистраторы = Организации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Счетчик = 0;
			Пока Регистраторы.Следующий() Цикл
				ДокументРасчетаКР = Регистраторы.Регистратор;
				Если Регистратор <> Неопределено Тогда
					Если Регистратор <> ДокументРасчетаКР Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					Счетчик = Счетчик + 1;
					Если Счетчик < Регистраторы.Количество() Тогда
						// Пометим на удаление все документы кроме последнего
						Если ЗначениеЗаполнено(ДокументРасчетаКР) Тогда
							ОбъектДокумента = ДокументРасчетаКР.ПолучитьОбъект();
							ОбъектДокумента.УстановитьПометкуУдаления(Истина);
						КонецЕсли;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				Если ДокументРасчетаКР = Неопределено Тогда
					ОбъектДокумента = Документы.РасчетКурсовыхРазниц.СоздатьДокумент();
					ОбъектДокумента.Дата = КонецМесяца(Месяцы.Месяц);
					ОбъектДокумента.Организация = Регистраторы.Организация;
					ОбъектДокумента.ХозяйственнаяОперация = ХозяйственнаяОперация;
					ОбъектДокумента.ПереоценкаПоДням = ПереоценкаПоДням;
					ОбъектДокумента.Проведен = Истина;
					ОбъектДокумента.Записать();
					ДокументРасчетаКР = ОбъектДокумента.Ссылка;
				КонецЕсли;
				Если Не Регистраторы.Проведен Тогда
					ОбъектДокумента = ДокументРасчетаКР.ПолучитьОбъект();
					ОбъектДокумента.Дата = КонецМесяца(Месяцы.Месяц);
					ОбъектДокумента.ПометкаУдаления = Ложь;
					ОбъектДокумента.Проведен = Истина;
					ОбъектДокумента.ОбменДанными.Загрузка = Истина;
					ОбъектДокумента.Записать();
				КонецЕсли;
				НаборЗаписейНУ = РегистрыНакопления.РасчетыПоФинансовымИнструментамНУ.СоздатьНаборЗаписей();
				НаборЗаписейНУ.Отбор.Регистратор.Установить(ДокументРасчетаКР);
				Движения = Регистраторы.Выбрать();
				Пока Движения.Следующий() Цикл
					Если Движения.СуммаРегл <> 0 Тогда
						НовоеДвижение = НаборЗаписейНУ.Добавить();
						ЗаполнитьЗначенияСвойств(НовоеДвижение, Движения);
						НовоеДвижение.СуммаНУ = Движения.СуммаРегл;
						Если НовоеДвижение.ДокументРегистратор = Неопределено Тогда
							НовоеДвижение.ДокументРегистратор = ДокументРасчетаКР;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				НаборЗаписейНУ.Записать();
				РасшифровкаРасчетаНУ = РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ.СоздатьНаборЗаписей();
				РасшифровкаРасчетаНУ.Отбор.Регистратор.Установить(ДокументРасчетаКР);
				РасшифровкаРасчетаНУ.Записать();
				Если НачалоМесяца(Месяцы.Месяц) <> НачалоМесяца(Период) Тогда
					ВыполнитьРасчетКурсовыхРазниц(ДокументРасчетаКР, РегистрыДляРасчета);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТипыСуммПереоценкиНУАренды()
	
	Результат = Новый Массив;	
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.ВыкупнаяСтоимость);
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.УслугаПоАренде);
	
	Возврат Результат;
	
КонецФункции

Процедура ПерезаполнитьОборотыНУ(Организация, Период, ХозяйственнаяОперация) Экспорт

	НачатьТранзакцию();
	Попытка
		
		НачалоВступленияВСилу67ФЗ = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоВступленияВСилу67ФЗ();
		ЗаполнитьДвиженияНУФинансовыхИнструментов(Организация, Период, ХозяйственнаяОперация, НачалоВступленияВСилу67ФЗ);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПерезаполнитьРасшифровкуРасчетаНУДляДС(Организация, Период) Экспорт
	
	НачалоВступленияВСилу67ФЗ = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоВступленияВСилу67ФЗ();
	Если НачалоМесяца(Период) <= НачалоВступленияВСилу67ФЗ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Период КАК Период,
	|	Регистр.Организация КАК Организация,
	|	Регистр.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные КАК Регистр
	|ГДЕ
	|	Регистр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Регистр.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(Регистр.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И Регистр.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Период КАК Период,
	|	Регистр.Организация КАК Организация,
	|	Регистр.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК Регистр
	|ГДЕ
	|	Регистр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Регистр.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(Регистр.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И Регистр.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Период КАК Период,
	|	Регистр.Организация КАК Организация,
	|	Регистр.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ КАК Регистр
	|ГДЕ
	|	Регистр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Регистр.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(Регистр.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И Регистр.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Период КАК Период,
	|	Регистр.Организация КАК Организация,
	|	Регистр.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути КАК Регистр
	|ГДЕ
	|	Регистр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Регистр.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(Регистр.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И Регистр.СуммаРегл <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	| Период";
	#КонецОбласти
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоВступленияВСилу67ФЗ);
	Запрос.УстановитьПараметр("КонецПериода", НачалоМесяца(Период)-1);
	
	РегистрыДляРасчета = Новый Структура("РасчетПереоценкиВалютныхСредствНУ");
	
	Переоценка = Запрос.Выполнить().Выбрать();
	Пока Переоценка.Следующий() Цикл
		РасшифровкаРасчетаНУ = РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ.СоздатьНаборЗаписей();
		РасшифровкаРасчетаНУ.Отбор.Регистратор.Установить(Переоценка.Регистратор);
		РасшифровкаРасчетаНУ.Записать();
		Если НачалоМесяца(Переоценка.Период) <> НачалоМесяца(Период) Тогда
			ВыполнитьРасчетКурсовыхРазниц(Переоценка.Регистратор, РегистрыДляРасчета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-- Локализация
Функция ТипыСуммОбратногоОтраженияРасходов()
	
	Результат = Новый Массив();
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.ВыкупнаяСтоимостьАванс);
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж);
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.УслугаПоАрендеАванс);
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.Проценты);
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.НДС);
	Возврат Результат;
	
КонецФункции

Функция ТипыСуммОплатыПоАренде()
	
	Результат = Новый Массив();
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.ВыкупнаяСтоимость);
	Результат.Добавить(Перечисления.ТипыПлатежейПоАренде.УслугаПоАренде);
	Возврат Результат;
	
КонецФункции

Функция ТипыСуммПлатежейПоАренде()
	Результат = Новый Массив;
	Для Инд = 0 По Метаданные.Перечисления.ТипыПлатежейПоАренде.ЗначенияПеречисления.Количество() - 1 Цикл
		Результат.Добавить(Перечисления.ТипыПлатежейПоАренде[Инд]);
	КонецЦикла;
	Возврат Результат;
КонецФункции
//-- НЕ УТ

#КонецОбласти

#Область УХ_Встраивание
Функция ИзменитьТекстЗапроса_ТекстыЗапросаКурсовВалют(ИсходныйТекстЗапроса)
	
	Возврат ВзаиморасчетыВстраиваниеУХ.ЗаменитьТекстЗапроса_ТекстыЗапросаКурсовВалют(ИсходныйТекстЗапроса);

КонецФункции
#КонецОбласти



#КонецОбласти

#КонецЕсли
