#Область СобытияМодуляФормы

// нетиповое событие документа. Вызывается перед исполнением основного кода
Процедура ПриЧтенииСозданииНаСервере(Форма) Экспорт
	
	// 
	СоздатьРеквизитыФормыДокумента(Форма);
	СоздатьЭлементыФормыДокумента(Форма);            
	
	УстановитьЗначенияИСвойстваФормы(Форма);
	
КонецПроцедуры

Процедура УстановитьЗначенияИСвойстваФормы(Знач Форма) Экспорт
	
	Перем РегистрируетПотребности;
	
	РегистрируетПотребности = ВстраиваниеУХСценарииТоварногоПланирования.ФормированиеПотребностей(Форма.Объект.Владелец); 
	
	Форма.Элементы.ЗаполнятьПодразделение.ТолькоПросмотр 	= РегистрируетПотребности;
	
	Форма.Элементы.ЗаполнятьПартнераЗакупки.ТолькоПросмотр 	= РегистрируетПотребности;  
	Форма.Элементы.ЗаполнятьПартнераВТЧПродажи.ТолькоПросмотр = РегистрируетПотребности;
	Форма.Элементы.ЗаполнятьПартнераВТЧЗакупки.ТолькоПросмотр = РегистрируетПотребности;
	
	Форма.Элементы.ЗаполнятьСоглашение.ТолькоПросмотр 		= РегистрируетПотребности;
	Форма.Элементы.ЗаполнятьСоглашениеВТЧПродажи.ТолькоПросмотр = РегистрируетПотребности;
	Форма.Элементы.ЗаполнятьСоглашениеВТЧЗакупки.ТолькоПросмотр = РегистрируетПотребности; 
	
	Форма.Элементы.ДетализацияСтатейБюджетаГруппа.Видимость = РегистрируетПотребности; 
	Форма.Элементы.ДетализацияСтатейБюджета.ТолькоПросмотр = Не Форма.Объект.Ссылка.Пустая();
	
	Форма.Элементы.ЗаполнятьПланОплатЗакупки.ТолькоПросмотр = РегистрируетПотребности;
	Если Форма.Объект.Ссылка.Пустая() Тогда
		Форма.Объект.ЗаполнятьПланОплат = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) экспорт
	УстановитьЗначенияИСвойстваФормы(Форма);	
КонецПроцедуры

Процедура ПриУстановкеВидимости(Форма) Экспорт
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Объект = Форма.Объект;
	
	РегистрируетПотребности = ВстраиваниеУХСценарииТоварногоПланирования.ФормированиеПотребностей(Форма.Объект.Владелец);

	Если РегистрируетПотребности Тогда  
		
		Если Не Объект.ЗаполнятьПланОплат Тогда
			Отказ = Истина;	
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для вида плана регистрирующего потребности необходимо %1'"), НСтр("ru = 'заполнять план оплат'")), 
													Объект.Ссылка, "", "Объект.ЗаполнятьПланОплат");  
		КонецЕсли;  
		
		Если Объект.ЗаполнятьПодразделение Тогда
			Отказ = Истина;	
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для вида плана регистрирующего потребности необходимо %1'"), НСтр("ru = 'отключить заполнение подразделения'")), 
													Объект.Ссылка, "", "Объект.ЗаполнятьПодразделение");  
		КонецЕсли;  
		
		Если Форма.ЗаполнятьПартнера Тогда
			Отказ = Истина;	
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для вида плана регистрирующего потребности необходимо %1'"), НСтр("ru = 'отключить заполнение поставщика'")), 
													Объект.Ссылка, "", "ЗаполнятьПартнера");  
		КонецЕсли; 
		
		Если Форма.ЗаполнятьСоглашение Тогда
			Отказ = Истина;	
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для вида плана регистрирующего потребности необходимо %1'"), НСтр("ru = 'отключить заполнение соглашения'")), 
													Объект.Ссылка, "", "ЗаполнятьСоглашение");  
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
	
Процедура СоздатьРеквизитыФормыДокумента(Форма)
	
	Если ФормыУХ.ЭлементыФормыУХУжеСозданы(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	//
	Реквизиты = Новый Массив;
	Реквизиты.Добавить(
		Новый РеквизитФормы(
			"ФормированиеПотребностейПланомЗакупок",
			Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.МассивЗначений(Тип("Булево")))
		)
	);

	
	Форма.ИзменитьРеквизиты(Реквизиты);
	
КонецПроцедуры

Процедура СоздатьЭлементыФормыДокумента(Форма)  
	
	Свойства = Новый Структура("Подсказка, ПоложениеЗаголовка", НСтр("ru = 'Требует указания статьи бюджета в каждой строке плана.'"), ПоложениеЗаголовкаЭлементаФормы.Право);    
	
	//Если элементы созданы, то возврвщаемся
	Если Форма.Элементы.Найти("ДетализацияСтатейБюджетаГруппа") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Группа = ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ДетализацияСтатейБюджетаГруппа", , 
								ВидГруппыФормы.ОбычнаяГруппа, 
								Форма.Элементы.ГруппаДетализация, 
								Форма.Элементы.ДекорацияДетализацияПояснениеЗакупки, 
								Новый Структура("ОтображатьЗаголовок, Группировка", Ложь, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная)); 
	                                                                                                                           		
	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ДетализацияСтатейБюджета",                                                           	//Имя
							НСтр("ru = 'Статьям бюджета в строках плана'"), "Объект.ДетализацияСтатейБюджета",                     	//Заголовок
							ВидПоляФормы.ПолеФлажка,                                                                               	//Вид
							Группа,                                                                      							//Родитель
							,                                                    													//РасположитьДо       
							Свойства);  	           	                                                                            //Свойства
							
	ФормыУХ.СоздатьДекорациюФормы(Форма.Элементы, "ДетализацияСтатейБюджетаОписание",                                               //Имя
									НСтр("ru = 'Требует указания статьи бюджета для каждой строки плана, а не документа в целом.'"), //Заголовок
									ВидДекорацииФормы.Надпись,                                                                      //Вид
									Группа,                                                               							//Родитель
									,                                           	 												//РасположитьДо
									Новый Структура("Ширина, ЦветТекста",                                                           //Свойства
													90, ЦветаСтиля.ПоясняющийТекст)); 
	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ДетализацияСтатейБюджетаОписаниеВажноеГруппа", , 
								ВидГруппыФормы.ОбычнаяГруппа, 
								Группа, 
								, 
								Новый Структура("ОтображатьЗаголовок", Ложь));   
	ФормыУХ.СоздатьДекорациюФормы(Форма.Элементы, "ДетализацияСтатейБюджетаОписаниеВажноеЗнак",,
									ВидДекорацииФормы.Картинка, 
									Форма.Элементы.ДетализацияСтатейБюджетаОписаниеВажноеГруппа,, Новый Структура("Картинка", БиблиотекаКартинок.ИнформацияПоНедоступнымПолям)); 
	ФормыУХ.СоздатьДекорациюФормы(Форма.Элементы, "ДетализацияСтатейБюджетаОписаниеВажное",                                         //Имя
									НСтр("ru = 'Необходимость указания статьи бюджета определяется настройками контроля закупок по виду бюджета на дату документа.'"), //Заголовок
									ВидДекорацииФормы.Надпись,                                                                      //Вид
									Форма.Элементы.ДетализацияСтатейБюджетаОписаниеВажноеГруппа,                                    //Родитель
									,                                            													//РасположитьДо
									Новый Структура("Ширина",                                                           			//Свойства
													90));
	//
	ВстраиваниеУХ.ЭлементыФормыУХДобавлены(Форма);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область СобытияМодуляОбъекта

#Область СлужебныеПроцедурыИФункции
	//
#КонецОбласти 

#КонецОбласти 

#Область МодульМенеджера    

Процедура ПолучитьБлокируемыеРеквизитыОбъекта(Результат) Экспорт 
	Результат.Добавить("ДетализацияСтатейБюджета");
КонецПроцедуры
//
#Область СлужебныеПроцедурыИФункции
	//	
#КонецОбласти 

#КонецОбласти    

 


