
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ПараметрыПреференцийОКПД2.Записывать = Истина;
	Для Каждого ТекСтрокаПараметрыПреференцийОКПД2 Из ПараметрыПреференцийОКПД2 Цикл
		Движение = Движения.ПараметрыПреференцийОКПД2.Добавить();
		Движение.Период = ЭтотОбъект.ДатаНачалаДействия;
		Движение.ОКПД2 = ТекСтрокаПараметрыПреференцийОКПД2.ОКПД2;
		Движение.Значение = ТекСтрокаПараметрыПреференцийОКПД2.Значение;
		Движение.НациональныйРежимЗакупок = ТекСтрокаПараметрыПреференцийОКПД2.НациональныйРежимЗакупок;
	КонецЦикла;
КонецПроцедуры
