#Область ОбработкаОсновныхСобытийФормы


#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы


&НаКлиенте
Процедура КомандаРедактироватьУИД(Команда)
	ЦентрализованныеЗакупкиКлиентУХ.РедактироватьУИДОбъекта(Объект, НСтр("ru = 'Введите УИД'"));
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтандартныйУИД(Команда)
	ЦентрализованныеЗакупкиКлиентУХ.УстановитьСтандартныйУИД(Объект);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьСуммыДокументаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ЗаполнитьСуммыДокументаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияЗаказчикПриИзменении(Элемент)
	ЗаполнитьСуммыДокументаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипОтчетностиОДоговорахПриИзменении(Элемент)
	ЗаполнитьСуммыДокументаНаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыНаКлиенте


#КонецОбласти

#Область СлужебныеПроцедурыНаСервере


&НаСервере
Процедура ЗаполнитьСуммыДокументаНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьСуммыДокумента();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры


#КонецОбласти
