
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПрочитатьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,Бланк,ТекущийОбъект) Экспорт
	
	текНаборЗаписей = РегистрыСведений.КэшГруппОтборовПоказателей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	ТекущийОбъект.КэшГруппОтборовПоказателей.Загрузить(текНаборЗаписей.Выгрузить());
	Для Каждого Строка Из ТекущийОбъект.КэшГруппОтборовПоказателей Цикл
		Строка.УидГруппыОтборовЧисло = Строка.УидГруппыОтборов;
	КонецЦикла;

	текНаборЗаписей = РегистрыСведений.РасшифровкаГруппОтборов.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	ТекущийОбъект.РасшифровкаГруппОтборов.Загрузить(текНаборЗаписей.Выгрузить());

	текНаборЗаписей = РегистрыСведений.КэшИменОбластейПоказателей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	ТекущийОбъект.КэшИменОбластейПоказателей.Загрузить(текНаборЗаписей.Выгрузить());
	
	текНаборЗаписей = РегистрыСведений.КэшРаскрываемыхОбластей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	ТекущийОбъект.КэшРаскрываемыхОбластей.Загрузить(текНаборЗаписей.Выгрузить());

	текНаборЗаписей = РегистрыСведений.НастройкиРаскрываемыхОбластей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	ТекущийОбъект.НастройкиРаскрываемыхОбластей.Загрузить(текНаборЗаписей.Выгрузить());

	текНаборЗаписей = РегистрыСведений.КэшИменФормул.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	ТекущийОбъект.КэшИменФормул.Загрузить(текНаборЗаписей.Выгрузить());
	
	текНаборЗаписей = РегистрыСведений.РасшифровкаФормулОбластейПоказателей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	ТекущийОбъект.РасшифровкаФормулОбластейПоказателей.Загрузить(текНаборЗаписей.Выгрузить());

	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
	Если  текНаборЗаписей.Количество() =1 Тогда			
		ЗначениеСохраняемойНастройки = текНаборЗаписей[0].ХранилищеДополнительныхНастроек.Получить();	
		Если  ЗначениеСохраняемойНастройки.Свойство("ТабДокМакет") Тогда		
			ПолеТабличногоДокументаМакет.Вывести(ЗначениеСохраняемойНастройки.ТабДокМакет);
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСверху") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСверху = ЗначениеСохраняемойНастройки.ФиксацияСверху;
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСлева") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСлева = ЗначениеСохраняемойНастройки.ФиксацияСлева;
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры	

Процедура ЗаписатьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,МакетДляВыводаПоказателей,Бланк,ТекущийОбъект,Отказ) Экспорт
		
	ПолучитьГруппировкиТабличногоДокумента(МакетДляВыводаПоказателей,ТекущийОбъект);
	
	текНаборЗаписей = РегистрыСведений.КэшГруппОтборовПоказателей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.КэшГруппОтборовПоказателей.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);
	
	текНаборЗаписей = РегистрыСведений.РасшифровкаГруппОтборов.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.РасшифровкаГруппОтборов.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);

	текНаборЗаписей = РегистрыСведений.КэшРаскрываемыхОбластей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.КэшРаскрываемыхОбластей.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);

	текНаборЗаписей = РегистрыСведений.НастройкиРаскрываемыхОбластей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.НастройкиРаскрываемыхОбластей.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);

	текНаборЗаписей = РегистрыСведений.НастройкиТаблицРаскрываемыхОбластей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.НастройкиТаблицРаскрываемыхОбластей.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);
	
	текНаборЗаписей = РегистрыСведений.РасшифровкаФормулОбластейПоказателей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	тТаблица  = ТекущийОбъект.РасшифровкаФормулОбластейПоказателей.Выгрузить();
	тТаблица.Свернуть("УидФормулы,УидГруппыОтборов,Показатель,ИндексПоказателя,ВидОтчета,ВидОтчетаКод,ПоказательКод,ИмяВФормуле");
	текНаборЗаписей.Загрузить(тТаблица);
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);
	
	текНаборЗаписей = РегистрыСведений.КэшИменОбластейПоказателей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.КэшИменОбластейПоказателей.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);
	
	текНаборЗаписей = РегистрыСведений.КэшИменФормул.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.КэшИменФормул.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);
	
	СтруктураАналитикРаскрытияПоказателей = Новый Структура;

	Попытка
		СтруктураПараметров = АналитическийБланкУХСервер.ПодготовитьТекстЗапросаПолученияДанных(ТекущийОбъект,ПолеТабличногоДокументаМакет,СтруктураАналитикРаскрытияПоказателей);
	Исключение
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ОписаниеОшибки(),Отказ,НСтр("ru = 'Ошибка записи бланка'"));
		Возврат;
	КонецПопытки;	
				
	Если СтруктураПараметров = Неопределено Тогда
		ЗначениеСохраняемойНастройки = Новый Структура;	
		ЗначениеСохраняемойНастройки.Вставить("ТабДокМакет",  				 			 ПолеТабличногоДокументаМакет);
		ЗначениеСохраняемойНастройки.Вставить("МакетДляВыводаПоказателей",  			 МакетДляВыводаПоказателей);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСлева",   						 ПолетабличногоДокументаМакет.ФиксацияСлева);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСверху",  						 ПолетабличногоДокументаМакет.ФиксацияСверху);	
		ЗначениеСохраняемойНастройки.Вставить("ТекстЗапросаСинтетика",  			 	 Неопределено);
		ЗначениеСохраняемойНастройки.Вставить("КоличествоОдинаковыхИмен",  				 ПолучитьИзВременногоХранилища(ТекущийОбъект.КоличествоОдинаковыхИменАдрес));
	Иначе		
		
		ТекущийОбъект.КэшФормулОбластейПоказателей.Очистить();
		тКэшОбластейРаскрытия  =  ПолучитьИзВременногоХранилища(СтруктураПараметров.тКэшОбластейРаскрытияАдрес);
		ЗаполнитьКэшВыводаОбластейМакета(тКэшОбластейРаскрытия,ТекущийОбъект,ПолеТабличногоДокументаМакет,СтруктураАналитикРаскрытияПоказателей);
				
		ЗначениеСохраняемойНастройки = Новый Структура;	
		ЗначениеСохраняемойНастройки.Вставить("ТабДокМакет",  				 			 ПолеТабличногоДокументаМакет);
		ЗначениеСохраняемойНастройки.Вставить("МакетДляВыводаПоказателей",  			 МакетДляВыводаПоказателей);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСлева",   						 ПолетабличногоДокументаМакет.ФиксацияСлева);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСверху",  						 ПолетабличногоДокументаМакет.ФиксацияСверху);	
		                                                                                                                                   
		ЗначениеСохраняемойНастройки.Вставить("ТзСтруктураВыводаГруппировок",  	 		 СтруктураПараметров.ТзСтруктураВыводаГруппировок);		
		ЗначениеСохраняемойНастройки.Вставить("ПараметрыОбластейКолонки",  				 ПолучитьИзВременногоХранилища(СтруктураПараметров.ПараметрыОбластейКолонки));
		ЗначениеСохраняемойНастройки.Вставить("ПараметрыОбластейСтроки",  				 ПолучитьИзВременногоХранилища(СтруктураПараметров.ПараметрыОбластейСтроки));
			
		ЗначениеСохраняемойНастройки.Вставить("тзПоказатели",  					 	 	 ПолучитьИзВременногоХранилища(СтруктураПараметров.тзПоказателиАдрес));
		ЗначениеСохраняемойНастройки.Вставить("тКэшОбластейРаскрытия",  			 	 ПолучитьИзВременногоХранилища(СтруктураПараметров.тКэшОбластейРаскрытияАдрес));
		ЗначениеСохраняемойНастройки.Вставить("КоличествоОдинаковыхИмен",  		 		 ПолучитьИзВременногоХранилища(ТекущийОбъект.КоличествоОдинаковыхИменАдрес));
		ЗначениеСохраняемойНастройки.Вставить("КэшОперандов",  		 		 	 		 ПолучитьИзВременногоХранилища(ТекущийОбъект.КэшОперандовАдрес));
		ЗначениеСохраняемойНастройки.Вставить("тИспользованныеПоказатели",  		 	 ПолучитьИзВременногоХранилища(ТекущийОбъект.ТзСвойстваПоказателейАдрес).ВыгрузитьКолонку("Ссылка"));		
			
		Если СтруктураПараметров.Свойство("ТзПоказателейОбластейКолонки") Тогда
			ЗначениеСохраняемойНастройки.Вставить("ТзПоказателейОбластейКолонки",  		 СтруктураПараметров.ТзПоказателейОбластейКолонки);
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("ТзПоказателейОбластейСтроки") Тогда
			ЗначениеСохраняемойНастройки.Вставить("ТзПоказателейОбластейСтроки",  		 СтруктураПараметров.ТзПоказателейОбластейСтроки);
		КонецЕсли;
	
		ТзПоказателиКроссОбластей = ТекущийОбъект.КэшПоказателейКроссОбластей.Выгрузить();
		ТзПоказателиКроссОбластей.Индексы.Добавить("Показатель");
		
		ЗначениеСохраняемойНастройки.Вставить("КэшПоказателейКроссОбластей",  		 ТзПоказателиКроссОбластей);
		
		ТзПоказателиМакетовРаскрытий = ТекущийОбъект.ПоказателиМакетовРаскрытий.Выгрузить();
		ТзПоказателиМакетовРаскрытий.Индексы.Добавить("Показатель");
		
		ЗначениеСохраняемойНастройки.Вставить("ТзПоказателиМакетовРаскрытий",  		 ТзПоказателиМакетовРаскрытий);
		ЗначениеСохраняемойНастройки.Вставить("СтруктураНемасштабируемых",  		 ПолучитьИзВременногоХранилища(ТекущийОбъект.НемасшатбируемыеАдрес));
		
	КонецЕсли;
			
	текНаборЗаписей = РегистрыСведений.КэшФормулОбластейПоказателей.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Загрузить(ТекущийОбъект.КэшФормулОбластейПоказателей.Выгрузить());
	Для Каждого Стр Из текНаборЗаписей Цикл
		Стр.Бланк = Бланк;
	КонецЦикла;	
	текНаборЗаписей.Записать(Истина);
	
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Очистить();
	нЗапись  									= текНаборЗаписей.Добавить();
	нЗапись.Бланк								= Бланк;
	нЗапись.ХранилищеДополнительныхНастроек 	= Новый ХранилищеЗначения(ЗначениеСохраняемойНастройки);
    текНаборЗаписей.Записать(Истина);
		
КонецПроцедуры	

Процедура ВернутьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,МакетДляВыводаПоказателей,Приемник,ТекущийОбъект,Отказ) Экспорт
		
	ПолучитьГруппировкиТабличногоДокумента(МакетДляВыводаПоказателей,ТекущийОбъект);
	
	Приемник.Вставить("КэшГруппОтборовПоказателей",ТекущийОбъект.КэшГруппОтборовПоказателей.Выгрузить());
	Приемник.Вставить("РасшифровкаГруппОтборов",ТекущийОбъект.РасшифровкаГруппОтборов.Выгрузить());
    Приемник.Вставить("КэшРаскрываемыхОбластей",ТекущийОбъект.КэшРаскрываемыхОбластей.Выгрузить());
	Приемник.Вставить("НастройкиРаскрываемыхОбластей",ТекущийОбъект.НастройкиРаскрываемыхОбластей.Выгрузить());
    Приемник.Вставить("НастройкиТаблицРаскрываемыхОбластей",ТекущийОбъект.НастройкиТаблицРаскрываемыхОбластей.Выгрузить());

	тТаблица  = ТекущийОбъект.РасшифровкаФормулОбластейПоказателей.Выгрузить();
	тТаблица.Свернуть("УидФормулы,УидГруппыОтборов,Показатель,ИндексПоказателя,ВидОтчета,ВидОтчетаКод,ПоказательКод,ИмяВФормуле");

	Приемник.Вставить("РасшифровкаФормулОбластейПоказателей",тТаблица);
	Приемник.Вставить("КэшИменОбластейПоказателей",ТекущийОбъект.КэшИменОбластейПоказателей.Выгрузить());
    Приемник.Вставить("КэшИменФормул",ТекущийОбъект.КэшИменФормул.Выгрузить());
	
	ТекущийОбъект.РежимСводнойТаблицы = Истина;
	
	СтруктураАналитикРаскрытияПоказателей = Новый Структура;

	Попытка
		СтруктураПараметров = АналитическийБланкУХСервер.ПодготовитьТекстЗапросаПолученияДанных(ТекущийОбъект,ПолеТабличногоДокументаМакет,СтруктураАналитикРаскрытияПоказателей);
	Исключение
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ОписаниеОшибки(),Отказ,НСтр("ru = 'Ошибка записи бланка'"));
		Возврат;
	КонецПопытки;	
				
	Если СтруктураПараметров = Неопределено Тогда
		ЗначениеСохраняемойНастройки = Новый Структура;	
		ЗначениеСохраняемойНастройки.Вставить("ТабДокМакет",  				 			 ПолеТабличногоДокументаМакет);
		ЗначениеСохраняемойНастройки.Вставить("МакетДляВыводаПоказателей",  			 МакетДляВыводаПоказателей);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСлева",   						 ПолетабличногоДокументаМакет.ФиксацияСлева);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСверху",  						 ПолетабличногоДокументаМакет.ФиксацияСверху);	
		ЗначениеСохраняемойНастройки.Вставить("ТекстЗапросаСинтетика",  			 	 Неопределено);
		ЗначениеСохраняемойНастройки.Вставить("КоличествоОдинаковыхИмен",  				 ПолучитьИзВременногоХранилища(ТекущийОбъект.КоличествоОдинаковыхИменАдрес));
	Иначе		
		
		тКэшОбластейРаскрытия  =  ПолучитьИзВременногоХранилища(СтруктураПараметров.тКэшОбластейРаскрытияАдрес);
		ЗаполнитьКэшВыводаОбластейМакета(тКэшОбластейРаскрытия,ТекущийОбъект,ПолеТабличногоДокументаМакет,СтруктураАналитикРаскрытияПоказателей);
				
		ЗначениеСохраняемойНастройки = Новый Структура;	
		ЗначениеСохраняемойНастройки.Вставить("ТабДокМакет",  				 			 ПолеТабличногоДокументаМакет);
		ЗначениеСохраняемойНастройки.Вставить("МакетДляВыводаПоказателей",  			 МакетДляВыводаПоказателей);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСлева",   						 ПолетабличногоДокументаМакет.ФиксацияСлева);
		ЗначениеСохраняемойНастройки.Вставить("ФиксацияСверху",  						 ПолетабличногоДокументаМакет.ФиксацияСверху);	
		                                                                                                                                   
		ЗначениеСохраняемойНастройки.Вставить("ТзСтруктураВыводаГруппировок",  	 		 СтруктураПараметров.ТзСтруктураВыводаГруппировок);		
		ЗначениеСохраняемойНастройки.Вставить("ПараметрыОбластейКолонки",  				 ПолучитьИзВременногоХранилища(СтруктураПараметров.ПараметрыОбластейКолонки));
		ЗначениеСохраняемойНастройки.Вставить("ПараметрыОбластейСтроки",  				 ПолучитьИзВременногоХранилища(СтруктураПараметров.ПараметрыОбластейСтроки));
			
		ЗначениеСохраняемойНастройки.Вставить("тзПоказатели",  					 	 	 ПолучитьИзВременногоХранилища(СтруктураПараметров.тзПоказателиАдрес));
		ЗначениеСохраняемойНастройки.Вставить("тКэшОбластейРаскрытия",  			 	 ПолучитьИзВременногоХранилища(СтруктураПараметров.тКэшОбластейРаскрытияАдрес));
		ЗначениеСохраняемойНастройки.Вставить("КоличествоОдинаковыхИмен",  		 		 ПолучитьИзВременногоХранилища(ТекущийОбъект.КоличествоОдинаковыхИменАдрес));
		ЗначениеСохраняемойНастройки.Вставить("КэшОперандов",  		 		 	 		 ПолучитьИзВременногоХранилища(ТекущийОбъект.КэшОперандовАдрес));
		ЗначениеСохраняемойНастройки.Вставить("тИспользованныеПоказатели",  		 	 ПолучитьИзВременногоХранилища(ТекущийОбъект.ТзСвойстваПоказателейАдрес).ВыгрузитьКолонку("Ссылка"));		
			
		Если СтруктураПараметров.Свойство("ТзПоказателейОбластейКолонки") Тогда
			ЗначениеСохраняемойНастройки.Вставить("ТзПоказателейОбластейКолонки",  		 СтруктураПараметров.ТзПоказателейОбластейКолонки);
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("ТзПоказателейОбластейСтроки") Тогда
			ЗначениеСохраняемойНастройки.Вставить("ТзПоказателейОбластейСтроки",  		 СтруктураПараметров.ТзПоказателейОбластейСтроки);
		КонецЕсли;
	
		ТзПоказателиКроссОбластей = ТекущийОбъект.КэшПоказателейКроссОбластей.Выгрузить();
		ТзПоказателиКроссОбластей.Индексы.Добавить("Показатель");
		
		ЗначениеСохраняемойНастройки.Вставить("КэшПоказателейКроссОбластей",  		 ТзПоказателиКроссОбластей);
		
		ТзПоказателиМакетовРаскрытий = ТекущийОбъект.ПоказателиМакетовРаскрытий.Выгрузить();
		ТзПоказателиМакетовРаскрытий.Индексы.Добавить("Показатель");
		
		ЗначениеСохраняемойНастройки.Вставить("ТзПоказателиМакетовРаскрытий",  		 ТзПоказателиМакетовРаскрытий);
		ЗначениеСохраняемойНастройки.Вставить("СтруктураНемасштабируемых",  		 ПолучитьИзВременногоХранилища(ТекущийОбъект.НемасшатбируемыеАдрес));
		
	КонецЕсли;
			
	Приемник.Вставить("КэшФормулОбластейПоказателей",ТекущийОбъект.КэшФормулОбластейПоказателей.Выгрузить());
    Приемник.Вставить("НастройкиАналитическихБланков",ЗначениеСохраняемойНастройки);
		
КонецПроцедуры	

Процедура ЗаполнитьКэшВыводаОбластейМакета(тКэшОбластейРаскрытия,ТекущийОбъект,ПолеТабличногоДокументаМакет,СтруктураАналитикРаскрытияПоказателей) 
		
	ТзСвойствПоказателей = ПолучитьИзВременногоХранилища(ТекущийОбъект.ТзСвойстваПоказателейАдрес);
	
	//Считываем ширину и высоту служебных областей бланка с настройками макетов раскрытий, если
	ШиринаСлужебнойОбласти = 0;
	ВысотаСлужебнойОбласти = 0;
	
	ИсходнаяОбластьНастройкиСтрок = ПолеТабличногоДокументаМакет.Области.Найти("ОбластьНастроекРаскрытийСтрок");
	Если НЕ ИсходнаяОбластьНастройкиСтрок = Неопределено Тогда 
		ШиринаСлужебнойОбласти = (ИсходнаяОбластьНастройкиСтрок.Право - ИсходнаяОбластьНастройкиСтрок.Лево)+1; 
	КонецЕсли;
	ИсходнаяОбластьНастройкиКолонок = ПолеТабличногоДокументаМакет.Области.Найти("ОбластьНастроекРаскрытийКолонок");
	Если НЕ ИсходнаяОбластьНастройкиКолонок = Неопределено Тогда 
		ВысотаСлужебнойОбласти = (ИсходнаяОбластьНастройкиКолонок.Верх - ИсходнаяОбластьНастройкиКолонок.Низ)+1; 
	КонецЕсли;

	
	//Кэш областей для динамического обновления итогов показателей.      
	Для Каждого СтрОбластиВывода Из тКэшОбластейРаскрытия Цикл	
		
		Если  СтрОбластиВывода.Лево>1 Тогда
			 СтрОбластиВывода.Лево = СтрОбластиВывода.Лево-1;
		КонецЕсли;	
		Если  СтрОбластиВывода.Право>1 Тогда
			 СтрОбластиВывода.Право = СтрОбластиВывода.Право-1;
		КонецЕсли;		
		Если  СтрОбластиВывода.Верх>1 Тогда
			 СтрОбластиВывода.Верх = СтрОбластиВывода.Верх-1;
		КонецЕсли;
		Если  СтрОбластиВывода.Низ>1 Тогда
			 СтрОбластиВывода.Низ = СтрОбластиВывода.Низ-1;
		КонецЕсли;

		тОбластьМакета = ПолеТабличногоДокументаМакет.Область(СтрОбластиВывода.ИмяОбласти); 
		ТабОперандов   = ПолучитьИзВременногоХранилища(ТекущийОбъект.ТабОперандовАдрес);
		
		СмещениеY = 1;	
		Для ИндС = тОбластьМакета.Верх По тОбластьМакета.Низ Цикл		
			СмещениеХ = 1;		
			Для ИндК = тОбластьМакета.Лево По тОбластьМакета.Право Цикл
				
				тОбласть =  ПолеТабличногоДокументаМакет.Область(ИндС,ИндК,ИндС,ИндК);
				
				Если тОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
					И ТипЗнч(тОбласть.Расшифровка) = Тип("Структура")
					И тОбласть.Расшифровка.Свойство("Ссылка") Тогда 
					
					нТзКэша =  ТекущийОбъект.КэшПоказателейКроссОбластей.Добавить();
					ЗаполнитьЗначенияСвойств(нТзКэша,СтрОбластиВывода);
					
					нТзКэша.Показатель 				= тОбласть.Расшифровка.Ссылка;
					нТзКэша.УидГруппыОтборов 		= тОбласть.Расшифровка.Уид;
					нТзКэша.ИмяКроссОбласти 		= СтрОбластиВывода.ИмяОбласти;
					Если СтрОбластиВывода.Верх = 1 Тогда
						нТзКэша.СмещениеY 				= СмещениеY-1;
					Иначе	 
						 нТзКэша.СмещениеY 				= СмещениеY;
					КонецЕсли;	
						
					Если СтрОбластиВывода.Лево = 1 Тогда
						 нТзКэша.СмещениеХ 				= СмещениеХ-1;
					Иначе	 
						 нТзКэша.СмещениеХ 				= СмещениеХ;
					КонецЕсли;	
									
					Если СтруктураАналитикРаскрытияПоказателей.Свойство(тОбласть.Имя) Тогда
						 нТзКэша.СтрГруппировки = СтрСоединить(СтруктураАналитикРаскрытияПоказателей[тОбласть.Имя],";")
					КонецЕсли;	
					
				ИначеЕсли тОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
					И ТипЗнч(тОбласть.Расшифровка) = Тип("Структура")
					И тОбласть.Расшифровка.Свойство("ТекстФормулы")  Тогда	
					
					ПоказателиФормулы   = ЗначениеИзСтрокиВнутр(тОбласть.Расшифровка.РасшифровкаФормулы);
					СтруктураОперандов 	= Новый Структура;
					
					тСтрокаКэшаФормул   					= ТекущийОбъект.КэшФормулОбластейПоказателей.Добавить();
					тСтрокаКэшаФормул.УидФормулы    		= тОбласть.Имя;
					ТекстФормулыПриведенный  				= тОбласть.Расшифровка.ТекстФормулы;
					тСтрокаКэшаФормул.ТекстФормулыИсходный  = тОбласть.Расшифровка.ТекстФормулы;
					
					Для Каждого СтрПоказатель Из ПоказателиФормулы Цикл
						
						нТзКэша =  ТекущийОбъект.КэшПоказателейКроссОбластей.Добавить();
						ЗаполнитьЗначенияСвойств(нТзКэша,СтрОбластиВывода);
						
						УидПоказателя =  ТабОперандов.Найти(СтрПоказатель.ИмяВФормуле,"ИмяВФормуле").УидГруппыОтборов;
						
						нТзКэша.Показатель 				= СтрПоказатель.Показатель;
						нТзКэша.УидГруппыОтборов 		= УидПоказателя;
						нТзКэша.ИмяФормулы              = тОбласть.Имя;
						нТзКэша.ЭтоФормула              = Истина;
						
						тПоказатель  					=  ТзСвойствПоказателей.Найти(нТзКэша.Показатель,"Ссылка");
						ИмяОбластиДляВыводаСУид       	=  СокрП(тПоказатель.ВидОтчетаКод)+"_"+СокрП(тПоказатель.ПоказательКод)+"_"+УидПоказателя;		
						нТзКэша.ИмяОперанда             =  ИмяОбластиДляВыводаСУид;	
						ТекстФормулыПриведенный 		= СтрЗаменить(ТекстФормулыПриведенный,"["+СтрПоказатель.ИмяВФормуле+"]","КэшОперандов."+ИмяОбластиДляВыводаСУид);
						
						нТзКэша.ИмяКроссОбласти 		= СтрОбластиВывода.ИмяОбласти;
						Если СтрОбластиВывода.Верх = 1 Тогда
							нТзКэша.СмещениеY 				= СмещениеY-1;
						Иначе	 
							нТзКэша.СмещениеY 				= СмещениеY;
						КонецЕсли;	
						
						Если СтрОбластиВывода.Лево = 1 Тогда
							нТзКэша.СмещениеХ 				= СмещениеХ-1;
						Иначе	 
							нТзКэша.СмещениеХ 				= СмещениеХ;
						КонецЕсли;	
						
						Если СтруктураАналитикРаскрытияПоказателей.Свойство(тОбласть.Имя) Тогда
							нТзКэша.СтрГруппировки = СтрСоединить(СтруктураАналитикРаскрытияПоказателей[тОбласть.Имя],";")
						КонецЕсли;	
						
					КонецЦикла;
						
					тСтрокаКэшаФормул.ТекстФормулы    = ТекстФормулыПриведенный;
					
				КонецЕсли;
				
				СмещениеХ = СмещениеХ+1;		
			КонецЦикла;	
			СмещениеY = СмещениеY+1;
		КонецЦикла;	   	
	КонецЦикла;		

	
КонецПроцедуры	

Процедура ЗполнитьПервоначальныйКэшОтборов(РасшифровкаГруппОтборов,УидГруппыОтборов) Экспорт
	
	НстрОтборов = РасшифровкаГруппОтборов.Добавить();
	НстрОтборов.УидГруппыОтборов = УидГруппыОтборов;
	НстрОтборов.Поле  		= "ПериодС";
	НстрОтборов.ПолеКод  	= "ПериодС";
	НстрОтборов.Отбор  		= Перечисления.ВидыСравненияПоказателейОтчетов.ПериодНачалаОтчета;
	НстрОтборов.ЗначениеОтбора  = "";
	НстрОтборов.ТипЗначенияСтрока = "СправочникСсылка.Периоды";
	НстрОтборов.ПорядокОтбора  = 1;	
	
	НстрОтборов = РасшифровкаГруппОтборов.Добавить();
	НстрОтборов.УидГруппыОтборов = УидГруппыОтборов;
	НстрОтборов.Поле 	 	= "ПериодПо";
	НстрОтборов.ПолеКод  	= "ПериодПо";
	НстрОтборов.Отбор  		= Перечисления.ВидыСравненияПоказателейОтчетов.ПериодОкончанияОтчета;
	НстрОтборов.ЗначениеОтбора  = "";
	НстрОтборов.ТипЗначенияСтрока = "СправочникСсылка.Периоды";
	НстрОтборов.ПорядокОтбора  = 2;

	НстрОтборов = РасшифровкаГруппОтборов.Добавить();
	НстрОтборов.УидГруппыОтборов = УидГруппыОтборов;
	НстрОтборов.Поле  		= 	"Сценарий";
	НстрОтборов.ПолеКод  	= 	"Сценарий";
	НстрОтборов.Отбор  		= 	Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета;
	НстрОтборов.ЗначениеОтбора  = "";
	НстрОтборов.ТипЗначенияСтрока = "СправочникСсылка.Сценарии";
	НстрОтборов.ПорядокОтбора  = 3;
	
	НстрОтборов = РасшифровкаГруппОтборов.Добавить();
	НстрОтборов.УидГруппыОтборов = УидГруппыОтборов;
	НстрОтборов.Поле  = 	"Организация";
	НстрОтборов.ПолеКод  = 	"Организация";
	НстрОтборов.Отбор  = 	Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета;
	НстрОтборов.ЗначениеОтбора  = "";
	НстрОтборов.ТипЗначенияСтрока = "СправочникСсылка.Организации";
	НстрОтборов.ПорядокОтбора  = 4;
	
	НстрОтборов = РасшифровкаГруппОтборов.Добавить();
	НстрОтборов.УидГруппыОтборов = УидГруппыОтборов;
	НстрОтборов.Поле  		= "Проект";
	НстрОтборов.ПолеКод  	= "Проект";
	НстрОтборов.Отбор  		= Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета;
	НстрОтборов.ЗначениеОтбора  = "";
	НстрОтборов.ТипЗначенияСтрока = "СправочникСсылка.Проекты";
	НстрОтборов.ПорядокОтбора  = 5;
	
КонецПроцедуры	

Функция ПолучитьОписаниеТаблицыНастроекАналитик() Экспорт 
	
	ТзДоступныхАналитик = Новый ТаблицаЗначений;
	ТзДоступныхАналитик.Колонки.Добавить("АналитикаПредставление",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(200));
	ТзДоступныхАналитик.Колонки.Добавить("АналитикаКод",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(50));
	ТзДоступныхАналитик.Колонки.Добавить("АналитикаТипСтрока",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(0));
	ТзДоступныхАналитик.Колонки.Добавить("АналитикаСортировка",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(255));
	ТзДоступныхАналитик.Колонки.Добавить("Пометка",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТзДоступныхАналитик.Колонки.Добавить("ЭтоАналитикаВерсии",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТзДоступныхАналитик.Колонки.Добавить("ЭтоОтбор",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТзДоступныхАналитик.Колонки.Добавить("АналитикаБезОтбора",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
    ТзДоступныхАналитик.Колонки.Добавить("ПорядокАналитики",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(2));
    ТзДоступныхАналитик.Колонки.Добавить("ИерархииАналитики");
	ТзДоступныхАналитик.Колонки.Добавить("АналитикаСортировкаСКД");
    ТзДоступныхАналитик.Колонки.Добавить("ЭтоПроизводноеПоле",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТзДоступныхАналитик.Колонки.Добавить("ПутьКРеквизиту",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(255));
   	ТзДоступныхАналитик.Колонки.Добавить("ТипПроизводногоПоляСтрока",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(1024));

	Возврат ТзДоступныхАналитик;
	
КонецФункции	

Функция ПолучитьОписаниеТаблицыВыводаГруппировок() Экспорт
	
	ТзСтруктураВыводаГрупировок  = Новый ТаблицаЗначений;
	
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ТипОбласти");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ИмяОбласти");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("Макет");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("МакетЭталон");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("Уровень");                           
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("ИменаГруппировок");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("Группировки");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("УидОбласти");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("КоличествоОдинаковыхИмен");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("ТекстЗапросаВыводаОбластей");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ТекстЗапросаВыводаИтогов");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("ИндексЗапросаПакета");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ПараметрыЗапроса");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ПоказателиОбласти");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ТзАналитикСтроки");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ТзАналитикКолонки");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("АналитикиСтрок");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("АналитикиКолонок");	
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ИмяОбластиСтроки");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ИмяОбластиКолонки");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ОбластьСодержитМакет");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("ОписаниеСмещенияПоказателй");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("КэшНастроекПериодов");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("КэшНастроекИерархий");
	ТзСтруктураВыводаГрупировок.Колонки.Добавить("СКДДляВыводаОбласти");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("СтруктураИменПолейСКД");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("МакетКомпоновки");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("ДанныеРасшифровки");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("ОсновнаяТаблицаПолученияДанныхЗапроса");
    ТзСтруктураВыводаГрупировок.Колонки.Добавить("СтруктураОформляемыхПолей");

	
	Возврат ТзСтруктураВыводаГрупировок;
	
КонецФункции

Функция ПолучитьХэшПоОтборам(ПараметрыОтбора) Экспорт
	
	СтрокаХэшаОтборов = "";
	ПараметрыОтбора.Сортировать("ПорядокОтбора,ПолеКод");
	
	Для Каждого Стр Из ПараметрыОтбора Цикл
		
		Если ТипЗнч(Стр.ЗначениеОтбора) = Тип("СписокЗначений") Тогда
			СтрЗначениеОтбора = ЗначениеВСтрокуВнутр(Стр.ЗначениеОтбора.ВыгрузитьЗначения());
		ИначеЕсли Стр.ЗначениеОтбора = "" Тогда
			СтрЗначениеОтбора = "";
		Иначе	
			СтрЗначениеОтбора = ЗначениеВСтрокуВнутр(Стр.ЗначениеОтбора);
		КонецЕсли;
		
		Если Стр.ПолеКод = "ПериодС"  Тогда
			Если НЕ Стр.Отбор=Перечисления.ВидыСравненияПоказателейОтчетов.ПериодНачалаОтчета Тогда
				СтрокаХэшаОтборов = СтрокаХэшаОтборов+Стр.ПолеКод+"@"+Строка(Стр.Отбор)+"@"+СтрЗначениеОтбора;		      
			КонецЕсли;	   
		ИначеЕсли Стр.ПолеКод = "ПериодПо" Тогда
			Если НЕ Стр.Отбор=Перечисления.ВидыСравненияПоказателейОтчетов.ПериодОкончанияОтчета Тогда
				СтрокаХэшаОтборов = СтрокаХэшаОтборов+Стр.ПолеКод+"@"+Строка(Стр.Отбор)+"@"+СтрЗначениеОтбора;		      
			КонецЕсли;	   	   
		ИначеЕсли Стр.ПолеКод = "Организация" Тогда
			Если НЕ Стр.Отбор=Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета Тогда
				СтрокаХэшаОтборов = СтрокаХэшаОтборов+Стр.ПолеКод+"@"+Строка(Стр.Отбор)+"@"+СтрЗначениеОтбора;		      
			КонецЕсли;	      
		ИначеЕсли Стр.ПолеКод = "Сценарий" Тогда
			Если НЕ Стр.Отбор=Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета Тогда
				СтрокаХэшаОтборов = СтрокаХэшаОтборов+Стр.ПолеКод+"@"+Строка(Стр.Отбор)+"@"+СтрЗначениеОтбора;		      
			КонецЕсли;      
		ИначеЕсли Стр.ПолеКод = "Проект" Тогда
			Если НЕ Стр.Отбор=Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета Тогда
				СтрокаХэшаОтборов = СтрокаХэшаОтборов+Стр.ПолеКод+"@"+Строка(Стр.Отбор)+"@"+СтрЗначениеОтбора;		      
			КонецЕсли;	   
		ИначеЕсли  НЕ Стр.Отбор=Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится Тогда 	   
			СтрокаХэшаОтборов = СтрокаХэшаОтборов+Стр.ПолеКод+"@"+Строка(Стр.Отбор)+"@"+СтрЗначениеОтбора;
		КонецЕсли;	
				
	КонецЦикла;	   
	
	Возврат СтрокаХэшаОтборов;
	
КонецФункции	

Функция ПолучитьОписаниеТаблицыРасшифровкиОперандов() Экспорт 
	
	ТзОперандов = Новый ТаблицаЗначений;
	ТзОперандов.Колонки.Добавить("ИмяВФормуле"					,ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(255));
	ТзОперандов.Колонки.Добавить("УидГруппыОтборов"				,ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(128));
	ТзОперандов.Колонки.Добавить("Показатель"					,Новый ОписаниеТипов("СправочникСсылка.ПоказателиОтчетов"));
	ТзОперандов.Колонки.Добавить("ВидОтчета"					,Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов"));
	ТзОперандов.Колонки.Добавить("ИндексОтборов"				,ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(10,0));
    ТзОперандов.Колонки.Добавить("ВидОтчетаКод"					,ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(100));
    ТзОперандов.Колонки.Добавить("ПоказательКод"				,ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(100));
	
	Возврат ТзОперандов;
	
КонецФункции	

Функция ПолучитьОписаниеТаблицыКэшаПериодов() Экспорт 
	
	ТзОперандов = Новый ТаблицаЗначений;
	ТзОперандов.Колонки.Добавить("ПериодС"					,ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(200));
	ТзОперандов.Колонки.Добавить("ПериодПо"					,ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(200));
	ТзОперандов.Колонки.Добавить("ПериодСОтбор"				);
	ТзОперандов.Колонки.Добавить("ПериодПоОтбор"			);
	ТзОперандов.Колонки.Добавить("Периоды");
	
	Возврат ТзОперандов;
	
КонецФункции	

Функция ПолучитьМакетБезСлужебныхОбластей(ПолеТабличногоДокументаМакет) Экспорт
	
	ТабДокДляВывода = Новый ТабличныйДокумент;
	ТабДокДляВывода.Вывести(ПолеТабличногоДокументаМакет);
	
	ОбластьКУдалениюСтроки = ТабДокДляВывода.Области.Найти("ОбластьНастроекРаскрытийСтрок");
	Если НЕ ОбластьКУдалениюСтроки = Неопределено Тогда
		ТабДокДляВывода.УдалитьОбласть(ОбластьКУдалениюСтроки,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	
	ОбластьКУдалениюКолонки = ТабДокДляВывода.Области.Найти("ОбластьНастроекРаскрытийКолонок");
	Если НЕ ОбластьКУдалениюКолонки = Неопределено Тогда
		ТабДокДляВывода.УдалитьОбласть(ОбластьКУдалениюКолонки,ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;	

	Возврат ТабДокДляВывода;
	
КонецФункции	

Процедура УдалитьСлужебныеОбласти(ПолеТабличногоДокументаМакет) Экспорт

	ОбластьКУдалениюСтроки = ПолеТабличногоДокументаМакет.Области.Найти("ОбластьНастроекРаскрытийСтрок");
	Если НЕ ОбластьКУдалениюСтроки = Неопределено Тогда
		ПолеТабличногоДокументаМакет.УдалитьОбласть(ОбластьКУдалениюСтроки,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	
	ОбластьКУдалениюКолонки = ПолеТабличногоДокументаМакет.Области.Найти("ОбластьНастроекРаскрытийКолонок");
	Если НЕ ОбластьКУдалениюКолонки = Неопределено Тогда
		ПолеТабличногоДокументаМакет.УдалитьОбласть(ОбластьКУдалениюКолонки,ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;	
		
КонецПроцедуры	

Процедура ПолучитьГруппировкиТабличногоДокумента(ТабДокумент, ТекущийОбъект)
	
	ТабДокумент.ПоказатьУровеньГруппировокСтрок(ТабДокумент.КоличествоУровнейГруппировокСтрок());
	
	Для Каждого СтрГруппа Из ТекущийОбъект.КэшРаскрываемыхОбластейСгруппированный Цикл
		ТабДокумент.Область(СтрГруппа.ИмяОбласти).Разгруппировать(); 
	КонецЦикла;	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ТабДокумент);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ЗаписьXML.Закрыть());
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	МассивУзловГрупп = ДокументDOM.ПолучитьЭлементыПоИмени("vg");
	Для Каждого УзелГруппы Из МассивУзловГрупп Цикл		
		Попытка
			
			НомерСтроки = Число(УзелГруппы.ПервыйДочерний.ТекстовоеСодержимое);
			ОбластьНачалаГруппировки = ТабДокумент.Область(НомерСтроки,1,НомерСтроки,1);
			Если Лев(ТабДокумент.Область(НомерСтроки,0,НомерСтроки,0).Имя,9) = "Раскрытие" Тогда
				ОбластьНачалаГруппировки = ТабДокумент.Область(НомерСтроки-1,1,НомерСтроки-1,1);
			КонецЕсли;
			ОбластьНачалаГруппировки.Текст = ОбластьНачалаГруппировки.Текст + "&&" + "[" + УзелГруппы.ТекстовоеСодержимое;

			НомерСтроки = Мин(Число(УзелГруппы.ПоследнийДочерний.ТекстовоеСодержимое)+2, ТабДокумент.ВысотаТаблицы+1);
			ОбластьОкончанияГруппировки = ТабДокумент.Область(НомерСтроки,1,НомерСтроки,1);
			ОбластьОкончанияГруппировки.Текст = ОбластьОкончанияГруппировки.Текст + "&&" + "]" + УзелГруппы.ТекстовоеСодержимое;
			
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры	

Функция ПолучитьОписаниеТаблицыТекущихОтборов() Экспорт
	
	ТзТекущихОтборов = Новый ТаблицаЗначений;
	ТзТекущихОтборов.Колонки.Добавить("ПолеПредставление",			ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(0));
	ТзТекущихОтборов.Колонки.Добавить("ПолеКод",					ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(0));
	ТзТекущихОтборов.Колонки.Добавить("ВидСравнения");
	ТзТекущихОтборов.Колонки.Добавить("Использовать",				ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТзТекущихОтборов.Колонки.Добавить("Пометка",					ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТзТекущихОтборов.Колонки.Добавить("ЗначениеОтбора");
	ТзТекущихОтборов.Колонки.Добавить("РежимОтбора");
	ТзТекущихОтборов.Колонки.Добавить("ТипЗначения");
    ТзТекущихОтборов.Колонки.Добавить("ВидСравненияСтрока",			ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(100));
    ТзТекущихОтборов.Колонки.Добавить("ОсновноеПолеКод",            ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(0));
	ТзТекущихОтборов.Колонки.Добавить("ОтборВерсии",            	ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
    ТзТекущихОтборов.Колонки.Добавить("ВыразитьТип",            	ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());

	
	Возврат ТзТекущихОтборов;

	
КонецФункции	


#Область РаботаСПанельюБланков

Процедура СоздатьРеквизитыДополнительногоБланка(ЭтаФорма,ЭлементРодитель,ИндексБланка,Бланк,Скрытый = Ложь,СвойстваБланка = Неопределено,РежимПанелиОтчетов = Ложь) Экспорт
	
	РеквизитыУжеЕсть = Ложь;
	Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если РеквизитФормы.Имя = "ПолеТабличногоДокументаМакет"+ИндексБланка Тогда
			// Реквизиты уже были добавлены раннее
			РеквизитыУжеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыУжеЕсть Тогда
		
		НГруппа = ЭтаФорма.Элементы.Найти("Бланк_"+ИндексБланка);
		
		НЭлемент = ЭтаФорма.Элементы.Найти("ПолеТабличногоДокументаМакет"+ИндексБланка);
		НЭлемент.Видимость = НЕ Скрытый;
		
	Иначе
		
		РеквизитыКДобавлению = Новый Массив;
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("ПолеТабличногоДокументаМакет"+ИндексБланка,
			Новый ОписаниеТипов("ТабличныйДокумент"),,,Ложь));
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("ОбъектАналитическогоБланка"+ИндексБланка,
			Новый ОписаниеТипов("ОбработкаОбъект.АналитическийБланк"),,,Ложь));
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("ПримечаниеАналитическогоБланка"+ИндексБланка,
			Новый ОписаниеТипов("ТекстовыйДокумент"),,,Ложь));
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("НепустыеСтроки"+ИндексБланка,
			Новый ОписаниеТипов("Булево"),,,Ложь));
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("НепустыеКолонки"+ИндексБланка,
			Новый ОписаниеТипов("Булево"),,,Ложь));
		
		ЭтаФорма.ИзменитьРеквизиты(РеквизитыКДобавлению);

		Если РежимПанелиОтчетов Тогда
			НГруппа     								= ЭлементРодитель;
		Иначе	
			НГруппа     								= ЭтаФорма.Элементы.Добавить("Бланк_"+ИндексБланка,Тип("ГруппаФормы"),ЭлементРодитель);// ГруппаФормы         
			НГруппа.Вид         						= ВидГруппыФормы.Страница;
			НГруппа.Группировка							= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НГруппа.Заголовок							= Строка(Бланк);
			Если Не СвойстваБланка = Неопределено Тогда
				Если Не СвойстваБланка.ЦветЗакладки = "" Тогда
					НГруппа.ЦветФона = ЗначениеИзСтрокиВнутр(СвойстваБланка.ЦветЗакладки);
				КонецЕсли;	
				Если Не СвойстваБланка.КартинкаЗакладки = "" Тогда
					НГруппа.Картинка = ЗначениеИзСтрокиВнутр(СвойстваБланка.КартинкаЗакладки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НЭлемент 									= ЭтаФорма.Элементы.Добавить("ПолеТабличногоДокументаМакет"+ИндексБланка,Тип("ПолеФормы"),НГруппа); // ПолеФормы
		НЭлемент.Вид       							= ВидПоляФормы.ПолеТабличногоДокумента;
		НЭлемент.ПутьКДанным						= "ПолеТабличногоДокументаМакет"+ИндексБланка;
		НЭлемент.РежимМасштабированияПросмотра 		= РежимМасштабированияПросмотра.Обычный;
		НЭлемент.ОтображатьГруппировки				= Истина;
		НЭлемент.ПоложениеЗаголовка 				= ПоложениеЗаголовкаЭлементаФормы.Нет;
		НЭлемент.Видимость                          = НЕ Скрытый;
		НЭлемент.ОтображатьЗаголовки                = Истина;
		
		НЭлемент.УстановитьДействие("ПриИзменении","ПолеТабличногоДокументаМакетПриИзменении");
		НЭлемент.УстановитьДействие("Выбор","ПолеТабличногоДокументаМакетВыбор");
		НЭлемент.УстановитьДействие("ОбработкаРасшифровки","ПолеТабличногоДокументаМакетОбработкаРасшифровки");
		НЭлемент.УстановитьДействие("ПриИзмененииСодержимогоОбласти","ПолеТабличногоДокументаМакетПриИзмененииСодержимогоОбласти");
		НЭлемент.УстановитьДействие("ПриАктивизации","ПолеТабличногоДокументаМакетПриАктивизацииОбласти");
		НЭлемент.УстановитьДействие("ОбработкаДополнительнойРасшифровки","ПолеТабличногоДокументаМакетОбработкаДополнительнойРасшифровки");
		
		НЭлемент 							= ЭтаФорма.Элементы.Добавить("ПримечаниеАналитическогоБланка"+ИндексБланка,Тип("ПолеФормы"),НГруппа); // ПолеФормы
		НЭлемент.Вид      	 				= ВидПоляФормы.ПолеТекстовогоДокумента;
		НЭлемент.ПутьКДанным				= "ПримечаниеАналитическогоБланка"+ИндексБланка;
		НЭлемент.Заголовок 					= НСтр("ru = 'Примечание к текущему бланку'");
		НЭлемент.ЦветТекстаЗаголовка		= Новый Цвет(51, 153, 102);
		НЭлемент.Видимость = Ложь;
		НЭлемент.Высота    = 5;
		НЭлемент.УстановитьДействие("ПриИзменении","ПримечаниеАналитическогоБланкаПриИзменении");
		
	КонецЕсли;
	
	ОтчетАБ 		= ЭтаФорма.РеквизитФормыВЗначение("ОбъектАналитическогоБланка"+ИндексБланка);
	ОтчетАБ.Бланк 	= Бланк;
	ЭтаФорма.ЗначениеВРеквизитФормы(ОтчетАБ,"ОбъектАналитическогоБланка"+ИндексБланка);
	
	// Добавим выведенные бланки в кэш
	нСтрокаКэшаБланков 					= ЭтаФорма.КэшБланков.Добавить();
	нСтрокаКэшаБланков.Бланк    		= Бланк;
	нСтрокаКэшаБланков.ИмяСтраницы      = НГруппа.Имя;
	нСтрокаКэшаБланков.ИмяОбъекта       = "ОбъектАналитическогоБланка"+ИндексБланка;
	нСтрокаКэшаБланков.ИмяМакета        = "ПолеТабличногоДокументаМакет"+ИндексБланка;
	нСтрокаКэшаБланков.Скрытый          = Скрытый;
		
КонецПроцедуры

Процедура ЗаполнитьБланкиДиаграмм(Бланк,МассивБланковДиаграмм) Экспорт
	
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(Бланк);
	текНаборЗаписей.Прочитать();
		
	Если текНаборЗаписей.Количество() = 1 Тогда
		ЗначениеСохраняемойНастройки = текНаборЗаписей[0].ХранилищеДополнительныхНастроек.Получить();
		тМакет = ЗначениеСохраняемойНастройки.МакетДляВыводаПоказателей;
		Для Каждого Обл Из тМакет.Рисунки Цикл
			Если  Обл.ТипРисунка = ТипРисункаТабличногоДокумента.Диаграмма
				И НЕ  Обл.Расшифровка = Неопределено 
				И Обл.Расшифровка.Свойство("СвязаннаяОбластьИмя") Тогда 
				БланкДанныхДиаграммы      = Обл.Расшифровка.СвязаннаяОбластьБланк;
				Если МассивБланковДиаграмм.Найти(БланкДанныхДиаграммы) = Неопределено Тогда
					МассивБланковДиаграмм.Добавить(БланкДанныхДиаграммы);
				КонецЕСли;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиБланки(КлючевыеПараметры,ЭтаФорма,МассивСтраниц,ДанныеДиаграмм = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(КлючевыеПараметры.Сценарий) Тогда
		УстановитьСостояниеНеИспользовать(ЭтаФорма,НСтр("ru = 'Не заполнен сценарий'"));
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(КлючевыеПараметры.ПериодОтчета) Тогда
		УстановитьСостояниеНеИспользовать(ЭтаФорма,НСтр("ru = 'Не заполнен период начала'"));
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(КлючевыеПараметры.ПериодОкончания) Тогда
		УстановитьСостояниеНеИспользовать(ЭтаФорма,НСтр("ru = 'Не заполнен период окончания'"));
		Возврат;
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(КлючевыеПараметры.Валюта) Тогда
		УстановитьСостояниеНеИспользовать(ЭтаФорма,НСтр("ru = 'Не заполнена валюта отображения'"));
		Возврат;
	КонецЕсли;
	
	Если КлючевыеПараметры.ИспользоватьБыстрыйОтборПоОрганизации И Не ЗначениеЗаполнено(КлючевыеПараметры.Организация) Тогда
		УстановитьСостояниеНеИспользовать(ЭтаФорма,НСтр("ru = 'Не заполнена организационная единица'"));
		Возврат;
	КонецЕсли;

	Если КлючевыеПараметры.Свойство("тОрганизации") Тогда
		КлючевыеПараметры.тОрганизации.Очистить();
		Если  КлючевыеПараметры.ИспользоватьБыстрыйОтборПоОрганизации Тогда
			КлючевыеПараметры.тОрганизации.Добавить(ЭтаФорма.Организация);
		КонецЕсли;  
	КонецЕсли;
	
	МакетВыведен = Истина;
				
	//Выводим бланки
	ИндексБланка = 0;
	Для Каждого Страница Из МассивСтраниц Цикл		
		
		СтрБланк  = ЭтаФорма.КэшБланков.НайтиСтроки(Новый Структура("ИмяСтраницы",Страница))[0];
		
		//Для неполных прав проверим возможность вывода
		Если НЕ ПроверитьВозможностьОтображенияВТекущемРежиме(ЭтаФорма,СтрБланк.Бланк.Владелец,СтрБланк.Бланк,КлючевыеПараметры.Организация) Тогда
			Продолжить;
		КонецЕсли;	

		Если СтрБланк.Выведен И НЕ СтрБланк.Скрытый Тогда  //актуальный макет уже обновлен
			//Дополним расшифовку для работы диаграмм, если нужно
			Если ДанныеДиаграмм И НЕ СтрБланк.УстановленаРасшифровкаДиаграммы Тогда
				 УстановитьРасшифровкуОбластиДляДиаграммы(ЭтаФорма,СтрБланк);
			КонецЕсли;	
			//Дальше не идем...
			Продолжить;			 	
		КонецЕсли;	
					
		ОтчетАБ 						= ЭтаФорма.РеквизитФормыВЗначение(СтрБланк.ИмяОбъекта);
		ОтчетАБ.Бланк 			 		= СтрБланк.Бланк;
		ОтчетАБ.Сценарий				= КлючевыеПараметры.Сценарий;
		ОтчетАБ.ПериодОтчета			= КлючевыеПараметры.ПериодОтчета;
		ОтчетАБ.ПериодОтчетаОкончание 	= КлючевыеПараметры.ПериодОкончания;
		ОтчетАБ.Организация 			= КлючевыеПараметры.Организация;
		ОтчетАБ.Проект 			 		= КлючевыеПараметры.Проект;
		ОтчетАБ.Валюта 			 		= КлючевыеПараметры.Валюта;		
		ОтчетАБ.ИдентификаторСеанса     = КлючевыеПараметры.ИдентификаторСеанса;
		
		Если КлючевыеПараметры.Свойство("ЕдиницаИзмерения") Тогда
			ОтчетАБ.ЕдиницаИзмерения 		= КлючевыеПараметры.ЕдиницаИзмерения;
		КонецЕсли;	
		Если КлючевыеПараметры.Свойство("ПравилоОбработки") Тогда
			ОтчетАБ.ТекущееПравило 			= КлючевыеПараметры.ПравилоОбработки;
		КонецЕсли;	
				
		Если КлючевыеПараметры.Свойство("ИспользоватьБыстрыйОтборПоАналитикамВерсии") Тогда
			ОтчетАБ.ИспользоватьБыстрыйОтборПоАналитикамВерсии = Истина;
			Для Инд = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
				Если КлючевыеПараметры.Свойство("Аналитика"+Инд) Тогда
					ОтчетАБ["Аналитика"+Инд] = КлючевыеПараметры["Аналитика"+Инд];
				КонецЕсли;	
			КонецЦикла;		
		КонецЕсли;
		
		СтруктураПараметров     = Новый Структура;
		СтруктураПараметров.Вставить("ПолеТабличногоДокументаМакет",ЭтаФорма[СтрБланк.ИмяМакета]);
		СтруктураПараметров.Вставить("ОбновитьДанные",Истина);
		СтруктураПараметров.Вставить("ДополнительныеНастройки",ОтчетАБ.СТ_ДополнительныеНастройки_Объект); 
		СтруктураПараметров.Вставить("ТекущаяТочность",КлючевыеПараметры.УровеньТочности);
		СтруктураПараметров.Вставить("ТекущийДелитель",КлючевыеПараметры.ТекущийДелитель);
		СтруктураПараметров.Вставить("НомерОсновногоЯзыка",КлючевыеПараметры.НомерОсновногоЯзыка);

		Если КлючевыеПараметры.Свойство("ИспользоватьДополнительныеОтборы") Тогда
			СтруктураПараметров.Вставить("тДополнительныхОтборов",ПодготовитьТаблицуОтборов(КлючевыеПараметры,ЭтаФорма));
		КонецЕсли;
		
		Если КлючевыеПараметры.Свойство("МакетСтрок") Тогда
			СтруктураПараметров.Вставить("МакетСтрок",КлючевыеПараметры.МакетСтрок);
		КонецЕсли;	
		
		ДополнительныеПараметры = Неопределено;
		Если ЗначениеЗаполнено(КлючевыеПараметры.ДополнительныеПараметрыАдрес) Тогда
			ДополнительныеПараметры  = ПолучитьИзВременногоХранилища(КлючевыеПараметры.ДополнительныеПараметрыАдрес);
		КонецЕсли;
		
		Если Не ДополнительныеПараметры = Неопределено И ДополнительныеПараметры.Свойство("СписокВерсий") Тогда
			СтруктураПараметров.Вставить("СписокВерсий",ДополнительныеПараметры.СписокВерсий);
		КонецЕсли;	
		
		Если Не ДополнительныеПараметры = Неопределено И ДополнительныеПараметры.Свойство("ПараметрыБазовойВерсии") Тогда
			СтруктураПараметров.Вставить("ПараметрыБазовойВерсии",ДополнительныеПараметры.ПараметрыБазовойВерсии);
		КонецЕсли;	
		
		Если КлючевыеПараметры.Свойство("логИзмененныхДанныхАдрес") Тогда
			ОтчетАБ.логИзмененныхДанныхАдрес 		= КлючевыеПараметры.логИзмененныхДанныхАдрес;
		КонецЕсли;
		Если КлючевыеПараметры.Свойство("логИзмененныхКомментариевАдрес") Тогда
			ОтчетАБ.логИзмененныхКомментариевАдрес 		= КлючевыеПараметры.логИзмененныхКомментариевАдрес;
		КонецЕсли;
        Если КлючевыеПараметры.Свойство("УникальныйИдентификатор")  Тогда
			ОтчетАБ.ИдентификаторСеанса 		= КлючевыеПараметры.УникальныйИдентификатор;
		КонецЕсли;
        Если КлючевыеПараметры.Свойство("ТекущееПравило") Тогда
			ОтчетАБ.ТекущееПравило 		= КлючевыеПараметры.ТекущееПравило;
		КонецЕсли;
		
		//Офоомление групп иерарахии по нужному шаблону
		Если ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(СтрБланк.Бланк, "РежимБланка") = 1 Тогда
			СтруктураОформления  = Новый Структура;
			Обработки.АналитическийБланкСводнаяТаблица.УстановитьШаблонУсловногоОформления(СтруктураОформления);
			СтруктураПараметров.Вставить("СтруктураОформления",СтруктураОформления);
			СтруктураПараметров.Вставить("ЗаголовокСводнойТаблицы",СтрБланк.Бланк);
		КонецЕсли;

		ОтчетАБ.ПолучитьРезультирующийМакет(СтруктураПараметров);
		ОтчетАБ.НомерОсновногоЯзыка		= КлючевыеПараметры.НомерОсновногоЯзыка;
		ОтчетАБ.ТекущийДелитель 		= КлючевыеПараметры.ТекущийДелитель;
		ОтчетАБ.ТекущаяТочность 		= КлючевыеПараметры.УровеньТочности;
		
		ЭтаФорма.ЗначениеВРеквизитФормы(ОтчетАБ,СтрБланк.ИмяОбъекта);		
		ИндексБланка = ИндексБланка +1;			
		
		тБланкКэш 			= ЭтаФорма.КэшБланков.НайтиСтроки(Новый Структура("ИмяСтраницы",Страница))[0];
		тБланкКэш.Выведен   = Истина;
		тБланкКэш.Обновлен  = Истина;
		
		//Если бланк диаграммы, то создаим дополнительную расшифровку ячеек для диаграмм
		Если ДанныеДиаграмм Тогда
			УстановитьРасшифровкуОбластиДляДиаграммы(ЭтаФорма,СтрБланк);
		КонецЕсли;	
		
		ОбновитьБланкиДанныхДиагармм(КлючевыеПараметры,ЭтаФорма,СтруктураПараметров.ПолеТабличногоДокументаМакет);
		СброситьСостояниеНеИспользовать(ЭтаФорма);
		
	КонецЦикла;		
			
	
КонецПроцедуры	

Процедура УстановитьРасшифровкуОбластиДляДиаграммы(ЭтаФорма,СтрБланк);
	
	тМакет = ЭтаФорма[СтрБланк.ИмяМакета];
	
	Для ИндСтроки = 1 По тМакет.ВысотаТаблицы Цикл
		Для ИндКолонки = 1 По тМакет.ШиринаТаблицы Цикл
			тЯчейка = тМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки);
			Если ТипЗнч(тЯчейка.Расшифровка) = Тип("Структура") Тогда
				Если  тЯчейка.Расшифровка.Свойство("Ссылка") Тогда
					нСтруктура = Новый Структура;
					нСтруктура.Вставить("Ссылка",тЯчейка.Расшифровка.Ссылка);
					нСтруктура.Вставить("УИД",тЯчейка.Расшифровка.УИД);
					нСтруктура.Вставить("ИмяОбласти",тЯчейка.Имя);						
					тЯчейка.Расшифровка = нСтруктура;
				ИначеЕсли тЯчейка.Расшифровка.Свойство("УидФормулы") Тогда
					нСтруктура = Новый Структура;
					Если тЯчейка.Расшифровка.Свойство("ТекстФормулы") Тогда
						нСтруктура.Вставить("ТекстФормулы",тЯчейка.Расшифровка.ТекстФормулы);
					КонецЕсли;
					нСтруктура.Вставить("УидФормулы",тЯчейка.Расшифровка.УидФормулы);
					нСтруктура.Вставить("ИмяОбласти",тЯчейка.Имя);						
					тЯчейка.Расшифровка = нСтруктура;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;		
	
	СтрБланк.УстановленаРасшифровкаДиаграммы = Истина;
	
КонецПроцедуры	

Процедура УстановитьСостояниеНеИспользовать(ЭтаФорма,ТекстСообщения) Экспорт
	
	тСтраница = ЭтаФорма.КэшБланков.НайтиСтроки(Новый Структура("ИмяСтраницы",ЭтаФорма.Элементы.ОсновнаяПанель.ТекущаяСтраница.Имя))[0];
	тМакет    = ЭтаФорма.Элементы[тСтраница.ИмяМакета];
	
	ОтображениеСостояния = тМакет.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = ТекстСообщения;
	
	тМакет.Доступность = Ложь;
	
	//Сбросим кэш актуальности бланков
	Для Каждого СтрКэш Из ЭтаФорма.КэшБланков Цикл	
		СтрКэш.Выведен = Ложь;	
	КонецЦикла	
	
КонецПроцедуры	

Процедура СброситьСостояниеНеИспользовать(ЭтаФорма)
	
	тСтраница = ЭтаФорма.КэшБланков.НайтиСтроки(Новый Структура("ИмяСтраницы",ЭтаФорма.Элементы.ОсновнаяПанель.ТекущаяСтраница.Имя))[0];
	тМакет    = ЭтаФорма.Элементы[тСтраница.ИмяМакета];
	
	ОтображениеСостояния 								= тМакет.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = "";
	
	тМакет.Доступность = Истина;
		
КонецПроцедуры

Функция ПодготовитьТаблицуОтборов(КлючевыеПараметры,ЭтаФорма); 
	
	тРасшифровкаОтборов = Новый ТаблицаЗначений;
	
	тДеревоОтборов      = ЭтаФорма.РеквизитФормыВЗначение("НастройкиОтборов");
	Для Каждого СтрОтборКолонка Из тДеревоОтборов.Колонки Цикл
		тРасшифровкаОтборов.Колонки.Добавить(СтрОтборКолонка.Имя,СтрОтборКолонка.ТипЗначения);	
	КонецЦикла;	
	
	тРасшифровкаОтборов.Колонки.Добавить("ИдентификаторСтроки",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(10));	
	тРасшифровкаОтборов.Колонки.Добавить("ИдентификаторРодителя",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(10));	
	
	ИдентификаторСтроки = 1;
	
	нСтр  						= тРасшифровкаОтборов.Добавить();
	нСтр.ПолеПредставление      = "Сценарий";
	нСтр.ПолеКод      			= "Сценарий";
	нСтр.ВидСравнения      		= ВидСравненияКомпоновкиДанных.Равно;
	нСтр.Использовать     		= Истина;
	нСтр.ЗначениеОтбора     	= КлючевыеПараметры.Сценарий;
	нСтр.РежимОтбора 	    	= Перечисления.РежимыОтборовАналитическихТаблиц.Данные;
	нСтр.ТипЗначения 	    	= Новый ОписаниеТипов("Справочникссылка.Сценарии");
	нСтр.ИдентификаторСтроки = ИдентификаторСтроки;	
	ИдентификаторСтроки = ИдентификаторСтроки+1;
	
	Если КлючевыеПараметры.ИспользоватьБыстрыйОтборПоОрганизации Тогда
		нСтр  						= тРасшифровкаОтборов.Добавить();
		нСтр.ПолеПредставление      = "Организация";
		нСтр.ПолеКод      			= "Организация";
		нСтр.ВидСравнения      		= ВидСравненияКомпоновкиДанных.Равно;
		нСтр.Использовать     		= Истина;
		нСтр.ЗначениеОтбора     	= КлючевыеПараметры.Организация;
		нСтр.РежимОтбора 	    	= Перечисления.РежимыОтборовАналитическихТаблиц.Данные;
		нСтр.ТипЗначения 	    	= Новый ОписаниеТипов("Справочникссылка.Организации");
		нСтр.ИдентификаторСтроки 	= ИдентификаторСтроки;	
		ИдентификаторСтроки 		= ИдентификаторСтроки+1;
	КонецЕсли;
	
	Для Каждого СтрЭлемент Из ЭтаФорма.НастройкиОтборов.ПолучитьЭлементы()[0].ПолучитьЭлементы() Цикл
		
		нСтр = тРасшифровкаОтборов.Добавить();
		ЗаполнитьЗначенияСвойств(нСтр,СтрЭлемент);	
		нСтр.ИдентификаторСтроки = ИдентификаторСтроки;	
		ИдентификаторСтроки = ИдентификаторСтроки+1;
		
	КонецЦикла;	
	
	Возврат тРасшифровкаОтборов;
	
КонецФункции	

Функция ПроверитьВозможностьОтображенияВТекущемРежиме(ЭтаФорма,тВидОтчета,тШаблонОтчета,тОрганизация) Экспорт
		
	ТекстПроверкаПравБланк =	 ПолныеПраваУХ.ПроверитьВозможностьОтображенияПоБланкуОтчета(тШаблонОтчета,тОрганизация,ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
	
	Если НЕ ПустаяСтрока(ТекстПроверкаПравБланк) Тогда
		УстановитьСостояниеНеИспользовать(ЭтаФорма,ТекстПроверкаПравБланк);
		Возврат Ложь;	
	Иначе	
		Возврат Истина;
	КонецЕсли;
	
КонецФункции	


#КонецОбласти


#Область РаботаСДиаграммами

Процедура ОбновитьБланкиДанныхДиагармм(КлючевыеПараметры,ЭтаФорма,ТекМакет) Экспорт
	
	МассивСтраницДиаграмм  = Новый Массив;
	
	Для Каждого Обл Из ТекМакет.Рисунки Цикл
		Если  Обл.ТипРисунка = ТипРисункаТабличногоДокумента.Диаграмма
			И НЕ Обл.Расшифровка = Неопределено И
			Обл.Расшифровка.Свойство("СвязаннаяОбластьИмя") Тогда 
			
			ИмяОбластиДанныхДиаграммы = Обл.Расшифровка.СвязаннаяОбластьИмя;
			БланкДанныхДиаграммы      = Обл.Расшифровка.СвязаннаяОбластьБланк;
			
			//Ищем бланк с данными диаграммы в текущем кэше
			тБланк = ЭтаФорма.КэшБланков.НайтиСтроки(Новый Структура("Бланк",БланкДанныхДиаграммы));
			Если тБланк.Количество() = 1 Тогда
				БланкИсточник = тБланк[0];	
				Если МассивСтраницДиаграмм.Найти(БланкИсточник.ИмяСтраницы) = Неопределено Тогда	
					МассивСтраницДиаграмм.Добавить(БланкИсточник.ИмяСтраницы);
				КонецЕсли;				
			КонецЕсли;			
		КонецЕсли;			
	КонецЦикла;	
	
	//Обновим страницы данных диаграмм
	ВывестиБланки(КлючевыеПараметры,ЭтаФорма,МассивСтраницДиаграмм,Истина);
	
	Для Каждого Обл Из ТекМакет.Рисунки Цикл
		Если  Обл.ТипРисунка = ТипРисункаТабличногоДокумента.Диаграмма
			И НЕ Обл.Расшифровка = Неопределено И
			Обл.Расшифровка.Свойство("СвязаннаяОбластьИмя") Тогда 
 
			ИмяОбластиДанныхДиаграммы = Обл.Расшифровка.СвязаннаяОбластьИмя;
			БланкДанныхДиаграммы      = Обл.Расшифровка.СвязаннаяОбластьБланк;
			//Ищем бланк с данными диаграммы в текущем кэше
			тБланк = ЭтаФорма.КэшБланков.НайтиСтроки(Новый Структура("Бланк",БланкДанныхДиаграммы));
			Если тБланк.Количество() = 1 Тогда
				БланкИсточник = тБланк[0];				
			КонецЕсли;			
			ОбновитьОбластьДанныхДиаграммы(ЭтаФорма,Обл,БланкИсточник);		
		КонецЕсли;			
	КонецЦикла;	

	
КонецПроцедуры

Процедура ОбновитьОбластьДанныхДиаграммы(ЭтаФорма,тДиаграмма,БланкИсточник)
	
	ИмяОбластиДанныхДиаграммы = тДиаграмма.Расшифровка.СвязаннаяОбластьИмя;

	БланкОбъект               = ЭтаФорма[БланкИсточник.ИмяОбъекта];
	ЭталонныйМакет            = БланкОбъект.ЭталонныйМакет;
	тВыводимыхОбластей        = ПолучитьИзВременногоХранилища(БланкОбъект.тКэшОбластейРаскрытияАдрес);
    СтруктураМакетаСтрок      = ПолучитьИзВременногоХранилища(БланкОбъект.СтруктураМакетаСтрокАдрес);
	СтруктураМакетаКолонок    = ПолучитьИзВременногоХранилища(БланкОбъект.СтруктураМакетаКолонокАдрес);
	тМакет                    = ЭтаФорма[БланкИсточник.ИмяМакета];
	
	КоординатыОбластиВИсходномМакете = 	ЭталонныйМакет.Область(ИмяОбластиДанныхДиаграммы);
	тВыводимыхОбластейКопия = тВыводимыхОбластей.СкопироватьКолонки();
	тВыводимыхОбластейКопия.Колонки.Добавить("ВсегоЯчеекВОбластиРаскрытияСтроки",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(10));
	тВыводимыхОбластейКопия.Колонки.Добавить("ВсегоЯчеекВОбластиРаскрытияКолонки",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(10));
	Для Каждого тОбласть Из тВыводимыхОбластей Цикл
		Если КоординатыОбластиВИсходномМакете.Лево-1<=тОбласть.Право
			И КоординатыОбластиВИсходномМакете.Право-1>=тОбласть.Лево
			И КоординатыОбластиВИсходномМакете.Верх-1<=тОбласть.Низ
			И КоординатыОбластиВИсходномМакете.Низ-1>= тОбласть.Верх  Тогда
			нВложенныеОбласти = тВыводимыхОбластейКопия.Добавить();
			ЗаполнитьЗначенияСвойств(нВложенныеОбласти,тОбласть);
			Если тОбласть.ТипОбласти = "Строки" Тогда
				Если СтруктураМакетаСтрок.Свойство(тОбласть.ИмяОбластиСтрок) Тогда
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияСтроки =  СтруктураМакетаСтрок[тОбласть.ИмяОбластиСтрок];
				Иначе
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияСтроки =  0;
				КонецЕсли;
			ИначеЕсли тОбласть.ТипОбласти = "Колонки" Тогда	
				Если СтруктураМакетаКолонок.Свойство(тОбласть.ИмяОбластиКолонок) Тогда
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияКолонки =  СтруктураМакетаКолонок[тОбласть.ИмяОбластиКолонок];
				Иначе
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияКолонки =  0;
				КонецЕсли;		
			ИначеЕсли тОбласть.ТипОбласти = "Таблица" Тогда		
				 Если СтруктураМакетаСтрок.Свойство(тОбласть.ИмяОбластиСтрок) Тогда
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияСтроки =  СтруктураМакетаСтрок[тОбласть.ИмяОбластиСтрок];
				Иначе
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияСтроки =  0;
				КонецЕсли;
                Если СтруктураМакетаКолонок.Свойство(тОбласть.ИмяОбластиКолонок) Тогда
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияКолонки =  СтруктураМакетаКолонок[тОбласть.ИмяОбластиКолонок];
				Иначе
					нВложенныеОбласти.ВсегоЯчеекВОбластиРаскрытияКолонки =  0;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
	тВыводимыхОбластейКопия.Сортировать("Лево,Верх");
	
	Если тВыводимыхОбластейКопия.Количество() = 1 
		И тВыводимыхОбластейКопия[0].ТипОбласти = "Синтетика" 
		И  НЕ тМакет.Области.Найти(ИмяОбластиДанныхДиаграммы) = Неопределено  Тогда
		тДиаграмма.Объект.ИсточникДанных = тМакет.Область(ИмяОбластиДанныхДиаграммы);
		Возврат;
	КонецЕсли;	
	
	КоординатыИсточникаВерх = 0;
	КоординатыИсточникаЛево = 0;
	КоординатыИсточникаНиз  = 0;
	КоординатыИсточникаПраво = 0;
	
	Если НЕ тВыводимыхОбластейКопия.Количество() = 0 Тогда
		
		ПерваяСтрока 		= тВыводимыхОбластейКопия[0];
		ПоследняяСтрока    = тВыводимыхОбластейКопия[тВыводимыхОбластейКопия.Количество()-1];
		
		Если ПерваяСтрока.ТипОбласти = "Синтетика" Тогда			
			КоординатыИсточникаВерх = (КоординатыОбластиВИсходномМакете.Верх-1)+ (ПерваяСтрока.СдвигY-ПерваяСтрока.Верх);		
			КоординатыИсточникаЛево = (КоординатыОбластиВИсходномМакете.Лево-1)+ПерваяСтрока.СдвигX-ПерваяСтрока.Лево;		 	
		Иначе	
			
		КонецЕсли;	 	 
		
		Если ПоследняяСтрока.ТипОбласти = "Синтетика" Тогда
			КоординатыИсточникаНиз = (КоординатыОбластиВИсходномМакете.Низ-2)+ПоследняяСтрока.СдвигY;
			КоординатыИсточникаНиз = (КоординатыОбластиВИсходномМакете.Низ-1)+ (ПоследняяСтрока.СдвигY-ПоследняяСтрока.Верх);		
			
			КоординатыИсточникаПраво = (КоординатыОбластиВИсходномМакете.Право-2)+ПоследняяСтрока.СдвигX;		 
		ИначеЕсли ПоследняяСтрока.ТипОбласти = "Строки" Тогда 	
			КоординатыИсточникаНиз = ПоследняяСтрока.СдвигY+ПоследняяСтрока.ВсегоЯчеекВОбластиРаскрытияСтроки-1;
			КоординатыИсточникаПраво = (КоординатыОбластиВИсходномМакете.Право-2)+ПоследняяСтрока.СдвигX;	
		ИначеЕсли ПоследняяСтрока.ТипОбласти = "Колонки" Тогда 	
			КоординатыИсточникаНиз = (КоординатыОбластиВИсходномМакете.Низ-2)+ПоследняяСтрока.СдвигY;
			КоординатыИсточникаПраво = ПоследняяСтрока.СдвигX+ПоследняяСтрока.ВсегоЯчеекВОбластиРаскрытияКолонки-1;	
		ИначеЕсли  ПоследняяСтрока.ТипОбласти = "Таблица" Тогда 	
			КоординатыИсточникаНиз 		= ПоследняяСтрока.СдвигY+ПоследняяСтрока.ВсегоЯчеекВОбластиРаскрытияСтроки-1;
			КоординатыИсточникаПраво 	= ПоследняяСтрока.СдвигX+ПоследняяСтрока.ВсегоЯчеекВОбластиРаскрытияКолонки-1;	
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(КоординатыИсточникаВерх)
		И ЗначениеЗаполнено(КоординатыИсточникаЛево)
		И ЗначениеЗаполнено(КоординатыИсточникаПраво)
		И ЗначениеЗаполнено(КоординатыИсточникаНиз) Тогда
		тДиаграмма.Объект.ИсточникДанных = тМакет.Область(КоординатыИсточникаВерх,КоординатыИсточникаЛево,КоординатыИсточникаНиз,КоординатыИсточникаПраво);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


 #Область РаботаСЖурналомДействий

Процедура ОтменитьДействие(ЭтаФорма, МассивВыделенныхТранзакций = Неопределено) Экспорт
	
	тТранзакции = ЭтаФорма.Транзакции.Выгрузить();
	тТранзакции.Сортировать("НомерТранзакции УБЫВ");
	
	Если МассивВыделенныхТранзакций = Неопределено Тогда
		МассивВыделенныхТранзакций = Новый Массив;
		Если тТранзакции.Количество() >0 Тогда
			МассивВыделенныхТранзакций.Добавить(тТранзакции[0].НомерТранзакции);
		КонецЕсли;	 	 
	КонецЕсли;
		
	Если МассивВыделенныхТранзакций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЛогИзмененныхПоказателей = ПолучитьЛогИзмененныхПоказателей(ЭтаФорма.УникальныйИдентификатор);
	ЛогИзмененныхПоказателей.Индексы.Добавить("НомерТранзакции");
	
	ЛогИзмененныхПоказателейREDO = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресЛогаИзмененныхПоказателейREDO);	
	ЭтаФорма.НомерТранзакцииREDO = ЭтаФорма.НомерТранзакцииREDO+1;
		
	Для Каждого НТранзакции Из МассивВыделенныхТранзакций Цикл
		
		ЗаписиПоследнейТранзакции = ЛогИзмененныхПоказателей.НайтиСтроки(Новый Структура("НомерТранзакции",НТранзакции));
		Для Каждого УдСтрока Из ЗаписиПоследнейТранзакции Цикл	
			нСтрока = ЛогИзмененныхПоказателейREDO.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрока, УдСтрока);
			нСтрока.НомерТранзакции = ЭтаФорма.НомерТранзакцииREDO;					
		КонецЦикла;	
		
		УправлениеРасчетомПоказателей.ОчиститьЛогИзмененныхПоказателей(ЭтаФорма.УникальныйИдентификатор, НТранзакции);
			
		ПоследняяТранзакция = тТранзакции.Найти(НТранзакции,"НомерТранзакции");
		
		нТранзакцияПовторить = ЭтаФорма.ТранзакцииПовторить.Добавить();
		ЗаполнитьЗначенияСвойств(нТранзакцияПовторить, ПоследняяТранзакция);
		нТранзакцияПовторить.НомерТранзакции = ЭтаФорма.НомерТранзакцииREDO;

		тТранзакции.Удалить(ПоследняяТранзакция);
		тТранзакции.Сортировать("НомерТранзакции");
		ЭтаФорма.Транзакции.Загрузить(тТранзакции);
		
	КонецЦикла;
		
	ЭтаФорма.АдресЛогаИзмененныхПоказателейREDO = ПоместитьВоВременноеХранилище(ЛогИзмененныхПоказателейREDO, ЭтаФорма.УникальныйИдентификатор);
	
	УстановитьВидимостьДоступностьЭлементовЖурналаДействий(ЭтаФорма);
	УстановитьВидимостьЭлементовОбновленияТаблицы(ЭтаФорма);
	
КонецПроцедуры

Процедура ПовторитьДействие(ЭтаФорма,МассивВыделенныхТранзакций = Неопределено) Экспорт
	
	тТранзакции = ЭтаФорма.ТранзакцииПовторить.Выгрузить();
	тТранзакции.Сортировать("НомерТранзакции УБЫВ");
	
	Если МассивВыделенныхТранзакций = Неопределено Тогда
		МассивВыделенныхТранзакций = Новый Массив;
		Если тТранзакции.Количество() >0 Тогда
			МассивВыделенныхТранзакций.Добавить(тТранзакции[0].НомерТранзакции);
		КонецЕсли;	 	 
	КонецЕсли;
	
	Если МассивВыделенныхТранзакций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекЛогИзмененныхПоказателей = УправлениеРасчетомПоказателей.ОписаниеЛогаИзмененныхПоказателей();	
	
	ЛогИзмененныхПоказателейREDO 	= ПолучитьИзВременногоХранилища(ЭтаФорма.АдресЛогаИзмененныхПоказателейREDO);	
	ЭтаФорма.НомерТранзакции 		= ЭтаФорма.НомерТранзакции+1;
		
	Для Каждого НТранзакции Из МассивВыделенныхТранзакций Цикл
		
		ЗаписиПоследнейТранзакции = ЛогИзмененныхПоказателейREDO.НайтиСтроки(Новый Структура("НомерТранзакции", НТранзакции));
		
		Сч = 1;
		Для Каждого УдСтрока Из ЗаписиПоследнейТранзакции Цикл
							
			нСтрока						= ТекЛогИзмененныхПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрока, УдСтрока);
			нСтрока.УникальныйИдентификаторСеанса = ЭтаФорма.УникальныйИдентификатор;
			нСтрока.НомерТранзакции	 	= ЭтаФорма.НомерТранзакции;
			нСтрока.НомерЗаписи      	= Сч;
			
			Сч = Сч+1; 
			
			ЛогИзмененныхПоказателейREDO.Удалить(УдСтрока);
			
		КонецЦикла;
		
		Для ВидЗначения = 1 По 3 Цикл
			тДляЗаписи = ТекЛогИзмененныхПоказателей.Скопировать(Новый Структура("ВидЗначения", ВидЗначения));
			Если тДляЗаписи.Количество() > 0 Тогда
				Если ВидЗначения = 1 Тогда
					НаборЗаписей = РегистрыСведений.ЛогИзмененныхЗначенийПоказателейОтчетов.СоздатьНаборЗаписей();
				ИначеЕсли ВидЗначения = 2 Тогда
					НаборЗаписей = РегистрыСведений.ЛогИзмененныхЗначенийПоказателейОтчетовНечисловые.СоздатьНаборЗаписей();
					ОбработатьТаблицуДляЗаписиВЛог(тДляЗаписи);
				Иначе
					НаборЗаписей = РегистрыСведений.ЛогИзмененныхКомментариевПоказателейОтчетов.СоздатьНаборЗаписей();
					ОбработатьТаблицуДляЗаписиВЛог(тДляЗаписи);
				КонецЕсли;				
				НаборЗаписей.Отбор.УникальныйИдентификаторСеанса.Установить(ЭтаФорма.УникальныйИдентификатор);
				НаборЗаписей.Отбор.НомерТранзакции.Установить(ЭтаФорма.НомерТранзакции);
				НаборЗаписей.Загрузить(тДляЗаписи);
				НаборЗаписей.Записать(Ложь);		    
			КонецЕсли;		
		КонецЦикла;		
		
		ПоследняяТранзакция = тТранзакции.Найти(НТранзакции,"НомерТранзакции");

		нТранзакцияПовторить = ЭтаФорма.Транзакции.Добавить();
		ЗаполнитьЗначенияСвойств(нТранзакцияПовторить, ПоследняяТранзакция);
		нТранзакцияПовторить.НомерТранзакции = ЭтаФорма.НомерТранзакции;

		тТранзакции.Удалить(ПоследняяТранзакция);
		тТранзакции.Сортировать("НомерТранзакции");
		ЭтаФорма.ТранзакцииПовторить.Загрузить(тТранзакции);
			
	КонецЦикла;
	
	ЭтаФорма.НомерТранзакции = ЭтаФорма.НомерТранзакции+1;
		
	ЭтаФорма.АдресЛогаИзмененныхПоказателейREDO = ПоместитьВоВременноеХранилище(ЛогИзмененныхПоказателейREDO, ЭтаФорма.УникальныйИдентификатор);
	
	УстановитьВидимостьДоступностьЭлементовЖурналаДействий(ЭтаФорма);
	УстановитьВидимостьЭлементовОбновленияТаблицы(ЭтаФорма);
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлементовОбновленияТаблицы(ЭтаФорма)
	
	Если НЕ НужноОбновлятьЯчейки(ЭтаФорма) Тогда
		
		Транзакции = ЭтаФорма.Транзакции;
		Если Транзакции.Количество() Тогда
			
			ТекущаяТранзакция = Транзакции[Транзакции.Количество() - 1].ПредставлениеТранзакции;
			Если ТекущаяТранзакция = Перечисления.ТранзакцииИзмененияПоказателей.ИзменениеПоказателя
				ИЛИ ТекущаяТранзакция = Перечисления.ТранзакцииИзмененияПоказателей.КопированиеПоСтроке
				ИЛИ ТекущаяТранзакция = Перечисления.ТранзакцииИзмененияПоказателей.КопированиеПоСтолбцу
				ИЛИ ТекущаяТранзакция = Перечисления.ТранзакцииИзмененияПоказателей.ВставкаИзБуфера
				ИЛИ ТекущаяТранзакция = Перечисления.ТранзакцииИзмененияПоказателей.ОчисткаДиапазонаЯчеек Тогда
				
				ЭтаФорма.НуженПересчет = Истина;
				ЭтаФорма.Элементы.НадписьОбновитеТаблицу.Видимость = Истина;
				
			Иначе
				
				ЭтаФорма.НуженПересчет = Ложь;
				ЭтаФорма.Элементы.НадписьОбновитеТаблицу.Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьТаблицуДляЗаписиВЛог(тДляЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДляЗаписи", тДляЗаписи);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПоказателей.УникальныйИдентификаторСеанса КАК УникальныйИдентификаторСеанса,
		|	ЗначенияПоказателей.ПравилоОбработки КАК ПравилоОбработки,
		|	ЗначенияПоказателей.Показатель КАК Показатель,
		|	ЗначенияПоказателей.Сценарий КАК Сценарий,
		|	ЗначенияПоказателей.Организация КАК Организация,
		|	ЗначенияПоказателей.Проект КАК Проект,
		|	ЗначенияПоказателей.СпособФормированияОтчета КАК СпособФормированияОтчета,
		|	ЗначенияПоказателей.ИспользуемаяИБ КАК ИспользуемаяИБ,
		|	ЗначенияПоказателей.Аналитика1 КАК Аналитика1,
		|	ЗначенияПоказателей.Аналитика2 КАК Аналитика2,
		|	ЗначенияПоказателей.Аналитика3 КАК Аналитика3,
		|	ЗначенияПоказателей.Аналитика4 КАК Аналитика4,
		|	ЗначенияПоказателей.Аналитика5 КАК Аналитика5,
		|	ЗначенияПоказателей.Аналитика6 КАК Аналитика6,
		|	ЗначенияПоказателей.АналитикаВалюта КАК АналитикаВалюта,
		|	ЗначенияПоказателей.ПериодОтчета КАК ПериодОтчета,
		|	ЗначенияПоказателей.Валюта КАК Валюта,
		|	ЗначенияПоказателей.НомерТранзакции КАК НомерТранзакции,
		|	ЗначенияПоказателей.НомерЗаписи КАК НомерЗаписи,
		|	ЗначенияПоказателей.Значение КАК Значение
		|ПОМЕСТИТЬ втЛогИзмененныхПоказателей
		|ИЗ
		|	&ТаблицаДляЗаписи КАК ЗначенияПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.УникальныйИдентификаторСеанса КАК УникальныйИдентификаторСеанса,
		|	ЗначенияПоказателей.ПравилоОбработки КАК ПравилоОбработки,
		|	ЗначенияПоказателей.Показатель КАК Показатель,
		|	ЗначенияПоказателей.Сценарий КАК Сценарий,
		|	ЗначенияПоказателей.Организация КАК Организация,
		|	ЗначенияПоказателей.Проект КАК Проект,
		|	ЗначенияПоказателей.СпособФормированияОтчета КАК СпособФормированияОтчета,
		|	ЗначенияПоказателей.ИспользуемаяИБ КАК ИспользуемаяИБ,
		|	ЗначенияПоказателей.Аналитика1 КАК Аналитика1,
		|	ЗначенияПоказателей.Аналитика2 КАК Аналитика2,
		|	ЗначенияПоказателей.Аналитика3 КАК Аналитика3,
		|	ЗначенияПоказателей.Аналитика4 КАК Аналитика4,
		|	ЗначенияПоказателей.Аналитика5 КАК Аналитика5,
		|	ЗначенияПоказателей.Аналитика6 КАК Аналитика6,
		|	ЗначенияПоказателей.АналитикаВалюта КАК АналитикаВалюта,
		|	ЗначенияПоказателей.ПериодОтчета КАК ПериодОтчета,
		|	ЗначенияПоказателей.Валюта КАК Валюта,
		|	ЗначенияПоказателей.НомерТранзакции КАК НомерТранзакции,
		|	МАКСИМУМ(ЗначенияПоказателей.НомерЗаписи) КАК НомерЗаписи
		|ПОМЕСТИТЬ втМаксимальныйНомерЗаписи
		|ИЗ
		|	втЛогИзмененныхПоказателей КАК ЗначенияПоказателей
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияПоказателей.УникальныйИдентификаторСеанса,
		|	ЗначенияПоказателей.ПравилоОбработки,
		|	ЗначенияПоказателей.Показатель,
		|	ЗначенияПоказателей.Сценарий,
		|	ЗначенияПоказателей.Организация,
		|	ЗначенияПоказателей.Проект,
		|	ЗначенияПоказателей.СпособФормированияОтчета,
		|	ЗначенияПоказателей.ИспользуемаяИБ,
		|	ЗначенияПоказателей.Аналитика1,
		|	ЗначенияПоказателей.Аналитика2,
		|	ЗначенияПоказателей.Аналитика3,
		|	ЗначенияПоказателей.Аналитика4,
		|	ЗначенияПоказателей.Аналитика5,
		|	ЗначенияПоказателей.Аналитика6,
		|	ЗначенияПоказателей.АналитикаВалюта,
		|	ЗначенияПоказателей.ПериодОтчета,
		|	ЗначенияПоказателей.Валюта,
		|	ЗначенияПоказателей.НомерТранзакции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.УникальныйИдентификаторСеанса КАК УникальныйИдентификаторСеанса,
		|	ЗначенияПоказателей.ПравилоОбработки КАК ПравилоОбработки,
		|	ЗначенияПоказателей.Показатель КАК Показатель,
		|	ЗначенияПоказателей.Сценарий КАК Сценарий,
		|	ЗначенияПоказателей.Организация КАК Организация,
		|	ЗначенияПоказателей.Проект КАК Проект,
		|	ЗначенияПоказателей.СпособФормированияОтчета КАК СпособФормированияОтчета,
		|	ЗначенияПоказателей.ИспользуемаяИБ КАК ИспользуемаяИБ,
		|	ЗначенияПоказателей.Аналитика1 КАК Аналитика1,
		|	ЗначенияПоказателей.Аналитика2 КАК Аналитика2,
		|	ЗначенияПоказателей.Аналитика3 КАК Аналитика3,
		|	ЗначенияПоказателей.Аналитика4 КАК Аналитика4,
		|	ЗначенияПоказателей.Аналитика5 КАК Аналитика5,
		|	ЗначенияПоказателей.Аналитика6 КАК Аналитика6,
		|	ЗначенияПоказателей.АналитикаВалюта КАК АналитикаВалюта,
		|	ЗначенияПоказателей.ПериодОтчета КАК ПериодОтчета,
		|	ЗначенияПоказателей.Валюта КАК Валюта,
		|	ЗначенияПоказателей.НомерТранзакции КАК НомерТранзакции,
		|	ЗначенияПоказателей.НомерЗаписи КАК НомерЗаписи,
		|	ЗначенияПоказателей.Значение КАК Значение
		|ИЗ
		|	втЛогИзмененныхПоказателей КАК ЗначенияПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимальныйНомерЗаписи КАК МаксимальныйНомерЗаписи
		|		ПО ЗначенияПоказателей.УникальныйИдентификаторСеанса = МаксимальныйНомерЗаписи.УникальныйИдентификаторСеанса
		|			И ЗначенияПоказателей.ПравилоОбработки = МаксимальныйНомерЗаписи.ПравилоОбработки
		|			И ЗначенияПоказателей.ПравилоОбработки = МаксимальныйНомерЗаписи.ПравилоОбработки
		|			И ЗначенияПоказателей.Показатель = МаксимальныйНомерЗаписи.Показатель
		|			И ЗначенияПоказателей.Сценарий = МаксимальныйНомерЗаписи.Сценарий
		|			И ЗначенияПоказателей.Организация = МаксимальныйНомерЗаписи.Организация
		|			И ЗначенияПоказателей.Проект = МаксимальныйНомерЗаписи.Проект
		|			И ЗначенияПоказателей.СпособФормированияОтчета = МаксимальныйНомерЗаписи.СпособФормированияОтчета
		|			И ЗначенияПоказателей.ИспользуемаяИБ = МаксимальныйНомерЗаписи.ИспользуемаяИБ
		|			И ЗначенияПоказателей.Аналитика1 = МаксимальныйНомерЗаписи.Аналитика1
		|			И ЗначенияПоказателей.Аналитика2 = МаксимальныйНомерЗаписи.Аналитика2
		|			И ЗначенияПоказателей.Аналитика3 = МаксимальныйНомерЗаписи.Аналитика3
		|			И ЗначенияПоказателей.Аналитика4 = МаксимальныйНомерЗаписи.Аналитика4
		|			И ЗначенияПоказателей.Аналитика5 = МаксимальныйНомерЗаписи.Аналитика5
		|			И ЗначенияПоказателей.Аналитика6 = МаксимальныйНомерЗаписи.Аналитика6
		|			И ЗначенияПоказателей.АналитикаВалюта = МаксимальныйНомерЗаписи.АналитикаВалюта
		|			И ЗначенияПоказателей.ПериодОтчета = МаксимальныйНомерЗаписи.ПериодОтчета
		|			И ЗначенияПоказателей.НомерТранзакции = МаксимальныйНомерЗаписи.НомерТранзакции
		|			И ЗначенияПоказателей.НомерЗаписи = МаксимальныйНомерЗаписи.НомерЗаписи";

	тДляЗаписи = Запрос.Выполнить().Выгрузить();	

КонецПроцедуры

Процедура ДобавитьЗаписьвЖурналДействийПослеРасчета(ЭтаФорма, ПараметрыРасчета) Экспорт

	ДопОписаниеТранзакции = "";
	
	Если Не ЗначениеЗаполнено(ПараметрыРасчета.СпособФормированияОтчета) Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.ЗаполнениеПоРегламенту;
	ИначеЕсли ПараметрыРасчета.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.ПоПравилуОбработки Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.ЗаполнениеПоПравилу;
		ДопОписаниеТранзакции = ПараметрыРасчета.ПравилоОбработки;
	ИначеЕсли ПараметрыРасчета.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Импорт Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.ЗагрузкаИзMSExcel;
		ДопОписаниеТранзакции = ПараметрыРасчета.УточнениеСпособаФормированияОтчета;
	ИначеЕсли ПараметрыРасчета.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Консолидация Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.АвтоматическиКонсолидация;
		ДопОписаниеТранзакции = "МСФО";
	ИначеЕсли ПараметрыРасчета.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.КонсолидацияПропорционально Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.АвтоматическиКонсолидация;
		ДопОписаниеТранзакции = "Пропорционально";
	ИначеЕсли ПараметрыРасчета.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Элиминация Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.АвтоматическиЭлиминация;
	ИначеЕсли ПараметрыРасчета.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.СвернувПоАналитикам Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.АвтоматическиСвернувПоАналитикам;
	ИначеЕсли ПараметрыРасчета.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.СвернувПоПериоду Тогда
		ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.АвтоматическиСвернувПоПериоду;
		ДопОписаниеТранзакции = ПараметрыРасчета.ПериодичностьСвертывания;
	КонецЕсли;
	
	Обработки.АналитическийБланк.ДобавитьЗаписьвЖурналДействий(ЭтаФорма, ПредставлениеТранзакции, ДопОписаниеТранзакции);
	
КонецПроцедуры

Процедура ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,ТекущаяОбласть) Экспорт
	
	СтрокаПредставлениеОбласти = "";
	Если ЗначениеЗаполнено(ТекущаяОбласть) Тогда
		Если ТипЗнч(ТекущаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Если ТекущаяОбласть.Лево = ТекущаяОбласть.Право 
				И ТекущаяОбласть.ТипОбласти  = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
				И ТекущаяОбласть.Верх = ТекущаяОбласть.Низ
				И ЗначениеЗаполнено(ТекущаяОбласть.Расшифровка)
				И ТекущаяОбласть.Расшифровка.Свойство("Ссылка") Тогда
				
				ПолеТабличногоДокументаМакет = ЭтаФорма[ЭтаФорма.ТекущийМакет];
				тОбласть = ТекущаяОбласть;
				СтруктураРасшифровки = Новый Структура;
				
				// Строки
				ОбластьРасшифровкиСтроки = ПолеТабличногоДокументаМакет.Область(тОбласть.Верх,1,тОбласть.Низ,1);
				Если  НЕ ОбластьРасшифровкиСтроки.Расшифровка = Неопределено Тогда
					Для Каждого рСтроки Из ОбластьРасшифровкиСтроки.Расшифровка Цикл
						Если НЕ рСтроки.Значение = Неопределено Тогда
							СтруктураРасшифровки.Вставить(рСтроки.Ключ,рСтроки.Значение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				// Колонки
				ОбластьРасшифровкиКолонки = ПолеТабличногоДокументаМакет.Область(1,тОбласть.Лево,1,тОбласть.Право);
				Если  НЕ ОбластьРасшифровкиКолонки.Расшифровка = Неопределено Тогда
					Для Каждого рКолонки Из ОбластьРасшифровкиКолонки.Расшифровка Цикл
						Если НЕ рКолонки.Значение = Неопределено Тогда
							СтруктураРасшифровки.Вставить(рКолонки.Ключ,рКолонки.Значение); 
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				тПериод = "";
				Если СтруктураРасшифровки.Свойство("ПериодОтчета") Тогда
					тПериод =  СтруктураРасшифровки.ПериодОтчета;
				КонецЕсли;
				
				СтрокаПредставлениеОбласти = НСтр("ru = 'Показатель: '")+ТекущаяОбласть.Расшифровка.Ссылка+", "+тПериод;
			Иначе	 
				СтрокаПредставлениеОбласти = НСтр("ru = 'Область: '")+ТекущаяОбласть.Имя;
			КонецЕсли;
		Иначе 	 
			СтрокаПредставлениеОбласти = ТекущаяОбласть;
		КонецЕсли;		
	КонецЕсли;
	
	тТранзакций									= ЭтаФорма.Транзакции.Добавить();
	тТранзакций.НомерТранзакции 				= ЭтаФорма.НомерТранзакции;
	тТранзакций.ПредставлениеТранзакции 		= ПредставлениеТранзакции;
	тТранзакций.ПредставлениеТранзакцииСтрока	= Строка(ПредставлениеТранзакции) 
		+ ?(ПустаяСтрока(СтрокаПредставлениеОбласти), "", " ("+СтрокаПредставлениеОбласти+")");
	
	ЭтаФорма.НомерТранзакции = ЭтаФорма.НомерТранзакции+1;
	
	ЭтаФорма.ТранзакцииПовторить.Очистить();
	
	УстановитьВидимостьДоступностьЭлементовЖурналаДействий(ЭтаФорма);
	
КонецПроцедуры

Процедура УстановитьВидимостьДоступностьЭлементовЖурналаДействий(ЭтаФорма) Экспорт
		
	ЭтаФорма.Элементы.ОтменитьПрименитьПодробно.Доступность = ЭтаФорма.Транзакции.Количество()>0;
	ЭтаФорма.Элементы.ОтменитьДействие.Доступность = ЭтаФорма.Транзакции.Количество()>0;
	ЭтаФорма.Элементы.ПовторитьДействие.Доступность = ЭтаФорма.ТранзакцииПовторить.Количество()>0;
	Если ЭтаФорма.Элементы.Найти("Применить") <> Неопределено Тогда
		ЭтаФорма.Элементы.Применить.Доступность = ЭтаФорма.Транзакции.Количество()>0;	
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьПоследнийНомерТранзакции(УникальныйИдентификаторСеанса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ЗначенияПоказателей.НомерТранзакции), НЕОПРЕДЕЛЕНО) КАК НомерТранзакции
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ЗначенияПоказателей.НомерТранзакции) КАК НомерТранзакции
		|	ИЗ
		|		РегистрСведений.ЛогИзмененныхЗначенийПоказателейОтчетов КАК ЗначенияПоказателей
		|	ГДЕ
		|		ЗначенияПоказателей.УникальныйИдентификаторСеанса = &УникальныйИдентификаторСеанса
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МАКСИМУМ(ЗначенияПоказателей.НомерТранзакции)
		|	ИЗ
		|		РегистрСведений.ЛогИзмененныхЗначенийПоказателейОтчетовНечисловые КАК ЗначенияПоказателей
		|	ГДЕ
		|		ЗначенияПоказателей.УникальныйИдентификаторСеанса = &УникальныйИдентификаторСеанса
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МАКСИМУМ(ЗначенияПоказателей.НомерТранзакции)
		|	ИЗ
		|		РегистрСведений.ЛогИзмененныхКомментариевПоказателейОтчетов КАК ЗначенияПоказателей
		|	ГДЕ
		|		ЗначенияПоказателей.УникальныйИдентификаторСеанса = &УникальныйИдентификаторСеанса) КАК ЗначенияПоказателей";
	
	Запрос.УстановитьПараметр("УникальныйИдентификаторСеанса",УникальныйИдентификаторСеанса);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();		
		Выборка.Следующий();	
		Возврат Выборка.НомерТранзакции;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти


#Область РаботаСКомандамиИзмененияДанных

Функция НужноОбновлятьЯчейки(ЭтаФорма)
	
	Если СтрНайти(ЭтаФорма.ИмяФормы, "НастраиваемыйОтчет") > 0 Тогда
		ПараметрыКонтекстногоОбновленияЗависимыхЯчеек = ЭтаФорма.Объект.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек;
	Иначе
		ПараметрыКонтекстногоОбновленияЗависимыхЯчеек = ЭтаФорма.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек;
	КонецЕсли;
	Возврат ПараметрыКонтекстногоОбновленияЗависимыхЯчеек = Перечисления.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек.АвтоматическиВсе
		ИЛИ ПараметрыКонтекстногоОбновленияЗависимыхЯчеек = Неопределено;
	
КонецФункции

Функция РассчитатьЗависимыеПоказатели(ЭтаФорма, Валюта, АдресТаблицыИзмененныхПоказателей, РасчетПоТекущимВидамОтчетов = Истина,ОбновитьЯчейки = Истина) Экспорт 
	
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("РасчетИЗаписьПоказателей");
	
	ПараметрыРасчета = ОбработкаОбъект.ПараметрыРасчета();
	ПараметрыРасчета.АдресТаблицыИзмененныхПоказателей = АдресТаблицыИзмененныхПоказателей;
	ПараметрыРасчета.НомерТранзакции = ЭтаФорма.НомерТранзакции;
	ПараметрыРасчета.РасчетПоТекущимВидамОтчетов = РасчетПоТекущимВидамОтчетов;
	Результат = ОбработкаОбъект.РассчитатьПоЗначениямИзмененныхПоказателей(ПараметрыРасчета);
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ОбработкаОбъект, "РасчетИЗаписьПоказателей");
	
	Если Не Результат Тогда
		Возврат Ложь;
	КонецЕсли;
		
	// Обновим связанные ячейки	
	Если ЗначениеЗаполнено(ОбработкаОбъект.АдресТаблицыРассчитанныхПоказателей) Тогда
		ТаблицаРассчитаныхПоказателей = ПолучитьИзВременногоХранилища(ОбработкаОбъект.АдресТаблицыРассчитанныхПоказателей);
	Иначе	
		ТаблицаРассчитаныхПоказателей = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Если ОбновитьЯчейки Тогда
		ТаблицаИзмененныхПоказателей 	= ПолучитьИзВременногоХранилища(АдресТаблицыИзмененныхПоказателей).Скопировать();
		ОбновитьЗависимыеЯчейки(ЭтаФорма,Валюта,ТаблицаИзмененныхПоказателей,ТаблицаРассчитаныхПоказателей); 
	Иначе	
		ЭтаФорма.Элементы.НадписьОбновитеТаблицу.Видимость = Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВставитьЗначениеПоказателя(ЭтаФорма, Валюта, ИмяОбласти, Значение, ОписаниеИзменений="", ПредставлениеТранзакции) Экспорт
	
	тМакет 								= ЭтаФорма[ЭтаФорма.ТекущийМакет];
	СтруктураРасшифровки 				= Новый Структура;
	ОбъектАБ 							= ЭтаФорма.РеквизитФормыВЗначение(ЭтаФорма.ТекущийОбъектАБ);
	АдресТаблицыИзмененныхПоказателей	= ПоместитьВоВременноеХранилище(УправлениеРасчетомПоказателей.ОписаниеТаблицыИзмененныхПоказателей(),ЭтаФорма.УникальныйИдентификатор);
	ИзмененнаяОбласть 					= тМакет.Область(ИмяОбласти);

	ОбновитьЯчейки = НужноОбновлятьЯчейки(ЭтаФорма);
		
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АдресТаблицыИзмененныхПоказателей",АдресТаблицыИзмененныхПоказателей);
	СтруктураПараметров.Вставить("ПолеТабличногоДокументаМакет",тМакет);
	СтруктураПараметров.Вставить("ИмяВыделеннойОбласти",ИмяОбласти);
	СтруктураПараметров.Вставить("ЗначениеДоИзменения",ЭтаФорма.ЗначениеОбластиДоИзменения);
	СтруктураПараметров.Вставить("ОписаниеИзменений",ОписаниеИзменений);
	СтруктураПараметров.Вставить("Объект", ЭтаФорма.ПолучитьСвойстваТекущегоОбъектаСервер());
	СтруктураПараметров.Вставить("НомерТранзакции",ЭтаФорма.НомерТранзакции);
	СтруктураПараметров.Вставить("ПредставлениеТранзакции",ПредставлениеТранзакции);
	СтруктураПараметров.Вставить("УидФормы",ЭтаФорма.УникальныйИдентификатор);
	СтруктураПараметров.Вставить("ИзменятьЗначениеВячейке",НЕ ОбновитьЯчейки);
	
	Если Значение = Дата(1, 1, 1)
		ИЛИ Значение = "" Тогда
		// Для пустых даты и строки пишем в регистр значение Неопределено
		СтруктураПараметров.Вставить("Значение", Неопределено);
	Иначе
		СтруктураПараметров.Вставить("Значение", Значение);
	КонецЕсли;

	ОбъектАБ.ИзменитьСодержимоеОбласти(СтруктураПараметров);

	ЭтаФорма.ЗначениеВРеквизитФормы(ОбъектАБ, ЭтаФорма.ТекущийОбъектАБ);
	
	Если ОбновитьЯчейки Тогда
		// Выполним расчет зависимых показателей
		РассчитатьЗависимыеПоказатели(ЭтаФорма, Валюта, АдресТаблицыИзмененныхПоказателей,, ОбновитьЯчейки);
	Иначе
		
		ИзмененныеПоказатели = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресТаблицыИзмененныхПоказателей);
		Если ИзмененныеПоказатели.Количество() Тогда
			// Поместим в лог для отложенного расчета зависимых
			ДобавитьЗначенияПоказателейВЛог(ЭтаФорма, АдресТаблицыИзмененныхПоказателей);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрКэш Из ЭтаФорма.КэшБланков Цикл
		СтрКэш.Выведен = Ложь;
	КонецЦикла;
	
	ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,ИзмененнаяОбласть);
	
	Возврат СтруктураРасшифровки;
	
КонецФункции

Процедура СкопироватьЗначения(ЭтаФорма,Валюта,ИмяОбласти,МассивЗначений,КодРесурса="",ОписаниеИзменений,ПредставлениеТранзакции,ОтображатьСуммуВДопВалюте=Ложь) Экспорт
	
	Если ТипЗнч(МассивЗначений) = Тип("Массив")
		И МассивЗначений.Количество() =0 Тогда
		Возврат;
	КонецЕсли;	
	
	тМакет 				= ЭтаФорма[ЭтаФорма.ТекущийМакет];	
	ОбъектАБ 			= ЭтаФорма.РеквизитФормыВЗначение(ЭтаФорма.ТекущийОбъектАБ);
	тОбъектСтруктура 	= Новый Структура;	
	АдресТаблицыИзмененныхПоказателей	= ПоместитьВоВременноеХранилище(УправлениеРасчетомПоказателей.ОписаниеТаблицыИзмененныхПоказателей(),ЭтаФорма.УникальныйИдентификатор);
	ИзмененнаяОбласть 					= тМакет.Область(ИмяОбласти);
	
	ОбновитьЯчейки = НужноОбновлятьЯчейки(ЭтаФорма);

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АдресТаблицыИзмененныхПоказателей",АдресТаблицыИзмененныхПоказателей);
	СтруктураПараметров.Вставить("ПолеТабличногоДокументаМакет",тМакет);
	СтруктураПараметров.Вставить("ИмяВыделеннойОбласти",ИмяОбласти);
	СтруктураПараметров.Вставить("Значение",МассивЗначений);
	СтруктураПараметров.Вставить("КодРесурса",КодРесурса);
	СтруктураПараметров.Вставить("ЗначениеДоИзменения",ЭтаФорма.ЗначениеОбластиДоИзменения);
	СтруктураПараметров.Вставить("ОписаниеИзменений",ОписаниеИзменений);
	СтруктураПараметров.Вставить("Объект",ЭтаФорма.ПолучитьСвойстваТекущегоОбъектаСервер());
	СтруктураПараметров.Вставить("НомерТранзакции",ЭтаФорма.НомерТранзакции);
	СтруктураПараметров.Вставить("ПредставлениеТранзакции",ПредставлениеТранзакции);
	СтруктураПараметров.Вставить("УидФормы",ЭтаФорма.УникальныйИдентификатор);
	СтруктураПараметров.Вставить("ИзменятьЗначениеВячейке",НЕ ОбновитьЯчейки);
	СтруктураПараметров.Вставить("ОтображатьСуммуВДопВалюте",ОтображатьСуммуВДопВалюте);

	ОбъектАБ.ИзменитьСодержимоеОбласти(СтруктураПараметров);
	
	Если ОбновитьЯчейки Тогда
		// Выполним расчет зависимых показателей
		РассчитатьЗависимыеПоказатели(ЭтаФорма, Валюта, АдресТаблицыИзмененныхПоказателей,,ОбновитьЯчейки);
	Иначе
		
		ИзмененныеПоказатели = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресТаблицыИзмененныхПоказателей);
		Если ИзмененныеПоказатели.Количество() Тогда
			// Поместим в лог для отложенного расчета зависимых
			ДобавитьЗначенияПоказателейВЛог(ЭтаФорма, АдресТаблицыИзмененныхПоказателей);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрКэш Из ЭтаФорма.КэшБланков Цикл	
		СтрКэш.Выведен = Ложь;	
	КонецЦикла;	
	
	ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,ИзмененнаяОбласть);

КонецПроцедуры

Процедура ОчиститьСодержимоеОбласти(ЭтаФорма,Валюта,ИмяОбласти,ОписаниеИзменений) Экспорт
		
	тМакет								= ЭтаФорма[ЭтаФорма.ТекущийМакет];
	ОбъектАБ							= ЭтаФорма.РеквизитФормыВЗначение(ЭтаФорма.ТекущийОбъектАБ);
	АдресТаблицыИзмененныхПоказателей	= ПоместитьВоВременноеХранилище(УправлениеРасчетомПоказателей.ОписаниеТаблицыИзмененныхПоказателей(),ЭтаФорма.УникальныйИдентификатор);
	тОбъектСтруктура					= Новый Структура;
	
	ОбновитьЯчейки = НужноОбновлятьЯчейки(ЭтаФорма);
	
	ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.ОчисткаДиапазонаЯчеек;
		
	МассивСтрок = Новый Массив();
	МассивЗначений = Новый Массив();
	МассивЗначений.Добавить(Неопределено);
	МассивСтрок.Добавить(МассивЗначений);
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АдресТаблицыИзмененныхПоказателей",АдресТаблицыИзмененныхПоказателей);
	СтруктураПараметров.Вставить("ПолеТабличногоДокументаМакет",тМакет);
	СтруктураПараметров.Вставить("ИмяВыделеннойОбласти",ИмяОбласти);
	СтруктураПараметров.Вставить("Значение",МассивСтрок);
	СтруктураПараметров.Вставить("ЗначениеДоИзменения","");
	СтруктураПараметров.Вставить("ОписаниеИзменений",ОписаниеИзменений);
	СтруктураПараметров.Вставить("Объект",ЭтаФорма.ПолучитьСвойстваТекущегоОбъектаСервер());
	СтруктураПараметров.Вставить("НомерТранзакции",ЭтаФорма.НомерТранзакции);
	СтруктураПараметров.Вставить("ПредставлениеТранзакции",ПредставлениеТранзакции);
	СтруктураПараметров.Вставить("УидФормы",ЭтаФорма.УникальныйИдентификатор);
	СтруктураПараметров.Вставить("ИзменятьЗначениеВячейке",НЕ ОбновитьЯчейки);
		
	ОбъектАБ.ИзменитьСодержимоеОбласти(СтруктураПараметров);
	
	Если ОбновитьЯчейки Тогда
		// Выполним расчет зависимых показателей
		РассчитатьЗависимыеПоказатели(ЭтаФорма, Валюта, АдресТаблицыИзмененныхПоказателей,,ОбновитьЯчейки);
	Иначе
		
		ИзмененныеПоказатели = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресТаблицыИзмененныхПоказателей);
		Если ИзмененныеПоказатели.Количество() Тогда
			// Поместим в лог для отложенного расчета зависимых
			ДобавитьЗначенияПоказателейВЛог(ЭтаФорма, АдресТаблицыИзмененныхПоказателей);
		КонецЕсли;
		
	КонецЕсли;

	Для Каждого СтрКэш Из ЭтаФорма.КэшБланков Цикл
		СтрКэш.Выведен = Ложь;
	КонецЦикла;
	
	ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,тМакет.Область(ИмяОбласти));
	
КонецПроцедуры

Процедура ИзменитьЗначенияВОбласти(ЭтаФорма,Валюта,ИмяОбласти,СтруктураПараметров,ОписаниеИзменений) Экспорт
				
	тМакет 								= ЭтаФорма[ЭтаФорма.ТекущийМакет];	
	ПредставлениеТранзакции 			= Перечисления.ТранзакцииИзмененияПоказателей.ИзменениеПоказателя;
	
	ОблДляВставки=тМакет.Область(ИмяОбласти);
			
	ОВерх 		= ?(ОблДляВставки.Верх = 0,тМакет.ФиксацияСверху+1,ОблДляВставки.Верх);
	ОНиз 		= ?(ОблДляВставки.Низ = 0,тМакет.ВысотаТаблицы,ОблДляВставки.Низ);
	ОПраво 		= ?(ОблДляВставки.Право=0,тМакет.ШиринаТаблицы,ОблДляВставки.Право);
	ОЛево 		= ?(ОблДляВставки.Лево=0,тМакет.ФиксацияСлева+1,ОблДляВставки.Лево);
		
	ОС=тМакет.ПолучитьОбласть(ИмяОбласти);
					
	МассивДляВставки 			= Новый Массив;

	Для ИндексСтрока = ОВерх По ОНиз Цикл	
		МассивДляВставкиЗначения 	= Новый Массив();
		Для ИндексКолонка = ОЛево По ОПраво Цикл
			
			ТекОбласть = тМакет.Область(ИндексСтрока,ИндексКолонка,ИндексСтрока,ИндексКолонка);
			
			Если ТекОбласть.СодержитЗначение Тогда
				
				Если ТекОбласть.ТипЗначения.Типы()[0] = Тип("Число") Тогда
					ЗначениеЧисло = ТекОбласть.Значение;
					
					Если СтруктураПараметров.ВидКорректировки = "Процент" Тогда
						ЗначениеЧислоИтог = ЗначениеЧисло*(1+СтруктураПараметров.ЗначениеКорректировки/100);
					ИначеЕсли СтруктураПараметров.ВидКорректировки = "Значение" Тогда	
						ЗначениеЧислоИтог = ЗначениеЧисло+СтруктураПараметров.ЗначениеКорректировки;
					ИначеЕсли СтруктураПараметров.ВидКорректировки = "Дефлятор" Тогда	
						СценарийДефлятор 	= СтруктураПараметров.ЗначениеКорректировки;
						ЗначениеЧислоИтог  = ЗначениеЧисло;
					КонецЕсли;
					
				Иначе	
					 ЗначениеЧислоИтог = ТекОбласть.Значение;
				КонецЕсли;
				
				МассивДляВставкиЗначения.Добавить(ЗначениеЧислоИтог);
				
			КонецЕсли;
			
		КонецЦикла;			
		МассивДляВставки.Добавить(МассивДляВставкиЗначения);
	КонецЦикла;
	
	Если СтруктураПараметров.ВидКорректировки = "Дефлятор" Тогда
		ПредставлениеТранзакции  = Перечисления.ТранзакцииИзмененияПоказателей.ИндексированиеПоСценарию;
		РаспределитьЗначенияПоДефлятору(ЭтаФорма,Валюта,ИмяОбласти,МассивДляВставки,СценарийДефлятор,ПредставлениеТранзакции)
	Иначе	
		СкопироватьЗначения(ЭтаФорма,Валюта,ИмяОбласти,МассивДляВставки,,,ПредставлениеТранзакции);
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьЗначенияПоДефлятору(ЭтаФорма,Валюта,ИмяОбласти,МассивЗначений,СценарийДефлятор,ПредставлениеТранзакции)
	
	Если ТипЗнч(МассивЗначений) = Тип("Массив")
		И МассивЗначений.Количество() =0 Тогда
		Возврат;
	КонецЕсли;	
	
	тМакет 				= ЭтаФорма[ЭтаФорма.ТекущийМакет];	
	ОбъектАБ 			= ЭтаФорма.РеквизитФормыВЗначение(ЭтаФорма.ТекущийОбъектАБ);
	тОбъектСтруктура 	= Новый Структура;	
	АдресТаблицыИзмененныхПоказателей	= ПоместитьВоВременноеХранилище(УправлениеРасчетомПоказателей.ОписаниеТаблицыИзмененныхПоказателей(),ЭтаФорма.УникальныйИдентификатор);
	ИзмененнаяОбласть 					= тМакет.Область(ИмяОбласти);

	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АдресТаблицыИзмененныхПоказателей",АдресТаблицыИзмененныхПоказателей);
	СтруктураПараметров.Вставить("ПолеТабличногоДокументаМакет",тМакет);
	СтруктураПараметров.Вставить("ИмяВыделеннойОбласти",ИмяОбласти);
	СтруктураПараметров.Вставить("Значение",МассивЗначений);
	СтруктураПараметров.Вставить("КодРесурса",Неопределено);
	СтруктураПараметров.Вставить("ЗначениеДоИзменения",ЭтаФорма.ЗначениеОбластиДоИзменения);
	СтруктураПараметров.Вставить("ОписаниеИзменений","");
	СтруктураПараметров.Вставить("Объект",ЭтаФорма.ПолучитьСвойстваТекущегоОбъектаСервер());
	СтруктураПараметров.Вставить("НомерТранзакции",ЭтаФорма.НомерТранзакции);
	СтруктураПараметров.Вставить("ПредставлениеТранзакции",ПредставлениеТранзакции);
	СтруктураПараметров.Вставить("УидФормы",ЭтаФорма.УникальныйИдентификатор);
	СтруктураПараметров.Вставить("ИзменятьЗначениеВячейке", НужноОбновлятьЯчейки(ЭтаФорма));
	СтруктураПараметров.Вставить("ОтображатьСуммуВДопВалюте",Ложь);
	СтруктураПараметров.Вставить("ВставлятьАбсолютныеЗначения",Истина);
	
	ОбъектАБ.ИзменитьСодержимоеОбласти(СтруктураПараметров);
	
	// Выполним расчет зависимых показателей	
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("РасчетИЗаписьПоказателей");
	
	ПараметрыРасчета = ОбработкаОбъект.ПараметрыРасчета();
	ПараметрыРасчета.АдресТаблицыИзмененныхПоказателей 		= АдресТаблицыИзмененныхПоказателей;
	ПараметрыРасчета.НомерТранзакции 						= ЭтаФорма.НомерТранзакции;
	ПараметрыРасчета.СценарийДляИндексации       			= СценарийДефлятор;
	
	Результат = ОбработкаОбъект.РассчитатьПоЗначениямИзмененныхПоказателей(ПараметрыРасчета);
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ОбработкаОбъект, "РасчетИЗаписьПоказателей");
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;			
		
	// Обновим связанные ячейки	
	Если ЗначениеЗаполнено(ОбработкаОбъект.АдресТаблицыРассчитанныхПоказателей) Тогда
		ТаблицаРассчитаныхПоказателей = ПолучитьИзВременногоХранилища(ОбработкаОбъект.АдресТаблицыРассчитанныхПоказателей);
	Иначе	
		ТаблицаРассчитаныхПоказателей = Новый ТаблицаЗначений;
	КонецЕсли;
	
	//Если ОбновитьЯчейки Тогда
		ТаблицаИзмененныхПоказателей 	= ПолучитьИзВременногоХранилища(АдресТаблицыИзмененныхПоказателей).Скопировать();
		ОбновитьЗависимыеЯчейки(ЭтаФорма,Валюта,ТаблицаИзмененныхПоказателей,ТаблицаРассчитаныхПоказателей,Истина); 
	//КонецЕсли;
		
	Для Каждого СтрКэш Из ЭтаФорма.КэшБланков Цикл	
		СтрКэш.Выведен = Ложь;	
	КонецЦикла;	
	
	ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,ИзмененнаяОбласть);

КонецПроцедуры

Функция ВставитьЗначениеКомментария(ЭтаФорма,Валюта,ИмяОбласти,ЗначениеКомментария,СтруктураРасшифровки,КэшАналитикПоказателей,ПредставлениеТранзакции) Экспорт
	
	тМакет 								= ЭтаФорма[ЭтаФорма.ТекущийМакет];	
	ОблДляВставки                       = тМакет.Область(ИмяОбласти); // ОбластьЯчеекТабличногоДокумента
		
	ПоказательСсылка = СтруктураРасшифровки.ПоказательСсылка;
	ГруппаПоказателя = КэшАналитикПоказателей.Найти(ПоказательСсылка,"Показатель");
	
	тЗаписьКомментария = РегистрыСведений.ЛогИзмененныхКомментариевПоказателейОтчетов.СоздатьМенеджерЗаписи();
	тЗаписьКомментария.УникальныйИдентификаторСеанса 						= ЭтаФорма.УникальныйИдентификатор;
	тЗаписьКомментария.НомерТранзакции  									= ЭтаФорма.НомерТранзакции;
	тЗаписьКомментария.Сценарий                                             = СтруктураРасшифровки.Сценарий;
	тЗаписьКомментария.Показатель                                           = СтруктураРасшифровки.ПоказательСсылка;
	тЗаписьКомментария.Организация                                          = СтруктураРасшифровки.Организация;
	тЗаписьКомментария.ПериодОтчета                                         = СтруктураРасшифровки.ПериодОтчета;
	тЗаписьКомментария.Валюта                                               = Валюта;
	тЗаписьКомментария.Значение                                          	= ЗначениеКомментария;
	
	Для ИндА=1 По ПараметрыСЕанса.ЧислоДопАналитик Цикл 
		Если НЕ ЗначениеЗаполнено(ГруппаПоказателя["ВидАналитики"+Строка(ИндА)+"Код"]) Тогда 
			Прервать;
		КонецЕсли;
		Если СтруктураРасшифровки.Свойство(ГруппаПоказателя["ВидАналитики"+Строка(ИндА)+"Код"]) Тогда
			тЗаписьКомментария["Аналитика"+ИндА] = СтруктураРасшифровки[СокрЛП(ГруппаПоказателя["ВидАналитики"+Строка(ИндА)+"Код"])];	
		КонецЕсли;	
	КонецЦикла;		

	Если СтруктураРасшифровки.Свойство("АналитикаВалюта") Тогда
		 АналитикаВалюта = ?(СтруктураРасшифровки["АналитикаВалюта"]=Неопределено,Справочники.Валюты.ПустаяСсылка(),СтруктураРасшифровки["АналитикаВалюта"]);
	КонецЕсли;	
	тЗаписьКомментария.АналитикаВалюта = АналитикаВалюта;
	
	Если СтруктураРасшифровки.Свойство("Проект") Тогда
		тЗаписьКомментария.Проект = ?(СтруктураРасшифровки["Проект"]=Неопределено,Справочники.Проекты.ПустаяСсылка(),СтруктураРасшифровки["Проект"]);
	КонецЕсли;
	
	ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(СтруктураРасшифровки);
	ПараметрыНастроек.ШаблонДокумента = ОбщегоНазначенияУХ.ЗначениеРеквизитаОбъекта(СтруктураРасшифровки.ПоказательСсылка, "Владелец");
	тЗаписьКомментария.ПравилоОбработки = УправлениеОтчетамиУХ.ЗначениеНастройкиОбработкиШаблонов(ПараметрыНастроек, "ПравилоОбработки");
	
	тЗаписьКомментария.Записать();
	
	ОблДляВставки.Примечание.Текст = ЗначениеКомментария;
	
	ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,тМакет.Область(ИмяОбласти));
	
	Возврат СтруктураРасшифровки;
	
КонецФункции

Процедура ОчиститьПоказателиТекущегоЭкземпляраОтчета(ЭтаФорма,Валюта,Периоды,СтруктураДопОтборов) Экспорт
		
	ОбъектРасчета = Новый Структура;
	
	ОбъектРасчета.Вставить("ВидОтчета", ЭтаФорма.Объект.ВидОтчета);
	ОбъектРасчета.Вставить("Сценарий", ЭтаФорма.Объект.Сценарий);
	ОбъектРасчета.Вставить("Организация", ЭтаФорма.Объект.Организация);
	ОбъектРасчета.Вставить("ОсновнаяВалюта", ЭтаФорма.Объект.ОсновнаяВалюта);
	ОбъектРасчета.Вставить("Проект", ЭтаФорма.Объект.Проект);
	
	ТаблицаИзмененныхПоказателей = ПолучитьТаблицуДанныхДляОчистки(ЭтаФорма,Периоды,СтруктураДопОтборов,ОбъектРасчета);
	ТаблицаИзмененныхПоказателей.Колонки.ПоказательОтчета.Имя  = "Показатель";
	ТаблицаИзмененныхПоказателей.Колонки.Добавить("ПравилоОбработки");
	
	АдресТаблицыИзмененныхПоказателей = ПоместитьВоВременноеХранилище(ТаблицаИзмененныхПоказателей,ЭтаФорма.УникальныйИдентификатор);

	ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.ОчисткаДиапазонаЯчеек;
		
	// Выполним расчет зависимых показателей
	РассчитатьЗависимыеПоказатели(ЭтаФорма, Валюта, АдресТаблицыИзмененныхПоказателей, Ложь);

	ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,"");
	
КонецПроцедуры	

Функция ПолучитьТаблицуДанныхДляОчистки(ЭтаФорма,Периоды,ДопОтборы,ОбъектРасчета,ИспользуемыеПоказатели = Неопределено) Экспорт
		
	СтруктураПараметров = Новый Структура;
	
	Если ИспользуемыеПоказатели = Неопределено Тогда
		СтруктураПараметров.Вставить("ВидОтчета",ОбъектРасчета.ВидОтчета);
	Иначе
		СтруктураПараметров.Вставить("ПоказательОтчета",ИспользуемыеПоказатели);
	КонецЕсли;	
		
	СтруктураПараметров.Вставить("Сценарий",ОбъектРасчета.Сценарий);
	СтруктураПараметров.Вставить("Организация",ОбъектРасчета.Организация);
	СтруктураПараметров.Вставить("ПериодОтчета",Периоды);
	СтруктураПараметров.Вставить("Валюта",ОбъектРасчета.ОсновнаяВалюта);
	
	Если ЗначениеЗаполнено(ОбъектРасчета.Проект) Тогда
		СтруктураПараметров.Вставить("Проект",ОбъектРасчета.Проект);
	КонецЕсли;	
	
	Для Каждого ДопОтбор Из ДопОтборы Цикл 
		СтруктураПараметров.Вставить(ДопОтбор.Ключ,ДопОтбор.Значение);
	КонецЦикла;
	
	РаскрываемыеАналитики = Новый Структура;
	Для Инд = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		РаскрываемыеАналитики.Вставить("Аналитика"+Инд);
	КонецЦикла;
	
	РаскрываемыеАналитики.Вставить("АналитикаВалюта");
	
	СтруктураДопПараметров  = Новый Структура;
	Если НЕ ЭтаФорма = Неопределено Тогда
		СтруктураДопПараметров.Вставить("ИдентификаторСеанса",ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	СтруктураДопПараметров.Вставить("РежимИнверсии",Истина);
	
	Возврат СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(СтруктураПараметров,РаскрываемыеАналитики,СтруктураДопПараметров);
		
КонецФункции

Функция ВставитьЗначениеПоказателяОбратноеРаспределение(ЭтаФорма,СтруктураПараметровВход) Экспорт
	
	тМакет 								= ЭтаФорма[ЭтаФорма.ТекущийМакет];	
	СтруктураРасшифровки 				= Новый Структура;
	ОбъектАБ 							= ЭтаФорма.РеквизитФормыВЗначение(ЭтаФорма.ТекущийОбъектАБ);
	АдресТаблицыИзмененныхПоказателей	= ПоместитьВоВременноеХранилище(СтруктураПараметровВход.ДанныеДляРаспределения,ЭтаФорма.УникальныйИдентификатор);
	
	ПредставлениеТранзакции = Перечисления.ТранзакцииИзмененияПоказателей.ИзменениеПоказателя;
	
	Валюта = СтруктураПараметровВход.ВалютаОтображения;
		
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("РасчетИЗаписьПоказателей");
	
	ПараметрыРасчета 									= ОбработкаОбъект.ПараметрыРасчета();
	ПараметрыРасчета.АдресТаблицыИзмененныхПоказателей 	= АдресТаблицыИзмененныхПоказателей;
	ПараметрыРасчета.НомерТранзакции 					= ЭтаФорма.НомерТранзакции;	
	ПараметрыРасчета.ЗначениеДляРаспределения 			= СтруктураПараметровВход.ЗначениеДляРаспределения;
	ПараметрыРасчета.МетодРаспределения	 				= СтруктураПараметровВход.МетодРаспределения;	

	Результат											= ОбработкаОбъект.РассчитатьПоЗначениямИзмененныхПоказателей(ПараметрыРасчета);

	ЭтаФорма.ЗначениеВРеквизитФормы(ОбработкаОбъект, "РасчетИЗаписьПоказателей");
	
	ДобавитьЗаписьвЖурналДействий(ЭтаФорма,ПредставлениеТранзакции,"");
	
	Возврат СтруктураРасшифровки;
	
КонецФункции

#КонецОбласти

#Область РасчетЗависимыхПриРучномПересчете

Функция ВыполнитьОтложенныйРасчетЗависимых(ЭтаФорма, Валюта) Экспорт
	
	УИДФормы = ЭтаФорма.УникальныйИдентификатор;
	ТаблицаИзмененных = УправлениеРасчетомПоказателей.ПолучитьЛогЧисловыхИзмененныхПоказателей(УИДФормы);
	ТаблицаИзмененных.ЗаполнитьЗначения(0, "Значение");
	ТаблицаИзмененных.ЗаполнитьЗначения(0, "ЗначениеВалюта");
	АдресТаблицыИзмененныхПоказателей = ПоместитьВоВременноеХранилище(ТаблицаИзмененных, УИДФормы);
	
	Результат = РассчитатьЗависимыеПоказатели(ЭтаФорма, Валюта, АдресТаблицыИзмененныхПоказателей,, Истина);
	
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДобавитьЗаписьВЖурналДействий(ЭтаФорма, Перечисления.ТранзакцииИзмененияПоказателей.ЗаполнениеПоПравилу,
		НСтр("ru='Расчет зависимых показателей'"));
	
	ЭтаФорма.НуженПересчет = Ложь;
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьЗначенияПоказателейВЛог(ЭтаФорма, Знач АдресТаблицыИзмененныхПоказателей) Экспорт
	
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("РасчетИЗаписьПоказателей");
	
	ОбработкаОбъект.АдресТаблицыИзмененныхПоказателей = АдресТаблицыИзмененныхПоказателей;
	ОбъектРасчета = НовыйОбъектРасчета(ЭтаФорма);
	Результат = ОбработкаОбъект.ДобавитьЗначенияПоказателейВЛог(ОбъектРасчета, ЭтаФорма.НомерТранзакции);
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ОбработкаОбъект, "РасчетИЗаписьПоказателей");
	
	ЭтаФорма.Элементы.НадписьОбновитеТаблицу.Видимость = Истина;
	ЭтаФорма.НуженПересчет = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйОбъектРасчета(ЭтаФорма)
	
	ОбъектРасчета = Новый Структура;
	
	Если СтрНайти(ЭтаФорма.ИмяФормы, "АналитическийБланк") Тогда
		
		Источник = ЭтаФорма;
		ОбъектРасчета.Вставить("ПериодОтчета", Источник.ПериодС);
		
		ТзСвойстваПоказателей = ПолучитьИзВременногоХранилища(ЭтаФорма.ОбъектАналитическогоБланка.ТзСвойстваПоказателейАдрес);
		СтрокаСвойств = ТзСвойстваПоказателей.Найти(Источник.ВидОтчета, "ВидОтчета");
		Если СтрокаСвойств <> Неопределено Тогда
			Для Номер = 1 По СтрокаСвойств.ВидОтчетаЧислоАналитик Цикл
				
				КодАналитикиН = "ВОВидАналитики" + Номер + "Код";
				АналитикаН = "Аналитика" + Номер;
				ОбъектРасчета.Вставить(АналитикаН, Источник[СтрокаСвойств[КодАналитикиН]]);
				
			КонецЦикла;
		КонецЕсли;
		
	Иначе // НастраиваемыйОтчет
		
		Источник = ЭтаФорма.Объект;
		ОбъектРасчета.Вставить("ПериодОтчета", Источник.ПериодОтчета);
		
		Для Номер = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
			
			АналитикаН = "Аналитика" + Номер;
			Если Источник[АналитикаН] = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ОбъектРасчета.Вставить(АналитикаН, Источник[АналитикаН]);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Проект") Тогда
		ОбъектРасчета.Вставить("Проект", Источник.Проект);
	КонецЕсли;
	
	ОбъектРасчета.Вставить("ВидОтчета",   Источник.ВидОтчета);
	ОбъектРасчета.Вставить("Сценарий",    Источник.Сценарий);
	ОбъектРасчета.Вставить("Организация", Источник.Организация);
	ОбъектРасчета.Вставить("СпособФормированияОтчета", Перечисления.СпособыФормированияОтчетов.РучноеЗаполнение);
	
	Возврат ОбъектРасчета;
	
КонецФункции

#КонецОбласти

#Область КонтекстноеОбновлениеЗависимыхПоказателей

Процедура ОбновитьЗависимыеЯчейки(ЭтаФорма,Валюта,ТаблицаИзмененныхПоказателей,ТаблицаРассчитаныхПоказателей,ОбновитьМакет = Ложь) Экспорт

	тОбъектАБ     			= ЭтаФорма[ЭтаФорма.ТекущийОбъектАБ];
    тМакет                  = ЭтаФорма[ЭтаФорма.ТекущийМакет];
	
	//Добавим рассчитанные в основной лог 
	Для Каждого СтрЛог Из ТаблицаРассчитаныхПоказателей Цикл	
		нСтрЛог = ТаблицаИзмененныхПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрЛог,СтрЛог);	
	КонецЦикла;	
	
	//Если ничего не менялось - выходим.
	Если ТаблицаИзмененныхПоказателей.Количество() = 0 Тогда
		 Возврат;
	КонецЕсли;	
	
	//Если изменилось больше 10% ячеек в документе - быстрее вывести макет целиком
	//Если ОбновитьМакет ИЛИ (ТаблицаИзмененныхПоказателей.Количество()*100)/((тМакет.ШиринаТаблицы-1)*(тМакет.ВысотаТаблицы-1))>10 Тогда
		ЭтаФорма.НарисоватьТаблицуСервер();	
		Возврат;	
	//КонецЕсли;	
	
	
	Если  ЭтаФорма.ТекущийДелитель = 1 Тогда
		КоличествоГрупп = "";
	ИначеЕсли ЭтаФорма.ТекущийДелитель = 1000 Тогда
		КоличествоГрупп = "3";
	ИначеЕсли ЭтаФорма.ТекущийДелитель = 1000000 Тогда
		КоличествоГрупп = "6";                 
	КонецЕсли;	

	
	тВыводимыхОбластей = ПолучитьИзВременногоХранилища(тОбъектАБ.тКэшОбластейРаскрытияАдрес);
	
	тРасшифровкаГруппОтборов = тОбъектАБ.РасшифровкаГруппОтборов.Выгрузить();
	тРасшифровкаГруппОтборов.Индексы.Добавить("УИДГруппыОтборов");
	
	тГруппыОтборов  = тРасшифровкаГруппОтборов.Скопировать();
	тГруппыОтборов.Свернуть("УидГруппыОтборов");
	
	тКэшГруппОтборовПоказателей = тОбъектАБ.КэшГруппОтборовПоказателей.Выгрузить();
	тКэшГруппОтборовПоказателей.Индексы.Добавить("УИДГруппыОтборов");
	
	тИзмененныеПоказатели = ТаблицаИзмененныхПоказателей.Скопировать();
	тИзмененныеПоказатели.Свернуть("Показатель");

	тОбластиСинтетика = ПолучитьИзВременногоХранилища(тОбъектАБ.тзПоказателиАдрес).Скопировать(Новый Структура("ТолькоСинтетика",Истина));
	
	тКэшПоказателейКроссОбластей = ПолучитьИзВременногоХранилища(тОбъектАБ.КэшПоказателейКроссОбластейАдрес);
	тКэшПоказателейКроссОбластей.Индексы.Добавить("ИмяФормулы");
	ТзПоказателиМакетовРаскрытий = ПолучитьИзВременногоХранилища(тОбъектАБ.ПоказателиМакетовРаскрытийАдрес);
	
	ТзЗапросыДляОбновления = Новый ТаблицаЗначений;
	ТзЗапросыДляОбновления.Колонки.Добавить("Показатель");
	ТзЗапросыДляОбновления.Колонки.Добавить("УИДГруппыОтборов");
	ТзЗапросыДляОбновления.Колонки.Добавить("ИндексЗапросаВПакете");
    ТзЗапросыДляОбновления.Колонки.Добавить("СтрокаГруппировок");
    ТзЗапросыДляОбновления.Колонки.Добавить("СтруктураГруппировок");
    ТзЗапросыДляОбновления.Колонки.Добавить("ТекОтбор");
	
	ТзПараметровЗапроса = Новый ТаблицаЗначений;
	ТзПараметровЗапроса.Колонки.Добавить("ИмяОтбора");
	ТзПараметровЗапроса.Колонки.Добавить("ТипОтбора");
	ТзПараметровЗапроса.Колонки.Добавить("ЗначениеОтбора");
    ТзПараметровЗапроса.Колонки.Добавить("УидГруппыОтбора");
	
	КэшАналитикПоказателей 		= ПолучитьИзВременногоХранилища(тОбъектАБ.КэшАналитикПоказателейАдрес);
	мПоказателиРаскрытия    	= ПолучитьИзВременногоХранилища(тОбъектАБ.мПоказателиРаскрытияАдрес);
	ЛогИзмененныхПоказателей    = ПолучитьЛогИзмененныхПоказателей(ЭтаФорма.УникальныйИдентификатор);
	КэшФормулОбластейПоказателей = тОбъектАБ.КэшФормулОбластейПоказателей.Выгрузить();
	
	Если ЗначениеЗаполнено(тОбъектАБ.СтруктураРасшифровкаОбластейХАдрес) Тогда 
		ТзПоказателейОбластейКолонки 			= ПолучитьИзВременногоХранилища(тОбъектАБ.ТзПоказателейОбластейКолонкиАдрес);
		СтруктураРасшифровкаОбластейХ		    = ПолучитьИзВременногоХранилища(тОбъектАБ.СтруктураРасшифровкаОбластейХАдрес);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(тОбъектАБ.СтруктураРасшифровкаОбластейYАдрес) Тогда 
		ТзПоказателейОбластейСтроки 			= ПолучитьИзВременногоХранилища(тОбъектАБ.ТзПоказателейОбластейСтрокиАдрес);
		СтруктураРасшифровкаОбластейY		    = ПолучитьИзВременногоХранилища(тОбъектАБ.СтруктураРасшифровкаОбластейYАдрес);
	КонецЕсли;	
	
	тОбновляемыеОбласти = Новый ТаблицаЗначений;
		
	тОбновляемыеОбласти.Колонки.Добавить("Показатель");
	тОбновляемыеОбласти.Колонки.Добавить("УидГруппыОтборов");
	тОбновляемыеОбласти.Колонки.Добавить("ИмяКроссОбласти");
	тОбновляемыеОбласти.Колонки.Добавить("ПериодОтчета");
	тОбновляемыеОбласти.Колонки.Добавить("Организация");
	тОбновляемыеОбласти.Колонки.Добавить("Сценарий");
	тОбновляемыеОбласти.Колонки.Добавить("Проект");
	тОбновляемыеОбласти.Колонки.Добавить("ЭтоФормула");
	тОбновляемыеОбласти.Колонки.Добавить("СтрГруппировки");
	тОбновляемыеОбласти.Колонки.Добавить("Значение");
	тОбновляемыеОбласти.Колонки.Добавить("ДетальнаяЗапись");
	тОбновляемыеОбласти.Колонки.Добавить("ТипОбласти");
    тОбновляемыеОбласти.Колонки.Добавить("СмещениеХ");
	тОбновляемыеОбласти.Колонки.Добавить("СмещениеY");
	тОбновляемыеОбласти.Колонки.Добавить("ИмяОбластиСтрок");
	тОбновляемыеОбласти.Колонки.Добавить("ИмяОбластиКолонок");
    тОбновляемыеОбласти.Колонки.Добавить("ИмяФормулы");
	тОбновляемыеОбласти.Колонки.Добавить("ИмяОперанда");
	тОбновляемыеОбласти.Колонки.Добавить("ЭтоИтогПоПериоду",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
    тОбновляемыеОбласти.Колонки.Добавить("ЭтоИтогПоАналитике",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());

	МассивУдаляемыхСтрокОбластей = Новый Массив;
		
	тПоказатели 					=  ПолучитьИзВременногоХранилища(тОбъектАБ.ТзСвойстваПоказателейАдрес);	
	СтруктураТекущихГруппУид 		= Новый Структура;	
	ЗаполнитьСтруктураТекущихГруппУид(тГруппыОтборов,тРасшифровкаГруппОтборов,СтруктураТекущихГруппУид);
	ФлОбновитьМакет = Ложь;
	
	
	Для Каждого СтрПоказатель Из ТаблицаИзмененныхПоказателей Цикл
			
		//Валютные ячейки контекстно не обновляются. 
		Если ЗначениеЗаполнено(СтрПоказатель.ЗначениеВалюта) И Не ЗначениеЗаполнено(СтрПоказатель.Значение) Тогда
			ФлОбновитьМакет = Истина;
			Прервать;
		КонецЕсли;	
		
		//Добавление итогов по раскрытиям
		тИтогиПоПоказателям = тКэшПоказателейКроссОбластей.НайтиСтроки(Новый Структура("Показатель",СтрПоказатель.Показатель));
		
		Для Каждого текПоказатель Из тИтогиПоПоказателям Цикл
				
			тПоказатель_ = тПоказатели.Найти(СтрПоказатель.Показатель,"Ссылка");
					
			нТобновляемаяОбласть 				= тОбновляемыеОбласти.Добавить();	
			тАналитикиОбласти                   = СтрРазделить(текПоказатель.СтрГруппировки,";");	
			ФлДетали = Истина;
			
			тГруппаПоказателя = КэшАналитикПоказателей.Найти(СтрПоказатель.Показатель,"Показатель");
			Для Инд = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
				Если  ЗначениеЗаполнено(тГруппаПоказателя["ВидАналитики"+Инд])  Тогда	
					тКэшАналитикаКод = СокрЛП(тГруппаПоказателя["ВидАналитики"+Инд+"Код"]);
						
					Если тОбновляемыеОбласти.Колонки.Найти(тКэшАналитикаКод) = Неопределено Тогда
						тОбновляемыеОбласти.Колонки.Добавить(тКэшАналитикаКод);
					КонецЕсли;	
					
					Если НЕ тАналитикиОбласти.Найти(тКэшАналитикаКод)=Неопределено Тогда
						нТобновляемаяОбласть[тКэшАналитикаКод] = СтрПоказатель["Аналитика"+Инд];
					Иначе							
						Если НЕ тПоказатель_["ВОВидАналитики"+Инд+"Код"] = тКэшАналитикаКод Тогда  //Это аналитика вида отчета
							ФлДетали = Ложь;	
						КонецЕсли;
					КонецЕсли;						
				Иначе	
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			
			Если ЗначениеЗаполнено(тГруппаПоказателя.ВидАналитикиВалютаКод)  Тогда	
				тКэшАналитикаКод = СокрЛП(тГруппаПоказателя["ВидАналитикиВалютаКод"]);
				Если тОбновляемыеОбласти.Колонки.Найти(тКэшАналитикаКод) = Неопределено Тогда
					тОбновляемыеОбласти.Колонки.Добавить(тКэшАналитикаКод);
				КонецЕсли;	
				Если НЕ тАналитикиОбласти.Найти(тКэшАналитикаКод)=Неопределено Тогда
					нТобновляемаяОбласть[тКэшАналитикаКод] = СтрПоказатель["АналитикаВалюта"];
				ИНаче	
					ФлДетали = Ложь;
				КонецЕсли;		
			КонецЕсли;	
			
			Если НЕ тАналитикиОбласти.Найти("ПериодОтчета")=Неопределено Тогда
				нТобновляемаяОбласть["ПериодОтчета"] = СтрПоказатель["ПериодОтчета"];
			Иначе	
				нТобновляемаяОбласть.ЭтоИтогПоПериоду = Истина;
				ФлДетали = Ложь;
			КонецЕсли;	
			
			Если НЕ тАналитикиОбласти.Найти("Организация")=Неопределено Тогда	
				нТобновляемаяОбласть["Организация"] = СтрПоказатель["Организация"];
			КонецЕсли;	
			
			Если НЕ тАналитикиОбласти.Найти("Сценарий")=Неопределено Тогда	
				нТобновляемаяОбласть["Сценарий"] = СтрПоказатель["Сценарий"];	
			КонецЕсли;	
			
			Если НЕ тАналитикиОбласти.Найти("Проект")=Неопределено Тогда	
				нТобновляемаяОбласть["Проект"] = СтрПоказатель["Проект"];
			КонецЕсли;	
			
			ЗаполнитьЗначенияСвойств(нТобновляемаяОбласть,текПоказатель);
			
			Если текПоказатель.ЭтоФормула Тогда
				МассивУдаляемыхСтрокОбластей.Добавить(нТобновляемаяОбласть);
				ЗаполнитьОперандыОбновляемойОбласти(текПоказатель,нТобновляемаяОбласть,тОбновляемыеОбласти,тКэшПоказателейКроссОбластей);
			КонецЕсли;
			
			Если   СтруктураТекущихГруппУид.Свойство("УИД_"+текПоказатель.УидГруппыОтборов) Тогда
				//Если ЗначениеЗаполнено(СтрПоказатель.ЗначениеВалюта) И Не ЗначениеЗАполнено(СтрПоказатель.Значение) Тогда
				//	нТобновляемаяОбласть.Значение = СтрПоказатель.ЗначениеВалюта;	
				Если тПоказатель_.ТипЗначенияЧисло Тогда	
					нТобновляемаяОбласть.Значение = СтрПоказатель.Значение;
				Иначе
					нТобновляемаяОбласть.Значение = СтрПоказатель.ЗначениеНечисловое;
				КонецЕсли;
								
				нТобновляемаяОбласть.ДетальнаяЗапись = ФлДетали;
			Иначе		
				Если тПоказатель_.ТипЗначенияЧисло Тогда	
					нТобновляемаяОбласть.Значение = 0;
				КонецЕсли;
			КонецЕсли;	
						
		КонецЦикла;
						
	КонецЦикла;	
	
	Если ФлОбновитьМакет Тогда
		ЭтаФорма.НарисоватьТаблицуСервер();	
		Возврат;	
	КонецЕсли;	

	
	//Обновление ячеек
	Для Каждого УдСтр Из   МассивУдаляемыхСтрокОбластей Цикл
		тОбновляемыеОбласти.Удалить(УдСтр);
	КонецЦикла;	  
	
	тЗапросыОбновляемыхОбластей 	= тОбновляемыеОбласти.Скопировать(Новый Структура("ДетальнаяЗапись",Ложь),"Показатель,УидГруппыОтборов,СтрГруппировки");
	тОбновляемыеОбласти.Индексы.Добавить("Показатель,УидГруппыОтборов,СтрГруппировки");
	
	тЗапросыОбновляемыхОбластей.Свернуть("Показатель,УидГруппыОтборов,СтрГруппировки");
	тЗапросыОбновляемыхОбластей.Колонки.Добавить("Результат");
	тЗапросыОбновляемыхОбластей.Индексы.Добавить("Показатель,УидГруппыОтборов,СтрГруппировки");
	 		
	тОбновляемыеОбластиФинал = Новый ТаблицаЗначений;	
	тДанные					 = Неопределено;
	
	СтруктураСлужебныхТаблиц    = Новый Структура;
	СтруктураСлужебныхТаблиц.Вставить("КэшАналитикПоказателей",КэшАналитикПоказателей);
	СтруктураСлужебныхТаблиц.Вставить("мПоказателиРаскрытия",мПоказателиРаскрытия);
	СтруктураСлужебныхТаблиц.Вставить("ЛогИзмененныхПоказателей",ЛогИзмененныхПоказателей);
    СтруктураСлужебныхТаблиц.Вставить("тЗапросыОбновляемыхОбластей",тЗапросыОбновляемыхОбластей);
    СтруктураСлужебныхТаблиц.Вставить("тПоказатели",тПоказатели);
	СтруктураСлужебныхТаблиц.Вставить("тВыводимыхОбластей",тВыводимыхОбластей);
	СтруктураСлужебныхТаблиц.Вставить("СтруктураРасшифровкаОбластейХ",СтруктураРасшифровкаОбластейХ);
	СтруктураСлужебныхТаблиц.Вставить("СтруктураРасшифровкаОбластейY",СтруктураРасшифровкаОбластейY);
	СтруктураСлужебныхТаблиц.Вставить("ТзПоказателиМакетовРаскрытий",ТзПоказателиМакетовРаскрытий);
	СтруктураСлужебныхТаблиц.Вставить("РасшифровкаГруппОтборов",тРасшифровкаГруппОтборов);
	СтруктураСлужебныхТаблиц.Вставить("СтруктураТекущихГруппУид",СтруктураТекущихГруппУид);
	СтруктураСлужебныхТаблиц.Вставить("тОбъектАБ",тОбъектАБ);
	СтруктураСлужебныхТаблиц.Вставить("Валюта",Валюта);
	СтруктураСлужебныхТаблиц.Вставить("КоличествоГрупп",КоличествоГрупп);
	
	
	//Пересчитаем итоговые ячейки бланка, если они есть.
	ОбновитьЗначенияПоказателей(ЭтаФорма,тМакет,тОбновляемыеОбласти,СтруктураСлужебныхТаблиц);
	
	тОперандыОбластей  				=  тКэшПоказателейКроссОбластей.Скопировать(Новый Структура("ЭтоФормула",Истина));
	тОперандыОбластей.Колонки.Добавить("Результат");
	тОперандыОбластей.Индексы.Добавить("ИмяФормулы");
	
	тФормулыОбластей                =  тОбновляемыеОбласти.Скопировать(Новый Структура("ЭтоФормула",Истина));
	СтрокаСверткиФормул             =  "";
	
	тОбновляемыеОбласти.Индексы.Добавить("ИмяОперанда,ИмяФормулы,ИмяКроссОбласти");
	
	Для Каждого Кол Из тФормулыОбластей.Колонки Цикл
		Если Кол.Имя = "Показатель" ИЛИ  Кол.Имя = "УидГруппыОтборов" ИЛИ Кол.Имя = "ИмяОперанда" Тогда
			 Продолжить;
		КонецЕсли;		
		СтрокаСверткиФормул = СтрокаСверткиФормул+Кол.Имя+",";	
	КонецЦикла;	
	
	СтрокаСверткиФормул = ЛЕВ(СтрокаСверткиФормул,СтрДлина(СтрокаСверткиФормул)-1);
	//Вычислим все области с формулами
	тФормулыОбластей.Свернуть(СтрокаСверткиФормул);

	СтруктураСлужебныхТаблиц.Вставить("тФормулыОбластей",тФормулыОбластей);
	СтруктураСлужебныхТаблиц.Вставить("тОперандыОбластей",тОперандыОбластей);
	СтруктураСлужебныхТаблиц.Вставить("КэшФормулОбластейПоказателей",КэшФормулОбластейПоказателей);

	//Пересчитаем ячейки динамических формул бланка, если они есть.
	ОбновитьЗначенияДинамическихФормул(Валюта,тМакет,тОбновляемыеОбласти,СтруктураСлужебныхТаблиц);
	
	ИмяИнтерактивноИзмененнойОбласти = "";
				
КонецПроцедуры

Процедура ПолучитьЗначениеИзТекущихДанных(Валюта,тОбновляемаяОбласть,тПоказатель,СтруктураСлужебныхТаблиц,ВидИтога = Неопределено)
			
	тОбновляемаяОбласть.Значение = ПолучитьЗначениеИзКонтекста(Валюта,тОбновляемаяОбласть,тПоказатель,СтруктураСлужебныхТаблиц,ВидИтога)
	
КонецПроцедуры	

Функция ПолучитьЗначениеИзКонтекста(Валюта,тОбновляемаяОбласть,тПоказатель,СтруктураСлужебныхТаблиц,ВидИтогаПоказателя)
	
	ВидИтога = ?(ВидИтогаПоказателя = Неопределено,Перечисления.ВидыИтоговПоказателя.Сумма,ВидИтогаПоказателя);
	
	тАналитикиЗапроса                   = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
    СтруктураПоиска                     = Новый Структура;
	СтруктураПоиска.Вставить("Показатель",тОбновляемаяОбласть.Показатель);
	СтруктураПоиска.Вставить("Валюта",Валюта);
	
	Для Каждого СтрИтог Из тАналитикиЗапроса Цикл
		
		Если СтрИтог = "" Тогда	
			Продолжить;	
		ИначеЕсли  СтрИтог = "ПериодОтчета" ИЛИ СтрИтог = "Сценарий" ИЛИ СтрИтог = "Организация" ИЛИ СтрИтог = "Проект" Тогда	
			СтруктураПоиска.Вставить(СтрИтог,тОбновляемаяОбласть[СтрИтог]);	
		Иначе	 
			
			тГруппаПоказателя = СтруктураСлужебныхТаблиц.КэшАналитикПоказателей.Найти(тОбновляемаяОбласть.Показатель,"Показатель");
			Для Инд = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
				Если  СокрЛП(тГруппаПоказателя["ВидАналитики"+Инд+"Код"]) = СтрИтог Тогда
										
					СтруктураПоиска.Вставить("Аналитика"+Инд,тОбновляемаяОбласть[СтрИтог]);
	
				КонецЕсли;						
			КонецЦикла;	
			Если тГруппаПоказателя.ВидАналитикиВалютаКод =  СтрИтог Тогда	
				СтруктураПоиска.Вставить("АналитикаВалюта",тОбновляемаяОбласть[СтрИтог]);
			КонецЕсли;	
						
		КонецЕсли;			
		
	КонецЦикла;	
	
	ЗначенияИзЛога = Неопределено;
	ФлПоискаЛога   = Истина;
	Если СтруктураСлужебныхТаблиц.ЛогИзмененныхПоказателей.Количество()>0 Тогда 
		Если Не СтруктураПоиска.Свойство("Сценарий") Тогда //Сценарий не определен 
			тГруппаОтборов = СтруктураСлужебныхТаблиц.РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов,ПолеКод",тОбновляемаяОбласть.УидГруппыОтборов,"Сценарий"))[0]; 	
			Если НЕ (тГруппаОтборов.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета ИЛИ тГруппаОтборов.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится) Тогда
				 ФлПоискаЛога = Ложь;
			КонецЕсли;	
		КонецЕсли;	
		Если Не СтруктураПоиска.Свойство("Организация") Тогда //Организация не определена 
			тГруппаОтборов = СтруктураСлужебныхТаблиц.РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов,ПолеКод",тОбновляемаяОбласть.УидГруппыОтборов,"Организация"))[0]; 	
			Если НЕ (тГруппаОтборов.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета ИЛИ тГруппаОтборов.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится) Тогда
				 ФлПоискаЛога = Ложь;
			КонецЕсли;	
		КонецЕсли;
		
		Если Не СтруктураПоиска.Свойство("Проект") Тогда //Организация не определена 
			тГруппаОтборов = СтруктураСлужебныхТаблиц.РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов,ПолеКод",тОбновляемаяОбласть.УидГруппыОтборов,"Проект"))[0];	
			Если НЕ (тГруппаОтборов.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета ИЛИ тГруппаОтборов.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится) Тогда
				 ФлПоискаЛога = Ложь;
			КонецЕсли;	
		КонецЕсли;
		
		Если ФлПоискаЛога Тогда
			 ЗначенияИзЛога = СтруктураСлужебныхТаблиц.ЛогИзмененныхПоказателей.НайтиСтроки(СтруктураПоиска);	
		КонецЕсли;	
		
	КонецЕсли;
	
	СтруктураПоиска.Удалить("Валюта");
	СтруктураПоиска.Вставить("УидГруппыОтборов",тОбновляемаяОбласть.УидГруппыОтборов);
	
	Если ВидИтога = Перечисления.ВидыИтоговПоказателя.Сумма Тогда //Для суммы достаточно свернуть итоговые значения 
		
		ИтоговаяТаблица = СтруктураСлужебныхТаблиц.мПоказателиРаскрытия.Скопировать(СтруктураПоиска,"Значение");
		
		Если НЕ ЗначенияИзЛога = Неопределено Тогда 
			Для Каждого Стр Из ЗначенияИзЛога Цикл
				Нстр = ИтоговаяТаблица.Добавить();
				Нстр.Значение = Стр.Значение;
			КонецЦикла;
		КонецЕсли;
		
	Иначе	
		
		ИтоговаяТаблица = СтруктураСлужебныхТаблиц.мПоказателиРаскрытия.Скопировать(СтруктураПоиска);
		СтрокаСвертки   = "";
		
		Если НЕ ЗначенияИзЛога = Неопределено Тогда 
			Для Каждого Стр Из ЗначенияИзЛога Цикл
				Нстр = ИтоговаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,Стр);
				Нстр.Значение = Стр.Значение;			
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Кол Из ИтоговаяТаблица.Колонки Цикл
			Если Кол.Имя = "УидГруппыОтборов" 
				ИЛИ Кол.Имя = "Значение"   
				   ИЛИ Кол.Имя = "ИмяОбластиДляВывода"
				      ИЛИ Кол.Имя = "ПоказательКод" 
					  	ИЛИ Кол.Имя = "ЗначениеНеЧисло"
							ИЛИ Кол.Имя = "ЗначениеВалюта" Тогда
				Продолжить;
			Иначе	
				СтрокаСвертки = СтрокаСвертки+Кол.Имя+",";
			КонецЕсли;	
		КонецЦикла;	
		СтрокаСвертки = Лев(СтрокаСвертки,СтрДлина(СтрокаСвертки)-1);	
		ИтоговаяТаблица.Свернуть(СтрокаСвертки,"Значение");
		
	КонецЕсли;
	
	ИтоговоеЗначение = 0;
	
	Если ВидИтога = Перечисления.ВидыИтоговПоказателя.Сумма Тогда
		
		Если ИтоговаяТаблица.Количество()>0 Тогда	
			ИтоговаяТаблица.Свернуть(,"Значение");
			ИтоговоеЗначение = ИтоговаяТаблица[0].Значение;
		КонецЕсли;
		
	ИначеЕсли ВидИтога = Перечисления.ВидыИтоговПоказателя.Минимум Тогда
		
		Если ИтоговаяТаблица.Количество()>0 Тогда	
			ИтоговаяТаблица.Сортировать("Значение");
			ИтоговоеЗначение = ИтоговаяТаблица[0].Значение;
		КонецЕсли;
	
	ИначеЕсли ВидИтога = Перечисления.ВидыИтоговПоказателя.Максимум Тогда
		
		Если ИтоговаяТаблица.Количество()>0 Тогда	
			ИтоговаяТаблица.Сортировать("Значение УБЫВ");
			ИтоговоеЗначение = ИтоговаяТаблица[0].Значение;
		КонецЕсли;
	
	ИначеЕсли ВидИтога = Перечисления.ВидыИтоговПоказателя.Среднее Тогда	   
		
		Если ИтоговаяТаблица.Количество()>0 Тогда	
			КоличествоЗаписей = ИтоговаяТаблица.Количество();
			ИтоговаяТаблица.Свернуть(,"Значение");	
			ИтоговоеЗначение = ИтоговаяТаблица[0].Значение/КоличествоЗаписей;
		КонецЕсли;
	
	КонецЕсли;	
	
	Возврат ИтоговоеЗначение; 
	
КонецФункции	

Процедура ЗаполнитьСтруктураТекущихГруппУид(тГруппыОтборов,тРасшифровкаГруппОтборов,СтруктураТекущихГруппУид)

	//Вычисляем обновляемые группы отборов...
	Для Каждого СтрОтбор Из тГруппыОтборов Цикл
		
		РасшифровкиГруппы = тРасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов",СтрОтбор.УидГруппыОтборов));		
		ФлДетали = Истина;
		
		Для Каждого Стр Из РасшифровкиГруппы Цикл
			
			Если Стр.Поле = "Сценарий" И НЕ (Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета ИЛИ Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится) Тогда
				 ФлДетали = Ложь;
				 Прервать;
			КонецЕсли;	
				
			Если Стр.Поле = "Проект" И НЕ (Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета ИЛИ Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится) Тогда
				 ФлДетали = Ложь;
				 Прервать;
			КонецЕсли;
			
			Если Стр.Поле = "Организация" И НЕ (Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета ИЛИ Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится) Тогда
				 ФлДетали = Ложь;
				 Прервать;
			КонецЕсли;
			
			Если Стр.Поле = "ПериодС" И НЕ Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.ПериодНачалаОтчета Тогда
				 ФлДетали = Ложь;
				 Прервать;
			КонецЕсли;

			Если Стр.Поле = "ПериодПо" И НЕ Стр.Отбор =Перечисления.ВидыСравненияПоказателейОтчетов.ПериодОкончанияОтчета Тогда
				 ФлДетали = Ложь;
				 Прервать;
			КонецЕсли;
		
		КонецЦикла;	

		
		Если ФлДетали Тогда
			СтруктураТекущихГруппУид.Вставить("УИД_"+СтрОтбор.УидГруппыОтборов,СтрОтбор.УидГруппыОтборов);
		КонецЕсли;	
			
	КонецЦикла;


КонецПроцедуры	

Процедура ЗаполнитьОперандыОбновляемойОбласти(текПоказатель,нТобновляемаяОбласть,тОбновляемыеОбласти,тКэшПоказателейКроссОбластей)
	
	тОперандыПоПоказателям = тКэшПоказателейКроссОбластей.НайтиСтроки(Новый Структура("ИмяФормулы",текПоказатель.ИмяФормулы));
	
	Для Каждого СтрОперанд Из тОперандыПоПоказателям Цикл		
		нТобновляемаяОбластьОперанд =  тОбновляемыеОбласти.Добавить();
		ЗаполнитьЗначенияСвойств(нТобновляемаяОбластьОперанд,нТобновляемаяОбласть);	
		нТобновляемаяОбластьОперанд.Показатель 			= СтрОперанд.Показатель;		
		нТобновляемаяОбластьОперанд.ИмяОперанда 		= СтрОперанд.ИмяОперанда;
		нТобновляемаяОбластьОперанд.УидГруппыОтборов 	= СтрОперанд.УидГруппыОтборов;	
		нТобновляемаяОбластьОперанд.ДетальнаяЗапись     = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЗначенияПоказателей(ЭтаФорма,тМакет,тОбновляемыеОбласти,СтруктураСлужебныхТаблиц)
	
	тЗапросыОбновляемыхОбластей     = СтруктураСлужебныхТаблиц.тЗапросыОбновляемыхОбластей;
	тПоказатели                     = СтруктураСлужебныхТаблиц.тПоказатели;
	тВыводимыхОбластей              = СтруктураСлужебныхТаблиц.тВыводимыхОбластей;
	СтруктураРасшифровкаОбластейХ   = СтруктураСлужебныхТаблиц.СтруктураРасшифровкаОбластейХ;
	СтруктураРасшифровкаОбластейY   = СтруктураСлужебныхТаблиц.СтруктураРасшифровкаОбластейY;
	ТзПоказателиМакетовРаскрытий    = СтруктураСлужебныхТаблиц.ТзПоказателиМакетовРаскрытий;
	
	СтруктураДоступыхКолонок = Новый Структура;
	Для Каждого Кол Из тОбновляемыеОбласти.Колонки Цикл
		Если Кол.Имя = "СмещениеY"  ИЛИ
			 Кол.Имя = "СмещениеХ"  Тогда
			 Продолжить;
		КонецЕсли;
		СтруктураДоступыхКолонок.Вставить(Кол.Имя);
	КонецЦикла;	
	
	
	Для Каждого тОбновляемаяОбласть Из тОбновляемыеОбласти Цикл
		
		Если тОбновляемаяОбласть.ЭтоФормула Тогда
			 Продолжить;
		КонецЕсли;	
				
		тПоказатель      = тПоказатели.Найти(тОбновляемаяОбласть.Показатель,"Ссылка");
		
		Если тОбновляемаяОбласть.ТипОбласти = "Синтетика" Тогда
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			КоординатаХ = НачалоОбластиХ+тОбновляемаяОбласть.СмещениеХ-1;
			КоординатаY = НачалоОбластиY+(тОбновляемаяОбласть.СмещениеY-1);
			
			тОбластьДляВывода = тМакет.Область(КоординатаY,КоординатаХ,КоординатаY,КоординатаХ);

			УстановитьЗначениеВЯчейке(ЭтаФорма,тОбновляемаяОбласть,тПоказатель,тОбластьДляВывода,СтруктураСлужебныхТаблиц);			
									
		ИначеЕсли тОбновляемаяОбласть.ТипОбласти = "Колонки" Тогда	
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			
			КоординатаY = НачалоОбластиY+(тОбновляемаяОбласть.СмещениеY-1);
			
			СтруктураГРуппирвок = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора = Новый Структура;
			Для Каждого Кол Из СтруктураГРуппирвок Цикл
				СтруктураОтбора.Вставить(Кол,тОбновляемаяОбласть[Кол]);		
			КонецЦикла;	
					
			СтруктураОтбора 		= Новый Структура;
			ПолнаяСтруктураПоиска 	= СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если НЕ СтруктураДоступыхКолонок.Свойство(Кол.Имя) Тогда
					Продолжить;
				Иначе
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			
			КоординатаСмещенияX = СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].НайтиСтроки(СтруктураОтбора);
			
			Если КоординатаСмещенияX.Количество() = 1 Тогда
				КоординатаСмещенияX_ 			= КоординатаСмещенияX[0].СмещениеХ;
				КоординатаСмещенияПоказателяX  = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Показатель,УидГруппыОтборов,ИмяМакетаКолонок","Колонки",тОбновляемаяОбласть.Показатель,тОбновляемаяОбласть.УидГруппыОтборов, КоординатаСмещенияX[0].ИмяМакета))[0].СмещениеХ;
				
				
				тОбластьДляВывода = тМакет.Область(КоординатаY
				,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX
				,КоординатаY
				,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX);
				
				УстановитьЗначениеВЯчейке(ЭтаФорма,тОбновляемаяОбласть,тПоказатель,тОбластьДляВывода,СтруктураСлужебныхТаблиц);			
				
			КонецЕсли;	
			
		ИначеЕсли тОбновляемаяОбласть.ТипОбласти = "Строки" Тогда	
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			КоординатаХ = НачалоОбластиХ+тОбновляемаяОбласть.СмещениеХ-1;
			
			СтруктураГРуппирвок = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
			
			СтруктураОтбора = Новый Структура;
			Для Каждого Кол Из СтруктураГРуппирвок Цикл
				СтруктураОтбора.Вставить(Кол,тОбновляемаяОбласть[Кол]);		
			КонецЦикла;	
						
			СтруктураОтбора = Новый Структура;
			Если Не СтруктураРасшифровкаОбластейY.Свойство(тОбновляемаяОбласть.ИмяОбластиСтрок) Тогда
				 Продолжить;
			КонецЕсли;	
			
			ПолнаяСтруктураПоиска =   СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если НЕ СтруктураДоступыхКолонок.Свойство(Кол.Имя)  Тогда
					Продолжить;
				Иначе
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			КоординатаСмещенияY = СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].НайтиСтроки(СтруктураОтбора);
			
			Если КоординатаСмещенияY.Количество() = 1 Тогда
				КоординатаСмещенияY_			= КоординатаСмещенияY[0].СмещениеY-1;
				КоординатаСмещенияПоказателяY  = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Показатель,УидГруппыОтборов,ИмяМакетаСтрок","Строки",тОбновляемаяОбласть.Показатель,тОбновляемаяОбласть.УидГруппыОтборов, КоординатаСмещенияY[0].ИмяМакета))[0].СмещениеY;
				
									
				тОбластьДляВывода = тМакет.Область(НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
						,КоординатаХ
						,НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
						,КоординатаХ);
						
				УстановитьЗначениеВЯчейке(ЭтаФорма,тОбновляемаяОбласть,тПоказатель,тОбластьДляВывода,СтруктураСлужебныхТаблиц);			
				
			КонецЕсли;	
			
		ИначеЕсли тОбновляемаяОбласть.ТипОбласти = "Таблица" Тогда	
			
			
			тСтруктураТаблицы = Новый Структура;
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			СтруктураГРуппирвок = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
			
			СтруктураОтбора = Новый Структура;
			Если Не СтруктураРасшифровкаОбластейY.Свойство(тОбновляемаяОбласть.ИмяОбластиСтрок) Тогда
				 Продолжить;
			КонецЕсли;	
			
			ПолнаяСтруктураПоиска =   СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если НЕ СтруктураДоступыхКолонок.Свойство(Кол.Имя)  Тогда
					Продолжить;
				Иначе
					  
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
					тСтруктураТаблицы.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			КоординатаСмещенияY = СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].НайтиСтроки(СтруктураОтбора);
			Если КоординатаСмещенияY.Количество() = 1 Тогда
				КоординатаСмещенияY_ 	= КоординатаСмещенияY[0].СмещениеY-1;
				КоординатаСмещенияПоказателяY  = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Показатель,УидГруппыОтборов,ИмяМакетаСтрок","Таблица",тОбновляемаяОбласть.Показатель,тОбновляемаяОбласть.УидГруппыОтборов, КоординатаСмещенияY[0].ИмяМакета));
				Если КоординатаСмещенияПоказателяY.Количество() = 1 Тогда
					КоординатаСмещенияПоказателяY = КоординатаСмещенияПоказателяY[0].СмещениеY;
				Иначе
					Продолжить;
				КонецЕсли;	 
			Иначе	 
				Продолжить;
			КонецЕсли;	
			
			СтруктураОтбора 		= Новый Структура;
			ПолнаяСтруктураПоиска 	= СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если НЕ СтруктураДоступыхКолонок.Свойство(Кол.Имя)  Тогда
					Продолжить;
				Иначе
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
					тСтруктураТаблицы.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			КоординатаСмещенияX = СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].НайтиСтроки(СтруктураОтбора);
			
			Если КоординатаСмещенияX.Количество() = 1 Тогда
				КоординатаСмещенияX_ 			= КоординатаСмещенияX[0].СмещениеХ;
				КоординатаСмещенияПоказателяX  = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Показатель,УидГруппыОтборов,ИмяМакетаКолонок","Таблица",тОбновляемаяОбласть.Показатель,тОбновляемаяОбласть.УидГруппыОтборов, КоординатаСмещенияX[0].ИмяМакета))[0].СмещениеХ;
			Иначе	 
				Продолжить;	 
			КонецЕсли;	
			
			СтруктураОтбора = Новый Структура;
			Для Каждого Кол Из СтруктураГРуппирвок Цикл
				СтруктураОтбора.Вставить(Кол,тОбновляемаяОбласть[Кол]);		
			КонецЦикла;	
						
			тОбластьДляВывода = тМакет.Область(НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
			,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX
			,НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
			,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX);
			
			УстановитьЗначениеВЯчейке(ЭтаФорма,тОбновляемаяОбласть,тПоказатель,тОбластьДляВывода,СтруктураСлужебныхТаблиц);			
				
		КонецЕсли;						
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбновитьЗначенияДинамическихФормул(Валюта,тМакет,тОбновляемыеОбласти,СтруктураСлужебныхТаблиц)
	
	тЗапросыОбновляемыхОбластей     = СтруктураСлужебныхТаблиц.тЗапросыОбновляемыхОбластей;
	тПоказатели                     = СтруктураСлужебныхТаблиц.тПоказатели;
	тВыводимыхОбластей              = СтруктураСлужебныхТаблиц.тВыводимыхОбластей;
	СтруктураРасшифровкаОбластейХ   = СтруктураСлужебныхТаблиц.СтруктураРасшифровкаОбластейХ;
	СтруктураРасшифровкаОбластейY   = СтруктураСлужебныхТаблиц.СтруктураРасшифровкаОбластейY;
	ТзПоказателиМакетовРаскрытий    = СтруктураСлужебныхТаблиц.ТзПоказателиМакетовРаскрытий;
	тФормулыОбластей                = СтруктураСлужебныхТаблиц.тФормулыОбластей;
	тОперандыОбластей               = СтруктураСлужебныхТаблиц.тОперандыОбластей;
	КэшФормулОбластейПоказателей    = СтруктураСлужебныхТаблиц.КэшФормулОбластейПоказателей;
	РежимСводнойТаблицы				= СтруктураСлужебныхТаблиц.тОбъектАБ.РежимСводнойТаблицы;
	
	Для Каждого тОбновляемаяОбласть Из тФормулыОбластей Цикл
		
		КэшОперандов = Новый Структура;
		
		//Вычислим операнды текущей формулы
		тОперанды =  тОперандыОбластей.НайтиСтроки(Новый Структура("ИмяФормулы",тОбновляемаяОбласть.ИмяФормулы));
		
		Для Каждого СтрОперанд Из тОперанды Цикл
			
			СтруктураГРуппирвок = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
			
			//Если нужный операнд выводился в показатель, его можно взять оттуда
			тЗначенияОперандов =  тОбновляемыеОбласти.НайтиСтроки(Новый Структура("ИмяОперанда,ИмяФормулы,ИмяКроссОбласти",СтрОперанд.ИмяОперанда,СтрОперанд.ИмяФормулы,СтрОперанд.ИмяКроссОбласти));	
			
			//Попытаемся найти значение операнда в уже выведенных показателях
			//тЗначенияОперандов =  тОбновляемыеОбласти.НайтиСтроки(Новый Структура("Показатель,УидГруппыОтборов,ИмяКроссОбласти",СтрОперанд.Показатель,СтрОперанд.УидГруппыОтборов,СтрОперанд.ИмяКроссОбласти));		
			тЗначение = 0;
			//						
			//Если тЗначенияОперандов.Количество()>0 И ЗначениеЗаполнено(тЗначенияОперандов[0].Значение) Тогда
			//	тЗначение = тЗначенияОперандов[0].Значение;
			//Иначе 		
			тПоказатель      = тПоказатели.Найти(СтрОперанд.Показатель,"Ссылка");
			ПолучитьЗначениеИзТекущихДанных(Валюта,тЗначенияОперандов[0],тПоказатель,СтруктураСлужебныхТаблиц);
				
			тЗначение = тЗначенияОперандов[0].Значение;
			//КонецЕсли;
			
			КэшОперандов.Вставить(СтрОперанд.ИмяОперанда,тЗначение);
			
		КонецЦикла;	
		
		тФормула = КэшФормулОбластейПоказателей.Найти(тОбновляемаяОбласть.ИмяФормулы).ТекстФормулы;
		
		Попытка
			тЗначениеИтог = Вычислить(тФормула);
		Исключение
			тЗначениеИтог = "#Ошибка";
		КонецПопытки;
		
		//Вывод результата вычисления
		
		Если тОбновляемаяОбласть.ТипОбласти = "Синтетика" Тогда
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			КоординатаХ = НачалоОбластиХ+тОбновляемаяОбласть.СмещениеХ-1;
			КоординатаY = НачалоОбластиY+(тОбновляемаяОбласть.СмещениеY-1);
						
			тОбластьДляВывода = тМакет.Область(КоординатаY,КоординатаХ,КоординатаY,КоординатаХ);	
						
			Если  НЕ тОбластьДляВывода = Неопределено Тогда	
				УстановитьЗначениеФормулы(тОбластьДляВывода,тЗначениеИтог,РежимСводнойТаблицы);
			КонецЕсли;
			
		ИначеЕсли тОбновляемаяОбласть.ТипОбласти = "Колонки" Тогда	
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			
			КоординатаY = НачалоОбластиY+(тОбновляемаяОбласть.СмещениеY-1);
			
			СтруктураГРуппирвок = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
						
			СтруктураОтбора 		= Новый Структура;
			ПолнаяСтруктураПоиска 	= СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если Кол.Имя = "СмещениеХ" ИЛИ Кол.Имя = "ИмяМакета" ИЛИ Кол.Имя = "ЭтоГруппа" ИЛИ Кол.Имя = "ОтступИсходный" Тогда
					Продолжить;
				Иначе
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			
			КоординатаСмещенияX = СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].НайтиСтроки(СтруктураОтбора);
			
			Если КоординатаСмещенияX.Количество() = 1 Тогда
				КоординатаСмещенияX_ 			= КоординатаСмещенияX[0].СмещениеХ;
				КоординатаСмещенияПоказателяX  = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Формула,ИмяМакетаКолонок","Колонки",тОбновляемаяОбласть.ИмяФормулы, КоординатаСмещенияX[0].ИмяМакета))[0].СмещениеХ;
				
				тОбластьДляВывода = тМакет.Область(КоординатаY
				,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX
				,КоординатаY
				,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX);
				
				УстановитьЗначениеФормулы(тОбластьДляВывода,тЗначениеИтог,РежимСводнойТаблицы);
				
			КонецЕсли;	
			
			
		ИначеЕсли тОбновляемаяОбласть.ТипОбласти = "Строки" Тогда	
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			КоординатаХ = НачалоОбластиХ+тОбновляемаяОбласть.СмещениеХ-1;
			
			СтруктураГРуппирвок = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
						
			
			СтруктураОтбора = Новый Структура;
			ПолнаяСтруктураПоиска =   СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если Кол.Имя = "СмещениеY" ИЛИ Кол.Имя = "ИмяМакета" ИЛИ Кол.Имя = "ЭтоГруппа" ИЛИ Кол.Имя = "ОтступИсходный" Тогда
					Продолжить;
				Иначе
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			КоординатаСмещенияY = СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].НайтиСтроки(СтруктураОтбора);
			
			Если КоординатаСмещенияY.Количество() = 1 Тогда
				КоординатаСмещенияY_			= КоординатаСмещенияY[0].СмещениеY-1;
				КоординатаСмещенияПоказателяY  = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Формула,ИмяМакетаСтрок","Строки",тОбновляемаяОбласть.ИмяФормулы,КоординатаСмещенияY[0].ИмяМакета))[0].СмещениеY;
				
				тОбластьДляВывода = тМакет.Область(НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
				,КоординатаХ
				,НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
				,КоординатаХ);
				
				УстановитьЗначениеФормулы(тОбластьДляВывода,тЗначениеИтог,РежимСводнойТаблицы);
				
			КонецЕсли;	
			
		ИначеЕсли тОбновляемаяОбласть.ТипОбласти = "Таблица" Тогда	
				
			тСтруктураТаблицы = Новый Структура;
			
			НачалоОбластиY  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигY;
			НачалоОбластиХ  = тВыводимыхОбластей.Найти(тОбновляемаяОбласть.ИмяКроссОбласти,"ИмяОбласти").СдвигX;
			
			СтруктураГРуппирвок = СтрРазделить(тОбновляемаяОбласть.СтрГруппировки,";");
			
			СтруктураОтбора = Новый Структура;
			ПолнаяСтруктураПоиска =   СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если Кол.Имя = "СмещениеY" ИЛИ Кол.Имя = "ИмяМакета" ИЛИ Кол.Имя = "ЭтоГруппа" ИЛИ Кол.Имя = "ОтступИсходный" Тогда
					Продолжить;
				Иначе
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
					тСтруктураТаблицы.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			КоординатаСмещенияY = СтруктураРасшифровкаОбластейY[тОбновляемаяОбласть.ИмяОбластиСтрок].НайтиСтроки(СтруктураОтбора);
			Если КоординатаСмещенияY.Количество() = 1 Тогда
				КоординатаСмещенияY_ 	= КоординатаСмещенияY[0].СмещениеY-1;
				КоординатаСмещенияПоказателяY  = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Формула,ИмяМакетаСтрок","Таблица",тОбновляемаяОбласть.ИмяФормулы, КоординатаСмещенияY[0].ИмяМакета));
				Если КоординатаСмещенияПоказателяY.Количество() = 1 Тогда
					КоординатаСмещенияПоказателяY = КоординатаСмещенияПоказателяY[0].СмещениеY;
				Иначе
					Продолжить;
				КонецЕсли;	 
			Иначе	 
				Продолжить;
			КонецЕсли;	
			
			СтруктураОтбора 		= Новый Структура;
			ПолнаяСтруктураПоиска 	= СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].Колонки;
			
			Для Каждого Кол Из ПолнаяСтруктураПоиска Цикл
				Если Кол.Имя = "СмещениеХ" ИЛИ Кол.Имя = "ИмяМакета"  ИЛИ Кол.Имя = "ЭтоГруппа" ИЛИ Кол.Имя = "ОтступИсходный" Тогда
					Продолжить;
				Иначе
					СтруктураОтбора.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
					тСтруктураТаблицы.Вставить(Кол.Имя,тОбновляемаяОбласть[Кол.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			
			КоординатаСмещенияX = СтруктураРасшифровкаОбластейХ[тОбновляемаяОбласть.ИмяОбластиКолонок].НайтиСтроки(СтруктураОтбора);
			
			Если КоординатаСмещенияX.Количество() = 1 Тогда
				КоординатаСмещенияX_ 			= КоординатаСмещенияX[0].СмещениеХ;
				КоординатаСмещенияПоказателяX   = ТзПоказателиМакетовРаскрытий.НайтиСтроки(Новый Структура("ТипМакета,Формула,ИмяМакетаКолонок","Таблица",тОбновляемаяОбласть.ИмяФормулы,КоординатаСмещенияX[0].ИмяМакета))[0].СмещениеХ;
			Иначе	 
				Продолжить;	 
			КонецЕсли;	
						
			Если тЗначениеИтог = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			тОбластьДляВывода = тМакет.Область(НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
			,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX
			,НачалоОбластиY+КоординатаСмещенияY_+КоординатаСмещенияПоказателяY
			,НачалоОбластиХ+КоординатаСмещенияX_+КоординатаСмещенияПоказателяX);
			
			УстановитьЗначениеФормулы(тОбластьДляВывода,тЗначениеИтог,РежимСводнойТаблицы);

		КонецЕсли;								
	КонецЦикла;	
	
КонецПроцедуры	

Процедура УстановитьЗначениеВЯчейке(ЭтаФорма,тОбновляемаяОбласть,тПоказатель,тОбластьДляВывода,СтруктураСлужебныхТаблиц)
	
	Если ЭтаФорма.ИмяИнтерактивноИзмененнойОбласти = тОбластьДляВывода.Имя Тогда
		 Возврат;
	КонецЕсли;	
	
	тОбластьДляВывода_Значение = Неопределено;
	
	Если тОбновляемаяОбласть.ЭтоФормула Тогда
				
	ИначеЕсли тПоказатель.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
		Если тОбновляемаяОбласть.ЭтоИтогПоПериоду Тогда
			Если НЕ тПоказатель.ВидИтогаПериод = Перечисления.ВидыИтоговПоказателяПоПериоду.НеРассчитывать Тогда
				тОбластьДляВывода_Значение = тОбластьДляВывода.Значение+тОбновляемаяОбласть.Значение;
			КонецЕсли;	 	 
		ИначеЕсли НЕ тОбновляемаяОбласть.ДетальнаяЗапись Тогда		    
			Если тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.Максимум Тогда
				тОбластьДляВывода_Значение 	= ПолучитьЗначениеИзКонтекста(СтруктураСлужебныхТаблиц.Валюта,тОбновляемаяОбласть,тПоказатель,СтруктураСлужебныхТаблиц,тПоказатель.ВидИтога);
			ИначеЕсли 	тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.Минимум Тогда 
				тОбластьДляВывода_Значение 	= ПолучитьЗначениеИзКонтекста(СтруктураСлужебныхТаблиц.Валюта,тОбновляемаяОбласть,тПоказатель,СтруктураСлужебныхТаблиц,тПоказатель.ВидИтога);
			ИначеЕсли 	тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.НеРассчитывается Тогда 
				//...
			ИначеЕсли 	тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.Среднее Тогда 		
				тОбластьДляВывода_Значение 	= ПолучитьЗначениеИзКонтекста(СтруктураСлужебныхТаблиц.Валюта,тОбновляемаяОбласть,тПоказатель,СтруктураСлужебныхТаблиц,тПоказатель.ВидИтога);
			Иначе 
				//Сумма
				тОбластьДляВывода_Значение = тОбластьДляВывода.Значение+тОбновляемаяОбласть.Значение;
			КонецЕсли;	 
		Иначе	 
			тОбластьДляВывода_Значение = тОбластьДляВывода.Значение+тОбновляемаяОбласть.Значение;
		КонецЕсли;
		
		тОбновляемаяОбласть_Значение =  тОбластьДляВывода.Значение;
		
	Иначе	
		Если тОбновляемаяОбласть.ЭтоИтогПоПериоду Тогда
			//Для нечисловых итог по периоду не заполняется. 
		ИначеЕсли НЕ тОбновляемаяОбласть.ДетальнаяЗапись Тогда	 
			Если тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.Максимум Тогда
				тОбластьДляВывода_Значение = Макс(тОбластьДляВывода.Значение,тОбновляемаяОбласть.Значение);
			ИначеЕсли 	тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.Минимум Тогда 
				тОбластьДляВывода_Значение = Мин(тОбластьДляВывода.Значение,тОбновляемаяОбласть.Значение);
			ИначеЕсли 	тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.НеРассчитывается 
				ИЛИ тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.Среднее 
				ИЛИ тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.Сумма   Тогда
				//... итоги не считать.
			ИначеЕсли  тПоказатель.ВидИтога = Перечисления.ВидыИтоговПоказателя.ПустаяСсылка() Тогда 
				//Итог по-умолчанию
				Если  тПоказатель.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Строка Тогда
					//... итоги не считать
				ИначеЕсли тПоказатель.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Дата Тогда
					тОбластьДляВывода_Значение = Макс(тОбластьДляВывода.Значение,тОбновляемаяОбласть.Значение);
				ИначеЕсли тПоказатель.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Булево Тогда	
					тОбластьДляВывода_Значение = Макс(тОбластьДляВывода.Значение,тОбновляемаяОбласть.Значение);
				КонецЕсли;	
			КонецЕсли;	
		Иначе	 
			тОбластьДляВывода_Значение = тОбновляемаяОбласть.Значение;
		КонецЕсли;	 	
		
		тОбновляемаяОбласть.Значение =  тОбластьДляВывода.Значение;
	
	КонецЕсли;	
		
	Если НЕ тОбластьДляВывода_Значение = Неопределено Тогда
		ВставитьЗначениеВОбластьТабличногоДокумента(тОбластьДляВывода,тОбластьДляВывода_Значение,тПоказатель.НеМасштабируется,СтруктураСлужебныхТаблиц.тОбъектАБ.ТекущаяТочность,СтруктураСлужебныхТаблиц.КоличествоГрупп);
	КонецЕсли;
	
КонецПроцедуры	

Процедура УстановитьЗначениеФормулы(тОбластьДляВывода,тЗначениеИтог,РежимСводнойТаблицы);
	
	тОбластьДляВывода.Значение =  тЗначениеИтог;
	
	Если РежимСводнойТаблицы Тогда
		
		ЦветПоложительный = Новый Цвет(0,128,0);
		ЦветОтрицательный = Новый Цвет(255,0,0);
		ЦветНейтральный   = Новый Цвет(0,0,0);
		
		Если тОбластьДляВывода.Значение>0 Тогда
			тОбластьДляВывода.ЦветТекста = ЦветПоложительный;
		ИначеЕсли тОбластьДляВывода.Значение<0 Тогда	
			тОбластьДляВывода.ЦветТекста = ЦветОтрицательный;
		Иначе	
			тОбластьДляВывода.ЦветТекста = ЦветНейтральный;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьЛогИзмененныхПоказателей(УникальныйИдентификаторСеанса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК ВидЗначения,
		|	ЗначенияПоказателей.НомерТранзакции КАК НомерТранзакции,
		|	ЗначенияПоказателей.Показатель КАК Показатель,
		|	ЗначенияПоказателей.Сценарий КАК Сценарий,
		|	ЗначенияПоказателей.Организация КАК Организация,
		|	ЗначенияПоказателей.Проект КАК Проект,
		|	ЗначенияПоказателей.ПериодОтчета КАК ПериодОтчета,
		|	ЗначенияПоказателей.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика1 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика1
		|	КОНЕЦ КАК Аналитика1,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика2 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика2
		|	КОНЕЦ КАК Аналитика2,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика3 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика3
		|	КОНЕЦ КАК Аналитика3,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика4 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика4
		|	КОНЕЦ КАК Аналитика4,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика5 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика5
		|	КОНЕЦ КАК Аналитика5,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика6 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика6
		|	КОНЕЦ КАК Аналитика6,
		|	ЗначенияПоказателей.АналитикаВалюта КАК АналитикаВалюта,
		|	ЗначенияПоказателей.Значение КАК Значение,
		|	ЗначенияПоказателей.ЗначениеВалюта КАК ЗначениеВалюта,
		|	ЗначенияПоказателей.ПравилоОбработки КАК ПравилоОбработки,
		|	ЗначенияПоказателей.СпособФормированияОтчета КАК СпособФормированияОтчета,
		|	ЗначенияПоказателей.ИспользуемаяИБ КАК ИспользуемаяИБ
		|ИЗ
		|	РегистрСведений.ЛогИзмененныхЗначенийПоказателейОтчетов КАК ЗначенияПоказателей
		|ГДЕ
		|	ЗначенияПоказателей.УникальныйИдентификаторСеанса = &УникальныйИдентификаторСеанса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ЗначенияПоказателей.НомерТранзакции,
		|	ЗначенияПоказателей.Показатель,
		|	ЗначенияПоказателей.Сценарий,
		|	ЗначенияПоказателей.Организация,
		|	ЗначенияПоказателей.Проект,
		|	ЗначенияПоказателей.ПериодОтчета,
		|	ЗначенияПоказателей.Валюта,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика1 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика2 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика3 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика3
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика4 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика4
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика5 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика5
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика6 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика6
		|	КОНЕЦ,
		|	ЗначенияПоказателей.АналитикаВалюта,
		|	ЗначенияПоказателей.Значение,
		|	0,
		|	ЗначенияПоказателей.ПравилоОбработки,
		|	ЗначенияПоказателей.СпособФормированияОтчета,
		|	ЗначенияПоказателей.ИспользуемаяИБ
		|ИЗ
		|	РегистрСведений.ЛогИзмененныхЗначенийПоказателейОтчетовНечисловые КАК ЗначенияПоказателей
		|ГДЕ
		|	ЗначенияПоказателей.УникальныйИдентификаторСеанса = &УникальныйИдентификаторСеанса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	ЗначенияПоказателей.НомерТранзакции,
		|	ЗначенияПоказателей.Показатель,
		|	ЗначенияПоказателей.Сценарий,
		|	ЗначенияПоказателей.Организация,
		|	ЗначенияПоказателей.Проект,
		|	ЗначенияПоказателей.ПериодОтчета,
		|	ЗначенияПоказателей.Валюта,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика1 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика2 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика3 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика3
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика4 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика4
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика5 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика5
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Аналитика6 = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗначенияПоказателей.Аналитика6
		|	КОНЕЦ,
		|	ЗначенияПоказателей.АналитикаВалюта,
		|	ЗначенияПоказателей.Значение,
		|	0,
		|	ЗначенияПоказателей.ПравилоОбработки,
		|	ЗНАЧЕНИЕ(Справочник.ВнешниеИнформационныеБазы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Перечисление.СпособыФормированияОтчетов.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ЛогИзмененныхКомментариевПоказателейОтчетов КАК ЗначенияПоказателей
		|ГДЕ
		|	ЗначенияПоказателей.УникальныйИдентификаторСеанса = &УникальныйИдентификаторСеанса";
	
	Запрос.УстановитьПараметр("УникальныйИдентификаторСеанса",УникальныйИдентификаторСеанса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Процедура ВставитьЗначениеВОбластьТабличногоДокумента(ОбластьТабличногоДокумента, ЗначениеЯчейки = Неопределено, НеМасштабируется = Ложь, ТекущаяТочность,КоличествоГрупп, СоставДаты = неопределено) Экспорт
				
	Если СтрНайти(ОбластьТабличногоДокумента.Формат,"ЧДЦ")>0 Тогда  
		//Если точность явно задана форматом в бланке, то не меняем ее
	Иначе	
		ОбластьТабличногоДокумента.Формат = ОбластьТабличногоДокумента.Формат+"; ЧДЦ="+ТекущаяТочность;
	КонецЕсли;
	
	Если СтрНайти(ОбластьТабличногоДокумента.Формат,"ЧС")>0 Тогда  
		//Если масштаб явно задан форматом в бланке, то не меняем его
	Иначе	
		Если Не  НеМасштабируется Тогда
			ОбластьТабличногоДокумента.Формат = ОбластьТабличногоДокумента.Формат+"; ЧС="+КоличествоГрупп+"";
		КонецЕсли;
	КонецЕсли;
	
	ОбластьТабличногоДокумента.Значение = ЗначениеЯчейки;
		
КонецПроцедуры



#КонецОбласти


Функция ПодготовитьПараметрыВызоваФормыРаскрытий(ЭтаФорма,СтруктураРасшифровки,СтруктураНезаполненныхАналитик,СтруктураОтбираемыхАналитик) Экспорт
	
	СтруктураОтбираемыхАналитик.Вставить("Валюта",ЭтаФорма.Валюта);
	
	тОбъектАБ               = ЭтаФорма[ЭтаФорма.ТекущийОбъектАБ];	
	
	МассивПериодов = Новый Массив;
	
		
	Для Каждого СтрНезаполненнаяАналитика Из СтруктураНезаполненныхАналитик Цикл
		Если СтруктураОтбираемыхАналитик.Свойство(СтрНезаполненнаяАналитика.Ключ) Тогда //Мы имеем дело с аналитикой -группой, нужно ее расшифровать
			Если СтрНезаполненнаяАналитика.Ключ = "ПериодОтчета" Тогда
				МассивПериодов = ПолучитьВложенныеПериоды(СтруктураОтбираемыхАналитик.ПериодОтчета,тОбъектАБ.Периодичность);			
				СтруктураОтбираемыхАналитик.Вставить("ПериодОтчета",МассивПериодов);	
			Иначе	
				МассивЗначений = ПолучитьЭлементыПотомки(СтруктураОтбираемыхАналитик[СтрНезаполненнаяАналитика.Ключ]);			
				СтруктураОтбираемыхАналитик.Вставить(СтрНезаполненнаяАналитика.Ключ,МассивЗначений);	
			КонецЕсли;	 
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтруктураНезаполненныхАналитик.Свойство("ПериодОтчета")     //Если не указан,  период, то берем весь текущий диапазон
		И НЕ СтруктураОтбираемыхАналитик.Свойство("ПериодОтчета") Тогда	
		МассивПериодов = ПериодыУХ.ПолучитьПодчиненныеПериоды(СтруктураРасшифровки.ПериодС, СтруктураРасшифровки.ПериодПо, тОбъектАБ.Периодичность);			
		СтруктураОтбираемыхАналитик.Вставить("ПериодОтчета",МассивПериодов);	
	КонецЕсли;	

	
	МассивПоказателей = Новый Массив();
    МассивПоказателей.Добавить(СтруктураРасшифровки.ПоказательСсылка);	
	СтруктураОтбираемыхАналитик.Вставить("ПоказательОтчета",МассивПоказателей);
    СтруктураОтбираемыхАналитик.Вставить("УидГруппыОтборов",СтруктураРасшифровки.УидГруппыОтборов);

	мПоказателиРаскрытия = ПолучитьИзВременногоХранилища(тОбъектАБ.мПоказателиРаскрытияАдрес);
	
	МассивУдаляемыхКолонок = Новый Массив;
	
	тСвойствАналитик = Новый ТаблицаЗначений;
	тСвойствАналитик.Колонки.Добавить("КодАналитики");
	тСвойствАналитик.Колонки.Добавить("типАналитики");
	тСвойствАналитик.Колонки.Добавить("Аналитика");
    тСвойствАналитик.Колонки.Добавить("СвязьПоВладельцу");
    тСвойствАналитик.Колонки.Добавить("ЭтоЭтапПроекта",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
    тСвойствАналитик.Колонки.Добавить("ОбязательноеЗаполнение",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	тСвойствАналитик.Колонки.Добавить("МетаИмяАналитики");
    тСвойствАналитик.Колонки.Добавить("ОтборЗначений");
	тСвойствАналитик.Колонки.Добавить("ПараметрыОтбораЗначений");
	
	тГруппаРаскрытия = СтруктураРасшифровки.ПоказательСсылка.ГруппаРаскрытия;
	
	ДополнительныйОтбор = Обработки.АналитическийБланк.ПолучитьОписаниеТаблицыТекущихОтборов();
	
	Для Каждого Аналитика Из СтруктураНезаполненныхАналитик Цикл
		
		нСвойство = тСвойствАналитик.Добавить();
		нСвойство.КодАналитики = Аналитика.Ключ;
		
		Если Аналитика.Ключ = "ПериодОтчета" Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Периоды");	
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "Организация" Тогда 
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Организации");
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "Проект"   Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Проекты");
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "Сценарий" Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Сценарии");
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "АналитикаВалюта" Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Валюты");
			нСвойство.ОбязательноеЗаполнение = Истина;
		
		Иначе	
			
			ТекСубконто =  ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоКоду(Аналитика.Ключ);
			
			Если ЗначениеЗаполнено(ТекСубконто) Тогда
				нСвойство.типАналитики = Новый ОписаниеТипов(ТекСубконто.ТипЗначения);
			КонецЕсли;	 
			
			Для Инд = 1 по ПараметрыСеанса.ЧислоДопАналитик Цикл	
				Если  тГруппаРаскрытия["ВидАналитики"+Инд] = ТекСубконто Тогда	
					нСвойство.ОбязательноеЗаполнение = тГруппаРаскрытия["Аналитика"+Инд+"Обязательна"];
					Если Инд = тГруппаРаскрытия.АналитикаЭтапПроекта Тогда
						 нСвойство.ЭтоЭтапПроекта = Истина;
					КонецЕсли;
					Прервать;
				КонецЕсли;		
			КонецЦикла;					
		КонецЕсли;		
		
		Если нСвойство.типАналитики.ПривестиЗначение() = Неопределено Тогда
			нСвойство.МетаИмяАналитики = "СправочникСсылка."+Метаданные.НайтиПоТипу(нСвойство.типАналитики.Типы()[0]).Имя;
		Иначе
			нСвойство.МетаИмяАналитики = нСвойство.типАналитики.ПривестиЗначение().Метаданные().Имя;
		КонецЕсли;

		тРасшифровкаГруппыОтборов = тОбъектАБ.РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов,ПолеКод",СтруктураОтбираемыхАналитик.УидГруппыОтборов,Аналитика.Ключ));
		
		Если тРасшифровкаГруппыОтборов.Количество() = 1 И ЗначениеЗаполнено(тРасшифровкаГруппыОтборов[0].ЗначениеОтбораСтрока) И НЕ тРасшифровкаГруппыОтборов[0].Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится Тогда
			
			ТзПараметровЗапроса = Новый ТаблицаЗначений;
			ТзПараметровЗапроса.Колонки.Добавить("ИмяОтбора");
			ТзПараметровЗапроса.Колонки.Добавить("ТипОтбора");
			ТзПараметровЗапроса.Колонки.Добавить("ЗначениеОтбора");
			ТзПараметровЗапроса.Колонки.Добавить("УидГруппыОтбора");
				
			ТекстОтбора = АналитическийБланкУХСервер.СформироватьТекстОтбораПоМакету("ТекущийСправочник","",тРасшифровкаГруппыОтборов[0],ТзПараметровЗапроса,"Ссылка");
			ТекстОтбора = Прав(ТекстОтбора,СтрДлина(ТекстОтбора)-1);
			
			ТекстЗапроса = "ВЫБРАТЬ 
			|	ТекущийСправочник.Ссылка
			|ИЗ
			|	Справочник."+нСвойство.МетаИмяАналитики+" КАК ТекущийСправочник
			|ГДЕ "+ТекстОтбора;
			
			Если ЗначениеЗАполнено(ТекстОтбора) Тогда		
				нСвойство.ОтборЗначений 			= ТекстЗапроса;
				нСвойство.ПараметрыОтбораЗначений 	= ТзПараметровЗапроса;	
			КонецЕсли;	
					
			нДополнительныйОтбор 				= ДополнительныйОтбор.Добавить();
			нДополнительныйОтбор.ПолеКод      	= Аналитика.Ключ;
			нДополнительныйОтбор.ВидСравнения   = тРасшифровкаГруппыОтборов[0].Отбор;
			нДополнительныйОтбор.ЗначениеОтбора = ЗначениеИзСтрокиВнутр(тРасшифровкаГруппыОтборов[0].ЗначениеОтбораСтрока);
	
		КонецЕсли;
			
	КонецЦикла;	
	
	//В расшифровке есть группировочное поле, добавим его в отбор
	Если СтруктураРасшифровки.Свойство("ПутьКРеквизиту") Тогда
		Для Каждого СтрПутьКРеквизиту Из СтруктураРасшифровки.ПутьКРеквизиту Цикл
			Если СтруктураРасшифровки.Свойство(СтрПутьКРеквизиту.Ключ) Тогда
				
				нДополнительныйОтбор 				= ДополнительныйОтбор.Добавить();
				нДополнительныйОтбор.ПолеКод      	= СтрПутьКРеквизиту.Значение;
				нДополнительныйОтбор.ВидСравнения   = Перечисления.ВидыСравненияПоказателейОтчетов.Равно;
				нДополнительныйОтбор.ЗначениеОтбора = СтруктураРасшифровки[СтрПутьКРеквизиту.Ключ];
				
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСеанса",ЭтаФорма.УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("ДополнительныйФильтр",ДополнительныйОтбор);
	
	Если НЕ СтруктураРасшифровки.ПоказательСсылка.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда 
		ДополнительныеПараметры.Вставить("ЭтоНечисловые",Истина);
	КонецЕсли;
	
	Если СтруктураНезаполненныхАналитик.Свойство("Проект") Тогда
		СтруктураНезаполненныхАналитик.Удалить("Проект"); 
	КонецЕсли;
	
	Результат = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(СтруктураОтбираемыхАналитик,СтруктураНезаполненныхАналитик,ДополнительныеПараметры);	
	
	Если  НЕ СтруктураРасшифровки.ПоказательСсылка.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
		Результат.Колонки.Удалить("Значение");
		Результат.Колонки.ЗначениеНеЧисловое.Имя = "Значение";
	КонецЕсли;	
	
	АдресТзРаскрытия = ПоместитьВовременноеХранилище(Результат,Новый УникальныйИдентификатор);
		
	//Заполняем возможные связи по владельцу
	Для Каждого Аналитика Из тСвойствАналитик Цикл				
		
		мВладельцы = Новый Массив;
		
		Если Аналитика.типАналитики.ПривестиЗначение() = Неопределено ИЛИ СтрНайти(Аналитика.типАналитики.ПривестиЗначение().Метаданные().ПолноеИмя(),"Справочник") = 0 Тогда
			Аналитика.СвязьПоВладельцу =  мВладельцы;
			Продолжить;	
		Иначе	
			Владельцы =  Аналитика.типАналитики.ПривестиЗначение().Метаданные().Владельцы;
		КонецЕсли;	

		Владельцы =  Аналитика.типАналитики.ПривестиЗначение().Метаданные().Владельцы;
		
		Для Каждого тВладелец Из Владельцы Цикл	
			СущВладельцы = тСвойствАналитик.НайтиСтроки(Новый Структура("МетаИмяАналитики",тВладелец.Имя));
			Для Каждого сВладелец Из СущВладельцы Цикл	
				мВладельцы.Добавить(сВладелец.КодАналитики);	
			КонецЦикла;		
		КонецЦикла;		
		Аналитика.СвязьПоВладельцу =  мВладельцы;
		
	КонецЦикла;	
    	
	СтруктураКлючевыхРеквизитов = Новый Структура;
	СтруктураКлючевыхРеквизитов.Вставить("Сценарий"		,ЭтаФорма["Сценарий"]);
	СтруктураКлючевыхРеквизитов.Вставить("Организация"	,ЭтаФорма["Организация"]);
    СтруктураКлючевыхРеквизитов.Вставить("Проект"		,Неопределено);
	СтруктураКлючевыхРеквизитов.Вставить("ПериодОтчета"	,ЭтаФорма.ПериодОтчета);
	СтруктураКлючевыхРеквизитов.Вставить("ВидОтчета"	,ЭтаФорма.тВидыОтчетов);
    СтруктураКлючевыхРеквизитов.Вставить("ВложенныеПериоды"	,тОбъектАБ.ВложенныеПериоды.Выгрузить());
	СтруктураКлючевыхРеквизитов.Вставить("ЗаблокированныеПоказатели",тОбъектАБ.ЗаблокированныеПоказатели.Выгрузить());
   	СтруктураКлючевыхРеквизитов.Вставить("ЗаблокированныеПериоды",тОбъектАБ.ЗаблокированныеПериоды.Выгрузить());
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураОтбираемыхАналитик",СтруктураОтбираемыхАналитик);
	СтруктураПараметров.Вставить("СтруктураНезаполненныхАналитик",СтруктураНезаполненныхАналитик);
	СтруктураПараметров.Вставить("АдресТзРаскрытия",АдресТзРаскрытия);
	СтруктураПараметров.Вставить("логИзмененныхПоказателейАдрес","");
	СтруктураПараметров.Вставить("мПоказателиРаскрытияАдрес",тОбъектАБ.мПоказателиРаскрытияАдрес);
	СтруктураПараметров.Вставить("КэшАналитикПоказателейАдрес",тОбъектАБ.КэшАналитикПоказателейАдрес);
	СтруктураПараметров.Вставить("Заблокирован",Истина);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения",ЭтаФорма.ТекущийДелитель);
	СтруктураПараметров.Вставить("ТекущийДелитель", ЭтаФорма.ТекущийДелитель);
	СтруктураПараметров.Вставить("УровеньТочности",ЭтаФорма.УровеньТочности);
	СтруктураПараметров.Вставить("УидГруппыОтборов",СтруктураРасшифровки.УидГруппыОтборов);
    СтруктураПараметров.Вставить("тГоризонт",МассивПериодов);
	СтруктураПараметров.Вставить("АдресТаблицыСвойствАналитик",ПоместитьВоВременноеХранилище(тСвойствАналитик,ЭтаФорма.УникальныйИдентификатор));
    СтруктураПараметров.Вставить("ПравилоОбработки",Неопределено);
	СтруктураПараметров.Вставить("ВИБ",Неопределено);

	
	СтруктураПараметров.Вставить("АдресСтруктураКлючевыхРеквизитов",ПоместитьВоВременноеХранилище(СтруктураКлючевыхРеквизитов,ЭтаФорма.УникальныйИдентификатор));
	
	Возврат СтруктураПараметров;
	
КонецФункции	

Функция ПолучитьВложенныеПериоды(ПериодОтчета,Периодичность)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Периоды.Ссылка КАК ПериодОтчета,
	|	Периоды.Периодичность КАК Периодичность
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ПометкаУдаления = ЛОЖЬ
	|	И Периоды.ДатаНачала >= &ДатаНачала
	|	И Периоды.ДатаОкончания <= &ДатаОкончания
	|	И Периоды.Периодичность = &Периодичность
	|	И Периоды.Произвольный = ЛОЖЬ";
	
	
	Запрос.УстановитьПараметр("Периодичность",Периодичность);
	Запрос.УстановитьПараметр("ДатаНачала",ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ПериодОтчета.ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПериодОтчета");
	
КонецФункции

Функция ПолучитьЭлементыПотомки(ЭлементРодитель)
	
	ТекущийТип = ЭлементРодитель.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначениеСправочика.Ссылка КАК Ссылка
	|ИЗ
	|	//ТекущийСправочник// КАК ЗначениеСправочика
	|ГДЕ
	|	ЗначениеСправочика.ПометкаУдаления = ЛОЖЬ
	|	И ЗначениеСправочика.Родитель  В ИЕРАРХИИ(&ЭлементРодитель)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ТекущийСправочник//","Справочник."+ТекущийТип);
	
	Запрос.УстановитьПараметр("ЭлементРодитель",ЭлементРодитель);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьПараметрыРасшифровкиОперанда(ЭтаФорма,Расшифровка,ЗначениеПоказателя,ВалютаОтображения) Экспорт
	
	ТекущийОбъектАБ = ЭтаФорма.ТекущийОбъектАБ;
	
	Если СтрНайти(ЭтаФорма.ИмяФормы, "АналитическийБланк") Тогда
		ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ЭтаФорма);
	Иначе // НастраиваемыйОтчет
		ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ЭтаФорма.Объект);
	КонецЕсли;

	ОбработкаОбъект 						= Обработки.ЗаписьПоказателяСРасчетомЗависимых.Создать();
	ОбработкаОбъект.ВидОтчета 				= Расшифровка.ВидОтчета;
	ОбработкаОбъект.ВалютаОтображения 		= ВалютаОтображения;
	оТаблицаИзмененныхПоказателей 			= ОбработкаОбъект.ТаблицаИзмененныхПоказателей.Выгрузить();
	оТаблицаИзмененныхПоказателей.Колонки.Добавить("ID");
	ФлагОшибки = Ложь;
	
	КэшАналитикПоказателей = ПолучитьИзВременногоХранилища(ЭтаФорма[ТекущийОбъектАБ].КэшАналитикПоказателейАдрес);
		
	АналитическийБланкУХСервер.ЗаписатьЗначениеВПоказатель(оТаблицаИзмененныхПоказателей,,ЗначениеПоказателя,Расшифровка,КэшАналитикПоказателей,ФлагОшибки,ЭтаФорма.ТекущийДелитель);
	
	ПереопределитьСинтетическоеЗначениеДляРасшифровки(оТаблицаИзмененныхПоказателей);
	
	СтруктураРеквизитов = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыНастроек);
	ОбработкаОбъект.ТаблицаИзмененныхПоказателей.Загрузить(оТаблицаИзмененныхПоказателей);
	ОбработкаОбъект.ПравилоОбработки = СтруктураРеквизитов.ПравилоОбработки;
	ОбработкаОбъект.ИспользуемаяИБ = СтруктураРеквизитов.ВнешняяИнформационнаяБаза;
		
	Если НЕ ФлагОшибки Тогда
		
		СтруктураОтвета = ОбработкаОбъект.ПолучитьСтруктуруПараметровДляРасшифровки();
		
		ДополнительныеОтборыЯчейкиБланка = 	ЭтаФорма[ТекущийОбъектАБ].РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов",Расшифровка.УидГруппыОтборов));
        ТаблицаДополнительныхОтборов     =  Обработки.АналитическийБланк.Создать().РасшифровкаГруппОтборов.ВыгрузитьКолонки();
		Для Каждого Стр Из ДополнительныеОтборыЯчейкиБланка Цикл
			нСтр = ТаблицаДополнительныхОтборов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Стр);
		КонецЦикла;	
		
		ИмяОтбора = "ПериодС";
		СтрокаОтбора = ТаблицаДополнительныхОтборов.Найти(ИмяОтбора, "ПолеКод");
		Если СтрокаОтбора <> Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаОтбора.ЗначениеОтбора) И Расшифровка.Свойство(ИмяОтбора) Тогда
				СтруктураОтвета.ОбъектРасчета.Вставить(ИмяОтбора, Расшифровка[ИмяОтбора]);
			КонецЕсли;
		КонецЕсли;
		
		СтруктураОтвета.Вставить("ДополнительныеОтборыЯчейкиБланка",ЗначениеВСтрокуВнутр(ТаблицаДополнительныхОтборов));
		
		Возврат СтруктураОтвета;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ПереопределитьСинтетическоеЗначениеДляРасшифровки(оТаблицаИзмененныхПоказателей)
	
	Для Каждого Стр Из оТаблицаИзмененныхПоказателей Цикл
		Если  Стр.Аналитика1 = Неопределено И Стр.Аналитика2 = Неопределено И Стр.Аналитика3 = Неопределено
			И Стр.Аналитика4 = Неопределено И Стр.Аналитика5 = Неопределено И Стр.Аналитика6 = Неопределено
			И НЕ ЗначениеЗаполнено(Стр.АналитикаВалюта) Тогда
			
			Стр.СинтетическоеЗначение = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруРасшифровки(ЭтаФорма,СтруктураТекущихКлючевыхРеквизитов,ОбластьИмя,Расшифровка,СтруктураНезаполненныхАналитик,СтруктураОтбираемыхАналитик) Экспорт
	
	тМакет 					= ЭтаФорма[ЭтаФорма.ТекущийМакет];
	тОбъектАБ               = ЭтаФорма[ЭтаФорма.ТекущийОбъектАБ];	
	
	ТзСвойстваПоказателей 	= ПолучитьИзВременногоХранилища(тОбъектАБ.ТзСвойстваПоказателейАдрес);
		
	Возврат АналитическийБланкУХСервер.ПолучитьСтруктуруРасшифровки(тМакет,СтруктураТекущихКлючевыхРеквизитов,тОбъектАБ,ОбластьИмя,Расшифровка,СтруктураНезаполненныхАналитик,СтруктураОтбираемыхАналитик,ТзСвойстваПоказателей);
	
КонецФункции

Функция ПолучитьСтруктуруРасшифровкиБезКонтекста(СтруктураРасшифровки,АдресРасшифровки,тОбъект,АдресРасшифровкиГруппОтборов,ОбластьИмя,Расшифровка,ТзСвойстваПоказателейАдрес) Экспорт
	
	СтруктураНезаполненныхАналитик 	= Новый Структура;
	СтруктураОтбираемыхАналитик 	= Новый Структура;
	РасшифровкаГруппОтборов         = ПолучитьИзВременногоХранилища(АдресРасшифровкиГруппОтборов);
	
	тРасшифровка 				= ПолучитьИзВременногоХранилища(АдресРасшифровкиГруппОтборов);
	ТзСвойстваПоказателей 		= ПолучитьИзВременногоХранилища(ТзСвойстваПоказателейАдрес);
	
	тПоказатель  = Неопределено;
	тПоказатель  = ТзСвойстваПоказателей.Найти(Расшифровка.Ссылка,"Ссылка");
	
	АналитическийБланкУХСервер.ПолучитьСвойстваПоказателяСтруктура(ТзСвойстваПоказателей,Расшифровка,СтруктураРасшифровки,тПоказатель);
	
	АналитическийБланкУХСервер.ПолучитьСтруктуруРасшифровкиБезКонтекста(тОбъект,СтруктураРасшифровки,СтруктураНезаполненныхАналитик,СтруктураОтбираемыхАналитик,РасшифровкаГруппОтборов,тПоказатель);
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("СтруктураНезаполненныхАналитик",СтруктураНезаполненныхАналитик);
	СтруктураОтвета.Вставить("СтруктураОтбираемыхАналитик",СтруктураОтбираемыхАналитик);
	СтруктураОтвета.Вставить("СтруктураРасшифровки",СтруктураРасшифровки);
	
	Возврат СтруктураОтвета;
	
КонецФункции


#Область КонвертацияОтборовБланков

Процедура СконверироватьБланк(БланкВход) Экспорт

	Если БланкВход.РежимБланка = 1 Тогда  //Сводная таблица
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВариантыСводныхТаблиц.Бланк КАК Бланк,
		|	ВариантыСводныхТаблиц.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВариантыСводныхТаблиц КАК ВариантыСводныхТаблиц
		|ГДЕ
		|	ВариантыСводныхТаблиц.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыСводныхТаблиц.Бланк = &Бланк";
		
		Запрос.УстановитьПараметр("Бланк",БланкВход);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Попытка
				СконвертироватьСтруктуруОтборовБланков(Выборка.Ссылка);
			Исключение	 
				
				ТекстСообщения = НСтр("ru = 'При конвертации отборов бланка %Бланк% произошла ошибка
				|			%ОписаниеОшибки%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(Выборка.Ссылка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.БланкиОтчетов,
				Выборка.Ссылка, 
				ТекстСообщения);
				
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
								
			КонецПопытки;	 
			
		КонецЦикла;			
		
	ИначеЕсли БланкВход.РежимБланка = 2 Тогда  //Бланк экземпляра
		
		Попытка
			
			СконвертироватьСтруктуруОтборовБланков(БланкВход);		
			
		Исключение	 
			
			ТекстСообщения = НСтр("ru = 'При конвертации отборов бланка %Бланк% произошла ошибка
			|			%ОписаниеОшибки%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(БланкВход));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.БланкиОтчетов,
			БланкВход, 
			ТекстСообщения);
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
			
		КонецПопытки;	 
			
	КонецЕсли;	


КонецПроцедуры	

Процедура СконвертироватьСтруктуруОтборовБланков(ВариантНастройки)
	
		
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	ПолеТабличногоДокументаКопия    = Новый ТабличныйДокумент;
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	//ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(ВариантНастройки);
	текНаборЗаписей.Прочитать();
	Если  текНаборЗаписей.Количество() =1 Тогда			
		ЗначениеСохраняемойНастройки = текНаборЗаписей[0].ХранилищеДополнительныхНастроек.Получить();	
		Если  ЗначениеСохраняемойНастройки.Свойство("ТабДокМакет") Тогда		
			ПолеТабличногоДокументаМакет.Вывести(ЗначениеСохраняемойНастройки.ТабДокМакет);
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСверху") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСверху = ЗначениеСохраняемойНастройки.ФиксацияСверху;
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСлева") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСлева = ЗначениеСохраняемойНастройки.ФиксацияСлева;
		КонецЕсли;	
	КонецЕсли;	

	ПолеТабличногоДокументаКопия.Вывести(ПолеТабличногоДокументаМакет);
	
	Для Каждого СтрОбласть Из ПолеТабличногоДокументаМакет.Области Цикл
		
		Если 	СтрОбласть.Лево = 0 И НЕ СтрОбласть.Имя = "ОбластьНастроекРаскрытийКолонок" Тогда   //Раскрытия строк
			
			ОбластьНастроек   = ПолеТабличногоДокументаМакет.Область(СтрОбласть.Верх,1,СтрОбласть.Верх,1);
			Если ТипЗнч(ОбластьНастроек.Расшифровка) = Тип("Структура") И ОбластьНастроек.Расшифровка.Свойство("НастройкиАналитикРаскрытия") Тогда
				тРасшифровка = ОбластьНастроек.Расшифровка;
				тСостав      = ЗначениеИзСтрокиВнутр(ОбластьНастроек.Расшифровка.ПараметрыОтбора);
				Если тРасшифровка.Свойство("ПараметрыОтбора") Тогда
					 тПараметрыОтбора = ЗначениеИзСтрокиВнутр(тРасшифровка.ПараметрыОтбора);
					 тПараметрыОтбора.Колонки.Добавить("Отбор_",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСравненияПоказателейОтчетов"));
					 Для Каждого Стр Из тПараметрыОтбора Цикл
						 Стр.Отбор_ = ?(ПреобразоватьОтбор(Стр.Отбор)= Неопределено,Стр.Отбор,ПреобразоватьОтбор(Стр.Отбор));
					 КонецЦикла;		  	
				КонецЕсли;		
				
				тПараметрыОтбора.Колонки.Удалить("Отбор");
				тПараметрыОтбора.Колонки.Отбор_.Имя ="Отбор";
				тСостав_ = ЗначениеВСтрокуВнутр(тПараметрыОтбора);
				
				ОбластьНастроек.Расшифровка.ПараметрыОтбора = тСостав_;
			Иначе
				Продолжить;
			КонецЕсли;
			
			
		ИначеЕсли 	СтрОбласть.Верх = 0 И НЕ СтрОбласть.Имя = "ОбластьНастроекРаскрытийСтрок" Тогда	  //Раскрытия колонок
			
			ОбластьНастроек   = ПолеТабличногоДокументаМакет.Область(1,СтрОбласть.Лево,1,СтрОбласть.Лево);
			Если ТипЗнч(ОбластьНастроек.Расшифровка) = Тип("Структура") И ОбластьНастроек.Расшифровка.Свойство("НастройкиАналитикРаскрытия") Тогда
				тРасшифровка = ОбластьНастроек.Расшифровка;
				тСостав      = ЗначениеИзСтрокиВнутр(ОбластьНастроек.Расшифровка.ПараметрыОтбора);
				Если тРасшифровка.Свойство("ПараметрыОтбора") Тогда
					 тПараметрыОтбора = ЗначениеИзСтрокиВнутр(тРасшифровка.ПараметрыОтбора);
					 тПараметрыОтбора.Колонки.Добавить("Отбор_",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСравненияПоказателейОтчетов"));
					 Для Каждого Стр Из тПараметрыОтбора Цикл
						 Стр.Отбор_ = ?(ПреобразоватьОтбор(Стр.Отбор)= Неопределено,Стр.Отбор,ПреобразоватьОтбор(Стр.Отбор));
					 КонецЦикла;		  	
				КонецЕсли;		
				
				тПараметрыОтбора.Колонки.Удалить("Отбор");
				тПараметрыОтбора.Колонки.Отбор_.Имя ="Отбор";
				тСостав_ = ЗначениеВСтрокуВнутр(тПараметрыОтбора);
				
				ОбластьНастроек.Расшифровка.ПараметрыОтбора = тСостав_;
			Иначе
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли СтрОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник  //Показатель 
			И ТипЗнч(СтрОбласть.Расшифровка) = Тип("Структура")
			И СтрОбласть.Расшифровка.Свойство("Ссылка")	 
			И СтрОбласть.Расшифровка.Свойство("РасшифровкаГруппОтборов") Тогда
			
			РасшифровкаГруппОтборовОперандов_ = Новый Структура;
			Для Каждого СтрОтбор Из СтрОбласть.Расшифровка.РасшифровкаГруппОтборов Цикл
				 СконвертироватьОтборПоказателяИзСтрокиВПеречисление(СтрОтбор,РасшифровкаГруппОтборовОперандов_);
			КонецЦикла;	
			
			СтрОбласть.Расшифровка.Вставить("РасшифровкаГруппОтборов",РасшифровкаГруппОтборовОперандов_); 
			
		ИначеЕсли СтрОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
			И ТипЗнч(СтрОбласть.Расшифровка) = Тип("Структура")
			И СтрОбласть.Расшифровка.Свойство("ТекстФормулы") 	
			И СтрОбласть.Расшифровка.Свойство("РасшифровкаГруппОтборовОперандов") Тогда
			РасшифровкаГруппОтборовОперандов  = ЗначениеИзСтрокиВнутр(СтрОбласть.Расшифровка.РасшифровкаГруппОтборовОперандов);
			//РасшифровкаГруппОтборовОперандов_ = Новый Структура;
			Для Каждого СтрОтбор Из РасшифровкаГруппОтборовОперандов Цикл
				 СконвертироватьОтборПоказателяИзСтрокиВПеречислениеТаблица(СтрОтбор);
			КонецЦикла;	
			РасшифровкаГруппОтборовОперандовСтрока = ЗначениеВстрокуВнутр(РасшифровкаГруппОтборовОперандов);
			СтрОбласть.Расшифровка.РасшифровкаГруппОтборовОперандов = РасшифровкаГруппОтборовОперандовСтрока;
		КонецЕсли;	
		
	КонецЦикла;
	
	ЗначениеСохраняемойНастройки.ТабДокМакет = ПолеТабличногоДокументаМакет;
	ЗначениеСохраняемойНастройки.Вставить("ТабДокМакетКопия",ПолеТабличногоДокументаКопия);
	
	//Перезапишем макет
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(ВариантНастройки);
	текНаборЗаписей.Очистить();
	нЗапись  									= текНаборЗаписей.Добавить();
	нЗапись.Бланк								= ВариантНастройки;
	нЗапись.ХранилищеДополнительныхНастроек 	= Новый ХранилищеЗначения(ЗначениеСохраняемойНастройки);
    текНаборЗаписей.Записать(Истина);
	
	//Перезапишем все кэши
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	Обработки.АналитическийБланк.ПрочитатьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,ВариантНастройки,ОбъектАБ);	
	ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	Отказ = Ложь;				
	Уид   = Новый УникальныйИдентификатор;
	Справочники.БланкиОтчетов.СохранитьМакетМногопериодногоБланка(ВариантНастройки,ПолеТабличногоДокументаМакет,ОбъектАБ,Уид,Отказ);
	

	
	
КонецПроцедуры

Процедура СконвертироватьОтборПоказателяИзСтрокиВПеречисление(СтрОтбор,РасшифровкаГруппОтборовОперандов_)

    тОтборСтруктура = АналитическийБланкГенерацияМакетаУХСервер.ПрочитатьСтрокуОтборов(СтрОтбор); 
	Если тОтборСтруктура.Количество()=3 Тогда
		тОтборСтрока = тОтборСтруктура.Отбор;
		тОтборПеречисление	=  ПреобразоватьОтбор(тОтборСтрока);	
	КонецЕсли;	

	Значение = Неопределено;
	Если Не тОтборПеречисление = Неопределено Тогда				
		Значение = тОтборСтруктура.Поле+"\"+ЗначениеВСтрокуВнутр(тОтборПеречисление)+"\"+тОтборСтруктура.ЗначениеОтбораСтрока;				
		РасшифровкаГруппОтборовОперандов_.Вставить(СтрОтбор.Ключ,Значение);
	Иначе	
		РасшифровкаГруппОтборовОперандов_.Вставить(СтрОтбор.Ключ,СтрОтбор.Значение);
	КонецЕсли;
	
	
КонецПроцедуры	

Процедура СконвертироватьОтборПоказателяИзСтрокиВПеречислениеТаблица(СтрОтбор)

    тОтборСтруктура = АналитическийБланкГенерацияМакетаУХСервер.ПрочитатьСтрокуОтборов(СтрОтбор); 
	Если тОтборСтруктура.Количество()=3 Тогда
		тОтборСтрока = тОтборСтруктура.Отбор;
		тОтборПеречисление	=  ПреобразоватьОтбор(тОтборСтрока);	
	КонецЕсли;	

	Значение = Неопределено;
	Если Не тОтборПеречисление = Неопределено Тогда				
		СтрОтбор.Значение = тОтборСтруктура.Поле+"\"+ЗначениеВСтрокуВнутр(тОтборПеречисление)+"\"+тОтборСтруктура.ЗначениеОтбораСтрока;				
	КонецЕсли;
	
	
КонецПроцедуры	

Функция ПреобразоватьОтбор(тОтборСтрока)

    Если  тОтборСтрока =  Нстр("ru = 'Период начала отчета'") Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодНачалаОтчета;
			
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Период окончания отчета'") Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодОкончанияОтчета;
	
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Сценарий отчета'") Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета;
	 
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Организация отчета'") Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета;
			 
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Проект отчета'") Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета;
	 
        ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Период начала со сдвигом'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодНачалаСоСдвигом;
			
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Период окончания со сдвигом'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодОкончанияСоСдвигом;
			 
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Равно'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.Равно;
			
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Не равно'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.НеРавно;
	 
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'В группе'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ВИерархии;
			
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'В группе из списка'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ВСпискеПоИерархии;
	 
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'В списке'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ВСписке;
			
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Не в списке'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.НеВСписке;
			
		ИначеЕсли  тОтборСтрока =  Нстр("ru = 'Отбор не производится'")  Тогда
			 тОтборПеречисление = Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится;

		Иначе	 
			тОтборПеречисление = Неопределено;
		КонецЕсли;	

		Возврат тОтборПеречисление;
		
КонецФункции	

Процедура ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ)
		
	ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Очистить();
	ОбъектАБ.КэшТаблицРаскрываемыхОбластей.Очистить();
	ОбъектАБ.НастройкиТаблицРаскрываемыхОбластей.Очистить();
	
	Для Каждого облРаскрытия Из ОбъектАБ.КэшРаскрываемыхОбластей Цикл			
		ОбластьРаскрытия =  ПолеТабличногоДокументаМакет.Области.Найти(облРаскрытия.ИмяОбласти);		
		ФлВключенияОбласти = Истина;	
		Если Не ОбластьРаскрытия = Неопределено Тогда	
			
			облРаскрытия.Лево = ОбластьРаскрытия.Лево;
			облРаскрытия.Верх = ОбластьРаскрытия.Верх;
			
			//Строки
			Если ОбластьРаскрытия.Лево=0 Тогда		
				Для Каждого ОбластьДляПроверки Из ОбъектАБ.КэшРаскрываемыхОбластей Цикл	
					тОбласть = ПолеТабличногоДокументаМакет.Области.Найти(ОбластьДляПроверки.ИмяОбласти);
					Если тОбласть.Верх<ОбластьРаскрытия.Верх И тОбласть.Низ>=ОбластьРаскрытия.Низ Тогда
						ФлВключенияОбласти = Ложь; Прервать; 	
					КонецЕсли;				
				КонецЦикла;				
				Если ФлВключенияОбласти Тогда
					НобластьКэша = ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Добавить();
					ЗаполнитьЗначенияСвойств(НобластьКэша,облРаскрытия);
					НобластьКэша.Низ =  ОбластьРаскрытия.Низ;
					НобластьКэша.Лево = 9999;		
				КонецЕсли;
			КонецЕсли;		
			//Колонки
			Если ОбластьРаскрытия.Верх=0 Тогда		
				Для Каждого ОбластьДляПроверки Из ОбъектАБ.КэшРаскрываемыхОбластей Цикл
					тОбласть = ПолеТабличногоДокументаМакет.Области.Найти(ОбластьДляПроверки.ИмяОбласти);
					//Если область имеет область - родителя, то игнорируем ее 
					Если тОбласть.Лево<ОбластьРаскрытия.Лево И тОбласть.Право>=ОбластьРаскрытия.Право Тогда
						ФлВключенияОбласти = Ложь; Прервать;						
					КонецЕсли;				
				КонецЦикла;			
				Если ФлВключенияОбласти Тогда
					НобластьКэша = ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Добавить();
					ЗаполнитьЗначенияСвойств(НобластьКэша,облРаскрытия);
					НобластьКэша.Право =  ОбластьРаскрытия.Право;
					НобластьКэша.Верх = 9999;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;						
	КонецЦикла;	
	
	
	
	
	//Готовим области таблиц
	тСтроки 	= ОбъектАБ.КэшРаскрываемыхОбластей.НайтиСтроки(Новый Структура("Лево",0));
	тКолонки 	= ОбъектАБ.КэшРаскрываемыхОбластей.НайтиСтроки(Новый Структура("Верх",0));
		
	Для Каждого тСтрока Из тСтроки Цикл	
		сНастройкиАналитикРаскрытия = ЗначениеИзСтрокиВнутр(тСтрока.НастройкиАналитикРаскрытия);
		тНастройкиАналитикРаскрытия = сНастройкиАналитикРаскрытия.СкопироватьКолонки();
		тОбластьСтрока              = ПолеТабличногоДокументаМакет.Область(тСтрока.ИмяОбласти);
		
		Для Каждого строкаАналитики Из сНастройкиАналитикРаскрытия Цикл
			тстрокаАналитики = тНастройкиАналитикРаскрытия.Добавить();
			ЗаполнитьЗначенияСвойств(тСтрокаАналитики,строкаАналитики);
		КонецЦикла;	
		Для Каждого тКолонка Из тКолонки Цикл	
			
		    тОбластьКолонка              = ПолеТабличногоДокументаМакет.Область(тКолонка.ИмяОбласти);
			
			кНастройкиАналитикРаскрытия = ЗначениеИзСтрокиВнутр(тКолонка.НастройкиАналитикРаскрытия);
			Для Каждого строкаАналитики Из кНастройкиАналитикРаскрытия Цикл
				тстрокаАналитики = тНастройкиАналитикРаскрытия.Добавить();
				ЗаполнитьЗначенияСвойств(тСтрокаАналитики,строкаАналитики);
			КонецЦикла;			
			нТаблица = ОбъектАБ.КэшТаблицРаскрываемыхОбластей.Добавить();
			нТаблица.УидГруппыОтборов =СтрЗаменить(Новый УникальныйИдентификатор,"-","");
			нТаблица.Лево 	= тОбластьКолонка.Лево;
			нТаблица.Право 	= тОбластьКолонка.Право;
			нТаблица.Верх 	= тОбластьСтрока.Верх;
			нТаблица.Низ 	= тОбластьСтрока.Низ;
			нТаблица.ИмяОбластиСтрок 	= тСтрока.ИмяОбласти;
			нТаблица.ИмяОбластиКолонок = тКолонка.ИмяОбласти;
			нТаблица.НастройкиАналитикРаскрытия = ЗначениеВСтрокуВнутр(тНастройкиАналитикРаскрытия);	
			нТаблица.ИмяОбласти           =  ПолеТабличногоДокументаМакет.Область(нТаблица.Верх,нТаблица.Лево,нТаблица.Низ,нТаблица.Право).Имя;
			
			ОтборРаскрываемойОбластиСтроки  = ОбъектАБ.НастройкиРаскрываемыхОбластей.НайтиСтроки(Новый Структура("УидГруппыОтборов",тСтрока.УидГруппыОтборов));
			ОтборРаскрываемойОбластиКолонки = ОбъектАБ.НастройкиРаскрываемыхОбластей.НайтиСтроки(Новый Структура("УидГруппыОтборов",тКолонка.УидГруппыОтборов));
			
			Для Каждого СтрокаОтбор Из ОтборРаскрываемойОбластиСтроки Цикл
				нОтбор = ОбъектАБ.НастройкиТаблицРаскрываемыхОбластей.Добавить();
				ЗаполнитьЗначенияСвойств(нОтбор,СтрокаОтбор);
				нОтбор.УидГруппыОтборов = нТаблица.УидГруппыОтборов;
			Конеццикла;
			
			Для Каждого СтрокаОтбор Из ОтборРаскрываемойОбластиКолонки Цикл
				нОтбор = ОбъектАБ.НастройкиТаблицРаскрываемыхОбластей.Добавить();
				ЗаполнитьЗначенияСвойств(нОтбор,СтрокаОтбор);
				нОтбор.УидГруппыОтборов = нТаблица.УидГруппыОтборов;
			Конеццикла;

			
		КонецЦикла;		
	КонецЦикла;	
			
   ОбъектАБ.КэшВыводаОбластейМакета.Очистить();	
   Лево =1;
   Верх =1;
   
   ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Сортировать("Верх,Лево");
   КолонкиРаскрытия 	= ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Выгрузить(Новый Структура("Верх",9999));
   СтрокиРаскрытия		= ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Выгрузить(Новый Структура("Лево",9999));
   
   нКол  		= КолонкиРаскрытия.Добавить();
   Нкол.Лево    = ПолетабличногоДокументаМакет.ШиринаТаблицы+1;
   Нкол.ИмяОбласти = "МаркерОкончания";
   
   Низ 		= ПолетабличногоДокументаМакет.ВысотаТаблицы;   
   нСтрока  = СтрокиРаскрытия.Добавить();
   нСтрока.Верх    = ПолетабличногоДокументаМакет.ВысотаТаблицы+1;
   нСтрока.ИмяОбласти = "МаркерОкончания";
   
   
   //Для Каждого СтрокаМакета Из  СтрокиРаскрытия Цикл	      
   //    //Между областями есть 'свободные' колонки
   //    Если Верх<>СтрокаМакета.Верх  Тогда   
   // 	   ЗаполнитьКэшВыводаОбластейМакета(ПолеТабличногоДокументаМакет,ОбъектАБ,КолонкиРаскрытия,Верх,СтрокаМакета.Верх,Лево,"Синтетика");
   //    КонецЕсли;
   //    Если СтрокаМакета.ИмяОбласти = "МаркерОкончания" Тогда
   // 	   Продолжить;
   //    КонецЕсли;		   
   //    ЗаполнитьКэшВыводаОбластейМакета(ПолеТабличногоДокументаМакет,ОбъектАБ,КолонкиРаскрытия,СтрокаМакета.Верх,СтрокаМакета.Низ,Лево,"Строки",СтрокаМакета.УидГруппыОтборов);	   
   //    Верх 	        = ?(ПолетабличногоДокументаМакет.ВысотаТаблицы =СтрокаМакета.Низ,ПолетабличногоДокументаМакет.ВысотаТаблицы+1,СтрокаМакета.Низ+1);	   
   //КонецЦикла;	   
    
   
КонецПроцедуры	

Функция ПолучитьИмяОбластиПоСтруктуреАналитик(СтруктураАналитик,ПолеТабличногоДокументаМакет)
	
	СтрИмениОбласти = "";
	Для Каждого СтрАналитика Из СтруктураАналитик Цикл
		СтрИмениОбластиЭталон = "Раскрытие_"+ОбщегоНазначенияУх.ВернутьАлфавитноЦифровоеПредставление(СтрАналитика.АналитикаПредставление)+"_";
	КонецЦикла;
	
	ИндексОбласти = 1;
	СтрИмениОбласти = СтрИмениОбластиЭталон;
	
	Пока НЕ ПолеТабличногоДокументаМакет.Области.Найти(СтрИмениОбласти) = Неопределено Цикл
		СтрИмениОбласти = СтрИмениОбластиЭталон+ИндексОбласти;
		ИндексОбласти = ИндексОбласти+1;
	КонецЦикла;	
	
	Возврат СтрИмениОбласти;
	
КонецФункции	

Процедура СконверироватьАналитикиБланка(БланкВход) Экспорт

	Если БланкВход.РежимБланка = 1 Тогда  //Сводная таблица
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВариантыСводныхТаблиц.Бланк КАК Бланк,
		|	ВариантыСводныхТаблиц.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВариантыСводныхТаблиц КАК ВариантыСводныхТаблиц
		|ГДЕ
		|	ВариантыСводныхТаблиц.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыСводныхТаблиц.Бланк = &Бланк";
		
		Запрос.УстановитьПараметр("Бланк",БланкВход);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Попытка
				СконвертироватьСтруктуруАналитикБланков(Выборка.Ссылка);
			Исключение	 
				
				ТекстСообщения = НСтр("ru = 'При конвертации отборов бланка %Бланк% произошла ошибка
				|			%ОписаниеОшибки%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(Выборка.Ссылка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.БланкиОтчетов,
				Выборка.Ссылка, 
				ТекстСообщения);
				
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
								
			КонецПопытки;	 
			
		КонецЦикла;			
		
	ИначеЕсли БланкВход.РежимБланка = 2 Тогда  //Бланк экземпляра
		
		Попытка
			
			СконвертироватьСтруктуруАналитикБланков(БланкВход);		
			
		Исключение	 
			
			ТекстСообщения = НСтр("ru = 'При конвертации отборов бланка %Бланк% произошла ошибка
			|			%ОписаниеОшибки%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(БланкВход));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.БланкиОтчетов,
			БланкВход, 
			ТекстСообщения);
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
			
		КонецПопытки;	 
			
	КонецЕсли;	


КонецПроцедуры	

Процедура СконвертироватьСтруктуруАналитикБланков(ВариантНастройки)
	
		
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	ПолеТабличногоДокументаКопия    = Новый ТабличныйДокумент;
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	//ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(ВариантНастройки);
	текНаборЗаписей.Прочитать();
	Если  текНаборЗаписей.Количество() =1 Тогда			
		ЗначениеСохраняемойНастройки = текНаборЗаписей[0].ХранилищеДополнительныхНастроек.Получить();	
		Если  ЗначениеСохраняемойНастройки.Свойство("ТабДокМакет") Тогда		
			ПолеТабличногоДокументаМакет.Вывести(ЗначениеСохраняемойНастройки.ТабДокМакет);
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСверху") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСверху = ЗначениеСохраняемойНастройки.ФиксацияСверху;
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСлева") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСлева = ЗначениеСохраняемойНастройки.ФиксацияСлева;
		КонецЕсли;	
	КонецЕсли;	

	ПолеТабличногоДокументаКопия.Вывести(ПолеТабличногоДокументаМакет);
	
	Для Каждого СтрОбласть Из ПолеТабличногоДокументаМакет.Области Цикл
		
		Если 	СтрОбласть.Лево = 0 И НЕ СтрОбласть.Имя = "ОбластьНастроекРаскрытийКолонок" Тогда   //Раскрытия строк
			
			ОбластьНастроек   = ПолеТабличногоДокументаМакет.Область(СтрОбласть.Верх,1,СтрОбласть.Верх,1);
			Если ТипЗнч(ОбластьНастроек.Расшифровка) = Тип("Структура") И ОбластьНастроек.Расшифровка.Свойство("НастройкиАналитикРаскрытия") Тогда
				тРасшифровка = ОбластьНастроек.Расшифровка;
				ТекущиеНастройкиАналитикРаскрытия      = ЗначениеИзСтрокиВнутр(ОбластьНастроек.Расшифровка.НастройкиАналитикРаскрытия);
				
				НастройкиАналитикРаскрытия 		= Обработки.АналитическийБланк.ПолучитьОписаниеТаблицыНастроекАналитик();
				Для Каждого Стр Из ТекущиеНастройкиАналитикРаскрытия Цикл
					НовНастройка = НастройкиАналитикРаскрытия.Добавить(); 
					ЗаполнитьЗначенияСвойств(НовНастройка,Стр);
				КонецЦикла;	
				
				ОбластьНастроек.Расшифровка.НастройкиАналитикРаскрытия = ЗначениеВСтрокуВнутр(НастройкиАналитикРаскрытия);
			Иначе
				Продолжить;
			КонецЕсли;
					
		ИначеЕсли 	СтрОбласть.Верх = 0 И НЕ СтрОбласть.Имя = "ОбластьНастроекРаскрытийСтрок" Тогда	  //Раскрытия колонок
			
			ОбластьНастроек   = ПолеТабличногоДокументаМакет.Область(1,СтрОбласть.Лево,1,СтрОбласть.Лево);
			Если ТипЗнч(ОбластьНастроек.Расшифровка) = Тип("Структура") И ОбластьНастроек.Расшифровка.Свойство("НастройкиАналитикРаскрытия") Тогда
				тРасшифровка = ОбластьНастроек.Расшифровка;
				ТекущиеНастройкиАналитикРаскрытия    = ЗначениеИзСтрокиВнутр(ОбластьНастроек.Расшифровка.НастройкиАналитикРаскрытия);
				
				НастройкиАналитикРаскрытия 		= Обработки.АналитическийБланк.ПолучитьОписаниеТаблицыНастроекАналитик();
				Для Каждого Стр Из ТекущиеНастройкиАналитикРаскрытия Цикл
					НовНастройка = НастройкиАналитикРаскрытия.Добавить(); 
					ЗаполнитьЗначенияСвойств(НовНастройка,Стр);
				КонецЦикла;				
				
				ОбластьНастроек.Расшифровка.НастройкиАналитикРаскрытия = ЗначениеВСтрокуВнутр(НастройкиАналитикРаскрытия);
				
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
				
	КонецЦикла;
	
	ЗначениеСохраняемойНастройки.ТабДокМакет = ПолеТабличногоДокументаМакет;
	ЗначениеСохраняемойНастройки.Вставить("ТабДокМакетКопия",ПолеТабличногоДокументаКопия);
	
	//Перезапишем макет
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(ВариантНастройки);
	текНаборЗаписей.Очистить();
	нЗапись  									= текНаборЗаписей.Добавить();
	нЗапись.Бланк								= ВариантНастройки;
	нЗапись.ХранилищеДополнительныхНастроек 	= Новый ХранилищеЗначения(ЗначениеСохраняемойНастройки);
    текНаборЗаписей.Записать(Истина);
	
	//Перезапишем все кэши
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	Обработки.АналитическийБланк.ПрочитатьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,ВариантНастройки,ОбъектАБ);	
	ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	Отказ = Ложь;				
	Уид   = Новый УникальныйИдентификатор;
	Справочники.БланкиОтчетов.СохранитьМакетМногопериодногоБланка(ВариантНастройки,ПолеТабличногоДокументаМакет,ОбъектАБ,Уид,Отказ);
	

		
КонецПроцедуры


Процедура ПерезаписатьБланки(БланкВход) Экспорт

	Если БланкВход.РежимБланка = 1 Тогда  //Сводная таблица
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВариантыСводныхТаблиц.Бланк КАК Бланк,
		|	ВариантыСводныхТаблиц.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВариантыСводныхТаблиц КАК ВариантыСводныхТаблиц
		|ГДЕ
		|	ВариантыСводныхТаблиц.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыСводныхТаблиц.Бланк = &Бланк";
		
		Запрос.УстановитьПараметр("Бланк",БланкВход);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Попытка
				ПерезаписатьМакетыБланков(Выборка.Ссылка);
			Исключение	 
				
				ТекстСообщения = НСтр("ru = 'При конвертации отборов бланка %Бланк% произошла ошибка
				|			%ОписаниеОшибки%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(Выборка.Ссылка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.БланкиОтчетов,
				Выборка.Ссылка, 
				ТекстСообщения);
				
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
								
			КонецПопытки;	 
			
		КонецЦикла;			
		
	ИначеЕсли БланкВход.РежимБланка = 2 Тогда  //Бланк экземпляра
		
		Попытка
			
			ПерезаписатьМакетыБланков(БланкВход);		
			
		Исключение	 
			
			ТекстСообщения = НСтр("ru = 'При конвертации отборов бланка %Бланк% произошла ошибка
			|			%ОписаниеОшибки%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(БланкВход));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.БланкиОтчетов,
			БланкВход, 
			ТекстСообщения);
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
			
		КонецПопытки;	 
			
	КонецЕсли;	


КонецПроцедуры	

Процедура ПерезаписатьМакетыБланков(ВариантНастройки)
		
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	ПолеТабличногоДокументаКопия    = Новый ТабличныйДокумент;
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	//ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
		
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(ВариантНастройки);
	текНаборЗаписей.Прочитать();
	Если  текНаборЗаписей.Количество() =1 Тогда			
		ЗначениеСохраняемойНастройки = текНаборЗаписей[0].ХранилищеДополнительныхНастроек.Получить();	
		Если  ЗначениеСохраняемойНастройки.Свойство("ТабДокМакет") Тогда		
			ПолеТабличногоДокументаМакет.Вывести(ЗначениеСохраняемойНастройки.ТабДокМакет);
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСверху") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСверху = ЗначениеСохраняемойНастройки.ФиксацияСверху;
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСлева") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСлева = ЗначениеСохраняемойНастройки.ФиксацияСлева;
		КонецЕсли;	
	Иначе	
		Возврат;
	КонецЕсли;	

	ПолеТабличногоДокументаКопия.Вывести(ПолеТабличногоДокументаМакет);
		
	ЗначениеСохраняемойНастройки.ТабДокМакет = ПолеТабличногоДокументаМакет;
	ЗначениеСохраняемойНастройки.Вставить("ТабДокМакетКопия",ПолеТабличногоДокументаКопия);
	
	//Перезапишем макет
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(ВариантНастройки);
	текНаборЗаписей.Очистить();
	нЗапись  									= текНаборЗаписей.Добавить();
	нЗапись.Бланк								= ВариантНастройки;
	нЗапись.ХранилищеДополнительныхНастроек 	= Новый ХранилищеЗначения(ЗначениеСохраняемойНастройки);
    текНаборЗаписей.Записать(Истина);
	
	//Перезапишем все кэши
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	Обработки.АналитическийБланк.ПрочитатьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,ВариантНастройки,ОбъектАБ);	
	ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	// Если копирование - заменить показатели
	Для Каждого СтрОбласть Из ПолеТабличногоДокументаМакет.Области Цикл
		
		ВидОтчета = Неопределено;
		Если ТипЗнч(ВариантНастройки) = Тип("СправочникСсылка.БланкиОтчетов") Тогда
			ВидОтчета = ВариантНастройки.Владелец;
		ИначеЕсли ТипЗнч(ВариантНастройки) = Тип("СправочникСсылка.ВариантыСводныхТаблиц") Тогда
			ВидОтчета = ВариантНастройки.Бланк.Владелец;
		КонецЕсли;
			
		Если СтрОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
			И  ТипЗнч(СтрОбласть.Расшифровка) = Тип("Структура")
			И СтрОбласть.Расшифровка.Свойство("Ссылка")
			И ЗначениеЗаполнено(ВидОтчета) Тогда
			
			Если ТипЗнч(СтрОбласть.Расшифровка.Ссылка) = Тип("СправочникСсылка.ПоказателиОтчетов") Тогда
				НовыйПоказатель = Справочники.ПоказателиОтчетов.НайтиПоКоду(СтрОбласть.Расшифровка.Ссылка.Код,,, ВидОтчета);
				Если ЗначениеЗаполнено(НовыйПоказатель) И (СтрОбласть.Расшифровка.Ссылка <> НовыйПоказатель) Тогда
					СтарыйКодВладельца = СокрЛП(СтрОбласть.Расшифровка.Ссылка.Владелец.Код);
					НовыйКодВладельца = СокрЛП(НовыйПоказатель.Владелец.Код);
					
					СтрОбласть.Имя = СтрЗаменить(СтрОбласть.Имя, СтарыйКодВладельца, НовыйКодВладельца);
					СтрОбласть.Текст = СтрЗаменить(СтрОбласть.Текст, СтарыйКодВладельца, НовыйКодВладельца);
					СтрОбласть.Расшифровка.Вставить("Ссылка", НовыйПоказатель);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
		
	Отказ = Ложь;				
	Уид   = Новый УникальныйИдентификатор;
	Справочники.БланкиОтчетов.СохранитьМакетМногопериодногоБланка(ВариантНастройки,ПолеТабличногоДокументаМакет,ОбъектАБ,Уид,Отказ);
		
КонецПроцедуры

//При переходе на версию 3.2.4.34 + поменялся интерфейс настройки бланков ЭО
//Необходимо отрисовать новые служебные области управления раскрытиями
Процедура СконверироватьМакетБланка(БланкВход) Экспорт

	Если БланкВход.РежимБланка = 2 Тогда  //Бланк экземпляра
		
		Попытка
			
			СконвертироватьМакетРазработкиБланкаЭО(БланкВход);		
			
		Исключение	 
			
			ТекстСообщения = НСтр("ru = 'При конвертации отборов бланка %Бланк% произошла ошибка
			|			%ОписаниеОшибки%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(БланкВход));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.БланкиОтчетов,
			БланкВход, 
			ТекстСообщения);
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
			
		КонецПопытки;	 
			
	КонецЕсли;	


КонецПроцедуры	

Процедура СконвертироватьМакетРазработкиБланкаЭО(БланкВход) Экспорт
	
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	ПолеТабличногоДокументаКопия    = Новый ТабличныйДокумент;
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	//ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(БланкВход);
	текНаборЗаписей.Прочитать();
	Если  текНаборЗаписей.Количество() =1 Тогда			
		ЗначениеСохраняемойНастройки = текНаборЗаписей[0].ХранилищеДополнительныхНастроек.Получить();	
		Если  ЗначениеСохраняемойНастройки.Свойство("ТабДокМакет") Тогда		
			ПолеТабличногоДокументаМакет.Вывести(ЗначениеСохраняемойНастройки.ТабДокМакет);
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСверху") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСверху = ЗначениеСохраняемойНастройки.ФиксацияСверху;
		КонецЕсли;
		Если  ЗначениеСохраняемойНастройки.Свойство("ФиксацияСлева") Тогда		
			ПолеТабличногоДокументаМакет.ФиксацияСлева = ЗначениеСохраняемойНастройки.ФиксацияСлева;
		КонецЕсли;	
	КонецЕсли;	
	
	ПолеТабличногоДокументаКопия.Вывести(ПолеТабличногоДокументаМакет);

	ПроверитьНаличиеСлужебныхОбластейРасширенный(ПолеТабличногоДокументаМакет);
	
	ЗначениеСохраняемойНастройки.Вставить("ТабДокМакетКопия",ПолеТабличногоДокументаКопия);
	ЗначениеСохраняемойНастройки.Вставить("ТабДокМакет",ПолеТабличногоДокументаМакет);
	ЗначениеСохраняемойНастройки.Вставить("ФиксацияСлева",ПолеТабличногоДокументаМакет.ФиксацияСлева);
    ЗначениеСохраняемойНастройки.Вставить("ФиксацияСверху",ПолеТабличногоДокументаМакет.ФиксацияСверху);

	
	//Перезапишем макет
	текНаборЗаписей = РегистрыСведений.НастройкиАналитическихБланков.СоздатьНаборЗаписей();
	текНаборЗаписей.Отбор.Бланк.Установить(БланкВход);
	текНаборЗаписей.Очистить();
	нЗапись  									= текНаборЗаписей.Добавить();
	нЗапись.Бланк								= БланкВход;
	нЗапись.ХранилищеДополнительныхНастроек 	= Новый ХранилищеЗначения(ЗначениеСохраняемойНастройки);
    текНаборЗаписей.Записать(Истина);
	
	//Перезапишем все кэши
	ПолеТабличногоДокументаМакет 	= Новый ТабличныйДокумент;
	
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	Обработки.АналитическийБланк.ПрочитатьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,БланкВход,ОбъектАБ);	
	ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	Отказ = Ложь;				
	Уид   = Новый УникальныйИдентификатор;
	Справочники.БланкиОтчетов.СохранитьМакетМногопериодногоБланка(БланкВход,ПолеТабличногоДокументаМакет,ОбъектАБ,Уид,Отказ);

	
КонецПроцедуры	

Процедура ПроверитьНаличиеСлужебныхОбластейРасширенный(ПолеТабличногоДокументаМакет) Экспорт
	
	//Получили таблицы служебных областей по макету, состоящему из одной области строки и колонок
	СтруктураГруппировок 				  = АналитическийБланкГенерацияМакетаУХСервер.ПолучитьСтруктуруГруппировокМакета(ПолеТабличногоДокументаМакет);
		
	МаксимальныйУровеньГруппировкиСтрок 	= СтруктураГруппировок.МаксимальныйУровеньГруппировкиСтрок;
	МаксимальныйУровеньГруппировкиКолонок   = СтруктураГруппировок.МаксимальныйУровеньГруппировкиКолонок;
			
	//Удалили "старые" области
	Обработки.АналитическийБланк.УдалитьСлужебныеОбласти(ПолеТабличногоДокументаМакет); //удалим служебные области...
		
	//Нарисовали новые области.
	УстановитьСлужебныеОбласти(ПолеТабличногоДокументаМакет,СтруктураГруппировок);
	
	//Таблицы координат служебных макетов нужно обновить по новым координатам
	ДельтаПоСтрокам = МаксимальныйУровеньГруппировкиСтрок-1;
	Если ДельтаПоСтрокам>0 Тогда	
		Для Каждого Строка Из СтруктураГруппировок.ТаблицаРаскрываемыхОбластейКолонок Цикл		
			Строка.Лево = Строка.Лево+ДельтаПоСтрокам;
			Строка.Право = Строка.Право+ДельтаПоСтрокам;		
		КонецЦикла;			
	КонецЕсли;	
	
	ДельтаПоКолонкам = МаксимальныйУровеньГруппировкиКолонок-1;
	Если ДельтаПоКолонкам>0 Тогда	
		Для Каждого Строка Из СтруктураГруппировок.ТаблицаРаскрываемыхОбластейСтрок Цикл		
			Строка.Верх = Строка.Верх+ДельтаПоКолонкам;
			Строка.Низ = Строка.Низ+ДельтаПоКолонкам;		
		КонецЦикла;			
	КонецЕсли;	
	
	//Скорректируем зафиксированную область
	ПолеТабличногоДокументаМакет.ФиксацияСлева 	= ПолеТабличногоДокументаМакет.ФиксацияСлева+ДельтаПоСтрокам;
	ПолеТабличногоДокументаМакет.ФиксацияСверху = ПолеТабличногоДокументаМакет.ФиксацияСверху+ДельтаПоКолонкам;
		
	НарисоватьОбластиРаскрытияСтрок(СтруктураГруппировок,ПолеТабличногоДокументаМакет,МаксимальныйУровеньГруппировкиСтрок);
	
	НарисоватьОбластиРаскрытияКолонок(СтруктураГруппировок,ПолеТабличногоДокументаМакет,МаксимальныйУровеньГруппировкиКолонок);	
	  	
КонецПроцедуры

Процедура УстановитьСлужебныеОбласти(ПолеТабличногоДокументаМакет,СтруктураГруппировок)
	
	МакетСлужебныхОбластей = Справочники.БланкиОтчетов.ПолучитьМакет("ШаблонСлужебныхОбластей");
	
	ОбластьИсточник = МакетСлужебныхОбластей.Область("ОбластьНастроекРаскрытийКолонок");
	
	Для ИндексОбласти = 1 По СтруктураГруппировок.МаксимальныйУровеньГруппировкиКолонок Цикл
		ОбластьПриемник = ПолеТабличногоДокументаМакет.Область(ИндексОбласти,0,ИндексОбласти,0);
		ПолеТабличногоДокументаМакет.ВставитьОбласть(ОбластьИсточник,ОбластьПриемник,ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЦикла;	
	
	
	ПолеТабличногоДокументаМакет.Область(СтруктураГруппировок.МаксимальныйУровеньГруппировкиКолонок,0,СтруктураГруппировок.МаксимальныйУровеньГруппировкиКолонок,1).Имя = "ОбластьНастроекРаскрытийКолонок";
	ПолеТабличногоДокументаМакет.Область(1,0,СтруктураГруппировок.МаксимальныйУровеньГруппировкиКолонок,1).Имя = "ОбластьНастроекРаскрытийКолонок";
	
	
	ОбластьИсточник = МакетСлужебныхОбластей.Область("ОбластьНастроекРаскрытийСтрок");
	
	Для ИндексОбласти = 1 По СтруктураГруппировок.МаксимальныйУровеньГруппировкиСтрок Цикл
		ОбластьПриемник = ПолеТабличногоДокументаМакет.Область(0,ИндексОбласти,0,ИндексОбласти);
		ПолеТабличногоДокументаМакет.ВставитьОбласть(ОбластьИсточник,ОбластьПриемник,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЦикла;	
	
	
	ПолеТабличногоДокументаМакет.Область(0,СтруктураГруппировок.МаксимальныйУровеньГруппировкиСтрок,0,СтруктураГруппировок.МаксимальныйУровеньГруппировкиСтрок).Имя = "";
	ПолеТабличногоДокументаМакет.Область(0,1,0,СтруктураГруппировок.МаксимальныйУровеньГруппировкиСтрок).Имя = "ОбластьНастроекРаскрытийСтрок";
	
КонецПроцедуры	

Процедура НарисоватьОбластиРаскрытияСтрок(СтруктураГруппировок,ПолеТабличногоДокументаМакет,МаксимальныйУровеньГруппировкиСтрок) 
	
	КартинкаОбластиИзмерения = БиблиотекаКартинок.МетаданныеИзмерения;
	КартинкаОбластиПериоды   = БиблиотекаКартинок.СводнаяТаблицаПериоды;
	
    ИмяОбластиГруппы = "";
	
	ЦветУзораЗаголовкаГруппировки                  	= Новый Цвет(255,255,255);
	ЦветУзораСлужебнойОбласти                  		= Новый Цвет(192,192,192);
	ЦветРамки                   					= Новый Цвет(125,125,125);
	
	ГраницаОбластиРаскрытия 	= Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
	
	Для Каждого СтрокаРаскрытия Из СтруктураГруппировок.ТаблицаРаскрываемыхОбластейСтрок Цикл
		
				
		ОбластьРаскрытия 			= ПолеТабличногоДокументаМакет.Область(СтрокаРаскрытия.ИмяОбласти);
		ЗаголовокОбластиРаскрытия  	= Справочники.БланкиОтчетов.ПолучитьЗаголовокОбластиРаскрытия(СтрокаРаскрытия.Расшифровка);
					
		ОбластьЗаголовка            = ПолеТабличногоДокументаМакет.Область(ОбластьРаскрытия.Верх,СтрокаРаскрытия.УровеньГруппировки,ОбластьРаскрытия.Верх,СтрокаРаскрытия.УровеньГруппировки);
		ОбластьЗаголовкаВсеЯчейки    =  ПолеТабличногоДокументаМакет.Область(
			  ОбластьРаскрытия.Верх
			 ,СтрокаРаскрытия.УровеньГруппировки
			 ,ОбластьРаскрытия.Верх+СтрокаРаскрытия.ВысотаМакета-1
			 ,МаксимальныйУровеньГруппировкиСтрок);
		
		//Установим свойства области заголовка по-умолчанию	
		Для ИндСтроки = ОбластьЗаголовкаВсеЯчейки.Верх По ОбластьЗаголовкаВсеЯчейки.Низ  Цикл 
			Для ИндКолонки = 1 По ОбластьЗаголовкаВсеЯчейки.Право  Цикл 
                ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).Картинка = Неопределено;
				ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).Текст = "";
				ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).Узор = ТипУзораТабличногоДокумента.Узор3;
                ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).ЦветУзора = ЦветУзораСлужебнойОбласти;

			КонецЦикла;	
		КонецЦикла;	
	 
			 			 
		//Выведем линии области
		//Если НЕ СтрокаРаскрытия.ИмяОбластиГруппы = ИмяОбластиГруппы Тогда
			 ИмяОбластиГруппы 		= СтрокаРаскрытия.ИмяОбластиГруппы;

			 ОбластьЗаголовкаВсеЯчейки.ГраницаСверху 	= ГраницаОбластиРаскрытия; 
			 ОбластьЗаголовкаВсеЯчейки.ГраницаСнизу	 	= ГраницаОбластиРаскрытия; 
			 ОбластьЗаголовкаВсеЯчейки.ГраницаСлева	 	= ГраницаОбластиРаскрытия; 
		 
			 ОбластьЗаголовкаВсеЯчейки.ЦветРамки = ЦветРамки;	 
			 ОбластьЗаголовкаВсеЯчейки.ЦветУзора = ЦветУзораЗаголовкаГруппировки;		 
		//КонецЕсли;
		
					
		//Установим картинку строк 
		Если НЕ СтрокаРаскрытия.Расшифровка.НастройкиАналитикРаскрытия.Найти("ПериодОтчета","АналитикаКод") = Неопределено Тогда	
			ОбластьЗаголовка.Картинка =  КартинкаОбластиПериоды;		 
		Иначе	 	 
			ОбластьЗаголовка.Картинка =  КартинкаОбластиИзмерения;
		КонецЕсли;	
		ОбластьЗаголовка.РазмерКартинки 				 = РазмерКартинки.РеальныйРазмер;
		ОбластьЗаголовка.ВертикальноеПоложениеКартинки 	 = ВертикальноеПоложение.Верх;
		ОбластьЗаголовка.ГоризонтальноеПоложениеКартинки = ГоризонтальноеПоложение.Лево;
		
		//Выведем заголовок области
		ОбластьЗаголовка.Текст 					=  ЗаголовокОбластиРаскрытия;
		ОбластьЗаголовка.ВертикальноеПоложение 	= ВертикальноеПоложение.Верх;
		ОбластьЗаголовка.Отступ                 = 0;
		
		//Установим расшифровку
		 ПолеТабличногоДокументаМакет.Область(ОбластьРаскрытия.Верх,1,ОбластьРаскрытия.Верх,1).Расшифровка = СтрокаРаскрытия.РасшифровкаИсходная;
		
		//Объединим область
		ОбластьЗаголовкаВсеЯчейки.Объединить();
		
		
	КонецЦикла;	

	//Установим ширину колонок технической области
	ШиринаПоследнейКолонки = 18;
	Для ИндексКолонки = 1 По МаксимальныйУровеньГруппировкиСтрок-1 Цикл		
		ПолеТабличногоДокументаМакет.Область(0,ИндексКолонки,0,ИндексКолонки).ШиринаКолонки = 2;	
		//ШиринаПоследнейКолонки = ШиринаПоследнейКолонки-3;
	КонецЦикла;			
	
	//ШиринаПоследнейКолонки = Макс(ШиринаПоследнейКолонки,3);
	
	ПолеТабличногоДокументаМакет.Область(0,МаксимальныйУровеньГруппировкиСтрок,0,МаксимальныйУровеньГруппировкиСтрок).ШиринаКолонки = ШиринаПоследнейКолонки;
			
КонецПроцедуры	

Процедура НарисоватьОбластиРаскрытияКолонок(СтруктураГруппировок,ПолеТабличногоДокументаМакет,МаксимальныйУровеньГруппировкиКолонок) 
	
	КартинкаОбластиИзмерения = БиблиотекаКартинок.МетаданныеИзмерения;
	КартинкаОбластиПериоды   = БиблиотекаКартинок.СводнаяТаблицаПериоды;
	
    ИмяОбластиГруппы = "";
	
	ЦветУзораЗаголовкаГруппировки                  	= Новый Цвет(255,255,255);
	ЦветУзораСлужебнойОбласти                  		= Новый Цвет(192,192,192);
	ЦветРамки                   					= Новый Цвет(125,125,125);
	

	ГраницаОбластиРаскрытия 	= Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
	
	Для Каждого СтрокаРаскрытия Из СтруктураГруппировок.ТаблицаРаскрываемыхОбластейКолонок Цикл
					
		ОбластьРаскрытия 			= ПолеТабличногоДокументаМакет.Область(СтрокаРаскрытия.ИмяОбласти);
		ЗаголовокОбластиРаскрытия  	= Справочники.БланкиОтчетов.ПолучитьЗаголовокОбластиРаскрытия(СтрокаРаскрытия.Расшифровка);
					
		ОбластьЗаголовка            = ПолеТабличногоДокументаМакет.Область(СтрокаРаскрытия.УровеньГруппировки,ОбластьРаскрытия.Лево,СтрокаРаскрытия.УровеньГруппировки,ОбластьРаскрытия.Лево);
		ОбластьЗаголовкаВсеЯчейки   = ПолеТабличногоДокументаМакет.Область(СтрокаРаскрытия.УровеньГруппировки
		,ОбластьРаскрытия.Лево
		,СтрокаРаскрытия.УровеньГруппировки
		,ОбластьРаскрытия.Право);
		
		//Установим свойства области заголовка по-умолчанию	
		Для ИндСтроки = 1 По ОбластьЗаголовкаВсеЯчейки.Низ  Цикл 
			Для ИндКолонки = ОбластьЗаголовкаВсеЯчейки.Лево По ОбластьЗаголовкаВсеЯчейки.Право  Цикл 
                ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).Картинка = Неопределено;
				ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).Текст = "";
				ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).Узор = ТипУзораТабличногоДокумента.Узор3;
                ПолеТабличногоДокументаМакет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).ЦветУзора = ЦветУзораСлужебнойОбласти;

			КонецЦикла;	
		КонецЦикла;
		
		ИмяОбластиГруппы 		= СтрокаРаскрытия.ИмяОбластиГруппы;
		
		ОбластьЗаголовкаВсеЯчейки.ГраницаСверху 	= ГраницаОбластиРаскрытия; 
		//ОбластьЗаголовкаВсеЯчейки.ГраницаСправа	= ГраницаОбластиРаскрытия; 
		//ОбластьЗаголовкаВсеЯчейки.ГраницаСлева	 	= ГраницаОбластиРаскрытия; 
		ОбластьЗаголовкаВсеЯчейки.ГраницаСнизу	 	= ГраницаОбластиРаскрытия; 
		
		
		ОбластьЗаголовкаВсеЯчейки.ЦветРамки = ЦветРамки;	 
		ОбластьЗаголовкаВсеЯчейки.ЦветУзора = ЦветУзораЗаголовкаГруппировки;		 
		
		//Установим картинку строк 
		Если НЕ СтрокаРаскрытия.Расшифровка.НастройкиАналитикРаскрытия.Найти("ПериодОтчета","АналитикаКод") = Неопределено Тогда	
			ОбластьЗаголовка.Картинка =  КартинкаОбластиПериоды;		 
		Иначе	 	 
			ОбластьЗаголовка.Картинка =  КартинкаОбластиИзмерения;
		КонецЕсли;	
		ОбластьЗаголовка.РазмерКартинки 				= РазмерКартинки.РеальныйРазмер;
		ОбластьЗаголовка.ВертикальноеПоложениеКартинки 	= ВертикальноеПоложение.Центр;
		
		
		//Выведем заголовок области
		ОбластьЗаголовка.Текст 								= ЗаголовокОбластиРаскрытия;
		ОбластьЗаголовка.ВертикальноеПоложение 				= ВертикальноеПоложение.Центр;
		ОбластьЗаголовка.ГоризонтальноеПоложение 			= ГоризонтальноеПоложение.Лево;
		ОбластьЗаголовка.ГоризонтальноеПоложениеКартинки 	= ГоризонтальноеПоложение.Лево;
		
		//Установим расшифровку
		 ШиринаОбластиМакета = СтрокаРаскрытия.Лево+(СтрокаРаскрытия.ШиринаМакета-1);
		 Для ИндКолонки = СтрокаРаскрытия.Лево  По ШиринаОбластиМакета Цикл		 
			 
			 СтруктураРсшифровкиНовая = Новый Структура;
			 Для Каждого СтрокаРасшифровки Из СтрокаРаскрытия.РасшифровкаИсходная Цикл
				 СтруктураРсшифровкиНовая.Вставить(СтрокаРасшифровки.Ключ,СтрокаРасшифровки.Значение);
			 КонецЦикла;	 
			 
			 ПолеТабличногоДокументаМакет.Область(1,ИндКолонки,1,ИндКолонки).Расшифровка = СтруктураРсшифровкиНовая; 
			 ПолеТабличногоДокументаМакет.Область(1,ИндКолонки,1,ИндКолонки).ЦветУзора   = ЦветУзораЗаголовкаГруппировки;
		 КонецЦикла;
		
	КонецЦикла;	

	//Установим высоту строк технической области
	Для ИндексСтроки = 1 По МаксимальныйУровеньГруппировкиКолонок Цикл		
		ПолеТабличногоДокументаМакет.Область(ИндексСтроки,0,ИндексСтроки,0).ВысотаСтроки = 15;	
	КонецЦикла;					
		
КонецПроцедуры	



#КонецОбласти

#КонецЕсли
