
Процедура ПередЗаписью(Отказ)
		
	ОбластиМакета.Очистить();
	
	ТабличныйДокументМакет = ЭтотОбъект.Макет.Получить();	
	Если ТабличныйДокументМакет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовок = ТабличныйДокументМакет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьРеквизиты = ТабличныйДокументМакет.ПолучитьОбласть("ОбластьРеквизиты");
	ОбластьШапка = ТабличныйДокументМакет.ПолучитьОбласть("ОбластьШапка");
		
	Если ОбластьРеквизиты.ВысотаТаблицы = 10 Тогда
		ВариантМакета = 1;
	ИначеЕсли ОбластьРеквизиты.ВысотаТаблицы = 5 Тогда
		ВариантМакета = 2;
	КонецЕсли;
	
	СохранитьОбластьМакетаВХранилище("ОбластьЗаголовок", ОбластьЗаголовок.ПолучитьОбласть(2,1,2,1));
	
	Если ВариантМакета = 1 Тогда
		
		СохранитьОбластьМакетаВХранилище("Организация", ОбластьРеквизиты.ПолучитьОбласть(1,1,1,1));
		СохранитьОбластьМакетаВХранилище("ОрганизацияПараметр", ОбластьРеквизиты.ПолучитьОбласть(2,1,2,1));
		СохранитьОбластьМакетаВХранилище("Проект", ОбластьРеквизиты.ПолучитьОбласть(3,1,3,1));
		СохранитьОбластьМакетаВХранилище("ПроектПараметр", ОбластьРеквизиты.ПолучитьОбласть(4,1,4,1));
		СохранитьОбластьМакетаВХранилище("Валюта", ОбластьРеквизиты.ПолучитьОбласть(5,1,5,1));
		СохранитьОбластьМакетаВХранилище("ВалютаПараметр", ОбластьРеквизиты.ПолучитьОбласть(6,1,6,1));
		СохранитьОбластьМакетаВХранилище("Период", ОбластьРеквизиты.ПолучитьОбласть(7,1,7,1));
		СохранитьОбластьМакетаВХранилище("ПериодПараметр", ОбластьРеквизиты.ПолучитьОбласть(8,1,8,1));
		СохранитьОбластьМакетаВХранилище("Сценарий", ОбластьРеквизиты.ПолучитьОбласть(9,1,9,1));
		СохранитьОбластьМакетаВХранилище("СценарийПараметр", ОбластьРеквизиты.ПолучитьОбласть(10,1,10,1));
		
	ИначеЕсли ВариантМакета = 2 Тогда
		
		СохранитьОбластьМакетаВХранилище("Организация", ОбластьРеквизиты.ПолучитьОбласть(1,1,1,1));
		СохранитьОбластьМакетаВХранилище("Проект", ОбластьРеквизиты.ПолучитьОбласть(2,1,2,1));
		СохранитьОбластьМакетаВХранилище("Валюта", ОбластьРеквизиты.ПолучитьОбласть(3,1,3,1));
		СохранитьОбластьМакетаВХранилище("Период", ОбластьРеквизиты.ПолучитьОбласть(4,1,4,1));
		СохранитьОбластьМакетаВХранилище("Сценарий", ОбластьРеквизиты.ПолучитьОбласть(5,1,5,1));
		
	КонецЕсли;
	
	СохранитьОбластьМакетаВХранилище("ОбластьШапкаСтрок", ОбластьШапка.ПолучитьОбласть(1,1,2,1));
	СохранитьОбластьМакетаВХранилище("ОбластьШапкаПериод", ОбластьШапка.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("ОбластьШапкаИтого", ОбластьШапка.ПолучитьОбласть(1,3,1,3));
	СохранитьОбластьМакетаВХранилище("ОбластьШапкаКолонка", ОбластьШапка.ПолучитьОбласть(2,2,2,2));
	СохранитьОбластьМакетаВХранилище("ОбластьШапкаКолонкаИтого", ОбластьШапка.ПолучитьОбласть(2,3,2,3));
	
	ОбластьСтрока = ТабличныйДокументМакет.ПолучитьОбласть("ОбластьСтрока");
	СохранитьОбластьМакетаВХранилище("ОбластьСтрока", ОбластьСтрока.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период", ОбластьСтрока.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог", ОбластьСтрока.ПолучитьОбласть(1,3,1,3));
	
	Область_Раскрытие_Аналитика_1 = ТабличныйДокументМакет.ПолучитьОбласть("Раскрытие_Аналитика_1");
	СохранитьОбластьМакетаВХранилище("Раскрытие_Аналитика_1", Область_Раскрытие_Аналитика_1.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период_Аналитика_1", Область_Раскрытие_Аналитика_1.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог_Аналитика_1", Область_Раскрытие_Аналитика_1.ПолучитьОбласть(1,3,1,3));
	
	Область_Раскрытие_Аналитика_2 = ТабличныйДокументМакет.ПолучитьОбласть("Раскрытие_Аналитика_2");
	СохранитьОбластьМакетаВХранилище("Раскрытие_Аналитика_2", Область_Раскрытие_Аналитика_2.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период_Аналитика_2", Область_Раскрытие_Аналитика_2.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог_Аналитика_2", Область_Раскрытие_Аналитика_2.ПолучитьОбласть(1,3,1,3));
	
	Область_Раскрытие_Аналитика_3 = ТабличныйДокументМакет.ПолучитьОбласть("Раскрытие_Аналитика_3");
	СохранитьОбластьМакетаВХранилище("Раскрытие_Аналитика_3", Область_Раскрытие_Аналитика_3.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период_Аналитика_3", Область_Раскрытие_Аналитика_3.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог_Аналитика_3", Область_Раскрытие_Аналитика_3.ПолучитьОбласть(1,3,1,3));
	
	Область_Раскрытие_Аналитика_4 = ТабличныйДокументМакет.ПолучитьОбласть("Раскрытие_Аналитика_4");
	СохранитьОбластьМакетаВХранилище("Раскрытие_Аналитика_4", Область_Раскрытие_Аналитика_4.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период_Аналитика_4", Область_Раскрытие_Аналитика_4.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог_Аналитика_4", Область_Раскрытие_Аналитика_4.ПолучитьОбласть(1,3,1,3));
	
	Область_Раскрытие_Аналитика_5 = ТабличныйДокументМакет.ПолучитьОбласть("Раскрытие_Аналитика_5");
	СохранитьОбластьМакетаВХранилище("Раскрытие_Аналитика_5", Область_Раскрытие_Аналитика_5.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период_Аналитика_5", Область_Раскрытие_Аналитика_5.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог_Аналитика_5", Область_Раскрытие_Аналитика_5.ПолучитьОбласть(1,3,1,3));
	
	Область_Раскрытие_Аналитика_6 = ТабличныйДокументМакет.ПолучитьОбласть("Раскрытие_Аналитика_6");
	СохранитьОбластьМакетаВХранилище("Раскрытие_Аналитика_6", Область_Раскрытие_Аналитика_6.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период_Аналитика_6", Область_Раскрытие_Аналитика_6.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог_Аналитика_6", Область_Раскрытие_Аналитика_6.ПолучитьОбласть(1,3,1,3));
	
	Область_Раскрытие_Аналитика_7 = ТабличныйДокументМакет.ПолучитьОбласть("Раскрытие_Аналитика_7");
	СохранитьОбластьМакетаВХранилище("Раскрытие_Аналитика_7", Область_Раскрытие_Аналитика_7.ПолучитьОбласть(1,1,1,1));
	СохранитьОбластьМакетаВХранилище("Раскрытие_Период_Аналитика_7", Область_Раскрытие_Аналитика_7.ПолучитьОбласть(1,2,1,2));
	СохранитьОбластьМакетаВХранилище("Итог_Аналитика_7", Область_Раскрытие_Аналитика_7.ПолучитьОбласть(1,3,1,3));
		
КонецПроцедуры

Процедура СохранитьМакетВХранилище(ТабличныйДокументМакет) Экспорт
	
	Если ТипЗнч(ТабличныйДокументМакет) <> Тип("ТабличныйДокумент") Тогда
		Возврат;
	КонецЕсли;
		
	ЭтотОбъект.Макет = Новый ХранилищеЗначения(ТабличныйДокументМакет, Новый СжатиеДанных(9));
		
КонецПроцедуры

Процедура СохранитьОбластьМакетаВХранилище(ИмяОбласти, ТабличныйДокументМакет)
		
	Если ТипЗнч(ТабличныйДокументМакет) <> Тип("ТабличныйДокумент") Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ОбластиМакета.Добавить();
	НоваяСтрока.Имя = ИмяОбласти;
	НоваяСтрока.МакетОбласти = Новый ХранилищеЗначения(ТабличныйДокументМакет, Новый СжатиеДанных(9));
		
КонецПроцедуры
