#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДанныеГрафикаРасчетов = ДанныеГрафикаРасчетов();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ГрафикРасчетов", ДанныеГрафикаРасчетов.ГрафикРасчетов);
	
	НастроитьВариантОтчета(НастройкиОтчета, ДанныеГрафикаРасчетов.ТаблицаПолей);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор)));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

#КонецОбласти   
  
#Область СлужебныеПроцедурыИФункции

Процедура НастроитьВариантОтчета(НастройкиОтчета, ТаблицаПолей)
	
	УстановитьМакетОформления(НастройкиОтчета);
	
	ПоляНабораДанных = СхемаКомпоновкиДанных.НаборыДанных[0].Поля; 
	ПоляНабораДанных.Очистить();
	
	ПоляРесурсов = СхемаКомпоновкиДанных.ПоляИтога;
	ПоляРесурсов.Очистить(); 
	
	ПоляВыбора = НастройкиОтчета.Выбор.Элементы;  
	ПоляВыбора.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаПолей Цикл
		
		ИмяПоля = СтрокаТаблицы.ИмяПоля;
		
		Если ПоляНабораДанных.Найти(ИмяПоля) = Неопределено Тогда
			
			НовоеПоле = ПоляНабораДанных.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			НовоеПоле.Поле = ИмяПоля;
			НовоеПоле.ПутьКДанным = ИмяПоля;
			НовоеПоле.ТипЗначения = СтрокаТаблицы.ТипЗначения;
			НовоеПоле.Заголовок = СтрокаТаблицы.Заголовок
		КонецЕсли;
		
		Если СтрокаТаблицы.ЭтоРесурс Тогда  
			
			Если ПоляРесурсов.Найти(ИмяПоля) = Неопределено Тогда
				НовоеПолеРесурса = ПоляРесурсов.Добавить();
				НовоеПолеРесурса.ПутьКДанным = ИмяПоля; 
				НовоеПолеРесурса.Выражение = "Сумма("+ИмяПоля+")";
			КонецЕсли;
			
		КонецЕсли; 
		
		Если Не ВыбранноеПолеДобавлено(ИмяПоля, ПоляВыбора) Тогда
			ВыбранноеПоле = ПоляВыбора.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;	
	КонецЦикла;
	

КонецПроцедуры

Функция ДанныеГрафикаРасчетов()
	
	СтруктураПараметровОтчета = ПараметрыОтчета();
	
	ДобавитьИЗаполнитьПоляРесурсовВГрафикеРасчетов(СтруктураПараметровОтчета);
	
	ПреобразоватьГрафикРасчетов(СтруктураПараметровОтчета);
	
	ЗаполнитьТаблицуПолейОтчета(СтруктураПараметровОтчета);
	
	Возврат СтруктураПараметровОтчета;

КонецФункции

Функция ПараметрыОтчета()

	СтруктураПараметров = ПолучитьИзВременногоХранилища(ПараметрыОтчета);
	ГрафикРасчетов = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресГрафикаРасчетов);  
	ВидДоговораУХ =  СтруктураПараметров.ВидДоговораУХ;

	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СтруктураПараметров.СсылкаНаОбъект);
	
	ОписаниеГрафика = Менеджер.ОписаниеГрафика(ВидДоговораУХ);
	
	Возврат Новый Структура("ГрафикРасчетов,ОписаниеГрафика,ТаблицаПолей",
							ГрафикРасчетов, ОписаниеГрафика, НовыйТаблицаПолейОтчета());
	
КонецФункции

Процедура ДобавитьИЗаполнитьПоляРесурсовВГрафикеРасчетов(СтруктураПараметровОтчета)

	Ресурсы = Ресурсы(СтруктураПараметровОтчета.ОписаниеГрафика);
	
	Для каждого Ресурс Из Ресурсы Цикл
		
		Если СтруктураПараметровОтчета.ГрафикРасчетов.Колонки.Найти(Ресурс.ИмяПоля) = Неопределено Тогда 
			СтруктураПараметровОтчета.ГрафикРасчетов.Колонки.Добавить(Ресурс.ИмяПоля, Ресурс.ТипЗначения);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтрокаГрафик Из СтруктураПараметровОтчета.ГрафикРасчетов Цикл
		
		КолонкаГрафика = РаботаСДоговорамиКонтрагентовУХ.ИмяКолонкиГрафика(ТекСтрокаГрафик.ОперацияГрафика, СтруктураПараметровОтчета.ОписаниеГрафика);
		Если ПустаяСтрока(КолонкаГрафика) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекСтрокаГрафик[КолонкаГрафика] = ТекСтрокаГрафик.Сумма;

	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПреобразоватьГрафикРасчетов(СтруктураПараметровОтчета)

	ПоляТаблицы = Новый Массив;

	Для каждого Колонка Из СтруктураПараметровОтчета.ГрафикРасчетов.Колонки Цикл
		
		Если Не ДопустимыйТипКолонки(Колонка) Тогда  
			Продолжить;
		КонецЕсли;
		
		ПоляТаблицы.Добавить("ГрафикРасчетов."+Колонка.Имя);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&ПоляТаблицы КАК ПоляТаблицы
		|ПОМЕСТИТЬ ВТ_ГрафикРасчетов
		|ИЗ
		|	&ГрафикРасчетов КАК ГрафикРасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрафикРасчетов.ПоляТаблицы КАК ПоляТаблицы
		|ИЗ
		|	ВТ_ГрафикРасчетов КАК ГрафикРасчетов";
	Запрос.УстановитьПараметр("ГрафикРасчетов", СтруктураПараметровОтчета.ГрафикРасчетов);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПоляТаблицы КАК ПоляТаблицы", СтрСоединить(ПоляТаблицы,","+Символы.ПС));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГрафикРасчетов.ПоляТаблицы КАК ПоляТаблицы", СтрСоединить(ПоляТаблицы,","+Символы.ПС));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураПараметровОтчета.ГрафикРасчетов = РезультатЗапроса.Выгрузить();

КонецПроцедуры

Процедура ЗаполнитьТаблицуПолейОтчета(СтруктураПараметровОтчета)
	
	ГрафикРасчетов = СтруктураПараметровОтчета.ГрафикРасчетов;
	ТаблицаПолей = СтруктураПараметровОтчета.ТаблицаПолей;
	
	ПорядокЗаполнения = Новый Массив;
	ПорядокЗаполнения.Добавить("Реквизиты");
	ПорядокЗаполнения.Добавить("Ресурсы");

	Для Каждого ИмяПорядкаЗаполнения Из ПорядокЗаполнения Цикл
		
		Для Каждого Колонка Из ГрафикРасчетов.Колонки Цикл
			
			Если ИмяПорядкаЗаполнения = "Реквизиты" Тогда
				
				Если ЭтоРесурс(СтруктураПараметровОтчета.ОписаниеГрафика, Колонка.Имя) Тогда
					Продолжить; 
				Иначе
					ДобавитьПолеОтчета(ТаблицаПолей, Колонка.Имя, Колонка.ТипЗначения);	
				КонецЕсли;
				
			ИначеЕсли  ИмяПорядкаЗаполнения = "Ресурсы" Тогда
				
				Если ЭтоРесурс(СтруктураПараметровОтчета.ОписаниеГрафика, Колонка.Имя) Тогда
					ДобавитьПолеОтчета(ТаблицаПолей, Колонка.Имя, Колонка.ТипЗначения, Истина);	
				Иначе
					Продолжить; 
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;	

КонецПроцедуры

Функция Ресурсы(ОписаниеГрафика)
	
	ТаблицаРесурсов = НовыйТаблицаПолейОтчета();
	
	МассивКолонокОписаний = СтрРазделить("КолонкаПриход КолонкаРасход", " ");
	
	ДенежнаяСуммаЛюбогоЗнака = Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип;
	
	Для каждого ЭлементОписания Из ОписаниеГрафика Цикл
		ОписаниеСекции = ЭлементОписания.Значение;
		Для каждого ИмяКолонкиОписания Из МассивКолонокОписаний Цикл 
			ИмяКолонки = ОписаниеСекции[ИмяКолонкиОписания];
			Заголовок =  ОписаниеСекции[ИмяКолонкиОписания+"Представление"];
			Если Не ЗначениеЗаполнено(ИмяКолонки) Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьПолеОтчета(ТаблицаРесурсов, ИмяКолонки, ДенежнаяСуммаЛюбогоЗнака, Заголовок);
			
		КонецЦикла;                             
	КонецЦикла;  
	         
	Возврат ТаблицаРесурсов;
	
КонецФункции     

Процедура ДобавитьПолеОтчета(ТаблицаПолейОтчета, ИмяПоля, ТипЗначения, ЭтоРесурс = Ложь, Заголовок = Неопределено)
	
	НовСтр =  ТаблицаПолейОтчета.Добавить();
	НовСтр.ИмяПоля = ИмяПоля;
	НовСтр.ТипЗначения = ТипЗначения;
	НовСтр.Заголовок = Заголовок;
	НовСтр.ЭтоРесурс = ЭтоРесурс;

КонецПроцедуры

Функция ДопустимыйТипКолонки(Колонка)

	Если СтрНайти(Колонка.Имя, "ВидАналитики") > 0  Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции      

Функция ЭтоРесурс(ОписаниеГрафика, ИмяПоля)
	
	Ресурсы = Ресурсы(ОписаниеГрафика);
	
	Возврат Ресурсы.Найти(ИмяПоля, "ИмяПоля") <> Неопределено;

КонецФункции

Функция ВыбранноеПолеДобавлено(ИмяПоля, ПоляВыбора)
	
	Для Каждого ПолеВыбора Из ПоляВыбора Цикл 
		
		Если Строка(ПолеВыбора.Поле) = ИмяПоля Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции 

Функция НовыйТаблицаПолейОтчета()

	ТаблицаПолей = Новый ТаблицаЗначений;  
	ТаблицаПолей.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
	ТаблицаПолей.Колонки.Добавить("Заголовок", Новый ОписаниеТипов("Строка"));
	ТаблицаПолей.Колонки.Добавить("ТипЗначения");
	ТаблицаПолей.Колонки.Добавить("ЭтоРесурс", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаПолей;

КонецФункции

Процедура УстановитьМакетОформления(НовыеНастройкиКД)
	
	ПараметрМакетОформленияЗначение = "ОформлениеОтчетовБежевый";
	
	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		ПараметрМакетОформления = НовыеНастройкиКД.ПараметрыВывода.Элементы.Найти("МакетОформления");
		Если ПараметрМакетОформления.Значение = "Main" 
			Или ПараметрМакетОформления.Значение = "Основной" Тогда
			ПараметрМакетОформления.Значение = ПараметрМакетОформленияЗначение;
			ПараметрМакетОформления.Использование = Истина;
		КонецЕсли;
		
		Для Каждого ЭлементСтруктуры Из НовыеНастройкиКД.Структура Цикл
			Если ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
				ПараметрМакетОформления = ЭлементСтруктуры.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
				Если ПараметрМакетОформления.Значение = "Main" 
					Или ПараметрМакетОформления.Значение = "Основной" Тогда
					ПараметрМакетОформления.Значение = ПараметрМакетОформленияЗначение;
					ПараметрМакетОформления.Использование = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#КонецЕсли
