#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Увеличивает номер задания в константе.
// 
// Возвращаемое значение:
//  Число - Предыдущий номер задания.
//
Функция УвеличитьНомерЗадания() Экспорт
	
	Возврат ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания(Метаданные.Константы.НомерЗаданияКРасчетуСтоимостиВНА.Имя);
	
КонецФункции

// Считывает записи регистра во временную таблицу за указанный период по отборам.
//
// Параметры:
//	НачалоПериода - Дата - Начало периода выборки данных.
//	ОкончаниеПериода - Дата - Конец периода выборки данных.
//	НомерЗаданияДоРасчета - Число -
//	Организации - Массив из СправочникСсылка.Организации - Фильтр по организации.
//
// Возвращаемое значение:
//	Структура:
//		* СписокОрганизаций - Массив из СправочникСсылка.Организации - Организации, для которых есть задания.
//		* НачалоПериода - Дата - Начало периода заданий.
//		* МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Содержит в себе временную таблицу ЗаданияКРасчету.
//
Функция ЗаданияКРасчету(НачалоПериода, ОкончаниеПериода, НомерЗаданияДоРасчета, Организации) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Задания.Месяц               КАК Месяц,
	|	Задания.ОбъектУчета         КАК ОбъектУчета,
	|	Задания.Организация         КАК Организация,
	|	Задания.НомерЗадания        КАК НомерЗадания,
	|	Задания.Документ            КАК Документ
	|
	|ПОМЕСТИТЬ ЗаданияКРасчету
	|
	|ИЗ
	|	РегистрСведений.ЗаданияКРасчетуСтоимостиВНА КАК Задания
	|
	|ГДЕ
	|	(Задания.Месяц >= &НачалоПериода 
	|		ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1,1,1))
	|	И (Задания.Месяц <= &ОкончаниеПериода
	|		ИЛИ &ОкончаниеПериода = ДАТАВРЕМЯ(1,1,1))
	|
	|	И Задания.НомерЗадания <= &НомерЗадания
	|	И (Задания.Организация В (&Организации)
	|			ИЛИ &ПоВсемОрганизациям)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(ЗаданияКРасчету.Месяц), ДАТАВРЕМЯ(1,1,1)) КАК НачалоПериода
	|ИЗ
	|	ЗаданияКРасчету КАК ЗаданияКРасчету
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданияКРасчету.Организация
	|ИЗ
	|	ЗаданияКРасчету КАК ЗаданияКРасчету
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("НомерЗадания", НомерЗаданияДоРасчета);
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", НЕ ЗначениеЗаполнено(Организации));
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[Результат.ВГраница()-1].Выбрать();
	Если Выборка.Следующий() Тогда
		НачалоПериодаЗаданий = Выборка.НачалоПериода;
	Иначе
		НачалоПериодаЗаданий = '000101010000';
	КонецЕсли;
	
	ЗаданияКРасчету = Новый Структура;
	ЗаданияКРасчету.Вставить("СписокОрганизаций", Результат[Результат.ВГраница()].Выгрузить().ВыгрузитьКолонку("Организация"));
	ЗаданияКРасчету.Вставить("НачалоПериода", НачалоПериодаЗаданий);
	ЗаданияКРасчету.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	
	Возврат ЗаданияКРасчету;
	
КонецФункции

// Метод создает записи регистра с параметрами, полученными запросом.
//
// Параметры:
//  Выборка		 - ВыборкаИзРезультатаЗапроса - выборка, содержащая данные для формирования записей.
//  НомерЗадания - Число - номер задания; если не задано, то будет установлено значение из соответствующей константы.
//
Процедура СоздатьЗаписиРегистраПоДаннымВыборки(Выборка, НомерЗадания = Неопределено) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		// В РИБ данный регистр обрабатывается только в главном узле.
		Возврат;
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		СтруктураПолей = Новый Структура("Месяц, Организация, ОбъектУчета, Документ");
		
		Если НомерЗадания = Неопределено Тогда
			НомерЗадания = ТекущийНомерЗадания();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.ОбъектУчета) Тогда
				Продолжить;
			КонецЕсли;	

			ЗаполнитьЗначенияСвойств(СтруктураПолей, Выборка);
			
			СоздатьЗаписьРегистра(
				СтруктураПолей.Месяц, 
				СтруктураПолей.Документ, 
				СтруктураПолей.Организация, 
				СтруктураПолей.ОбъектУчета, 
				НомерЗадания);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось сформировать задание к расчету стоимости ОС и НМА за %1 в организации %2 по причине: %3';
				|en = 'Cannot generate a job to calculate fixed assets and intangible assets value for %1 in company %2. Reason: %3'"),
			Выборка.Месяц,
			Выборка.Организация,
			ТекстОшибки);
			
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Закрытие месяца';
				|en = 'Month-end closing'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,,, 
			ТекстСообщения);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

// Фиксирует удачное выполнение операции.
//
// Параметры:
//  Период - Дата -
//  СписокОрганизаций - Массив - 
//  НомерДоРасчета - Число - 
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ИмяТаблицыОбъектов - Строка -
//
Процедура ЗафиксироватьРасчет(Период, СписокОрганизаций, НомерДоРасчета, МенеджерВременныхТаблиц, ИмяТаблицыОбъектов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СформироватьЗаданияНаСледующийПериод(КонецМесяца(Период) + 1, СписокОрганизаций, МенеджерВременныхТаблиц, ИмяТаблицыОбъектов);
	УдалитьЗадания(Период, СписокОрганизаций, НомерДоРасчета, МенеджерВременныхТаблиц, ИмяТаблицыОбъектов);

КонецПроцедуры

// Возвращает период с которого для данной операции закрытия месяца данные становятся неактуальными.
//
// Параметры:
//  СписокОрганизаций	 - Массив	 - Массив организаций, для которых контролируется актуальность.
// 
// Возвращаемое значение:
//  Дата - Начало месяца на который неактуально закрытие месяца.
//
Функция НачалоРасчета(СписокОрганизаций) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(Задания.Месяц), ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоРасчета
	|ИЗ
	|	РегистрСведений.ЗаданияКРасчетуСтоимостиВНА КАК Задания
	|ГДЕ
	|	Задания.Организация В (&СписокОрганизаций)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НачалоРасчета;
	
КонецФункции

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения
Процедура ОписаниеРегистровДляКонтроляДатЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.РегистрыНакопления.СтоимостьОС.ПолноеИмя(),
		"Период", "ФинансовыйКонтур", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.РегистрыНакопления.СтоимостьНМА.ПолноеИмя(),
		"Период", "ФинансовыйКонтур", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.РегистрыНакопления.ПрочиеРасходы.ПолноеИмя(),
		"Период", "ФинансовыйКонтур", "Организация");
	
КонецПроцедуры

// Возвращает перечень объектов метаданных, на основании данных которых формируются записи в регистре.
//
//Возвращаемое значение:
// Массив из ОбъектМетаданных
Функция ВходящиеДанныеМеханизма() Экспорт
	
	ВходящиеДанные = Новый Массив;
	ВходящиеДанные.Добавить(Метаданные.РегистрыНакопления.СтоимостьОС);
	ВходящиеДанные.Добавить(Метаданные.РегистрыНакопления.СтоимостьНМА);
	ВходящиеДанные.Добавить(Метаданные.РегистрыНакопления.ПрочиеРасходы);
	
	Возврат ВходящиеДанные;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущийНомерЗадания()
	
	УстановитьПривилегированныйРежим(Истина);
	ТекущийНомерЗадания = Константы.НомерЗаданияКРасчетуСтоимостиВНА.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТекущийНомерЗадания;
	
КонецФункции

Процедура СоздатьЗаписьРегистра(ПериодЗадания, ДокументЗадания, Организация, ОбъектУчета, НомерЗадания)
				
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		// В РИБ данный регистр обрабатывается только в главном узле.
		Возврат;
	КонецЕсли;
	
	// Запишем задания
	НачатьТранзакцию();
	Попытка
	
		НаборЗаписей = РегистрыСведений.ЗаданияКРасчетуСтоимостиВНА.СоздатьМенеджерЗаписи();
		НаборЗаписей.Месяц             = НачалоМесяца(ПериодЗадания);
		НаборЗаписей.ОбъектУчета       = ОбъектУчета;
		НаборЗаписей.Организация       = Организация;
		НаборЗаписей.Документ          = ДокументЗадания;
		НаборЗаписей.НомерЗадания      = НомерЗадания;
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки; 
	
КонецПроцедуры

Процедура УдалитьЗадания(Период, СписокОрганизаций, НомерДоРасчета, МенеджерВременныхТаблиц, ИмяТаблицыОбъектов)
	
	СписокЗапросов = Новый Массив;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ОбработанныеДанные") = Неопределено Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Ссылка,
		|	НЕОПРЕДЕЛЕНО КАК ОбъектУчета,
		|	ЛОЖЬ КАК ЕстьОшибки
		|ПОМЕСТИТЬ ОбработанныеДанные
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Задания.Месяц КАК Месяц,
	|	Задания.Организация КАК Организация,
	|	Задания.ОбъектУчета КАК ОбъектУчета,
	|	Задания.НомерЗадания КАК НомерЗадания,
	|	Задания.Документ КАК Документ
	|
	|ИЗ
	|	РегистрСведений.ЗаданияКРасчетуСтоимостиВНА КАК Задания
	|
	|ГДЕ
	|	Задания.Месяц <= &ОкончаниеПериода
	|	И Задания.НомерЗадания <= &НомерЗадания
	|	И Задания.Организация В (&СписокОрганизаций)
	|
	|	И Задания.ОбъектУчета В
	|		(ВЫБРАТЬ
	|			СписокОбъектов.ОбъектУчета
	|		ИЗ
	|			СписокОбъектов КАК СписокОбъектов)
	|
	|	И НЕ ИСТИНА В 
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			ОбработанныеДанные КАК ОбработанныеДанные
	|		ГДЕ
	|			ОбработанныеДанные.ОбъектУчета = Задания.ОбъектУчета
	|			И ОбработанныеДанные.ЕстьОшибки)
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СписокОбъектов", ИмяТаблицыОбъектов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("НомерЗадания", НомерДоРасчета);
	
	Результат = Запрос.Выполнить();
	
	Набор = СоздатьНаборЗаписей();

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Набор.Количество() >= 1000 Тогда
			Набор.Записать(РежимЗамещения.Удаление);
			Набор.Очистить(); 
		КонецЕсли;
		
		НоваяЗапись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		
	КонецЦикла;
	
	Если Набор.Количество() <> 0 Тогда
		Набор.Записать(РежимЗамещения.Удаление); 
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗаданияНаСледующийПериод(НачалоСледующегоМесяца, СписокОрганизаций, МенеджерВременныхТаблиц, ИмяТаблицыОбъектов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(НАЧАЛОПЕРИОДА(ДанныеКРасчету.Период, МЕСЯЦ)), ДАТАВРЕМЯ(1, 1, 1)) КАК Месяц,
	|	ДанныеКРасчету.Организация КАК Организация,
	|	ДанныеКРасчету.АналитикаКапитализацииРасходов КАК ОбъектУчета,
	|	&НомерЗадания КАК НомерЗадания
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьОС КАК ДанныеКРасчету
	|
	|ГДЕ
	|	ДанныеКРасчету.Организация В (&СписокОрганизаций)
	|	И ДанныеКРасчету.АналитикаКапитализацииРасходов В
	|			(ВЫБРАТЬ
	|				СписокОбъектов.ОбъектУчета
	|			ИЗ
	|				СписокОбъектов КАК СписокОбъектов)
	|
	|	И ДанныеКРасчету.Период >= &НачалоСледующегоМесяца
	|	И ДанныеКРасчету.Активность
	|	И ДанныеКРасчету.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ТИПЗНАЧЕНИЯ(ДанныеКРасчету.Регистратор) В (&ТипыДокументовПоКоторымРассчитываетсяСтоимость)
	|	И ДанныеКРасчету.ХозяйственнаяОперация В (&ХозяйственныеОперацииПоКоторымРассчитываетсяСтоимость)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеКРасчету.Организация,
	|	ДанныеКРасчету.АналитикаКапитализацииРасходов
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(МИНИМУМ(ДанныеКРасчету.Период), ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(НАЧАЛОПЕРИОДА(ДанныеКРасчету.Период, МЕСЯЦ)), ДАТАВРЕМЯ(1, 1, 1)) КАК Месяц,
	|	ДанныеКРасчету.Организация КАК Организация,
	|	ДанныеКРасчету.НематериальныйАктив КАК ОбъектУчета,
	|	&НомерЗадания КАК НомерЗадания
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК ДанныеКРасчету
	|
	|ГДЕ
	|	ДанныеКРасчету.Организация В (&СписокОрганизаций)
	|	И ДанныеКРасчету.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокОбъектов.ОбъектУчета
	|			ИЗ
	|				СписокОбъектов КАК СписокОбъектов)
	|
	|	И ДанныеКРасчету.Период >= &НачалоСледующегоМесяца
	|	И ДанныеКРасчету.Активность
	|	И ДанныеКРасчету.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ТИПЗНАЧЕНИЯ(ДанныеКРасчету.Регистратор) В (&ТипыДокументовПоКоторымРассчитываетсяСтоимость)
	|	И ДанныеКРасчету.ХозяйственнаяОперация В (&ХозяйственныеОперацииПоКоторымРассчитываетсяСтоимость)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеКРасчету.Организация,
	|	ДанныеКРасчету.НематериальныйАктив
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(МИНИМУМ(ДанныеКРасчету.Период), ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СписокОбъектов", ИмяТаблицыОбъектов);

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НомерЗадания", ТекущийНомерЗадания());
	Запрос.УстановитьПараметр("НачалоСледующегоМесяца", НачалоСледующегоМесяца);
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	
	Запрос.УстановитьПараметр(
		"ТипыДокументовПоКоторымРассчитываетсяСтоимость", 
		РасчетСтоимостиВНА.ТипыДокументовПоКоторымРассчитываетсяСтоимость());
	
	Запрос.УстановитьПараметр(
		"ХозяйственныеОперацииПоКоторымРассчитываетсяСтоимость", 
		РасчетСтоимостиВНА.ХозяйственныеОперацииПоКоторымРассчитываетсяСтоимость());
	 
	Результат = Запрос.Выполнить();
	
	Набор = СоздатьНаборЗаписей();

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
	Если Набор.Количество() <> 0 Тогда
		Набор.Записать(РежимЗамещения.Слияние); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли