#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("КомплекснаяАвтоматизация") Тогда
		Элементы.ГруппаДляРаспределенияПоЭтапам.Заголовок = НСтр("ru = 'Статей расходов по выпускам продукции';
																|en = 'Product release expense items'");
	КонецЕсли;

	Элементы.ГруппаДляРаспределенияПоЭтапам.Видимость = Ложь;
	Элементы.ГруппаДляРаспределенияМатериаловИРабот.Видимость = Ложь;
	Элементы.СтраницаПоказатели.Видимость = Ложь;	
	Элементы.УстаревшиеПравила.Видимость = Ложь;	
	//++ НЕ УТ
	Элементы.ГруппаДляРаспределенияПоЭтапам.Видимость = Истина;
	Элементы.ГруппаДляРаспределенияМатериаловИРабот.Видимость = Истина;
	Элементы.СтраницаПоказатели.Видимость = Истина;	
	Элементы.СтраницаПоказателиОВЗ.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат");	
	Элементы.УстаревшиеПравила.Видимость = Истина;	
	//-- НЕ УТ
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

