//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СтруктураЗатратПоОС);
	ОписаниеОтчета.ФункциональныеОпции.Добавить("ИспользоватьВнеоборотныеАктивы2_4");
	ОписаниеОтчета.ФункциональныеОпции.Добавить("ИспользоватьУправлениеРемонтами");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие затраты отнесены на основные средства?';
									|en = 'View expenses allocated to fixed assets.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СтруктураЗатратПоОС");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие затраты отнесены на основные средства?';
									|en = 'View expenses allocated to fixed assets.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
