
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;
	МестоПоставки = Параметры.МестоПоставки;
	Цена = Параметры.Цена;
	Коэффициент = Параметры.Коэффициент;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция УстановкаПараметров()

	ПараметрыВовзрата = Новый Структура();
	ПараметрыВовзрата.Вставить("ЕдиницаИзмерения",ЕдиницаИзмерения);
	ПараметрыВовзрата.Вставить("Номенклатура",Номенклатура);
	ПараметрыВовзрата.Вставить("Характеристика",Характеристика);
	ПараметрыВовзрата.Вставить("МестоПоставки",МестоПоставки);
	ПараметрыВовзрата.Вставить("Цена",Цена);
	ПараметрыВовзрата.Вставить("Коэффициент",Коэффициент);
	Возврат ПараметрыВовзрата;  
	
КонецФункции	
	
&НаКлиенте
Процедура УстановитьЦену(Команда)

	ПараметрыВовзрата = УстановкаПараметров();	
	ОповеститьОВыборе(ПараметрыВовзрата);
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	Иначе
		// Форма уже закрыта.
	КонецЕсли;   
	
КонецПроцедуры
