///////////////////////////////////////////////////////////////////////
// Процедуры и функции подсистемы "Прием в переработку"
// связанные с хозяйственной операцией "Поступление от давальца".
// 
///////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ФормированиеГиперссылкиВЖурнале

// Возвращает текст гиперссылки перехода из журнала документов в рабочее место оформления.
//
// Параметры:
//  Параметры - Структура - параметры формирования текста гиперссылки.
//
// Возвращаемое значение:
//  ФорматированнаяСтрока, Неопределено - текст гиперссылки перехода в рабочее место оформления передач.
//
Функция СформироватьГиперссылкуКОформлению(Параметры) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.РаспоряженияНаОтгрузку)
	 Или Не ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ТоварыКОтгрузке) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстСсылки = "Обработка.ЖурналДокументовПриемаВПереработку2_5.Форма.КОформлениюНакладных/СтраницаПоступленияСырья";
	
	ЕстьДокументыКОформлению = Обработки.ЖурналДокументовПриемаВПереработку2_5.ЕстьДокументыКОформлению(
									Параметры, Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца2_5);
	
	ЦветГиперссылки = ?(ЕстьДокументыКОформлению, Неопределено, ЦветаСтиля.НезаполненноеПолеТаблицы);
	
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'Поступление сырья';
											|en = 'Raw material receipt'"),, ЦветГиперссылки,, ТекстСсылки);
	
КонецФункции

#КонецОбласти

#КонецОбласти