
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	Ошибки = Неопределено;
	ЗакупкаСсылка =
		ЦентрализованныеЗакупкиВызовСервераУХ.ПолучитьЗакупкуПоСтрокеПлана(
			ПараметрКоманды, Ошибки);
	Если Ошибки.Количество() > 0 Тогда
		ЦентрализованныеЗакупкиКлиентСерверУХ.СообщитьПользователюИзМассива(
			Ошибки,
			НСтр("ru='Невозможно создать закупочную процедуру на основании выбранных строк!'"));
	ИначеЕсли ЗначениеЗаполнено(ЗакупкаСсылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ЗакупкаСсылка);
		ОткрытьФорму(
			"Справочник.ЗакупочныеПроцедуры.ФормаОбъекта",
			ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, 
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не удалось создать закупочную процедуру!'");
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
