#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаПараметров Из Объект.ПараметрыПреференцийОКПД2 Цикл   
		Если СтрокаПараметров.НациональныйРежимЗакупок = Перечисления.НациональныйРежимЗакупок.Преференции И
			СтрокаПараметров.Значение = 0 Тогда                                               
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для ОКПД %1 не указано значение преференции'"), СтрокаПараметров.ОКПД2),,,
													"Объект.ПараметрыПреференцийОКПД2["+СтрЗаменить(СтрокаПараметров.ПолучитьИдентификатор(), Символы.НПП, "")+"].Значение", 
													Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы   

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьНациональныйРежим(Команда) 
	ОткрытьФорму("Документ.УстановкаНациональногоРежима.Форма.ФормаВыбораНациональногоРежима",,ЭтотОбъект,,,,Новый ОписаниеОповещения("УстановитьНациональныйРежимЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Перем ВыборкаДетальныеЗаписи, Запрос, НоваяСтрока, РезультатЗапроса;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторОКПД2.Ссылка КАК ОКПД2,
	|	ПараметрыПреференцийОКПД2СрезПоследних.Значение КАК Значение,
	|	ЕСТЬNULL(ПараметрыПреференцийОКПД2СрезПоследних.НациональныйРежимЗакупок, ЗНАЧЕНИЕ(Перечисление.НациональныйРежимЗакупок.НеИспользовать)) КАК НациональныйРежимЗакупок
	|ИЗ
	|	Справочник.КлассификаторОКПД2 КАК КлассификаторОКПД2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыПреференцийОКПД2.СрезПоследних КАК ПараметрыПреференцийОКПД2СрезПоследних
	|		ПО (ПараметрыПреференцийОКПД2СрезПоследних.ОКПД2 = КлассификаторОКПД2.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОКПД2";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Объект.ПараметрыПреференцийОКПД2.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		НоваяСтрока = Объект.ПараметрыПреференцийОКПД2.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьНациональныйРежимНаСервере(Знач ВыделенныеСтроки, Значение)
	Для Каждого ОКПД2Ид Из ВыделенныеСтроки Цикл      
		СтрокаТаблицы = Объект.ПараметрыПреференцийОКПД2.НайтиПоИдентификатору(ОКПД2Ид);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Значение, "НациональныйРежимЗакупок"); 
		СтрокаТаблицы.Значение = Значение.Преференции;
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьНациональныйРежимЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УстановитьНациональныйРежимНаСервере(Элементы.ПараметрыПреференцийОКПД2.ВыделенныеСтроки, Результат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
