#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущаяСтрока Экспорт;

&НаКлиенте
Перем ПоследнийТипПараметра; // При изменении типа параметра запроса эта переменная содержит последний тип активной строки

&НаКлиенте
Перем ПоследнийТипВнешнегоИсточника; // При изменении типа внешнего источника эта переменная содержит последний тип активной строки

&НаКлиенте
Перем КопируемыеДанныеВнешнихИсточников;

&НаКлиенте
Перем ПоследнийТипТаблицыМВТ; // При изменении типа таблицы МВТ эта переменная содержит последний тип активной строки

&НаКлиенте
Перем КопируемыеДанныеТаблицМВТ;

&НаКлиенте
Перем ЗакрытиеРазрешено;

&НаКлиенте
Перем СравнениеРезультатов Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИТК_КонсольРазработчика.ПереносНастроекПриПереходеУИРКToolkit();
	
	РабочиеДанные = Новый Структура("Тип, Имя, Комментарий");
	
	ИТК_Перечисления.ЗаполнитьСписок(Элементы.НастройкиВыводаТаблицВывод, ИТК_Перечисления.ВидыВыводаТаблицы());
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.НастройкиВыводаТаблиц);
	
	ИТК_Перечисления.ЗаполнитьСписок(Элементы.ВнешниеИсточникиТип, ИТК_Перечисления.ТипыЗначенияВнешнегоИсточника());
	
	ИТК_КонсольРазработчикаКлиентСервер.НовыйРезультат(ТекущийРезультат);
	
	АдресДанных = ИТК_ВременноеХранилище.Поместить(Новый Соответствие, , УникальныйИдентификатор);
	ИТК_ТабличныйДокумент.ИнициализироватьФорму(ЭтотОбъект);
	ИТК_Форма.ЗаполнитьСписокВыбораМаксимальноеКоличествоВыводимыхСтрок(Элементы.МаксимумСтрок);
	
	УстановитьУсловноеОформление();
	
	Элементы.ВнешниеИсточникиИмя.ЦветТекста = ИТК_ОбщийКлиентСервер.ЦветТекстаГиперссылки();
	Элементы.ВнешниеИсточникиПредставление.ЦветТекста = ИТК_ОбщийКлиентСервер.ЦветТекстаГиперссылки();
	Элементы.СтраницаМВТ.Видимость = ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.17");
	Элементы.ГруппаПрогрессДлительнойОперации.Видимость = Ложь;
	Элементы.РезультатКодГруппа.Видимость = Ложь;
	
	ИТК_Настройки.ИнициализироватьФорму(ЭтотОбъект, ИТК_Перечисления.ИнструментКонсольРазработчика());
	
	Параметры.Свойство("ВходныеДанныеОтладки", ВходныеДанныеОтладки);
	Параметры.Свойство("Команда", КомандаЗапуска);
	
	ОбновитьЭлементыПоследниеРабочиеДанные();
	
	ИТК_Форма.ОбработчикПриСозданииНаСервереПосле(ЭтотОбъект);
	
	// Интерфейс 8.5
	ЭтоИнтерфейс8_5 = ИТК_ОбщийКлиентСервер.ЭтоИнтерфейс8_5();
	Если ЭтоИнтерфейс8_5 Тогда
		Элементы.ДеревоДанных.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	КонецЕсли;
	Элементы.СкрытьПоказатьДеревоДанных.Видимость = ЭтоИнтерфейс8_5;
	
	ИТК_ОбщийКлиентСервер.ИсправленияПроблемы85РедактированиеПоляПроизвольногоТипа(Элементы.ПараметрыЗапросаЗначениеПредставление);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	АварийноеЗавершение = ИТК_КонсольРазработчика.ЗначениеПеременной("АварийноеЗавершение");
	Если АварийноеЗавершение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АварийноеЗавершение.Удалить(УникальныйИдентификатор);
	ИТК_КонсольРазработчика.ЗаписатьЗначениеПеременной("АварийноеЗавершение", АварийноеЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	// Установим признак модифицированности сохраняемых в настройках формы данных,
	// должна быть ПриОткрытии в ПриСозданииНаСервере не устанавливается
	СохраняемыеВНастройкахДанныеМодифицированы = Истина; 
	
	ОткрытыеОкнаКонсоли = ОткрытыеОкнаКонсолиРазработчика();
	НачальныеДанныеИВосстановлениеАварийногоЗавершения(ОткрытыеОкнаКонсоли);
	
	УстановитьТекущейСтрокойДереваПервую();
	РаскрытьВеткиДереваВСоответствииСДанными(ДеревоДанных);
	
	ОбновитьОбработчикАвтоСохранения();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзмененыПоследниеОткрытыеДанные" Тогда
		
		ОбновитьЭлементыПоследниеРабочиеДанные(ИТК_Перечисления.ТипХраненияДанныхНастройка());
		
	КонецЕсли;
	
	НастройкиИзменены = ИТК_НастройкиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ИТК_Перечисления.ИнструментКонсольРазработчика());
	Если НастройкиИзменены Тогда
		НастройкиИзменены();
	КонецЕсли;
	
	ИТК_РедакторКодаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТипЗначенияИсточника = ТипЗнч(ИсточникВыбора);
	
	ИсточникУправляемаяФорма = (ТипЗначенияИсточника = Тип("УправляемаяФорма"));
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		ИсточникКонструкторСКД1С = (ТипЗначенияИсточника = Тип("КонструкторСхемыКомпоновкиДанных"));
	#Иначе
		ИсточникКонструкторСКД1С = Ложь;
	#КонецЕсли
	
	Если ИсточникКонструкторСКД1С
			ИЛИ ИТК_СКДКлиент.ИсточникВыбораКонструкторСКД(ИсточникВыбора) Тогда
			
		Если ИсточникКонструкторСКД1С Тогда
			АдресЗначения = ПоместитьВоВременноеХранилище(ВыбранноеЗначение);
		Иначе
			АдресЗначения = ВыбранноеЗначение;
		КонецЕсли;
		
		ОсновнаяСтрокаСКД = ОсновнаяСхемаКомпоновкиДанных(ТекущаяСтрока);
		ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, ОсновнаяСтрокаСКД, "Текст", ИТК_СКД.XMLТекстИзАдреса(АдресЗначения));
		
		ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОсновнаяСтрокаСКД);
		ПроверитьСхемуКомпоновкиДанных(ТекущиеДанные, ОсновнаяСтрокаСКД);
		
		ПодключаемыйЗагрузитьСостояниеРедактораКода();
		
		ОбновитьЭлементыФормы();
		
	КонецЕсли;
	
	Если ИсточникУправляемаяФорма Тогда
		
		ИмяФормыИсточника = ИсточникВыбора.ИмяФормы;
		Если СтрНайти(ИмяФормыИсточника, "ОбработкаРезультата") Тогда
			
			ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, ТекущаяСтрока, "АлгоритмыОбработки", ВыбранноеЗначение); 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Истина Тогда
		
		Если Модифицированность Тогда
			
			ТекстПредупреждения = НСтр("ru = 'В консоли имеются несохраненные данные, они будут потеряны.
			|Для сохранения изменений нажмите ""Продолжить работу"", сохраните данные, а потом завершите работу.';
			|en = 'The console has unsaved data, it will be lost.
			|To save your changes, click Continue, save the data, and then exit.'");
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗакрытиеРазрешено = Неопределено Тогда
			
			Отказ = Истина;
			ЗапуститьОбработчикСПроверкойНаСохранностьДанных(Новый ОписаниеОповещения("ОбработчикЗакрытиеРазрешеноЗакрыть", ЭтотОбъект));
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОшибкаТекстНажатие(Элемент)
	
	ПоказатьОшибку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПриИзменении(Элемент)
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ТекущаяСтрока.Имя = Представление;
		ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВнешнихФункцийПриИзменении(Элемент)
	
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, ТекущаяСтрока, "ИспользованиеВнешнихФункций", ИспользованиеВнешнихФункций);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументРезультатПриАктивизацииОбласти(Элемент)
	
	ИТК_ТабличныйДокументКлиент.ОбработчикПриАктивизацииОбласти(ЭтотОбъект, Элемент,
		ТабличныйДокументРезультат, ПоследняяАктивнаяОбласть, ТекущийРезультат.АдресДанныхРасшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументРезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	ИТК_ТабличныйДокументКлиент.ОбработчикВыбор(ЭтотОбъект, ТекущийРезультат.АдресДанныхРасшифровки, Область, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МаксимальноСтрокПриИзменении(Элемент)
	
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, ТекущаяСтрока, "МаксимумСтрок", МаксимумСтрок);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастроекСКД(Элемент)
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СКДПерейтиКОтчету(Элемент)
	
	ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.СКДСтруктура.ТекущаяСтрока);
	НастройкиЭлемента =  КомпоновщикНастроек.Настройки.НастройкиЭлемента(ЭлементСтруктуры);
	Элементы.СКДСтруктура.ТекущаяСтрока = КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(НастройкиЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура СКДЛокальныеВыбранныеПоляПриИзменении(Элемент)
	
	Если СКДЛокальныеВыбранныеПоля Тогда
		Элементы.СтраницыСКДПоляВыбора.ТекущаяСтраница = Элементы.СКДНастройкиВыбранныхПолей;
	Иначе
		
		Элементы.СтраницыСКДПоляВыбора.ТекущаяСтраница = Элементы.СКДОтключенныеНастройкиВыбранныхПолей;
		
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.СКДСтруктура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьВыборЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СКДЛокальныйОтборПриИзменении(Элемент)
	
	Если СКДЛокальныйОтбор Тогда
		Элементы.СКДСтраницыОтбора.ТекущаяСтраница = Элементы.СКДНастройкиОтбора;
	Иначе
		
		Элементы.СКДСтраницыОтбора.ТекущаяСтраница = Элементы.СКДОтключенныеНастройкиОтбора;
		
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.СКДСтруктура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьОтборЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СКДЛокальныйПорядокПриИзменении(Элемент)
	
	Если СКДЛокальныйПорядок Тогда
		Элементы.СтраницыСКДПорядок.ТекущаяСтраница = Элементы.СКДНастройкиПорядка;
	Иначе
		
		Элементы.СтраницыСКДПорядок.ТекущаяСтраница = Элементы.СКДОтключенныеНастройкиПорядка;
		
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.СКДСтруктура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьПорядокЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СКДЛокальноеУсловноеОформлениеПриИзменении(Элемент)
	
	Если СКДЛокальноеУсловноеОформление Тогда
		Элементы.СтраницыСКДУсловногоОформления.ТекущаяСтраница = Элементы.СКДНастройкиУсловногоОформления;
	Иначе
		
		Элементы.СтраницыСКДУсловногоОформления.ТекущаяСтраница = Элементы.СКДОтключенныеНастройкиУсловногоОформления;
		
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.СКДСтруктура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьУсловноеОформлениеЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СКДЛокальныеПараметрыВыводаПриИзменении(Элемент)
	
	Если СКДЛокальныеПараметрыВывода Тогда
		Элементы.СтраницыСКДПараметрыВывода.ТекущаяСтраница = Элементы.СКДНастройкиПараметровВывода;
	Иначе
		
		Элементы.СтраницыСКДПараметрыВывода.ТекущаяСтраница = Элементы.СКДОтключенныеНастройкиПараметровВывода;
		
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.СКДСтруктура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьПараметрыВыводаЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроекПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ИмяСтраницы = Сред(ТекущаяСтраница.Имя, СтрДлина("Страница") + 1);
	ТекущиеДанные.Страница = ИмяСтраницы;
	
	Если ТекущаяСтраница = Элементы.СтраницаПараметрыЗапроса
			ИЛИ ТекущаяСтраница = Элементы.СтраницаВнешниеИсточники Тогда
		
		ПроверитьДанныеСтроки(ТекущаяСтрока);
		ОбновитьЭлементыФормы();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйРедакторПриИзменении(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	Если ИмяЭлемента = "Код" Тогда
		
		ИзменяемыеПоля = Новый Структура;
		ИзменяемыеПоля.Вставить("Текст", Код);
		ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
		
	ИначеЕсли ИмяЭлемента = "ТекстЗапроса" Тогда
		
		ИзменяемыеПоля = Новый Структура;
		ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
		ИзменяемыеПоля.Вставить("Текст", ТекстЗапроса);
		ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
		ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
		
		ОбновитьСтруктуруЗапросов(ТекущаяСтрока, Ложь);
		
	ИначеЕсли ИмяЭлемента = "СхемаКомпоновкиДанныхXML" Тогда
		
		ИзменяемыеПоля = Новый Структура;
		ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
		ИзменяемыеПоля.Вставить("Текст", СхемаКомпоновкиДанныхXML);
		ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
		ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйДокументСформирован(Элемент)
	
	ДополнительныеПараметры = Новый Структура;
	
	// Подготовка пользовательских объектов
	ПользовательскиеОбъекты = Неопределено;
	Если Элемент = Элементы.ТекстЗапроса Тогда
		ПользовательскиеОбъекты = ПользовательскиеОбъектыТекстЗапроса();
	КонецЕсли;
	
	Если Элемент = Элементы.Код Тогда
		ПользовательскиеОбъекты = ИТК_РедакторКодаВызовСервера.ПользовательскиеОбъектыРезультат();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПользовательскиеОбъекты) Тогда
		ДополнительныеПараметры.Вставить("ПользовательскиеОбъекты", ПользовательскиеОбъекты);
	КонецЕсли;
	
	ИТК_РедакторКодаКлиент.ДополнительнаяИнициализация(ЭтотОбъект, Элемент, ДополнительныеПараметры);
	
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если Элемент = Элементы.ТекстЗапроса Тогда
		ИмяОбработчика = "ОбработкаТекстЗапросаПриИзменении";
	ИначеЕсли Элемент = Элементы.СхемаКомпоновкиДанныхXML Тогда
		ИмяОбработчика = "ОбработкаСхемаКомпоновкиДанныхXMLПриИзменении";
	Иначе
		ИмяОбработчика = "ОбработкаКодПриИзменении";
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения(ИмяОбработчика, ЭтотОбъект);
	
	ИТК_РедакторКодаКлиент.ОбработкаСобытий(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатКодДекорацияЗначениеНажатие(Элемент)
	
	Результат = РезультатИсполненияКода(ТекущийРезультат.Адрес);
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ИТК_ФормаКлиент.ОткрытьМногострочныйТекст(ЭтотОбъект, Результат, Ложь);
	Иначе
		ПоказатьЗначение( , Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДанных

&НаКлиенте
Процедура ДеревоДанныхПриИзменении(Элемент)
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = ДеревоДанных.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ТипСтроки = ТекущаяСтрока.Тип;
		ЭлементТекст = ЭлементТекстПоТипуСтроки(ТипСтроки);
		Если ТипСтроки = ИТК_Перечисления.ЭлементДанныхКод() 
				И ИТК_РедакторКодаКлиент.ТребуетсяПервоначальнаяИнициализация(ЭлементТекст) Тогда
			
			ИнициализацияРедактораКода();
			ИТК_РедакторКодаКлиент.Инициализация(ЭтотОбъект, "Код");
			
		ИначеЕсли ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиЗапрос(ТипСтроки) 
				И ИТК_РедакторКодаКлиент.ТребуетсяПервоначальнаяИнициализация(ЭлементТекст) Тогда
			
			ИнициализацияРедактораЗапроса();
			ИТК_РедакторКодаКлиент.Инициализация(ЭтотОбъект, "ТекстЗапроса");
			
		ИначеЕсли ТипСтроки = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных()
				И ИТК_РедакторКодаКлиент.ТребуетсяПервоначальнаяИнициализация(ЭлементТекст) Тогда
			
			ИнициализацияСхемаКомпоновкиДанныхXML();
			ИТК_РедакторКодаКлиент.Инициализация(ЭтотОбъект, "СхемаКомпоновкиДанныхXML");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// При новом получении формы если выделена одна та же самая строка ничего не делаем http://partners.v8.1c.ru/forum/thread.jsp?id=808386#808386
	// Необходимо обновлять сразу (ОбновлениеЭлементовФормыПослеОжидания не подходит) 
	// т.к. при обновлении после не срабатывают пункты контекстного меню Конструктор, Удалить и т.д.
	
	ИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
	Если ИдентификаторПоследнейВыделеннойСтроки <> ИдентификаторТекущейСтроки Тогда 
		
		СохранитьИзмененныеДанныеСтроки();
		ИдентификаторПоследнейВыделеннойСтроки = ИдентификаторТекущейСтроки;
		
		ВосстановитьСостояниеСтроки();
		ОбновитьЭлементыФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	// Обработка стандартного события добавления строки в Дерево (Insert)
	Отказ = Истина;
	
	Если ТекущаяСтрока <> Неопределено 
			И ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(ТекущаяСтрока.Тип) Тогда
		Возврат;
	ИначеЕсли Копирование Тогда // Добавлено копированием
		
		РодительТекущейСтроки = ИТК_КонсольРазработчикаДанныеКлиент.ПолучитьРодителяСтроки(ЭтотОбъект, ТекущаяСтрока);
		
		// Скопируем строку
		ПереместитьСтрокуДереваДанных(ТекущаяСтрока, РодительТекущейСтроки, Истина, Истина)
		
	Иначе
		ДобавитьСтрокуВДеревоДанных(ИТК_Перечисления.ЭлементДанныхЗапрос());
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущийЭлемент = Элементы.Представление;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	// Проверим есть ли строки для которых доступно перетаскивание
	ПриемникПеретаскивания = ПолучитьСтрокуПриемникПеретаскиванияДереваДанных(Строка);
	СтрокиКоторыеМожноПеренести = ПолучитьСтрокиКоторыеМожноПеренести(Элемент.ВыделенныеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания);
	
	Если Не ЗначениеЗаполнено(СтрокиКоторыеМожноПеренести) Тогда
		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаПриемникПеретаскивания = ПолучитьСтрокуПриемникПеретаскиванияДереваДанных(Строка);
	СтрокиКоторыеМожноПеренести = ПолучитьСтрокиКоторыеМожноПеренести(Элемент.ВыделенныеСтроки, ПараметрыПеретаскивания, СтрокаПриемникПеретаскивания);
	
	Копирование = (ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование);
	Для Каждого Идентификатор Из СтрокиКоторыеМожноПеренести Цикл
		
		ПереносимаяСтрока = ДеревоДанных.НайтиПоИдентификатору(Идентификатор);
		АктивироватьСтроку = (Элемент.ТекущаяСтрока = Идентификатор);
		
		Если ТипЗнч(СтрокаПриемникПеретаскивания) = Тип("ДанныеФормыДерево") 
			ИЛИ ИТК_КонсольРазработчикаДанныеКлиентСервер.ПереносСтрокиВнутрь(СтрокаПриемникПеретаскивания.Тип, ПереносимаяСтрока.Тип) Тогда
			
			ИндексВставки = Неопределено;
			
		Иначе
			
			ПриемникПеретаскиванияРодитель = ИТК_КонсольРазработчикаДанныеКлиент.ПолучитьРодителяСтроки(ЭтотОбъект, СтрокаПриемникПеретаскивания);
			ИндексВставки = ПриемникПеретаскиванияРодитель.ПолучитьЭлементы().Индекс(СтрокаПриемникПеретаскивания);
			СтрокаПриемникПеретаскивания = ПриемникПеретаскиванияРодитель;
			
		КонецЕсли;
		
		ПереместитьСтрокуДереваДанных(ПереносимаяСтрока, СтрокаПриемникПеретаскивания, Копирование, АктивироватьСтроку, ИндексВставки);
		
		// Удалим перемещенную строку (сделали копию строки на новом месте и нужно удалить старую)
		Если Не Копирование Тогда
			
			РодительПереносимойСтроки = ИТК_КонсольРазработчикаДанныеКлиент.ПолучитьРодителяСтроки(ЭтотОбъект, ПереносимаяСтрока);
			
			Если ПереносимаяСтрока <> Неопределено Тогда // Возможно уже была удалена
				РодительПереносимойСтроки.ПолучитьЭлементы().Удалить(ПереносимаяСтрока);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(СтрокаПриемникПеретаскивания) <> Тип("ДанныеФормыДерево") Тогда // Не перенос в корень дерева
		Элементы.ДеревоДанных.Развернуть(СтрокаПриемникПеретаскивания.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПередРазворачиванием(Элемент, Строка, Отказ)
	
	СтрокаДанных = ДеревоДанных.НайтиПоИдентификатору(Строка);
	СтрокаДанных.Развернуто = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПередСворачиванием(Элемент, Строка, Отказ)
	
	СтрокаДанных = ДеревоДанных.НайтиПоИдентификатору(Строка);
	Если СтрокаДанных <> Неопределено Тогда
		СтрокаДанных.Развернуто = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ЗаголовокВопроса = НСтр("ru = 'Удаление строк';
							|en = 'Deleting rows'");
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Выделено: %1
	|Данные будут потеряны. Продолжить?';
	|en = 'Lines selected: %1
	|Data will be lost. Continue?'"), Элемент.ВыделенныеСтроки.Количество());

	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВопросПередУдалениемСтрокДанныхЗавершение", ЭтотОбъект);
	КнопкиВопроса = ИТК_ФормаКлиент.КнопкиВопросаПродолжитьОтмена();
	
	ИТК_ФормаКлиент.ЗадатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, КнопкиВопроса, Истина, ЗаголовокВопроса, ЭтотОбъект, "ПередУдалениемСтрокДанных");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыЗапроса

&НаКлиенте
Процедура ПараметрыЗапросаПриИзменении(Элемент)
	
	СтрокаПараметр = Элемент.ТекущиеДанные;
	Если СтрокаПараметр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяИзменяемойКолонки = Элемент.ТекущийЭлемент.Имя;
	ИмяПараметра = СтрокаПараметр.Имя;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ТипЗначения = ТекущиеДанные.Параметры[ИмяПараметра];
	ЗначениеПараметра = ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(ТекущиеДанные, ИмяПараметра, ТипЗначения);
	НовыйТип = СтрокаПараметр.Тип;
	
	Если ИмяИзменяемойКолонки = "ПараметрыЗапросаТип" Тогда
		
		Если ПоследнийТипПараметра <> НовыйТип Тогда // Изменен тип
			
			ТекстОшибки = "";
			ПреобразованноеЗначение = ПреобразоватьЗначениеПараметраКТипу(ЗначениеПараметра, ОписаниеДоступныхТиповПараметра(ТипЗначения), ПоследнийТипПараметра, НовыйТип, ТекстОшибки);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Тип", НовыйТип);
			ДополнительныеПараметры.Вставить("Значение", ЗначениеПараметра);
			ДополнительныеПараметры.Вставить("НовоеЗначение", ПреобразованноеЗначение);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершенВопросПреобразоватьЗначениеПараметраВыражения", ЭтотОбъект, ДополнительныеПараметры);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
				ТекстВопроса = СтрШаблон(НСтр("ru = 'Ошибка при преобразовании значения: %1
	                                           |Значение будет потеряно. Продолжить?';
	                                           |en = 'Error converting value: %1
	                                           |The value will be lost. Proceed?'"), ТекстОшибки);
				
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, ИТК_ФормаКлиент.КнопкиВопросаПродолжитьОтмена(), , , ИТК_КонсольРазработчикаКлиентСервер.Представление()); 
				
			Иначе 
				ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		НовоеЗначениеПараметра = СтрокаПараметр.ЗначениеПредставление;
		
		Если НовоеЗначениеПараметра <> ЗначениеПараметра Тогда 
			ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, ИмяПараметра, НовоеЗначениеПараметра);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаПриАктивизацииСтроки(Элемент)
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Тип <> ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
		
		// Странно иногда активация строки параметра проиходит при обновлении страницы код
		// и решение проблемы https://github.com/infostart-hub/toolkit/issues/938
		Возврат;
		
	КонецЕсли;
	
	СтрокаПараметр = Элемент.ТекущиеДанные;
	Если СтрокаПараметр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоследнийТипПараметра = СтрокаПараметр.Тип;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ТипЗначенияПараметра = ТекущиеДанные.Параметры[СтрокаПараметр.Имя];
	ЗначениеПараметра = ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(ТекущиеДанные, СтрокаПараметр.Имя, ТипЗначенияПараметра);
	
	ЗначенияПараметровЗапросаОбновитьЭлементыСтроки(СтрокаПараметр);
	
	ЭлементЗначение = Элементы.ПараметрыЗапросаЗначениеПредставление;
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("СписокЗначений") Тогда
		
		ОписаниеТиповСтрока = ИТК_ТипыКлиентСервер.ОписаниеСтрока();
		Элементы.ПараметрыЗапросаЗначениеПредставление.ОграничениеТипа = ОписаниеТиповСтрока;
		ЭлементЗначение.РедактированиеТекста = Ложь;
		ЭлементЗначение.КнопкаВыпадающегоСписка = Ложь;
		ЭлементЗначение.КнопкаВыбора = Истина;
		
		СтрокаПараметр.ЗначениеПредставление = ОписаниеТиповСтрока.ПривестиЗначение(ЗначениеПараметра); 
		
	ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("Структура") Тогда
		
		Элементы.ПараметрыЗапросаЗначениеПредставление.ОграничениеТипа = ИТК_ТипыКлиентСервер.ОписаниеСтрока();
		ЭлементЗначение.РедактированиеТекста = Ложь;
		ЭлементЗначение.КнопкаОчистки = Ложь;
		ЭлементЗначение.КнопкаВыбора = Истина;
		ЭлементЗначение.КнопкаВыпадающегоСписка = Ложь;
		
		СтрокаПараметр.ЗначениеПредставление = ЗначениеПараметра.Представление;
		
	КонецЕсли;
	
	// Обновление списка выбора типа
	СписокДоступен = СписокДоступенДляПараметра(ЗначениеПараметра, ТипЗначенияПараметра);
	ИТК_Перечисления.ЗаполнитьСписок(Элементы.ПараметрыЗапросаТип, ИТК_Перечисления.ТипыЗначенияПараметровЗапроса(), СписокДоступен);
	
	ОбновитьЭлементыУправленияПараметровЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаПриНаведении(Элемент, ИдентификаторСтроки, Поле)
	
	Если ИдентификаторСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = ПараметрыЗапроса.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗначенияПараметровЗапросаОбновитьЭлементыСтроки(Строка, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПараметрыЗапросаИмя
			И ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
			
		ПереименоватьПараметр();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаТипОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Перем ОписаниеОповещенияОЗакрытии;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	СтрокаПараметр = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	ИмяПараметра = СтрокаПараметр.Имя;
	
	ТипЗначенияПараметра = ТекущиеДанные.Параметры[СтрокаПараметр.Имя];
	ЗначениеПараметра = ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(ТекущиеДанные, ИмяПараметра, ТипЗначенияПараметра);
	ЗаголовокПараметр = СтрШаблон(НСтр("ru = 'Параметр ""%1""'; en = 'Parameter ""%1""'"), ИмяПараметра);
	
	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВводЗначенияПараметраЗавершен", ЭтотОбъект, ДополнительныеПараметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДополнятьДату", Истина);
	ИТК_ФормаКлиент.ВводЗначенияСтрокиВФорме(ЗаголовокПараметр, Элемент, ЗначениеПараметра, СтрокаПараметр.ТипЗначения, СтандартнаяОбработка, ОписаниеОповещенияЗавершение, ДополнительныеПараметры);
	
	ДополнительныеПараметры = Новый Структура("Имя", ИмяПараметра);
	Если СтрокаПараметр.Тип = ИТК_Перечисления.ТипЗначенияПараметраЗапросаВыражение() Тогда
		
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры.Вставить("ВидСложногоПараметра", ИТК_Перечисления.СложныйПараметрЗапросаВыражение());
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеСложногоПараметраЗавершено", ЭтотОбъект, ДополнительныеПараметры);
		
		ШаблонЗаголовка = НСтр("ru = 'Редактирование выражения (%1): %2';
								|en = 'Expression edit (%1):%2'");
		ЗаголовокФормы = СтрШаблон(ШаблонЗаголовка, ИТК_Строки.ТекстПараметр(), ИмяПараметра);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Владелец", ЭтотОбъект);
		ДополнительныеПараметры.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияЗавершение);
		
		ИТК_РедакторКодаКлиент.ОткрытьРедактированиеКодаВОтдельномОкне(ЗаголовокФормы, ЗначениеПараметра.Значение, ДополнительныеПараметры);
		
	ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры.Вставить("ВидСложногоПараметра", ЗначениеПараметра.Вид);
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеСложногоПараметраЗавершено", ЭтотОбъект, ДополнительныеПараметры);
		
		Если ЗначениеПараметра.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
			
			ДополнительныеПараметрыОткрытия = Новый Структура;
			ДополнительныеПараметрыОткрытия.Вставить("ДополнениеЗаголовка", СтрШаблон("(%1): %2", ИТК_Строки.ТекстПараметр(), ИмяПараметра));
			ДополнительныеПараметрыОткрытия.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияЗавершение);
			ДополнительныеПараметрыОткрытия.Вставить("Источник", СтрШаблон("&%1", ИмяПараметра));
			
			ИТК_ФормаКлиент.ОткрытьТаблицуЗначений(ЗначениеПараметра.Значение, ЭтотОбъект, , ДополнительныеПараметрыОткрытия);
			
		ИначеЕсли ЗначениеПараметра.Вид = ИТК_Перечисления.СложныйПараметрЗапросаГраница() Тогда
			
			ИТК_ФормаКлиент.ОткрытьРедактированиеГраницы(ЗаголовокПараметр, ЗначениеПараметра.Значение, ЭтотОбъект, ОписаниеОповещенияЗавершение);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("МоментВремени") Тогда
		
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеЗначенияПараметраЗавершено", ЭтотОбъект, ДополнительныеПараметры);
		ИТК_ФормаКлиент.ОткрытьРедактированиеМоментаВремени(ЭтотОбъект, ЗначениеПараметра, СтандартнаяОбработка, ОписаниеОповещенияЗавершение, ЗаголовокПараметр);
		
	ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("СписокЗначений") Тогда
		
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеЗначенияПараметраЗавершено", ЭтотОбъект, ДополнительныеПараметры);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДополнениеЗаголовка", ЗаголовокПараметр);
		
		ИТК_ФормаКлиент.ОткрытьСписокЗначений(ЭтотОбъект, ИТК_Перечисления.ВариантФормыСписокЗначенийРедактирование(),
												ЗначениеПараметра, СтрокаПараметр.ТипЗначения, ОписаниеОповещенияЗавершение,
												СтандартнаяОбработка, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОчисткаЗначенияСтрокиВФорме(Элемент, СтандартнаяОбработка);
	
	СтрокаПараметр = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	НовоеЗначение = СтрокаПараметр.ТипЗначения.ПривестиЗначение(Неопределено);
	
	Если СтрокаПараметр.Тип = ИТК_Перечисления.ТипЗначенияПараметраЗапросаСписок() Тогда
		НовоеЗначение = ИТК_ОбщийКлиентСервер.НовыйСписокЗначений(НовоеЗначение);
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, СтрокаПараметр.Имя, НовоеЗначение);
	ОбновитьСтрокуПараметра(СтрокаПараметр, СтрокаПараметр.Имя, СтрокаПараметр.ТипЗначения, НовоеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ИТК_ФормаКлиент.ОбработкаВыбораЗначенияВФорме(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.АвтоПодборЗначенияВФорме(Текст, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВнешниеИсточники

&НаКлиенте
Процедура ВнешниеИсточникиПриАктивизацииСтроки(Элемент)
	
	ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;
	Элементы.ВнешниеИсточникиКонтекстноеМенюЗапросИсточника.Доступность = (ВнешниеИсточникиТекущиеДанные <> Неопределено);
	
	Если ВнешниеИсточникиТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнешниеИсточникиТекущиеДанные.Тип) Тогда // Без этого условия при копировании заносит пустое значение и обновляет внешний источник пустым
		ПоследнийТипВнешнегоИсточника = ВнешниеИсточникиТекущиеДанные.Тип;
	КонецЕсли;
	
	ОбновитьСтрокуВнешнийИсточник(ВнешниеИсточникиТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		КопируемыеДанныеВнешнихИсточников = Элемент.ТекущиеДанные;
	Иначе
		КопируемыеДанныеВнешнихИсточников = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;
	ИмяВнешнегоИсточника = ИТК_Строки.НовыйИдентификатор(
		НСтр("ru = 'Таблица'; en = 'Table'"),
		ИТК_ФормаКлиент.ВыгрузитьКолонкуКоллекции(ВнешниеИсточники, "Имя"));
	ВнешниеИсточникиТекущиеДанные.Имя = ИмяВнешнегоИсточника;
	
	UIDВнешнегоИсточника = Новый УникальныйИдентификатор;
	ВнешниеИсточникиТекущиеДанные.UID = UIDВнешнегоИсточника;
	
	Если Копирование Тогда
		
		Тип = КопируемыеДанныеВнешнихИсточников.Тип;
		Если Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
			
			ИТК_КонсольРазработчикаДанныеКлиент.СкопироватьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока,
				ИмяВнешнегоИсточника, UIDВнешнегоИсточника, КопируемыеДанныеВнешнихИсточников.UID);
			
		КонецЕсли;
		
	Иначе
		
		Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение();
		
		ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйВнешнийИсточник();
		ОписаниеВнешнегоИсточника.Имя = ИмяВнешнегоИсточника;
		ОписаниеВнешнегоИсточника.Тип = Тип;
		ИТК_КонсольРазработчикаДанныеКлиент.ВставитьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока, UIDВнешнегоИсточника, ОписаниеВнешнегоИсточника);
		
	КонецЕсли;
	ВнешниеИсточникиТекущиеДанные.Тип = Тип;
	
	ПоследнийТипВнешнегоИсточника = Тип;
	ВнешниеИсточники.Сортировать("Имя");
	
	ОбновитьСтрокуВнешнийИсточник(ВнешниеИсточникиТекущиеДанные);
	ТекущийЭлемент = Элементы.ВнешниеИсточникиИмя;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;
	
	ИмяТаблицы = ВнешниеИсточникиТекущиеДанные.Имя;
	ТипТаблицы = ВнешниеИсточникиТекущиеДанные.Тип;
	UIDТаблицы = ВнешниеИсточникиТекущиеДанные.UID;
	
	Если КопируемыеДанныеВнешнихИсточников <> Неопределено
			И ТипТаблицы = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
		
		ИТК_КонсольРазработчикаДанныеКлиент.СкопироватьВнешнийИсточник(
			ЭтотОбъект, ТекущаяСтрока, ИмяТаблицы, UIDТаблицы, КопируемыеДанныеВнешнихИсточников.UID);
		
	КонецЕсли;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, UIDТаблицы);
	Если ОписаниеВнешнегоИсточника = Неопределено Тогда
		ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйВнешнийИсточник();
	КонецЕсли;
	ОписаниеВнешнегоИсточника.Имя = ИмяТаблицы;
	ОписаниеВнешнегоИсточника.Тип = ТипТаблицы;
	
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока, UIDТаблицы, ОписаниеВнешнегоИсточника);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;
	
	Если ВнешниеИсточникиТекущиеДанные <> Неопределено Тогда
		ПоследнийТипВнешнегоИсточника = ВнешниеИсточникиТекущиеДанные.Тип;
	КонецЕсли;
	
	ОбновитьИнформациюВнешнихИсточников();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиПриИзменении(Элемент)
	
	Если Элемент.ТекущийЭлемент = Элементы.ВнешниеИсточникиТип Тогда
		
		ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;
		НовыйТип = ВнешниеИсточникиТекущиеДанные.Тип;
		Если ЗначениеЗаполнено(НовыйТип) 
				И ПоследнийТипВнешнегоИсточника <> НовыйТип Тогда
			
			ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
			ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, ВнешниеИсточникиТекущиеДанные.UID);
			Если ЗначениеЗаполнено(ОписаниеВнешнегоИсточника) Тогда
				
				НовоеЗначение = ОписаниеВнешнегоИсточника.Значение;
				
			Иначе
				
				ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйВнешнийИсточник(ВнешниеИсточникиТекущиеДанные.Имя);
				НовоеЗначение = Неопределено;
				
			КонецЕсли;
			
			ОписаниеВнешнегоИсточника.Тип = НовыйТип;
			ОписаниеВнешнегоИсточника.Значение = ПреобразоватьЗначениеВнешнегоИсточникаКТипу(НовоеЗначение, ПоследнийТипВнешнегоИсточника, НовыйТип);
			ИТК_КонсольРазработчикаДанныеКлиент.ВставитьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока, ВнешниеИсточникиТекущиеДанные.UID, ОписаниеВнешнегоИсточника);
			
			ПоследнийТипВнешнегоИсточника = НовыйТип;
			ОбновитьСтрокуВнешнийИсточник(ВнешниеИсточникиТекущиеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	ОбновитьИнформациюВнешнихИсточников();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ШаблонТекстаВопроса = НСтр("ru = 'Выделено : %1
							|Данные будут потеряны. Продолжить?';
							|en = 'Selected: %1
							|Data will be lost. Continue?'");
	ТекстВопроса = СтрШаблон(ШаблонТекстаВопроса, Элемент.ВыделенныеСтроки.Количество());
	
	ЗаголовокВопроса = НСтр("ru = 'Удаление внешних источников';
							|en = 'Deleting external sources'");
	КнопкиВопроса = ИТК_ФормаКлиент.КнопкиВопросаПродолжитьОтмена();
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередУдалениемВнешнегоИсточникаЗавершение", ЭтотОбъект);
	
	ИТК_ФормаКлиент.ЗадатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиВопроса, Истина, ЗаголовокВопроса,	ЭтотОбъект, "ПередУдалениемВнешнихИсточников");
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиТипОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеИсточникиПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент = Элементы.ВнешниеИсточникиИмя
			ИЛИ Элемент.ТекущийЭлемент = Элементы.ВнешниеИсточникиПредставление Тогда
		
		Отказ = Истина;
		
		ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;
		
		ТекущаяКолонка = Элемент.ТекущийЭлемент;
		ИмяВнешнегоИсточника = ВнешниеИсточникиТекущиеДанные.Имя;
		UIDВнешнегоИсточника = ВнешниеИсточникиТекущиеДанные.UID;
		
		Если СтрНайти(ТекущаяКолонка.Имя, "Имя") Тогда
			
			ЗанятыеИдентификаторы = ИТК_ФормаКлиент.ВыгрузитьКолонкуКоллекции(ВнешниеИсточники, "Имя", ИмяВнешнегоИсточника);
			ИТК_ФормаКлиент.ОткрытьРедактированиеИдентификатора(
				НСтр("ru = 'Имя внешнего источника'; en = 'External source name'"),
				ИТК_Перечисления.РежимРедактированияИдентификатораИдентификаторВременнойТаблицы(), ЭтотОбъект,
				Новый ОписаниеОповещения("ВводИдентификатораВнешнегоИсточникаЗавершен", ЭтотОбъект),
				ИмяВнешнегоИсточника, ЗанятыеИдентификаторы);
			
		ИначеЕсли СтрНайти(ТекущаяКолонка.Имя, "Представление") Тогда
			
			ДополнительныеПараметры = Новый Структура("UID", UIDВнешнегоИсточника);
			
			ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
			ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, UIDВнешнегоИсточника);
			Если ОписаниеВнешнегоИсточника = Неопределено Тогда
				ЗначениеВнешнегоИсточника = Неопределено;
			Иначе
				ЗначениеВнешнегоИсточника = ОписаниеВнешнегоИсточника.Значение;
			КонецЕсли;
			ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеЗначенияВнешнегоИсточникаЗавершено", ЭтотОбъект, ДополнительныеПараметры);
			
			Если ВнешниеИсточникиТекущиеДанные.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
				
				ШаблонЗаголовка = НСтр("ru = 'Редактирование выражения (%1): %2'; en = 'Expression edit (%1):%2'");
				ЗаголовокФормы = СтрШаблон(ШаблонЗаголовка, ИТК_Строки.ИмяВнешнегоИсточника(), ИмяВнешнегоИсточника);
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Владелец", ЭтотОбъект);
				ДополнительныеПараметры.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияЗавершение);
				
				ИТК_РедакторКодаКлиент.ОткрытьРедактированиеКодаВОтдельномОкне(ЗаголовокФормы, ЗначениеВнешнегоИсточника, ДополнительныеПараметры);
				
			ИначеЕсли ВнешниеИсточникиТекущиеДанные.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
				
				ДополнительныеПараметрыОткрытия = Новый Структура;
				ДополнительныеПараметрыОткрытия.Вставить("ДополнениеЗаголовка", СтрШаблон("(%1): %2", ИТК_Строки.ИмяВнешнегоИсточника(), ИмяВнешнегоИсточника));
				ДополнительныеПараметрыОткрытия.Вставить("НастройкаИндексацииКолонок", Истина);
				ДополнительныеПараметрыОткрытия.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияЗавершение);
				ДополнительныеПараметрыОткрытия.Вставить("Источник", ИмяВнешнегоИсточника);
				
				ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
				ДополнительныеПараметрыОткрытия.Вставить("ДобавляемыеКолонки", ТекущиеДанные.ОписаниеВнешнихИсточников.Получить(ИмяВнешнегоИсточника));
				
				ИТК_ФормаКлиент.ОткрытьТаблицуЗначений(ЗначениеВнешнегоИсточника, ЭтотОбъект, , ДополнительныеПараметрыОткрытия);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицыМВТ

&НаКлиенте
Процедура ТаблицыМВТПриИзменении(Элемент)
	
	Если Элемент.ТекущийЭлемент = Элементы.ТаблицыМВТТип Тогда
		
		ТаблицыМВТТекущиеДанные = Элементы.ТаблицыМВТ.ТекущиеДанные;
		НовыйТип = ТаблицыМВТТекущиеДанные.Тип;
		Если ЗначениеЗаполнено(НовыйТип) 
				И ПоследнийТипТаблицыМВТ <> НовыйТип Тогда
			
			ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
			ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиент.ТаблицаМВТ(ТекущиеДанные, ТаблицыМВТТекущиеДанные.UID);
			Если ЗначениеЗаполнено(ОписаниеТаблицыМВТ) Тогда
				НовоеЗначение = ОписаниеТаблицыМВТ.Значение;
			Иначе
				
				ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиентСервер.НоваяТаблицаМВТ(ТаблицыМВТТекущиеДанные.Имя);
				НовоеЗначение = Неопределено;
				
			КонецЕсли;
			
			ОписаниеТаблицыМВТ.Тип = НовыйТип;
			ОписаниеТаблицыМВТ.Значение = ПреобразоватьЗначениеВнешнегоИсточникаКТипу(НовоеЗначение, ПоследнийТипТаблицыМВТ, НовыйТип);
			ИТК_КонсольРазработчикаДанныеКлиент.ВставитьТаблицуМВТ(ЭтотОбъект, ТекущаяСтрока, ТаблицыМВТТекущиеДанные.UID, ОписаниеТаблицыМВТ);
			
			ПоследнийТипТаблицыМВТ = НовыйТип;
			ОбновитьСтрокуТаблицыМВТ(ТаблицыМВТТекущиеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	ОбновитьКоличествоТаблицМВТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТПриАктивизацииСтроки(Элемент)
	
	ТаблицыМВТТекущиеДанные = Элементы.ТаблицыМВТ.ТекущиеДанные;
	
	Если ТаблицыМВТТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТаблицыМВТТекущиеДанные.Тип) Тогда // Без этого условия при копировании заносит пустое значение и обновляет внешний источник пустым
		ПоследнийТипТаблицыМВТ = ТаблицыМВТТекущиеДанные.Тип;
	КонецЕсли;
	
	ОбновитьСтрокуТаблицыМВТ(ТаблицыМВТТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		КопируемыеДанныеТаблицМВТ = Элемент.ТекущиеДанные;
	Иначе
		КопируемыеДанныеТаблицМВТ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ШаблонТекстаВопроса = НСтр("ru = 'Выделено : %1
							|Данные будут потеряны. Продолжить?';
							|en = 'Selected: %1
							|Data will be lost. Continue?'");
	ТекстВопроса = СтрШаблон(ШаблонТекстаВопроса, Элемент.ВыделенныеСтроки.Количество());
	
	ЗаголовокВопроса = НСтр("ru = 'Удаление таблиц МВТ';
							|en = 'Removing TTM tables'");
	КнопкиВопроса = ИТК_ФормаКлиент.КнопкиВопросаПродолжитьОтмена();
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередУдалениемТаблицыМВТЗавершение", ЭтотОбъект);
	
	ИТК_ФормаКлиент.ЗадатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиВопроса, Истина, ЗаголовокВопроса,	ЭтотОбъект, "ПередУдалениемВнешнихИсточников");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыМВТТекущиеДанные = Элементы.ТаблицыМВТ.ТекущиеДанные;
	
	ИмяТаблицы = ТаблицыМВТТекущиеДанные.Имя;
	ТипТаблицы = ТаблицыМВТТекущиеДанные.Тип;
	UIDТаблицы = ТаблицыМВТТекущиеДанные.UID;
	
	Если КопируемыеДанныеТаблицМВТ <> Неопределено
			И ТипТаблицы = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
		
		ИТК_КонсольРазработчикаДанныеКлиент.СкопироватьТаблицуМВТ(
			ЭтотОбъект, ТекущаяСтрока, ИмяТаблицы,
			UIDТаблицы, КопируемыеДанныеТаблицМВТ.UID);
		
	КонецЕсли;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиент.ТаблицаМВТ(ТекущиеДанные, UIDТаблицы);
	Если ОписаниеТаблицыМВТ = Неопределено Тогда
		ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиентСервер.НоваяТаблицаМВТ();
	КонецЕсли;
	ОписаниеТаблицыМВТ.Имя = ИмяТаблицы;
	ОписаниеТаблицыМВТ.Тип = ТипТаблицы;
	
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьТаблицуМВТ(ЭтотОбъект, ТекущаяСтрока, UIDТаблицы, ОписаниеТаблицыМВТ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТаблицыМВТТекущиеДанные = Элементы.ТаблицыМВТ.ТекущиеДанные;
	
	Если ТаблицыМВТТекущиеДанные <> Неопределено Тогда
		ПоследнийТипТаблицыМВТ = ТаблицыМВТТекущиеДанные.Тип;
	КонецЕсли;
	
	ОбновитьКоличествоТаблицМВТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТТипОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент = Элементы.ТаблицыМВТИмя
			ИЛИ Элемент.ТекущийЭлемент = Элементы.ТаблицыМВТПредставление Тогда
		
		Отказ = Истина;
		
		ТаблицыМВТТекущиеДанные = Элементы.ТаблицыМВТ.ТекущиеДанные;
		ТекущаяКолонка = Элемент.ТекущийЭлемент;
		ИмяТаблицыМВТ = ТаблицыМВТТекущиеДанные.Имя;
		UIDТаблицыМВТ = ТаблицыМВТТекущиеДанные.UID;
		
		Если СтрНайти(ТекущаяКолонка.Имя, "Имя") Тогда
			
			ЗанятыеИдентификаторы = ИТК_ФормаКлиент.ВыгрузитьКолонкуКоллекции(ТаблицыМВТ, "Имя", ИмяТаблицыМВТ);
			ИТК_ФормаКлиент.ОткрытьРедактированиеИдентификатора(НСтр("ru = 'Имя таблицы МВТ'; en = 'Table name TTM'"),
				ИТК_Перечисления.РежимРедактированияИдентификатораИдентификаторВременнойТаблицы(), ЭтотОбъект,
				Новый ОписаниеОповещения("ВводИдентификатораТаблицыМВТЗавершен", ЭтотОбъект),
				ИмяТаблицыМВТ, ЗанятыеИдентификаторы);
			
		ИначеЕсли СтрНайти(ТекущаяКолонка.Имя, "Представление") Тогда
			
			ДополнительныеПараметры = Новый Структура("UID", UIDТаблицыМВТ);
			
			ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
			ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиент.ТаблицаМВТ(ТекущиеДанные, UIDТаблицыМВТ);
			Если ОписаниеТаблицыМВТ = Неопределено Тогда
				ЗначениеТаблицыМВТ = Неопределено;
			Иначе
				ЗначениеТаблицыМВТ = ОписаниеТаблицыМВТ.Значение;
			КонецЕсли;
			ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеЗначенияТаблицаМВТЗавершено", ЭтотОбъект, ДополнительныеПараметры);
			
			Если ТаблицыМВТТекущиеДанные.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
				
				ШаблонЗаголовка = НСтр("ru = 'Редактирование выражения (%1): %2';
										|en = 'Expression edit (%1):%2'");
				ЗаголовокФормы = СтрШаблон(ШаблонЗаголовка, ИТК_Строки.ИмяВнешнегоИсточника(), ИмяТаблицыМВТ);
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Владелец", ЭтотОбъект);
				ДополнительныеПараметры.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияЗавершение);
				
				ИТК_РедакторКодаКлиент.ОткрытьРедактированиеКодаВОтдельномОкне(ЗаголовокФормы, ЗначениеТаблицыМВТ, ДополнительныеПараметры);
				
			ИначеЕсли ТаблицыМВТТекущиеДанные.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
				
				ДополнительныеПараметрыОткрытия = Новый Структура;
				ДополнительныеПараметрыОткрытия.Вставить("ДополнениеЗаголовка", СтрШаблон("(%1): %2", ИТК_Строки.ИмяВнешнегоИсточника(), ИмяТаблицыМВТ));
				ДополнительныеПараметрыОткрытия.Вставить("НастройкаИндексацииКолонок", Истина);
				ДополнительныеПараметрыОткрытия.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияЗавершение);
				ДополнительныеПараметрыОткрытия.Вставить("Источник", ИмяТаблицыМВТ);
				
				ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
				ДополнительныеПараметрыОткрытия.Вставить("ДобавляемыеКолонки", ТекущиеДанные.ОписаниеТаблицМВТ.Получить(ИмяТаблицыМВТ));
				
				ИТК_ФормаКлиент.ОткрытьТаблицуЗначений(ЗначениеТаблицыМВТ, ЭтотОбъект, , ДополнительныеПараметрыОткрытия);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыМВТПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыМВТТекущиеДанные = Элементы.ТаблицыМВТ.ТекущиеДанные;
	ИмяТаблицыМВТ = ИТК_Строки.НовыйИдентификатор(НСтр("ru = 'Таблица'; en = 'Table'"),
		ИТК_ФормаКлиент.ВыгрузитьКолонкуКоллекции(ТаблицыМВТ, "Имя"));
	ТаблицыМВТТекущиеДанные.Имя = ИмяТаблицыМВТ;
	
	UIDТаблицыМВТ = Новый УникальныйИдентификатор;
	ТаблицыМВТТекущиеДанные.UID = UIDТаблицыМВТ;
	
	Если Копирование Тогда
		
		Тип = КопируемыеДанныеТаблицМВТ.Тип;
		Если Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
			
			ИТК_КонсольРазработчикаДанныеКлиент.СкопироватьТаблицуМВТ(
				ЭтотОбъект, ТекущаяСтрока, ИмяТаблицыМВТ, UIDТаблицыМВТ, КопируемыеДанныеТаблицМВТ.UID);
			
		КонецЕсли;
		
	Иначе
		
		Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение();
		
		ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиентСервер.НоваяТаблицаМВТ();
		ОписаниеТаблицыМВТ.Имя = ИмяТаблицыМВТ;
		ОписаниеТаблицыМВТ.Тип = Тип;
		ИТК_КонсольРазработчикаДанныеКлиент.ВставитьТаблицуМВТ(ЭтотОбъект, ТекущаяСтрока, UIDТаблицыМВТ, ОписаниеТаблицыМВТ);
		
	КонецЕсли;
	ТаблицыМВТТекущиеДанные.Тип = Тип;
	
	ПоследнийТипТаблицыМВТ = Тип;
	
	ТаблицыМВТ.Сортировать("Имя");
	
	ОбновитьСтрокуТаблицыМВТ(ТаблицыМВТТекущиеДанные);
	ТекущийЭлемент = Элементы.ТаблицыМВТИмя;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтруктураСКД

&НаКлиенте
Процедура СтруктураСКДПриАктивизацииПоля(Элемент)
	
	ВыбраннаяСтраница = Неопределено;
	ИмяПоля = Элемент.ТекущийЭлемент.Имя;
	
	Если СтрНайти(ИмяПоля, "СтруктураНаличиеВыбора") Тогда
		ВыбраннаяСтраница = Элементы.СтраницаСКДПоляВыбора;
	ИначеЕсли СтрНайти(ИмяПоля, "СтруктураНаличиеОтбора") Тогда
		ВыбраннаяСтраница = Элементы.СтраницаСКДОтбор;
	ИначеЕсли СтрНайти(ИмяПоля, "СтруктураНаличиеПорядка") Тогда
		ВыбраннаяСтраница = Элементы.СтраницаСКДПорядок;
	ИначеЕсли СтрНайти(ИмяПоля, "СтруктураНаличиеУсловногоОформления") Тогда
		ВыбраннаяСтраница = Элементы.СтраницаСКДУсловноеОформление;
	ИначеЕсли СтрНайти(ИмяПоля, "СтруктураНаличиеПараметровВывода") Тогда
		ВыбраннаяСтраница = Элементы.СтраницаСКДПараметрыДанных;
	КонецЕсли;
	
	Если ВыбраннаяСтраница <> Неопределено Тогда
		ТекущийЭлемент = Элементы.СтраницыНастройкиСКД;
		Элементы.СтраницыНастройкиСКД.ТекущаяСтраница = ВыбраннаяСтраница;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураСКДПриАктивизацииСтроки(Элемент)
	
	ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.СКДСтруктура.ТекущаяСтрока);
	ТипЭлемента = ТипЗнч(ЭлементСтруктуры); 
	
	ЭтоКоллекция	= ТипЭлемента = Неопределено  
						ИЛИ ТипЭлемента = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных")
						ИЛИ ТипЭлемента = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных");
	ЭтоНастройка	= ТипЭлемента = Тип("НастройкиКомпоновкиДанных")
						ИЛИ ТипЭлемента = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных");
	ЭтоГруппировка	= ТипЭлемента = Тип("ГруппировкаКомпоновкиДанных")
						ИЛИ ТипЭлемента = Тип("ГруппировкаТаблицыКомпоновкиДанных")
						ИЛИ ТипЭлемента = Тип("ГруппировкаДиаграммыКомпоновкиДанных");
	ЭтаТаблицаДиаграмма = ТипЭлемента = Тип("ТаблицаКомпоновкиДанных")
						ИЛИ ТипЭлемента = Тип("ДиаграммаКомпоновкиДанных");
						
	// Поля группировки
	Если ЭтоГруппировка Тогда
		Элементы.СтраницыСКДПолейГруппировки.ТекущаяСтраница = Элементы.НастройкиСКДПолейГруппировки;
	КонецЕсли;
	
	// Выбранные поля
	НаличиеВыбораУЭлемента = КомпоновщикНастроек.Настройки.НаличиеВыбораУЭлемента(ЭлементСтруктуры)
								ИЛИ ЭтоНастройка;
	СКДЛокальныеВыбранныеПоля = НаличиеВыбораУЭлемента;
	Элементы.СКДЛокальныеВыбранныеПоля.ТолькоПросмотр = ЭтоКоллекция ИЛИ ЭтоНастройка;
	Если ЭтоКоллекция Тогда
		ТекущаяСтраницаПоляВыбора = Элементы.СКДНедоступныеНастройкиВыбранныхПолей;
	ИначеЕсли НаличиеВыбораУЭлемента Тогда
		ТекущаяСтраницаПоляВыбора = Элементы.СКДНастройкиВыбранныхПолей;
	Иначе
		ТекущаяСтраницаПоляВыбора = Элементы.СКДОтключенныеНастройкиВыбранныхПолей;
	КонецЕсли;
	Элементы.СтраницыСКДПоляВыбора.ТекущаяСтраница = ТекущаяСтраницаПоляВыбора;
	
	// Отбор
	НаличиеОтбораУЭлемента = КомпоновщикНастроек.Настройки.НаличиеОтбораУЭлемента(ЭлементСтруктуры)
								ИЛИ ЭтоНастройка;
	СКДЛокальныйОтбор = НаличиеОтбораУЭлемента;
	Элементы.СКДЛокальныйОтбор.ТолькоПросмотр = ЭтоНастройка ИЛИ ЭтаТаблицаДиаграмма;
	Если ЭтоКоллекция ИЛИ ЭтаТаблицаДиаграмма Тогда
		ТекущаяСтраницаОтбор = Элементы.СКДНедоступныеНастройкиОтбора;
	ИначеЕсли НаличиеОтбораУЭлемента Тогда
		ТекущаяСтраницаОтбор = Элементы.СКДНастройкиОтбора;
	Иначе	
		ТекущаяСтраницаОтбор = Элементы.СКДОтключенныеНастройкиОтбора;
	КонецЕсли;
	Элементы.СКДСтраницыОтбора.ТекущаяСтраница = ТекущаяСтраницаОтбор;
	
	// Порядок
	НаличиеПорядкаУЭлемента = КомпоновщикНастроек.Настройки.НаличиеПорядкаУЭлемента(ЭлементСтруктуры)
								ИЛИ ЭтоНастройка;
	СКДЛокальныйПорядок = НаличиеПорядкаУЭлемента;
	Элементы.СКДЛокальныйПорядок.ТолькоПросмотр = ЭтоНастройка ИЛИ ЭтаТаблицаДиаграмма;
	Если ЭтоКоллекция ИЛИ ЭтаТаблицаДиаграмма Тогда
		ТекущаяСтраницаПорядок = Элементы.СКДНедоступныеНастройкиПорядка;
	ИначеЕсли СКДЛокальныйПорядок Тогда
		ТекущаяСтраницаПорядок = Элементы.СКДНастройкиПорядка;
	Иначе
		ТекущаяСтраницаПорядок = Элементы.СКДОтключенныеНастройкиПорядка;
	КонецЕсли;
	Элементы.СтраницыСКДПорядок.ТекущаяСтраница = ТекущаяСтраницаПорядок;
	
	// Условное оформление
	НаличиеУсловногоОформленияУЭлемента = КомпоновщикНастроек.Настройки.НаличиеУсловногоОформленияУЭлемента(ЭлементСтруктуры);
	СКДЛокальноеУсловноеОформление = НаличиеУсловногоОформленияУЭлемента;
	Элементы.СКДЛокальноеУсловноеОформление.ТолькоПросмотр = ЭтоКоллекция;
	Если ЭтоКоллекция Тогда
		ТекущаяСтраницаУсловноеОформление = Элементы.СКДНедоступныеНастройкиУсловногоОформления;
	ИначеЕсли СКДЛокальноеУсловноеОформление Тогда
		ТекущаяСтраницаУсловноеОформление = Элементы.СКДНастройкиУсловногоОформления;
	Иначе
		ТекущаяСтраницаУсловноеОформление = Элементы.СКДОтключенныеНастройкиУсловногоОформления;
	КонецЕсли;
	Элементы.СтраницыСКДУсловногоОформления.ТекущаяСтраница = ТекущаяСтраницаУсловноеОформление;
	
	// Параметры вывода
	НаличиеПараметровВыводаУЭлемента = КомпоновщикНастроек.Настройки.НаличиеПараметровВыводаУЭлемента(ЭлементСтруктуры);
	СКДЛокальныеПараметрыВывода = НаличиеПараметровВыводаУЭлемента;
	Элементы.СКДЛокальныеПараметрыВывода.ТолькоПросмотр = ЭтоКоллекция;
	Если ЭтоКоллекция Тогда
		ТекущаяСтраницаПараметрыВывода = Элементы.СКДНедоступныеНастройкиПараметровВывода;
	ИначеЕсли НаличиеПараметровВыводаУЭлемента Тогда
		ТекущаяСтраницаПараметрыВывода = Элементы.СКДНастройкиПараметровВывода;
	Иначе
		ТекущаяСтраницаПараметрыВывода = Элементы.СКДОтключенныеНастройкиПараметровВывода;
	КонецЕсли;
	Элементы.СтраницыСКДПараметрыВывода.ТекущаяСтраница = ТекущаяСтраницаПараметрыВывода;
						
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиВыводаТаблиц

&НаКлиенте
Процедура НастройкиВыводаТаблицВыводПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиВыводаТаблиц.ТекущиеДанные;
	УстановитьДляСтрокиНастройкуВыводаТаблицы(ТекущиеДанные, ТекущиеДанные.Вывод);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатСообщения

&НаКлиенте
Процедура РезультатСообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Данные = РезультатСообщения.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ИТК_ФормаКлиент.ОткрытьМногострочныйТекст(ЭтотОбъект, Данные.Текст, Ложь, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗапросСВременнымиТаблицами(Команда)

	ВыполнитьОперацию(ИТК_Перечисления.РежимВыполненияЗапросаСРезультатамиВременныхТаблиц());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКодНаКлиенте(Команда)
	
	ВыполнитьОперацию(ИТК_Перечисления.РежимВыполненияКодаНаКлиенте());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗамер(Команда)
	
	ВыполнитьОперацию("Замер");
	
КонецПроцедуры

&НаКлиенте
Процедура Конструктор(Команда)
	
	Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(ТекущаяСтрока.Тип) Тогда
		ОткрытьКонструкторСхемыКомпоновкиДанных();
	Иначе
		ОткрытьКонструкторТекстаЗапроса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьЗапрос(Команда)
	ПроверитьПоказатьОшибку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ДобавитьСтрокуВДеревоДанных(ИТК_Перечисления.ЭлементДанныхГруппа());
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыеДанные(Команда)
	
	ЗапуститьОбработчикСПроверкойНаСохранностьДанных(Новый ОписаниеОповещения("ОбработчикНовыеДанные", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакФайл(Команда = Неопределено)
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.Фильтр = ИТК_ОбщийКлиентСервер.ФильтрФайловДанных();
	ДиалогСохраненияФайла.Расширение = ИТК_ОбщийКлиентСервер.ОсновноеРасширениеФайловДанных();
	ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Сохранение данных';
											|en = 'Saving data'");
	
	ДиалогСохраненияФайла.Показать(Новый ОписаниеОповещения("СохранитьФайлЗакончено", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеКоманда(Команда)
	СохранитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСтроку(Команда = Неопределено)
	ВыполнитьОперацию("Выполнение");
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьСтроку(Команда)
	
	// Изменяем статус выделения строки на противоположный ; РежимОтметки (по умолчанию) = Неопределено - Инвертирование
	РежимИнвертированиеВыделения = Неопределено;
	УстановитьВыделениеСтрок(Элементы.ДеревоДанных.ВыделенныеСтроки, РежимИнвертированиеВыделения);
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	ОбновитьЭлементыВыделенияСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлКоманда(Команда)
	
	ОписаниеОповещения = ОписаниеОбработчикаЗагрузкиФайла();
	ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСФайлом(Команда)
	
	ОписаниеОповещения = ОписаниеОбработчикаЗагрузкиФайла(Истина);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемаяКомандаОткрытьПоследнийФайл(Команда)
	
	ИндексКоманды = ИТК_Строки.ИндексИдентификатора(Команда.Имя);
	ОписаниеОбработчика = Новый ОписаниеОповещения("ОбработчикОткрытьПоследнийФайл", ЭтотОбъект, ИндексКоманды);
	
	ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемаяКомандаОткрытьПоследнююНастройку(Команда)

	ИндексКоманды = ИТК_Строки.ИндексИдентификатора(Команда.Имя);
	ОписаниеОбработчика = Новый ОписаниеОповещения("ОбработчикОткрытьПоследнююНастройку", ЭтотОбъект, ИндексКоманды);
	
	ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОбработчика);

КонецПроцедуры

&НаКлиенте
Процедура КодНаВстроенномЯзыке(Команда)
	
	Если ЗапускНевозможенПроверкаОповещение(НСтр("ru = 'Код на встроенном языке';
												|en = 'Embedded language code'")) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Данные", ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока));
	ПараметрыФормы.Вставить("Тип", ТекущаяСтрока.Тип);
	
	ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.КодНаВстроенномЯзыке", ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторСтрокиОтладки(Команда)
	
	ОткрытьФорму("Обработка.ИТК_КонструкторСтрокиОтладки.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПапкуСодержащуюФайл(Команда)
	
	ИТК_ФайлыКлиент.ОткрытьВПроводнике(РабочиеДанные.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ИТК_ОбщийКлиент.ОткрытьНастройки(ЭтотОбъект, ИТК_Перечисления.ИнструментКонсольРазработчика());
КонецПроцедуры

&НаКлиенте
Процедура ДоступнаНоваяВерсия(Команда)
	ИТК_ОбщийКлиент.ОткрытьИнформациюОНовойВерсии();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСхемуКомпоновкиДанных(Команда)
	ДобавитьСтрокуВДеревоДанных(ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных());
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариантОтчетаСКД(Команда)
	ДобавитьСтрокуВДеревоДанных(ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД());
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользовательскуюНастройкуСКД(Команда)
	ДобавитьСтрокуВДеревоДанных(ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД());
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуКомпоновкиДанныхИзФайла(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла (РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Фильтр = ИТК_СКДКлиентСервер.ФильтрФайловXML();
	ВыборФайла.Расширение = "xml";
	ВыборФайла.Заголовок = НСтр("ru = 'Загрузка схемы компоновки данных';
								|en = 'Loading the data layout diagram'");
	ВыборФайла.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлов(Новый ОписаниеОповещения("ЗагрузитьСхемыКомпоновкиДанныхИзФайлаПослеПомещенияФайлов", ЭтотОбъект), , ВыборФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСхемуКомпоновкиДанныхВФайл(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Фильтр = ИТК_СКДКлиентСервер.ФильтрФайловXML();
	ВыборФайла.Заголовок = НСтр("ru = 'Сохранение схемы компоновки данных';
								|en = 'Saving the data layout diagram'");
	ВыборФайла.Расширение = "xml";
	
	ВыборФайла.Показать(Новый ОписаниеОповещения("СохранитьСхемуКомпоновкиДанныхВФайлПослеВыбораФайла", ЭтотОбъект, Новый Структура("ВыборФайла", ВыборФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьСхемуКомпоновкиДанных(Команда)
	
	ПроверитьПоказатьОшибку(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СравнитьСхемуКомпоновкиДанных(Команда)
	
	НеизменяемыеПоля = Новый Структура;
	НеизменяемыеПоля.Вставить("ОбъектЭталон");
	НеизменяемыеПоля.Вставить("ТипОбъектов");
	НеизменяемыеПоля.Вставить("ТипСравнения");

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипОбъектов", ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных());
	ДополнительныеПараметры.Вставить("ТипСравнения", ИТК_Перечисления.ВариантСравненияДанныхТексты());
	ДополнительныеПараметры.Вставить("НеизменяемыеПоля", НеизменяемыеПоля);
	
	ОткрытьФормуСравнения(ТекущаяСтрока, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура СравнитьТекстЗапроса(Команда)
	
	НеизменяемыеПоля = Новый Структура;
	НеизменяемыеПоля.Вставить("ОбъектЭталон");
	НеизменяемыеПоля.Вставить("ТипОбъектов");
	НеизменяемыеПоля.Вставить("ТипСравнения");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипОбъектов", ИТК_Перечисления.ЭлементДанныхЗапрос());
	ДополнительныеПараметры.Вставить("ТипСравнения", ИТК_Перечисления.ВариантСравненияДанныхТексты());
	ДополнительныеПараметры.Вставить("НеизменяемыеПоля", НеизменяемыеПоля);
	
	ОткрытьФормуСравнения(ТекущаяСтрока, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьРезультаты(Команда)
	
	НеизменяемыеПоля = Новый Структура;
	НеизменяемыеПоля.Вставить("ОбъектЭталон");
	НеизменяемыеПоля.Вставить("ТипОбъектов");
	НеизменяемыеПоля.Вставить("ТипСравнения");
	
	ДополнительныеПараметры = Новый Структура;
	
	Строка = НайтиСтрокуПоUID(ДеревоДанных, ТекущийРезультат.АктуаленПоСтроке);
	ДополнительныеПараметры.Вставить("ТипОбъектов", Строка.Тип);
	ДополнительныеПараметры.Вставить("ТипСравнения", ИТК_Перечисления.ВариантСравненияДанныхРезультаты());
	ДополнительныеПараметры.Вставить("НеизменяемыеПоля", НеизменяемыеПоля);
	
	ОткрытьФормуСравнения(Строка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьСтроки(Команда)
	
	ВыделенныеСтроки = Элементы.ДеревоДанных.ВыделенныеСтроки;
	
	СписокОшибок = Новый Массив;
	
	// Определим есть ли строки группы и не выделены разные типы строк
	ЕстьСтрокаГруппа = Ложь; НесовместимыеТипыСтрок = Ложь; ПоследнийТипСтроки = Неопределено;
	Для Каждого ИдентификаторВыделеннойСтроки Из ВыделенныеСтроки Цикл 
		
		ВыделеннаяСтрока = ДеревоДанных.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);

		Если ВыделеннаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхГруппа() Тогда
			ЕстьСтрокаГруппа = Истина;
		КонецЕсли;
		
		Если ПоследнийТипСтроки <> Неопределено Тогда 
			
			Если ПоследнийТипСтроки <> ВыделеннаяСтрока.Тип
					И Не (ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(ПоследнийТипСтроки) 
							И ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(ВыделеннаяСтрока.Тип))	Тогда
				НесовместимыеТипыСтрок = Истина;
			КонецЕсли;
			
		КонецЕсли;
			
		ПоследнийТипСтроки = ВыделеннаяСтрока.Тип;
		
	КонецЦикла;
	
	Если ЕстьСтрокаГруппа Тогда
		СписокОшибок.Добавить(НСтр("ru = 'Нельзя выбирать группы';
									|en = 'You cannot select groups'"));
	КонецЕсли;
	Если ВыделенныеСтроки.Количество() > 2 Тогда
		СписокОшибок.Добавить(НСтр("ru = 'Необходимо выделять не более 2-х строк';
									|en = 'It is necessary to select no more than 2 lines'"));
	КонецЕсли;
	Если НесовместимыеТипыСтрок Тогда
		СписокОшибок.Добавить(НСтр("ru = 'Несовместимые типы строк';
									|en = 'Incompatible string types'"));
	КонецЕсли;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		СписокОшибок.Добавить(НСтр("ru = 'Нет выделенных строк';
									|en = 'No rows selected'"));
	КонецЕсли;
	
	Если СписокОшибок.Количество() > 0 Тогда
		
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Проблема сравнения: %1';
											|en = 'Comparison problem: %1'"), СтрСоединить(СписокОшибок, ", "));
		ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;
	
	НеизменяемыеПоля = Новый Структура;
	НеизменяемыеПоля.Вставить("ОбъектЭталон");
	НеизменяемыеПоля.Вставить("ТипОбъектов");
	
	СтрокаЭталон = ДеревоДанных.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	СтрокаНовый = Неопределено;
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		СтрокаНовый = ДеревоДанных.НайтиПоИдентификатору(ВыделенныеСтроки[1]);
		НеизменяемыеПоля.Вставить("ОбъектНовый");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокаНовый", СтрокаНовый);
	ДополнительныеПараметры.Вставить("ТипОбъектов", СтрокаЭталон.Тип);
	ДополнительныеПараметры.Вставить("НеизменяемыеПоля", НеизменяемыеПоля);
	
	ОткрытьФормуСравнения(СтрокаЭталон, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройку(Команда)
	
	ОписаниеОповещения = ОписаниеОбработчикаЗагрузкиНастройки();
	ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСНастройкой(Команда)
	
	ОписаниеОповещения = ОписаниеОбработчикаЗагрузкиНастройки(Истина);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакНастройку(Команда = Неопределено)
	
	ТекущееИмяНастройки = Неопределено;
	Если РабочиеДанные.Тип = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
		ТекущееИмяНастройки = РабочиеДанные.Имя;
	КонецЕсли;
	
	КлючНастроек = ИТК_КонсольРазработчикаДанныеКлиентСервер.КлючНастроек();
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранениеНастройкиЗавершено", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьДиалогВыбораНастроекДанных(ЭтотОбъект, ИТК_Перечисления.РежимДиалогаУправлениеДаннымиВНастройкахСохранение(),
														КлючНастроек, ТекущееИмяНастройки, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатВОтдельномОкне(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущийРезультат.Адрес) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Нет результата для просмотра в отдельном окне';
										|en = 'No result to view in separate window'"), , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Представление", ТекущийРезультат.Представление);
	ПараметрыФормы.Вставить("АдресРезультата", ТекущийРезультат.Адрес);
	ПараметрыФормы.Вставить("АдресДанныхРасшифровки", ТекущийРезультат.АдресДанныхРасшифровки);
	ПараметрыФормы.Вставить("ФиксацияШапки", Элементы.КнопкаФиксацияШапки.Пометка);
	ПараметрыФормы.Вставить("ФиксацияШапкиДоступность", Элементы.КнопкаФиксацияШапки.Доступность);
	ПараметрыФормы.Вставить("ВсеСтрокиВыведены", ТекущийРезультат.ВсеСтрокиВыведены);
	
	Если ЗначениеЗаполнено(ТекущийРезультат.АдресСхемыКомпоновкиДанных) Тогда
		ПараметрыФормы.Вставить("АдресСхемыКомпоновкиДанных", ТекущийРезультат.АдресСхемыКомпоновкиДанных);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.РезультатВОтдельномОкне", ПараметрыФормы, , Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметр(Команда)

	ТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	ИменаПараметров = Новый Массив;
	ИменаПараметров.Добавить(ТекущиеДанные.Имя);
	
	ДанныеЗаполнения = ПодготовитьДанныеЗаполненияПараметров(ИменаПараметров, ДеревоДанных);
	
	ОбработатьЗаполняемыеПараметры(ДанныеЗаполнения, ИменаПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	
	ИменаПараметров = Новый Массив;
	Для Каждого СтрокаПараметрЗапроса Из ПараметрыЗапроса Цикл 
		ИменаПараметров.Добавить(СтрокаПараметрЗапроса.Имя);
	КонецЦикла;
	
	ДанныеЗаполнения = ПодготовитьДанныеЗаполненияПараметров(ИменаПараметров, ДеревоДанных);
	ОбработатьЗаполняемыеПараметры(ДанныеЗаполнения, ИменаПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереименоватьПараметр(Команда = Неопределено)
	
	ПараметрЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Имя", ПараметрЗапросаТекущиеДанные.Имя);
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ВсеПараметры = Новый СписокЗначений;
	Для Каждого Параметр Из ТекущиеДанные.Параметры Цикл 
		
		Если Параметр.Ключ = ПараметрЗапросаТекущиеДанные.Имя Тогда
			Продолжить;
		КонецЕсли;
		
		ВсеПараметры.Добавить(Параметр.Ключ);
		
	КонецЦикла;
	ПараметрыФормы.Вставить("ВсеПараметры", ВсеПараметры);
	
	ДополнительныеПараметры = Новый Структура("Имя", ПараметрЗапросаТекущиеДанные.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПереименованиеПараметраЗавершено", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.ПереименованиеПараметра", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТипПараметра(Команда)
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ИменаПараметров = Новый Массив;
	ОписаниеТиповПараметров = Неопределено;
	Для Каждого ИдентификаторСтрокиПараметр Из Элементы.ПараметрыЗапроса.ВыделенныеСтроки Цикл 
		
		СтрокаПараметр = ПараметрыЗапроса.НайтиПоИдентификатору(ИдентификаторСтрокиПараметр);
		ИменаПараметров.Добавить(СтрокаПараметр.Имя);
		
		ОписаниеТиповПараметра = ТекущиеДанные.Параметры[СтрокаПараметр.Имя];
		
		Если ОписаниеТиповПараметров = Неопределено Тогда
			ОписаниеТиповПараметров = ОписаниеТиповПараметра;
		Иначе
			ОписаниеТиповПараметров = ИТК_ТипыКлиентСервер.СложитьОписания(ОписаниеТиповПараметров, ОписаниеТиповПараметра);
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ПреобразованиеТипаЗначенияПараметраЗавершено", ЭтотОбъект, Новый Структура);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДополнятьДату", Истина);
	
	ПредставлениеИменПараметров = СтрСоединить(ИменаПараметров, ", ");
	ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, СтрШаблон(НСтр("ru = 'Параметр(ы) ""%1""';
																				|en = 'Parameter(s) ""%1""'"), ПредставлениеИменПараметров), 
									ИТК_Перечисления.РежимРедактированияТипаЗначенияВыборТипа(), ОписаниеТиповПараметров,
									ОписаниеОповещенияЗавершение, , ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьПараметрВТекстеНаЗначение(Команда)
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ПараметрЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	ИмяПараметра = ПараметрЗапросаТекущиеДанные.Имя;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Имя", ИмяПараметра);
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаменаПараметраВТекстеНаЗначениеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Результат = ИТК_Запрос.АнализПреобразованияПараметраВЗначение(ТекущиеДанные, ИмяПараметра);
	Если Результат.Преобразуется = 0 Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Невозможно преобразовать значение параметра в значение';
									|en = 'Cannot convert parameter value to value'");
		ПоказатьПредупреждение(, ТекстПредупреждения, ,	ИТК_КонсольРазработчикаКлиентСервер.Представление());
		
	ИначеЕсли ЗначениеЗаполнено(Результат.Потеряно) Тогда
		
		ЗаголовокВопроса = НСтр("ru = 'Замена значения параметра на ЗНАЧЕНИЕ';
								|en = 'Replacing a parameter value with VALUE'");
		ТекстВопроса = НСтр("ru = 'При замене часть значений будет потеряно. Продолжить?';
							|en = 'When replacing, part of the values will be lost. Proceed?'");
		КнопкиВопроса = ИТК_ФормаКлиент.КнопкиВопросаПродолжитьОтмена();

		ИТК_ФормаКлиент.ЗадатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, КнопкиВопроса, Истина, ЗаголовокВопроса, ЭтотОбъект, "ПередЗаменойПараметраНаЗначение");
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФормаВыбораУниверсальнаяЗначениеПараметра(Команда)
	
	ПараметрыЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	Если ПараметрыЗапросаТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПараметра = ДанныеПараметраЗапроса(ТекущаяСтрока, ПараметрыЗапросаТекущиеДанные.Имя);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РежимВыбора", Истина);
	ДополнительныеПараметры.Вставить("ЗакрыватьПриВыборе", Истина);
		
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗавершенВыборЗначенияПараметра", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияОЗакрытии);
		
	ДополнительныеПараметры.Вставить("Ключ", ДанныеПараметра.Значение);

	ИТК_ФормаКлиент.ОткрытьУниверсальнуюФормуСписка(ДанныеПараметра.Значение, ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультата(Команда)
	
	ОписаниеОперации = Новый Структура;
	ОписаниеОперации.Вставить("Источник", ИТК_Перечисления.ИнструментКонсольРазработчика());
	ОписаниеОперации.Вставить("Наименование", НСтр("ru = 'Получение результата для обработки';
													|en = 'Getting the result for processing'"));
	
	Если ЗапускНевозможенПроверкаОповещение(ОписаниеОперации.Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ДлительныеОперацииКлиент.НачатьОперацию(ЭтотОбъект, Новый ОписаниеОповещения("НачалоДлительнойОперации", ЭтотОбъект), ОписаниеОперации);
	
	Данные = ПодготовитьДанныеПередВыполнением(ТекущаяСтрока);
	
	ФоновоеВыполнение = ИТК_БСПКлиентСервер.ВозможноВыполнениеВФоне();
	ДлительнаяОперация = ЗапуститьПолучениеРезультатаДляОбработкиНаСервере(Данные, УникальныйИдентификатор, ФоновоеВыполнение);
	ИТК_ДлительныеОперацииКлиент.ЗаполнитьОписаниеОперации(ДлительнаяОперация, ОписаниеОперации);
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработкаПрогрессаВыполненияДлительнойОперации", ЭтотОбъект);
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект, ОповещениеОПрогрессеВыполнения);
	
	ИТК_ДлительныеОперацииКлиент.ДобавитьОповещениеПользователя(ЭтотОбъект, ПараметрыОжидания);
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("UID", ТекущаяСтрока.UID);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеПолученияРезультатаДляОбработки", ЭтотОбъект, ДополнительныеПараметры);
	
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализироватьПланЗапроса(Команда)
	
	// Необходимо подождать т.к. запись в файл технологического журнала иногда не успевает
	Пока ИТК_ОбщийВызовСервера.ТекущаяДатаСервера() < ТекущийРезультат.ОкончаниеВыполненияНаКлиенте + 3 Цикл // +3 секунды
	КонецЦикла;
	
	ПолноеИмяФайлаЖурнала = ИТК_АнализПланаЗапроса.ПолноеИмяLogФайлаТехнологическогоЖурнала(ТекущийРезультат.IDПроцесса, ТекущийРезультат.НачалоВыполнения);
	
	Если ПолноеИмяФайлаЖурнала = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось найти файл логов на сервере (возможно не включен технологический журнал)';
										|en = 'Log file could not be found on the server (technology log may not be enabled)'"), , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Имя", ТекущаяСтрока.Имя);
		ПараметрыФормы.Вставить("UID", ТекущийРезультат.UID);
		ПараметрыФормы.Вставить("ОписанияТиповПараметров", ТекущийРезультат.ОписанияТиповПараметров);
		ПараметрыФормы.Вставить("ИмяФайла", ПолноеИмяФайлаЖурнала);
		
		ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.АнализПланаЗапроса", ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АнализИсполняемыхЗапросов(Команда)
	ВыполнитьОперацию(ИТК_Перечисления.РежимВыполненияСКДПолучениеИсполняемыхЗапросов());
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортВоВнешнийОтчет(Команда)
	
	Если ЗапускНевозможенПроверкаОповещение(НСтр("ru = 'Экспорт во внешний отчет (erf)';
												|en = 'Export to external report (erf)'")) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Имя", ТекущаяСтрока.Имя);
	ПараметрыФормы.Вставить("Данные", ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока));

	ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.ЭкспортВоВнешнийОтчет", ПараметрыФормы, ЭтотОбъект, , , , 
					Новый ОписаниеОповещения("ЭкспортВоВнешнийОтчетФайлаЗакончен", ЭтотОбъект),
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНастройкиДанных(Команда)
	
	СохранитьИзмененныеДанныеСтроки();
	
	Элемент = Элементы.ФормаВидВидНастройкиДанных;
	Элемент.Пометка = Не Элемент.Пометка;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДеревоДанных(Команда)
	
	Элемент = Элементы.ФормаВидВидДеревоДанных;
	Элемент.Пометка = НЕ Элемент.Пометка;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРезультат(Команда)
	
	Если Элементы.ПанельРезультат.Скрыта() Тогда
		ИТК_ФормаКлиентСервер.ПоказатьГруппу(Элементы.ПанельРезультат);
	Иначе
		ИТК_ФормаКлиентСервер.СкрытьГруппу(Элементы.ПанельРезультат);
	КонецЕсли;
	
	Элемент = Элементы.ФормаВидРезультат;
	Элемент.Пометка = НЕ Элемент.Пометка;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыводаТаблицыУстановитьВыводить(Команда)
	УстановитьНастройкиВыводаТаблицыПакета(ИТК_Перечисления.ВидВыводаТаблицыВыводить());
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыводаТаблицыУстановитьНеВыводить(Команда)
	УстановитьНастройкиВыводаТаблицыПакета(ИТК_Перечисления.ВидВыводаТаблицыНеВыводить());
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыводаТаблицыУстановитьСвернуто(Команда)
	УстановитьНастройкиВыводаТаблицыПакета(ИТК_Перечисления.ВидВыводаТаблицыСвернуто());
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДлительнуюОперацию(Команда)
	
	ИТК_ДлительныеОперацииКлиент.ОтменитьОперацию(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗамерПакетаЗапросов(Команда)
	
	ОписаниеОперации = Новый Структура;
	ОписаниеОперации.Вставить("Источник", ИТК_Перечисления.ИнструментКонсольРазработчика());
	ОписаниеОперации.Вставить("Наименование", НСтр("ru = 'Получение результата для обработки';
													|en = 'Getting the result for processing'"));
	
	Если ЗапускНевозможенПроверкаОповещение(ОписаниеОперации.Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ДлительныеОперацииКлиент.НачатьОперацию(ЭтотОбъект, Новый ОписаниеОповещения("НачалоДлительнойОперации", ЭтотОбъект), ОписаниеОперации);
	
	Данные = ПодготовитьДанныеПередВыполнением(ТекущаяСтрока);
	
	ФоновоеВыполнение = ИТК_БСПКлиентСервер.ВозможноВыполнениеВФоне();
	ДлительнаяОперация = ЗапуститьЗамераПакетногоЗапросаНаСервере(Данные, УникальныйИдентификатор, ФоновоеВыполнение);
	ИТК_ДлительныеОперацииКлиент.ЗаполнитьОписаниеОперации(ДлительнаяОперация, ОписаниеОперации);
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработкаПрогрессаВыполненияДлительнойОперации", ЭтотОбъект);
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект, ОповещениеОПрогрессеВыполнения);
	
	ИТК_ДлительныеОперацииКлиент.ДобавитьОповещениеПользователя(ЭтотОбъект, ПараметрыОжидания);
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеЗамераПакетногоЗапроса", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКод(Команда)
	ДобавитьСтрокуВДеревоДанных(ИТК_Перечисления.ЭлементДанныхКод());
КонецПроцедуры

&НаКлиенте
Процедура ЗапросВнешнегоИсточника(Команда)
	
	ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ОписаниеИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, ВнешниеИсточникиТекущиеДанные.UID);
	
	Если ОписаниеИсточника.Значение = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Пустой внешний источник (нет колонок)';
									|en = 'Empty external source (no columns)'");
		ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;
	
	КолонкиИсточника = КолонкиВнешнегоИсточника(ОписаниеИсточника);
	ИТК_ОбщийКлиент.ОткрытьЗапросИсточника(ЭтотОбъект, КолонкиИсточника, ОписаниеИсточника.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеОтладкиИзСтроки(Команда)
	
	Текст = ИТК_БуферОбменаКлиент.Текст();
	КорректныйТекст = СтрНачинаетсяС(Текст, "<Structure");
	
	Если НЕ КорректныйТекст Тогда
		
		ПоказатьПредупреждение( , НСтр("ru = 'Буфер обмена должен содержать XML текст вида: <Structure...
                                       |Полученный функцией БСП:  ОбщегоНазначения.ЗапросВСтрокуXML';
                                       |en = 'The clipboard must contain XML text of the form: <Structure ...
                                       |Received by function SSL: ОбщегоНазначения.ЗапросВСтрокуXML in XML String'"),
										, ИТК_КонсольРазработчикаКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = ОповещениеЗагрузкиДанных("ОбработчикЗагрузитьДанныеОтладкиИзБуфераОбмена");
	ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СтекВызововПоОшибке(Команда)
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	СтекВызовов = ТекущиеДанные.ОшибкаПриВыполнении.СтекВызовов;
	ИТК_ФормаКлиент.ОткрытьСтекВызовов(ЭтотОбъект, СтекВызовов);
	
КонецПроцедуры

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура ПодключаемаяКомандаВывестиВсеСтрокиРезультата(Команда)
	
	Строка = НайтиСтрокуПоUID(ДеревоДанных, ТекущийРезультат.АктуаленПоСтроке);
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОперацию(ТекущийРезультат.РежимВыполнения, Истина, Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемаяКомандаЭкспортВ(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭкспортФайлаЗакончен", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьФормуЭкспортВ(ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемаяКомандаРезультатВТабличномДокументе(Команда)

	ИТК_ТабличныйДокументКлиент.ОбработкаКомандыРезультатВТабличномДокументе(ЭтотОбъект, Команда,
			ТабличныйДокументРезультат, ТекущийРезультат.Адрес, ТекущийРезультат.АдресДанныхРасшифровки);

КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемаяКомандаРедакторКодаОбработчик(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("UID", ТекущаяСтрока.UID);
	
	Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("Данные", Данные);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработкаКомандыРедактораКодаЗавершена", ЭтотОбъект, ДополнительныеПараметры);
	
	ИмяКоманды = Команда.Имя;
	ИТК_РедакторКодаКлиент.ПодключаемыйОбработчикКоманд(ЭтотОбъект, ИмяКоманды, ОповещениеОЗавершении);
	
	Если СтрНайти(ИмяКоманды, "ЗафиксироватьИзменения") Тогда
		ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьОригинальныйТекст(Данные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПерейтиКОсновномуЗапросу(Команда)
	
	СтрокаОсновнойЗапрос = ОсновнойЗапрос(ТекущаяСтрока);
	Элементы.ДеревоДанных.ТекущаяСтрока = СтрокаОсновнойЗапрос.ПолучитьИдентификатор();
	ТекущийЭлемент = Элементы.СтраницаПараметрыЗапроса;
	
КонецПроцедуры

&НаКлиенте
Процедура Видеоинструкция(Команда)
	ПерейтиПоНавигационнойСсылке("https://rutube.ru/video/41fd85237a895e7e4fb595eea763360f/");
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	ОткрытьКонструкторТекстаЗапроса();
КонецПроцедуры

&НаКлиенте
Процедура ПанельРезультатаСократитьПоказать(Команда)
	
	ПанельРезультатСокращенная = НЕ ПанельРезультатСокращенная;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьДеревоДанных(Команда)
	ВидДеревоДанных(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВынестиВОтдельныйЗапрос(Команда)
	
	ОсновнаяСтрока = ОсновнаяСтрока(ТекущаяСтрока, ИТК_Перечисления.ЭлементДанныхЗапрос());
	РодительТекущейСтроки = ИТК_КонсольРазработчикаДанныеКлиент.ПолучитьРодителяСтроки(ЭтотОбъект, ОсновнаяСтрока);
	
	НоваяСтрока = ПереместитьСтрокуДереваДанных(ОсновнаяСтрока, РодительТекущейСтроки, Истина);
	НоваяСтрока.Имя = СтрШаблон(НСтр("ru = '%1 (отдельно)'; en = '%1 (separately)'"), ТекущаяСтрока.Имя);
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Ложь);
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ТекстЗапроса = ТекущиеДанные.Текст + ИТК_ЗапросКлиентСервер.РазделительПакетов() + ТекущиеДанные.ТекстИнициализации;
	ИзменяемыеПоля.Вставить("Текст", ТекстЗапроса);
	
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, НоваяСтрока, ИзменяемыеПоля);
	
	Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(НоваяСтрока);
	ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьОригинальныйТекст(Данные);
	
	ОбновитьСтруктуруЗапросов(НоваяСтрока, Ложь);
	
	Элементы.ДеревоДанных.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТипСтроки = Неопределено;
	Иначе
		ТипСтроки = ТекущаяСтрока.Тип;
	КонецЕсли;
	
	ИспользуетсяБСП = ИТК_БСПКлиентСервер.ИспользуетсяБСП();
	ЭтоСтрока = (ТекущаяСтрока <> Неопределено);
	ЭтоСтрокаЗапрос = (ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапрос());
	ЭтоСтрокаСхемаКомпоновкиДанных = (ТипСтроки = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных());
	ЭтоСтрокаГруппа = (ТипСтроки = ИТК_Перечисления.ЭлементДанныхГруппа());
	ЭтоСтрокаЗапросПакета = (ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапросПакета());
	ЭтоСтрокаЗапросСтруктуры = ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(ТипСтроки);
	ЭтоСтрокаЗапросИлиПодзапрос = ЭтоСтрокаЗапрос ИЛИ ЭтоСтрокаЗапросСтруктуры;
	ЭтоСтрокаВариантОтчетаСКД = (ТипСтроки = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД());
	ЭтоСтрокаПользовательскаяНастройкаСКД = (ТипСтроки = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД());
	ЭтоСтрокаСКД = ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(ТипСтроки);
	ЭтоСтрокаКод = (ТипСтроки = ИТК_Перечисления.ЭлементДанныхКод());
	КоличествоВыделенныхСтрок = Элементы.ДеревоДанных.ВыделенныеСтроки.Количество();
	ДоступностьКодНаВстроенномЯзыке = ЭтоСтрокаЗапрос ИЛИ ЭтоСтрокаСхемаКомпоновкиДанных;
	ДоступноРедактированиеТекста = ИТК_КонсольРазработчикаДанныеКлиентСервер.ДоступноРедактированиеТекстаДляСтроки(ТипСтроки);
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	// Заголовок
	Если РабочиеДанные.Тип = Неопределено Тогда
		Заголовок = НСтр("ru = 'Новый';
						|en = 'New'");
	ИначеЕсли РабочиеДанные.Тип = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда 
		Заголовок = ИТК_ФайлыКлиентСервер.ПолноеИмяФайлаКратко(РабочиеДанные.Имя);
	ИначеЕсли РабочиеДанные.Тип = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда 
		Заголовок = СтрШаблон("(%1)", РабочиеДанные.Имя);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РабочиеДанные.Комментарий) Тогда
		Заголовок = СтрШаблон("%1 - (%2)", Заголовок, РабочиеДанные.Комментарий);
	КонецЕсли;
	
	// Закладка прочее 
	Элементы.НастройкиВыводаТаблиц.Видимость = ЭтоСтрокаЗапрос;
	Если ЭтоСтрокаЗапрос Тогда
		ЗаполнитьНастройкиВыводаТаблиц();
	КонецЕсли;
	
	// Представление
	Если ЭтоСтрока Тогда
		Представление = ТекущаяСтрока.Имя;
	Иначе 
		Представление = "";
	КонецЕсли;
	Элементы.Представление.Доступность = ЭтоСтрока;
	
	Если ЭтоСтрокаСхемаКомпоновкиДанных Тогда
		ИспользованиеВнешнихФункций = ТекущиеДанные.ИспользованиеВнешнихФункций;
	КонецЕсли;
	Элементы.ИспользованиеВнешнихФункций.Видимость = ЭтоСтрокаСхемаКомпоновкиДанных;
	
	ДоступностьКонструктора = ЭтоСтрокаЗапрос ИЛИ ЭтоСтрокаСКД ИЛИ ЭтоСтрокаЗапросПакета;
	Элементы.Конструктор.Видимость = ДоступностьКонструктора;
	Элементы.КонструкторВКонтекстномМенюДерева.Доступность = ДоступностьКонструктора;
	
	Элементы.ФормаПодменюПрочее.Видимость = ИспользуетсяБСП;
	Элементы.ДанныеНастройка.Видимость = Элементы.ФормаВидВидНастройкиДанных.Пометка;
	Элементы.ДеревоДанных.Видимость = Элементы.ФормаВидВидДеревоДанных.Пометка;
	Элементы.ФормаОбработкаРезультата.Доступность = ЭтоСтрокаЗапрос;
	Элементы.ФормаКодНаВстроенномЯзыке.Доступность = ДоступностьКодНаВстроенномЯзыке;
	Элементы.ФормаЗамерПакетаЗапросов.Доступность = ЭтоСтрокаЗапрос;
	Элементы.ФормаОткрытьПапкуСодержащуюФайл.Доступность = ЗначениеЗаполнено(РабочиеДанные.Имя)
															И РабочиеДанные.Тип = ИТК_Перечисления.ТипХраненияДанныхФайл();
	КартинкаКнопкиСохранить = КартинкаКнопкиСохранить();
	Элементы.СохранитьДанные.Картинка = КартинкаКнопкиСохранить;
	Элементы.ФормаСохранитьДанные.Картинка = КартинкаКнопкиСохранить;
	
	Элементы.ФормаВидВидДеревоДанных.Доступность = Элементы.ФормаВидВидНастройкиДанных.Пометка;
	Элементы.СкрытьПоказатьДеревоДанных.Картинка =
		?(Элементы.ФормаВидВидДеревоДанных.Пометка,
		БиблиотекаКартинок.ПерейтиНазад,
		БиблиотекаКартинок.ПерейтиВперед);
	Элементы.ФормаВидРезультат.Видимость = ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.12");
	
	Элементы.ФормаДоступнаНоваяВерсия.Видимость = ИТК_ИнформацияОНовойВерсииКлиент.ДоступнаНоваяВерсия();
	
	ЕстьЗамерВремениВыполнения = ЭтоСтрокаЗапрос ИЛИ ЭтоСтрокаСКД ИЛИ ЭтоСтрокаЗапросСтруктуры ИЛИ ЭтоСтрокаКод;
	Элементы.ОбновитьЗамер.Доступность = ЕстьЗамерВремениВыполнения;
	Если ЕстьЗамерВремениВыполнения Тогда
		Элементы.ФормаГруппаЗамеры.Заголовок = ИТК_ОбщийКлиентСервер.ПредставлениеВремениВМс(ТекущиеДанные.ВремяВыполнения);
	КонецЕсли;
	
	Элементы.Выполнить.Доступность = ЭтоСтрокаЗапросИлиПодзапрос ИЛИ ЭтоСтрокаСКД ИЛИ ЭтоСтрокаКод;
	Элементы.ВыполнитьЗапросСВременнымиТаблицами.Видимость = ЭтоСтрокаЗапросИлиПодзапрос;
	Элементы.ВыполнитьАнализИсполняемыхЗапросов.Видимость = ЭтоСтрокаСКД;
	Элементы.ВыполнитьКодНаКлиенте.Видимость = ЭтоСтрокаКод;
	
	ОбновитьЭлементыВыделенияСтроки();
	
	ДоступностьДобавленияОбособленно = НЕ (ЭтоСтрокаВариантОтчетаСКД
										ИЛИ ЭтоСтрокаПользовательскаяНастройкаСКД
										ИЛИ ЭтоСтрокаЗапросСтруктуры);
	
	Элементы.ДобавитьГруппу.Доступность = ДоступностьДобавленияОбособленно;
	Элементы.ДобавитьГруппу1.Доступность = ДоступностьДобавленияОбособленно;
	
	Элементы.ДобавитьЗапрос.Доступность = ДоступностьДобавленияОбособленно;
	Элементы.ДобавитьЗапрос1.Доступность = ДоступностьДобавленияОбособленно;
	
	Элементы.ДобавитьКод.Доступность = ДоступностьДобавленияОбособленно;
	Элементы.ДобавитьКод1.Доступность = ДоступностьДобавленияОбособленно;
	
	Элементы.ДобавитьСхемуКомпоновкиДанных.Доступность = ДоступностьДобавленияОбособленно;
	Элементы.ДобавитьСхемуКомпоновкиДанных1.Доступность = ДоступностьДобавленияОбособленно;
	
	ДоступностьДобавленияВариантаОтчетаСКД = ЭтоСтрокаСхемаКомпоновкиДанных;
	Элементы.ДобавитьВариантОтчетаСКД.Доступность = ДоступностьДобавленияВариантаОтчетаСКД;
	Элементы.ДобавитьВариантОтчетаСКД1.Доступность = ДоступностьДобавленияВариантаОтчетаСКД;
	
	ДоступностьДобавленияПользовательскойНастройкиСКД = ЭтоСтрокаСхемаКомпоновкиДанных ИЛИ ЭтоСтрокаВариантОтчетаСКД;
	Элементы.ДобавитьПользовательскуюНастройкуСКД.Доступность = ДоступностьДобавленияПользовательскойНастройкиСКД;
	Элементы.ДобавитьПользовательскуюНастройкуСКД1.Доступность = ДоступностьДобавленияПользовательскойНастройкиСКД;
	
	ОсновнаяСтрокаЗапрос = ОсновнаяСтрока(ТекущаяСтрока, ИТК_Перечисления.ЭлементДанныхЗапрос());
	ДоступностьВынестиВОтдельныйЗапрос = НЕ ЭтоСтрокаЗапрос
											И ОсновнаяСтрокаЗапрос <> Неопределено
											И (ОсновнаяСтрокаЗапрос.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос());
	Элементы.ДеревоДанныхВынестиВОтдельныйЗапрос.Доступность = ДоступностьВынестиВОтдельныйЗапрос;
	Элементы.ДеревоДанныхКонтекстноеМенюВынестиВОтдельныйЗапрос.Доступность = ДоступностьВынестиВОтдельныйЗапрос;
	
	Элементы.СтраницаТекстЗапроса.Видимость = ЭтоСтрокаЗапросИлиПодзапрос;
	Элементы.СтраницаПараметрыЗапроса.Видимость = ЭтоСтрокаЗапросИлиПодзапрос;
	
	Элементы.СтраницаСхемаКомпоновкиДанныхXML.Видимость = ЭтоСтрокаСхемаКомпоновкиДанных;
	
	ИспользуютсяВнешниеИсточники = ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемВнешнихИсточников(ТипСтроки);
	Элементы.СтраницаВнешниеИсточники.Видимость = ИспользуютсяВнешниеИсточники;
	Если ИспользуютсяВнешниеИсточники Тогда
		ЗаполнитьВнешниеИсточники();
	КонецЕсли;
	
	ИспользуютсяТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемМВТ(ТипСтроки);
	Элементы.СтраницаМВТ.Видимость = ИспользуютсяТаблицыМВТ;
	Если ИспользуютсяТаблицыМВТ Тогда
		ЗаполнитьТаблицыМВТ();
	КонецЕсли;
	
	Элементы.СтраницаВариантОтчетаСКД.Видимость = ЭтоСтрокаВариантОтчетаСКД;
	Элементы.СтраницаПользовательскаяНастройкаСКД.Видимость = ЭтоСтрокаПользовательскаяНастройкаСКД;
	Элементы.СтраницаКод.Видимость = ЭтоСтрокаКод;
	
	Элементы.СтраницаПрочее.Видимость = НЕ ЭтоСтрокаЗапросСтруктуры;
	Элементы.СлужебнаяДекорация.Видимость = ЭтоСтрокаГруппа;
	Если ЭтоСтрокаГруппа Тогда
		Элементы.ПанельНастроек.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Иначе
		Элементы.ПанельНастроек.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	КонецЕсли;
	
	Элементы.СкопироватьСтроку.Доступность = (КоличествоВыделенныхСтрок = 1);
	Элементы.СкопироватьСтроку1.Доступность = (КоличествоВыделенныхСтрок = 1);
	Элементы.Изменение.Доступность = Не ЭтоСтрокаЗапросСтруктуры;
	Элементы.Изменение1.Доступность = Не ЭтоСтрокаЗапросСтруктуры;
	Элементы.Порядок.Доступность = Не ЭтоСтрокаЗапросСтруктуры;
	Элементы.Сортировка.Доступность = Не ЭтоСтрокаЗапросСтруктуры;
	Элементы.УдалитьСтроку.Доступность = Не ЭтоСтрокаЗапросСтруктуры;
	Элементы.УдалитьСтроку1.Доступность = Не ЭтоСтрокаЗапросСтруктуры;
	
	Элементы.МаксимумСтрок.Видимость = ЭтоСтрокаЗапрос;
	Элементы.ГруппаСумма.Видимость = ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "РасчетСуммыВыделенныхЯчеек");
	
	АктуаленПоСтроке = ТекущийРезультат.АктуаленПоСтроке;
	Элементы.СравнитьРезультаты.Доступность = ЗначениеЗаполнено(АктуаленПоСтроке);
	
	Если ЭтоСтрокаЗапрос Тогда
		
		Если ТекущиеДанные.МаксимумСтрок = Неопределено Тогда
			МаксимумСтрок = ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "МаксимальноеКоличествоВыводимыхСтрок");
		Иначе 
			МаксимумСтрок = ТекущиеДанные.МаксимумСтрок;
		КонецЕсли;
		
	КонецЕсли;
	
	ПолучениеПлана = ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "ПолучениеПлана");
	Элементы.АнализироватьПланЗапроса.Видимость = ПолучениеПлана <> ИТК_Перечисления.ПолучениеПланаОтключено()
													И ЗначениеЗаполнено(ТекущийРезультат.IDПроцесса);
	
	СтрокаРезультата = НайтиСтрокуПоUID(ДеревоДанных, АктуаленПоСтроке);
	Если СтрокаРезультата = Неопределено Тогда
		ТипСтрокиРезультата = Неопределено;
	Иначе 
		ТипСтрокиРезультата = СтрокаРезультата.Тип;
	КонецЕсли;
	ПоказатьНеВсеСтрокиВыведены = (ТекущийРезультат.ВсеСтрокиВыведены = Ложь) И ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиЗапрос(ТипСтрокиРезультата);
	Элементы.ГруппаНеВсеСтрокиВыведены.Видимость = ПоказатьНеВсеСтрокиВыведены;
	Элементы.КнопкаНеВсеСтрокиВыведены.Видимость = ПоказатьНеВсеСтрокиВыведены;
	Элементы.КартинкаНеВсеСтрокиВыведены.Видимость = ПоказатьНеВсеСтрокиВыведены;
	Элементы.НадписьНеВсеСтрокиВыведены.Видимость = ПоказатьНеВсеСтрокиВыведены;
	
	Если НЕ ИТК_ОбщийКлиентСервер.ЭтоИнтерфейс8_5() Тогда
		
		Если ПоказатьНеВсеСтрокиВыведены Тогда
			ЦветФона = Новый Цвет(255, 250, 217);
		Иначе 
			ЦветФона = Новый Цвет();
		КонецЕсли;
		Элементы.ГруппаМаксимумСтрок.ЦветФона = ЦветФона;
		
	КонецЕсли;
	
	Если ЭтоСтрокаЗапросИлиПодзапрос Тогда
		
		Элементы.ТекстаЗапросаКнопки.Видимость = ЭтоСтрокаЗапросИлиПодзапрос;
		Элементы.ПроверитьЗапрос.Доступность = ДоступноРедактированиеТекста;
		Элементы.КонструкторЗапроса.Доступность = ДоступноРедактированиеТекста;
		Элементы.КодНаВстроенномЯзыке.Доступность = ДоступностьКодНаВстроенномЯзыке;
		
		// Элементы ПараметрыЗапроса 
		Ошибка = ТекущиеДанные.Ошибка;
		ОшибкаВТекстеЗапроса = (Ошибка <> Неопределено);
		
		ЗаполнитьЗакладкуПараметры();
		ДоступноИзменениеПараметров = ЭтоСтрокаЗапрос И (ПараметрыЗапроса.Количество() > 0);
		
		Элементы.ПараметрыЗапроса.ТолькоПросмотр = НЕ ДоступноИзменениеПараметров;
		Элементы.ПараметрыЗапроса.ЦветФона = ИТК_ОбщийКлиентСервер.ЦветФонаЭлементРедактируется(ДоступноИзменениеПараметров);
		Элементы.ГруппаИнформацияПараметровРедактируютсяВГлавномЗапросе.Видимость = ЭтоСтрокаЗапросСтруктуры;
		
		ДоступныДействияСПараметрами = ДоступноИзменениеПараметров И НЕ ОшибкаВТекстеЗапроса;
		Элементы.ПараметрыЗапросаЗаполнитьПараметры.Доступность = ДоступныДействияСПараметрами;
		Элементы.ПараметрыЗапросаКонтекстноеМенюЗаполнитьПараметр.Доступность = ДоступныДействияСПараметрами;
		Элементы.ПараметрыЗапросаКонтекстноеМенюПереименоватьПараметр.Доступность = ДоступныДействияСПараметрами;
		Элементы.ПараметрыЗапросаПереименоватьПараметр.Доступность = ДоступныДействияСПараметрами;
		Элементы.ПараметрыЗапросаИзменитьТипПараметра.Доступность = ДоступныДействияСПараметрами;
		Элементы.ПараметрыЗапросаКонтекстноеМенюЗаменитьПараметрВТекстеНаЗначение.Доступность = ДоступныДействияСПараметрами;
		
		Элементы.ГруппаИнформацияПараметровНеПолученыОшибкаВТексте.Видимость = ЭтоСтрокаЗапрос И ОшибкаВТекстеЗапроса;
		Если ОшибкаВТекстеЗапроса Тогда
			ПредставлениеОшибки = ИТК_Строки.Сократить(ИТК_ОбщийКлиентСервер.ПредставлениеОшибкиВТекстеЗапросаИлиСхемеКомпоновкиДанных(Ошибка), 50);
			Элементы.ПараметрыНеПолученыОшибкаВТекстеПерейти.Заголовок = ПредставлениеОшибки;
		КонецЕсли;
		Элементы.ГруппаИнформацияПараметровНеПолученыТребуетсяПроверка.Видимость = ЭтоСтрокаЗапрос И ТекущиеДанные.ТребуетсяПроверка;
		
	ИначеЕсли ЭтоСтрокаПользовательскаяНастройкаСКД
			ИЛИ ЭтоСтрокаВариантОтчетаСКД Тогда
		ЗагрузитьДанныеВКомпоновщикНастроек(ПолныеДанныеСКД(ТекущаяСтрока));
	КонецЕсли;
	
	Если НЕ ЭтоСтрокаГруппа Тогда
		ОбновитьЭлементыОшибки();
	КонецЕсли;
	
	ОбновитьЭлементыПанелиРезультата();
	
	УстановитьТребуетсяИнициализацияРедактора();
	
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйВосстановлениеФокусаРедактора() Экспорт 
	
	ИТК_РедакторКодаКлиент.ВосстановлениеФокусаРедактора(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОбработчика)
	
	Если Модифицированность Тогда
		
		// Список вариантов ответа
		ВариантыОтвета = Новый СписокЗначений;
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Да,		НСтр("ru = 'Сохранить';
																	|en = 'Save'"));
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Нет,		НСтр("ru = 'Не сохранять';
																	|en = 'Not save'"));
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Отмена,	НСтр("ru = 'Отмена';
																	|en = 'Cancel'"));
		
		// Вопрос "сохранить данные"?
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросСохраненияЗавершение", ЭтотОбъект, ОписаниеОбработчика),
								НСтр("ru = 'Сохранить изменения?';
									|en = 'Save the changes?'"), ВариантыОтвета, , КодВозвратаДиалога.Да, ИТК_КонсольРазработчикаКлиентСервер.Представление());
		
	Иначе 
		
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияЗавершение(Результат, ОписаниеОбработчика) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда // Отмена
		
		Возврат;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		СохранитьДанные(ОписаниеОбработчика);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда		
		
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Объединение)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = ИТК_ОбщийКлиентСервер.ФильтрФайловДанных(Истина, Истина);
	ДиалогОткрытияФайла.Расширение = ИТК_ОбщийКлиентСервер.ОсновноеРасширениеФайловДанных();
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	Если Объединение Тогда
		ЗаголовокДиалога = НСтр("ru = 'Объединение с данными';
								|en = 'Data merge'");
	Иначе
		ЗаголовокДиалога = НСтр("ru = 'Открытие данных';
								|en = 'Opening data'");
	КонецЕсли;
	ДиалогОткрытияФайла.Заголовок = ЗаголовокДиалога;
	
	ОписаниеОповещения = ОповещениеЗагрузкиДанных("ЗагрузкаФайлаЗакончена", Объединение);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаФайлаЗакончена(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеИзФайла(ВыбранныеФайлы[0], , ДополнительныеПараметры.Объединение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(ИмяФайла, ОбновитьЭлементы = Истина, Объединение = Ложь)
	
	Попытка
		
		ОписаниеОповещения = ОповещениеЗагрузкиДанных("ЗаконченоПомещениеФайлаВХранилищеДляЗагрузки", Объединение);
		НачатьПомещениеФайла(ОписаниеОповещения, , ИмяФайла, Ложь);
		
		Если ОбновитьЭлементы Тогда
			
			РаскрытьВеткиДереваВСоответствииСДанными(ДеревоДанных);
			ОбновитьЭлементыФормы();
			
		КонецЕсли;
		
	Исключение
		
		ОбновитьЭлементыПоследниеРабочиеДанные(ИТК_Перечисления.ТипХраненияДанныхФайл(), , ИмяФайла);
		
		Шаблон = НСтр("ru = 'Ошибка загрузки файла: %1';
						|en = 'Error loading file: %1'");
		ПредставлениеОшибки = СтрШаблон(Шаблон, ИмяФайла);
		ПоказатьПредупреждение( , ПредставлениеОшибки, , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаконченоПомещениеФайлаВХранилищеДляЗагрузки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт 
	
	Попытка
		
		ЗагрузитьДанныеИзФайлаСервер(Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры.Объединение);
		АктивироватьСтрокуДереваДанныхПослеОбновления();
		
	Исключение
		
		КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Ошибка при загрузке файла: %1
												|%2';
												|en = 'Error loading file: %1
												|%2'"), ВыбранноеИмяФайла, КраткоеПредставлениеОшибки), , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		
	КонецПопытки;
	
КонецПроцедуры

// Получает строку по идентификатору (Приемник перетаскивания) для корня - ДеревоДанных 
//
// Параметры:
//  ИдентификаторСтроки (Число) - Идентификатор строки
// Возвращаемое значение:
//   (ДанныеФормыЭлементДерева,ДанныеФормыДерева) - Строка полученная по идентификатору либо ДеревоДанных для Неопределено
//
&НаКлиенте
Функция ПолучитьСтрокуПриемникПеретаскиванияДереваДанных(ИдентификаторСтроки)
	
	Если ИдентификаторСтроки = Неопределено Тогда // Перенос в корень дерева
		
		Возврат ДеревоДанных;
		
	Иначе
		
		Возврат ДеревоДанных.НайтиПоИдентификатору(ИдентификаторСтроки);
		
	КонецЕсли;	
	
КонецФункции

// Производит установку, снятие или инвертирование выделения для обрабатываемого массива строк 
//
// Параметры:
//  ОбрабатываемыеСтроки	(Массив)				- Массив идентификаторов строки
//  РежимОтметки			(Булево, Неопределено)	- Режим установки отметки Инвертировать - Неопределено, Установить - Истина, Снять - Ложь
//
&НаКлиенте
Процедура УстановитьВыделениеСтрок(ОбрабатываемыеСтроки, РежимОтметки = Неопределено)
	
	Для Каждого ИдентификаторСтроки Из ОбрабатываемыеСтроки Цикл
		
		ОбрабатываемаяСтрока = ДеревоДанных.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если РежимОтметки = Неопределено Тогда // Инвертирование
			
			ОбрабатываемаяСтрока.Выделение = НЕ ОбрабатываемаяСтрока.Выделение;
			
		Иначе // Истина - установить отметку, Ложь - снять
			
			ОбрабатываемаяСтрока.Выделение = РежимОтметки
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Производит управление свойствами элементов формы обслуживающих команду выделение 
//
// Параметры: (отсутствуют)
//
&НаКлиенте
Процедура ОбновитьЭлементыВыделенияСтроки()
	
	ЕстьСтрокиВДереве = ДеревоДанных.ПолучитьЭлементы().Количество();
	
	Элементы.ВыделитьСтроку.Доступность = (ЕстьСтрокиВДереве);
	Элементы.ВыделитьСтроку1.Доступность = (ЕстьСтрокиВДереве);
	
	Если ЕстьСтрокиВДереве Тогда
		
		ЕстьВыделенныеСтроки = Ложь;
		
		Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоДанных.ВыделенныеСтроки Цикл
			
			ОбрабатываемаяСтрока = ДеревоДанных.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Если ОбрабатываемаяСтрока <> Неопределено 
					И ОбрабатываемаяСтрока.Выделение Тогда
					
				ЕстьВыделенныеСтроки = Истина; // Есть отмеченные строки значит кнопка должна быть Нажатой (отмеченной)
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Элементы.ВыделитьСтроку.Пометка = ЕстьВыделенныеСтроки;
		Элементы.ВыделитьСтроку1.Пометка = ЕстьВыделенныеСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыОшибки()
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтроки = ТекущаяСтрока.Тип;
	ЭлементТекст = ЭлементТекстПоТипуСтроки(ТипСтроки);
	Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиЗапрос(ТипСтроки) Тогда
		
		ЭлементГруппаОшибка = Элементы.ГруппаОшибкаВЗапросе;
		ЭлементТекстОшибки = Элементы.ОшибкаВЗапросеТекст;
		ЭлементКартинкаОшибки = Элементы.ОшибкаВЗапросеКартинка;
		
	ИначеЕсли ТипСтроки = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
		
		ЭлементГруппаОшибка = Элементы.ГруппаОшибкаВСхемеКомпоновкиДанных;
		ЭлементТекстОшибки = Элементы.ОшибкаВСхемеКомпоновкиДанныхТекст;
		ЭлементКартинкаОшибки = Элементы.ОшибкаВСхемеКомпоновкиДанныхКартинка;
		
	ИначеЕсли ТипСтроки = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД() Тогда
		
		ЭлементГруппаОшибка = Элементы.ГруппаОшибкаВВариантеСКД;
		ЭлементТекстОшибки = Элементы.ОшибкаВВариантеСКДТекст;
		ЭлементКартинкаОшибки = Элементы.ОшибкаВВариантеСКДКартинка;
		
	ИначеЕсли ТипСтроки = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД() Тогда
		
		ЭлементГруппаОшибка = Элементы.ГруппаОшибкаВПользовательскойНастройкеСКД;
		ЭлементТекстОшибки = Элементы.ОшибкаВПользовательскойНастройкеСКДТекст;
		ЭлементКартинкаОшибки = Элементы.ОшибкаВПользовательскойНастройкеСКДКартинка;
		
	ИначеЕсли ТипСтроки = ИТК_Перечисления.ЭлементДанныхКод() Тогда
		
		ЭлементГруппаОшибка = Элементы.ГруппаОшибкаВКоде;
		ЭлементТекстОшибки = Элементы.ОшибкаВКодеТекст;
		ЭлементКартинкаОшибки = Элементы.ОшибкаВКодеКартинка;
		
	КонецЕсли;
	
	ТребуетсяПроверка = ТребуетсяПроверкаСтроки();
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	Если ТипСтроки = ИТК_Перечисления.ЭлементДанныхКод() Тогда
		
		Элементы.СтекВызововПоОшибке.Видимость = ЗначениеЗаполнено(ТекущиеДанные.ОшибкаПриВыполнении)
													И ЗначениеЗаполнено(ТекущиеДанные.ОшибкаПриВыполнении.СтекВызовов);
		
	КонецЕсли;
	
	Ошибка = ОшибкаВДанных(ТекущиеДанные);
	ЕстьОшибки = ЗначениеЗаполнено(Ошибка);
	АкцентироватьТекст = ЕстьОшибки ИЛИ ТребуетсяПроверка;
	ЭлементГруппаОшибка.Видимость = АкцентироватьТекст;
	
	Если ЭлементТекст <> Неопределено Тогда
		
		Если АкцентироватьТекст Тогда
			ЦветРамки = WebЦвета.Красный;
		Иначе
			ЦветРамки = Новый Цвет();
		КонецЕсли;
		
		ЭлементТекст.ЦветРамки = ЦветРамки;
		ЭлементТекстОшибки.Гиперссылка = Не ТребуетсяПроверка;
		
	КонецЕсли;
	
	Если ТребуетсяПроверка Тогда
		
		ТекстОшибки = НСтр("ru = 'Требуется проверка текста';
							|en = 'You want to check the text'");
		ЭлементКартинкаОшибки.Картинка = Новый Картинка;
		
	Иначе
		
		Если ЕстьОшибки Тогда
			
			Если ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхКод() Тогда
				ТекстОшибки = ИТК_КодКлиентСервер.ПредставлениеОшибки(Ошибка);
			Иначе
				ТекстОшибки = ИТК_ОбщийКлиентСервер.ПредставлениеОшибкиВТекстеЗапросаИлиСхемеКомпоновкиДанных(Ошибка);
			КонецЕсли;
			ЭлементКартинкаОшибки.Картинка = КартинкаОшибкиВДанных(ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементТекстОшибки.Заголовок = ТекстОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыУправленияПараметровЗапроса()
	
	ПараметрыЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	Если ПараметрыЗапросаТекущиеДанные = Неопределено Тогда
		
		ДоступностьИзменитьТипПараметра = Ложь;
		ДоступнаФормаВыбораУниверсальная = Ложь;
		
	Иначе
			
		ДанныеПараметра = ДанныеПараметраЗапроса(ТекущаяСтрока, ПараметрыЗапросаТекущиеДанные.Имя);
		ОписаниеТипаПараметра = ДанныеПараметра.ОписаниеТипов;
		
		ДоступностьИзменитьТипПараметра = (ПараметрыЗапросаТекущиеДанные.Тип = ИТК_Перечисления.ТипЗначенияПараметраЗапросаЗначение())
											И (ТипЗнч(ОписаниеТипаПараметра) = Тип("ОписаниеТипов") И (ОписаниеТипаПараметра.СодержитТип(Тип("Дата")) ИЛИ ОписаниеТипаПараметра.Типы().Количество() > 1));
											
		ДоступнаФормаВыбораУниверсальная = (ПараметрыЗапросаТекущиеДанные.Тип = ИТК_Перечисления.ТипЗначенияПараметраЗапросаЗначение())
												И ТипЗнч(ОписаниеТипаПараметра) = Тип("ОписаниеТипов")
												И ИТК_ТипыКлиентСервер.ЕстьСсылочныеТипы(ОписаниеТипаПараметра, Истина)
												И ИТК_ТипыКлиентСервер.ЭтоСсылочный(ТипЗнч(ДанныеПараметра.Значение), Истина);
		
	КонецЕсли;
	
	Элементы.ПараметрыЗапросаИзменитьТипПараметра.Доступность = ДоступностьИзменитьТипПараметра;
	Элементы.ПараметрыЗапросаКонтекстноеМенюИзменитьТипПараметра.Доступность = ДоступностьИзменитьТипПараметра;
	Элементы.ПараметрыЗапросаКонтекстноеМенюФормаВыбораУниверсальная.Доступность = ДоступнаФормаВыбораУниверсальная;

КонецПроцедуры

// Проверяет входит можно ли переносить проверяемую строку (ПроверяемаяСтрока) в строку (ПриемникПеретаскивания)
//
// Параметры:
//  ПроверяемаяСтрока		(ДанныеФормыЭлементДерева)						- Проверяемая строка
//  ПриемникПеретаскивания	(ДанныеФормыДерево,ДанныеФормыЭлементДерева)	- Строка приемник перетаскивания
//  ПараметрыПеретаскивания	(ПараметрыПеретаскивания)						- Параметры перетаскивания
// Возвращаемое значение:
//   Булево	- Истина, можно перенести строку; Ложь, нельзя
//
&НаКлиенте
Функция МожноПереместитьСтроку(ПроверяемаяСтрока, ПараметрыПеретаскивания, ПриемникПеретаскивания)
	
	// Правила перетаскивания Drag & Drop
	// 1. В корень дерева можно переносить элементы Запрос, Код, СКД, Группа
	// 2. Нельзя переносить/копировать элементы вложенный запрос
	// 3. Строку нельзя переносить саму в себя
	// 4. Необходимо проверять не перемещается ли группа внутрь самой себя для избежания бесконечной рекурсии
	// В группу переносить можно, но только не в туже самую... копированием можно и в туже самую
	// 5. Группу можно переносить только в другую группу
	// 6. Переносить в родительскую группу только копированием
	// 7. Вариант отчета СКД можно переносить только в другой вариант (т.е. перемещение элементов)
	//     в вариант можно переносить только вариант или пользовательскую настройку
	// 8. Пользовательскую настройку СКД можно перемешать в СКД или Вариант отчета СКД или в другую пользовательскую настройку (перемещение)
	//    внутрь пользовательской настройки ничего перемещать нельзя
	
	Если ТипЗнч(ПриемникПеретаскивания) = Тип("ДанныеФормыДерево") Тогда // (должно быть начальной проверкой) // 1
		
		Возврат ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхГруппа()
				ИЛИ ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос()
				ИЛИ ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных()
				ИЛИ ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхКод();
		
	ИначеЕсли ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(ПроверяемаяСтрока.Тип) Тогда // 2
		Возврат Ложь;
	ИначеЕсли ПроверяемаяСтрока = ПриемникПеретаскивания Тогда // 3
		Возврат Ложь;
	ИначеЕсли ИТК_ФормаКлиент.СтрокаДеревоВходитВСтроку(ПриемникПеретаскивания, ПроверяемаяСтрока) Тогда // 4
		Возврат Ложь;
	ИначеЕсли ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхГруппа() 
				И ПриемникПеретаскивания.Тип <> ИТК_Перечисления.ЭлементДанныхГруппа() Тогда // 5
		Возврат Ложь;
	ИначеЕсли ПриемникПеретаскивания = ПроверяемаяСтрока.ПолучитьРодителя() И ПараметрыПеретаскивания.Действие <> ДействиеПеретаскивания.Копирование Тогда // 6
		Возврат Ложь;
	ИначеЕсли (ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД() 
				И ПриемникПеретаскивания.Тип <> ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД())
			 ИЛИ (ПриемникПеретаскивания.Тип = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД()
			 		И НЕ(ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД()
							ИЛИ ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД())) Тогда // 7
		Возврат Ложь;
	ИначеЕсли ПроверяемаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД() 
				И ПриемникПеретаскивания.Тип <> ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД() Тогда // 8
		Возврат ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(ПриемникПеретаскивания.Тип);
	ИначеЕсли ПриемникПеретаскивания.Тип = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД() Тогда // 8
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Возвращает массив строк которые можно перенести (т.е. какие из выделенных строк можно перенести в строку приемник)
//
// Параметры:
//  АнализируемыеСтроки		(Массив)										- Идентификаторы строк, которые нужно проверить 
//  ПриемникПеретаскивания	(ДанныеФормыДерево,ДанныеФормыЭлементДерева)	- Строка приемник перетаскивания
//  ПараметрыПеретаскивания	(ПараметрыПеретаскивания)						- Параметры перетаскивания
// Возвращаемое значение:
//   Массив	- Массив с идентификаторами строк, которые можно перенести
//
&НаКлиенте
Функция ПолучитьСтрокиКоторыеМожноПеренести(АнализируемыеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания)
	
	Результат = Новый Массив;
	Для Каждого Идентификатор Из АнализируемыеСтроки Цикл
		
		ПеретаскиваемаяСтрока = ДеревоДанных.НайтиПоИдентификатору(Идентификатор);
		
		Если МожноПереместитьСтроку(ПеретаскиваемаяСтрока, ПараметрыПеретаскивания, ПриемникПеретаскивания) Тогда
			
			Результат.Добавить(Идентификатор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Переносит (или копирует) строку дерева данных
//
// Параметры:
//  СтрокаИсточник			(ДанныеФормыЭлементДерева)						- Строка источник та которую перетаскиваем 
//  СтрокаПриемник			(ДанныеФормыДерево,ДанныеФормыЭлементДерева)	- Строка в которую перетаскиваем
//  Копирование				(Булево)										- Режим перетаскивания: Истина - копирование, Ложь - перемещение
//  СделатьСтрокуАктивной	(Булево)										- Сделать строку активной
//  ИндексВставки			(Число)											- Индекс вставки
// Возвращаемое значение:
//   ДанныеФормыЭлементДерева - Новая строка перенесенная или скопированная
//
&НаКлиенте
Функция ПереместитьСтрокуДереваДанных(СтрокаИсточник, СтрокаПриемник, Копирование = Ложь, СделатьСтрокуАктивной = Ложь, ИндексВставки = Неопределено)
	
	Если Копирование Тогда // Копирование
		
		ТипСтроки = СтрокаИсточник.Тип;
		
		Картинка = Неопределено;
		Если ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапрос()
				ИЛИ ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(ТипСтроки)
				ИЛИ ТипСтроки = ИТК_Перечисления.ЭлементДанныхГруппа() Тогда
			ИмяНовойСтроки = СтрШаблон(НСтр("ru = '%1 - копия';
											|en = '%1 - copy'"), СтрокаИсточник.Имя);
		ИначеЕсли ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(ТипСтроки) Тогда
			Картинка = СтрокаИсточник.Картинка;
			ИмяНовойСтроки = СтрокаИсточник.Имя;
		КонецЕсли;
		
		// Копирование данных строки
		НачальныеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ТипСтроки);
		ЗаполнитьЗначенияСвойств(НачальныеДанные, ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(СтрокаИсточник));
		
		// Оригинальный текст при копировании
		Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемОригинальногоТекста(ТипСтроки) Тогда
			ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьОригинальныйТекст(НачальныеДанные);
		КонецЕсли;
		
		Если ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
			
			// ЗначенияПараметров
			НовыеЗначенияПараметров = Новый Соответствие;
			Для Каждого ЗначениеПараметра Из НачальныеДанные.ЗначенияПараметров Цикл 
				
				ОписаниеЗначениеПараметра = ЗначениеПараметра.Значение;
				НовыеЗначенияПараметров.Вставить(ЗначениеПараметра.Ключ, СкопироватьЗначениеПараметра(ОписаниеЗначениеПараметра));
				
			КонецЦикла;
			НачальныеДанные.ЗначенияПараметров = НовыеЗначенияПараметров;
			
			// НастройкиВыводаТаблиц
			НачальныеДанные.НастройкиВыводаТаблиц = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(НачальныеДанные.НастройкиВыводаТаблиц);
			
		КонецЕсли;
		
		// Внешние источники
		Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемВнешнихИсточников(ТипСтроки) Тогда
			
			НовыеВнешниеИсточники = Новый Соответствие;
			Для Каждого ВременнаяТаблица Из ИТК_КонсольРазработчикаДанныеКлиентСервер.ВнешниеИсточники(НачальныеДанные) Цикл 
				
				ОписаниеВнешнегоИсточника = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ВременнаяТаблица.Значение);
				ОписаниеВнешнегоИсточника.Значение = ИТК_ОбщийВызовСервера.КопияТаблицыЗначений(ОписаниеВнешнегоИсточника.Значение, УникальныйИдентификатор);
				
				НовыеВнешниеИсточники.Вставить(Новый УникальныйИдентификатор, ОписаниеВнешнегоИсточника);
				
			КонецЦикла;
			НачальныеДанные.ВнешниеИсточники = НовыеВнешниеИсточники;
			
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Родитель", СтрокаПриемник);
		ДополнительныеПараметры.Вставить("Активизировать", Ложь);
		ДополнительныеПараметры.Вставить("НачальныеДанные", НачальныеДанные);
		ДополнительныеПараметры.Вставить("Картинка", Картинка);
		НоваяСтрока = ДобавитьСтрокуВДеревоДанных(ТипСтроки, ИмяНовойСтроки, ДополнительныеПараметры);
		
		НоваяСтрока.Выделение = СтрокаИсточник.Выделение;
		
	Иначе // Перемещение
		Если ИндексВставки = Неопределено Тогда
			НоваяСтрока = СтрокаПриемник.ПолучитьЭлементы().Добавить();
		Иначе 
			НоваяСтрока = СтрокаПриемник.ПолучитьЭлементы().Вставить(ИндексВставки + 1);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
	КонецЕсли;	
	
	Для Каждого ОбрабатываемаяСтрока Из СтрокаИсточник.ПолучитьЭлементы() Цикл
		
		ПереместитьСтрокуДереваДанных(ОбрабатываемаяСтрока, НоваяСтрока, Копирование);
		
		// Развернем в соответствии с источником
		Если Элементы.ДеревоДанных.Развернут(СтрокаИсточник.ПолучитьИдентификатор()) Тогда
			Элементы.ДеревоДанных.Развернуть(НоваяСтрока.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	
	Если СделатьСтрокуАктивной Тогда
		// Установим текущую строку
		Элементы.ДеревоДанных.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
	Возврат НоваяСтрока;
	
КонецФункции

// Добавляет новые данные 
//
// Параметры: (Отсутствуют)
//
&НаКлиенте
Процедура НовыеДанные()
	
	НовыеДанныеСервер();
	АктивироватьСтрокуДереваДанныхПослеОбновления();
	
КонецПроцедуры

&НаСервере
Процедура НовыеДанныеСервер()
	
	ОчиститьДанныеСервер();
	УстановитьРабочиеДанные(РабочиеДанные);
	
	Если КомандаЗапуска = "КонсольКода" Тогда
		
		ПредставлениеНовойСтроки = НСтр("ru = 'Код'; en = 'Code'");
		ТипНовойСтроки =  ИТК_Перечисления.ЭлементДанныхКод();
	
	ИначеЕсли КомандаЗапуска = "КонсольСКД" Тогда
		
		ПредставлениеНовойСтроки = НСтр("ru = 'Схема компоновки данных'; en = 'Data composition schema'");
		ТипНовойСтроки =  ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных();
		
	Иначе
		
		ПредставлениеНовойСтроки = НСтр("ru = 'Запрос'; en = 'Query'");
		ТипНовойСтроки =  ИТК_Перечисления.ЭлементДанныхЗапрос();
		
	КонецЕсли;
	
	ДобавитьСтрокуВДеревоДанныхСервер(ПредставлениеНовойСтроки, ТипНовойСтроки, ДеревоДанных);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеСервер()
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьМодифицированность(ЭтотОбъект);
	
	ДеревоДанных.ПолучитьЭлементы().Очистить();
	ИдентификаторПоследнейВыделеннойСтроки = Неопределено;
	
	РезультатКоличество = "";
	ПоследняяАктивнаяОбласть = Неопределено;
	
	ОбновитьРезультатСервер();
	ИТК_КонсольРазработчикаКлиентСервер.НовыйРезультат(ТекущийРезультат);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаВходныхДанныеОтладки(ВходныеДанныеОтладки)
	
	ИмяСтроки = СтрШаблон(НСтр("ru = '%1 (схема компоновки данных)'; en = '%1 (data layout scheme)'"), ВходныеДанныеОтладки.Имя);
	
	// Строка схема компоновки данных
	ТипНовойСтроки = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных();
	
	ДополнительныеПараметры = Новый Структура;
	
	НачальныеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ТипНовойСтроки);
	НачальныеДанные.Текст = ВходныеДанныеОтладки.СхемаКомпоновкиДанных;
	НачальныеДанные.ОригинальныйТекст = НачальныеДанные.Текст;
	НачальныеДанные.Ошибка = Неопределено;
	ДополнительныеПараметры.Вставить("НачальныеДанные", НачальныеДанные);
	
	НоваяСтрока = ДобавитьСтрокуВДеревоДанныхСервер(ИмяСтроки, ТипНовойСтроки, ДеревоДанных, ДополнительныеПараметры);
	
	// Строка настройки схемы компоновки данных
	ТипНовойСтроки = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД();
	
	ДополнительныеПараметры = Новый Структура;
	
	НачальныеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ТипНовойСтроки);
	НачальныеДанные.Текст = ВходныеДанныеОтладки.НастройкиКомпоновкиДанных;
	ДополнительныеПараметры.Вставить("НачальныеДанные", НачальныеДанные);
	
	ДобавитьСтрокуВДеревоДанныхСервер(НСтр("ru = 'Настройки схемы компоновки данных'; en = 'Data layout schema settings'"),
		ТипНовойСтроки, НоваяСтрока, ДополнительныеПараметры);
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Сохраняет данные в файл (формат по умолчанию)
//
// Параметры:
//  ПолноеИмяФайла (Строка) - Полное имя файла
//
// Возвращаемое значение:
//   Булево - Истина, сохранено успешно; Ложь - ошибка (данные не сохранены)
&НаКлиенте
Процедура СохранитьДанныеВФайл(ПолноеИмяФайла)
	
	Состояние(НСтр("ru = 'Сохранение файла:';
					|en = 'Saving file:'"), , ПолноеИмяФайла, БиблиотекаКартинок.ИТК_ДлительнаяОперацияАнимация48);
	
	СохранитьИзмененныеДанныеСтроки();
	
	// Подготовка данных на клиенте для сервера (развернутость веток, надписи, ТипСтроки)
	АдресХранилища = ПодготовленныДанныеДляСохраненияВоВременномХранилище();
	Попытка
		
		ПолучитьФайл(АдресХранилища, ПолноеИмяФайла, Ложь);
		
		ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьМодифицированность(ЭтотОбъект);
		
		ТипыХраненияДанных = ИТК_Перечисления.ТипХраненияДанныхФайл();
		УстановитьРабочиеДанные(РабочиеДанные, ТипыХраненияДанных, ПолноеИмяФайла);
		ОбновитьЭлементыПоследниеРабочиеДанные(ТипыХраненияДанных, ПолноеИмяФайла);
		
		ПослеСохраненияДанных();
		
	Исключение
		
		// Ошибка файл не удалось сохранить
		ПредставлениеОшибки = НСтр("ru = 'Ошибка сохранения :';
									|en = 'Save failed :'") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение( , ПредставлениеОшибки, , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		Возврат; 
		
	КонецПопытки;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(ОписаниеОбработчикаПослеВыполнения = Неопределено)
	
	Если ПустаяСтрока(РабочиеДанные.Имя) Тогда
		
		ИмяНастройкиСохранятьДанныеПоУмолчаниюВ = ИТК_НастройкиКлиентСерверПовтИсп.ИмяНастройкиСохранятьДанныеПоУмолчаниюВ();
		СохранятьДанныеПоУмолчаниюВ = ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, ИмяНастройкиСохранятьДанныеПоУмолчаниюВ);

		Если СохранятьДанныеПоУмолчаниюВ = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
			
			СохранитьКакНастройку();
			
		Иначе
			
			СохранитьКакФайл();
			
		КонецЕсли;
		
	Иначе
		
		Если РабочиеДанные.Тип = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
			СохранитьДанныеВНастройки(РабочиеДанные.Имя);
		Иначе 
			СохранитьДанныеВФайл(РабочиеДанные.Имя);
		КонецЕсли;
		
		Если ОписаниеОбработчикаПослеВыполнения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОбработчикаПослеВыполнения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗакончено(ВыбранныеФайлы, ОписаниеОбработчика) Экспорт 
	
	Если ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		СохранитьДанныеВФайл(ВыбранныеФайлы[0]);
	КонецЕсли;
	
	Если ОписаниеОбработчика <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗакладкуПараметры()
	
	ПараметрыЗапросаЭлементы = ПараметрыЗапроса;
	ПараметрыЗапросаЭлементы.Очистить();
	КоличествоПараметровВЗапросе = 0;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТребуетсяПроверка = ТребуетсяПроверкаСтроки();
	
	Если ТребуетсяПроверка Тогда
		Возврат;
	КонецЕсли;
	
	Номер = 1;
	СписокПараметровЗапроса = СписокПараметровЗапроса(ТекущаяСтрока);
	Для Каждого ПараметрЗапроса Из СписокПараметровЗапроса Цикл
		
		СтрокаПараметр = ПараметрыЗапросаЭлементы.Добавить();
		
		ОписаниеЗначения = ПараметрЗапроса.Значение;
		ОбновитьСтрокуПараметра(СтрокаПараметр, ПараметрЗапроса.Представление, ОписаниеЗначения.Тип, ОписаниеЗначения.Значение);
		
		СтрокаПараметр.Номер = Номер;
		Номер = Номер + 1;
		
	КонецЦикла;
	
	КоличествоПараметровВЗапросе = СписокПараметровЗапроса.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуПараметра(Строка, Имя, ДоступныеТипы, Значение)
	
	ТипПараметра = ИТК_Перечисления.ТипЗначенияПараметраЗапросаЗначение();
	ТипЗначения = ТипЗнч(Значение);
	ЭтоСложныйПараметр = ИТК_КонсольРазработчикаКлиентСервер.ЭтоСложныйПараметр(ТипЗначения);
	
	Если ТипЗначения = Тип("СписокЗначений") Тогда
		ТипПараметра = ИТК_Перечисления.ТипЗначенияПараметраЗапросаСписок();
	ИначеЕсли ЭтоСложныйПараметр Тогда
		
		Если Значение.Вид = ИТК_Перечисления.СложныйПараметрЗапросаВыражение() Тогда
			ТипПараметра = ИТК_Перечисления.ТипЗначенияПараметраЗапросаВыражение();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоСложныйПараметр Тогда
		ПредставлениеПараметра = Значение.Представление;
	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда
		ПредставлениеПараметра = ДоступныеТипы.ПривестиЗначение(Значение);
	ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений")
				ИЛИ ТипЗнч(Значение) = Тип("МоментВремени")
				ИЛИ ТипЗнч(ТипЗначения) = Тип("Тип") Тогда
		ПредставлениеПараметра = Значение;
	Иначе
		ПредставлениеПараметра = ДоступныеТипы.ПривестиЗначение(Значение);
	КонецЕсли;
	
	Строка.Тип = ТипПараметра;
	Строка.Имя = Имя;
	Строка.ТипЗначения = ДоступныеТипы;
	Строка.Картинка = ИТК_КонсольРазработчикаКлиентСервер.КартинкаПараметраЗапроса(ДоступныеТипы);
	Строка.ЗначениеПредставление = ПредставлениеПараметра;
	
	ПараметрыЗапросаПриАктивизацииСтроки(Элементы.ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьЗначениеПараметраКТипу(Значение, ТипЗначения, ИзТипа, КТипу, ТекстОшибки = "")
	
	Результат = Неопределено;
	
	Если ИзТипа = ИТК_Перечисления.ТипЗначенияПараметраЗапросаСписок() Тогда
		
		Если КТипу = ИТК_Перечисления.ТипЗначенияПараметраЗапросаЗначение() Тогда
			
			Если ЗначениеЗаполнено(Значение) Тогда
				
				Если ТипЗнч(Значение) = Тип("Массив") Тогда
					Результат = Значение[0];
				Иначе
					Результат = Значение[0].Значение;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли КТипу = ИТК_Перечисления.ТипЗначенияПараметраЗапросаВыражение() Тогда
			Результат = ИТК_КодВызовСервера.ЗначениеПараметра(Значение, "Список");
		КонецЕсли;
		
	ИначеЕсли ИзТипа = ИТК_Перечисления.ТипЗначенияПараметраЗапросаЗначение() Тогда 
		
		Если КТипу = ИТК_Перечисления.ТипЗначенияПараметраЗапросаСписок() Тогда
			
			Результат = ИТК_ОбщийКлиентСервер.НовыйСписокЗначений(Значение);
			
		ИначеЕсли КТипу = ИТК_Перечисления.ТипЗначенияПараметраЗапросаВыражение() Тогда
			
			Если ТипЗнч(ТипЗначения) = Тип("Структура") Тогда
				
				Если ТипЗначения.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
					
					Если ЗначениеЗаполнено(Значение.Значение) Тогда
						Результат = ИТК_КодВызовСервера.ЗначениеПараметра(Значение.Значение, "Таблица");
					Иначе
						
						ЯзыкПрограммирования = ИТК_НастройкиКлиент.ЗначениеОбщейНастройки(ЭтотОбъект, "ЯзыкПрограммирования");
						ВидПараметра = ИТК_Перечисления.СложныйПараметрЗапросаВыражение();
						Значение = НСтр("ru = 'Результат = Новый ТаблицаЗначений';
										|en = 'Result = New ValueTable'", ЯзыкПрограммирования);
						
						Результат = ИТК_ЗапросКлиентСервер.ЗначениеСложногоПараметра(ВидПараметра, Значение);
						
					КонецЕсли;
					
				ИначеЕсли ТипЗначения.Вид = ИТК_Перечисления.СложныйПараметрЗапросаГраница() Тогда
					Результат = ИТК_КодВызовСервера.ЗначениеПараметра(Значение.Значение);
				КонецЕсли;
				
			Иначе
				Результат = ИТК_КодВызовСервера.ЗначениеПараметра(Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИзТипа = ИТК_Перечисления.ТипЗначенияПараметраЗапросаВыражение() Тогда 
		
		ВычисленноеЗначение = ИТК_КодВызовСервера.ПараметрИзВыражения(Значение.Значение, УникальныйИдентификатор, ТекстОшибки);
		
		Если ТипЗнч(ВычисленноеЗначение) = Тип("СписокЗначений")
				ИЛИ ТипЗнч(ВычисленноеЗначение) = Тип("Массив") Тогда
			ТипВычисленногоЗначения = ИТК_Перечисления.ТипЗначенияПараметраЗапросаСписок();
		Иначе 
			ТипВычисленногоЗначения = ИТК_Перечисления.ТипЗначенияПараметраЗапросаЗначение();
		КонецЕсли;
		
		Если ТипВычисленногоЗначения = КТипу Тогда
			
			Если ТипЗнч(ВычисленноеЗначение) = Тип("Граница") Тогда
				
				Результат = ИТК_ЗапросКлиентСервер.ЗначениеСложногоПараметра(ИТК_Перечисления.СложныйПараметрЗапросаГраница(),
								ИТК_Запрос.ОписаниеИзГраницы(ВычисленноеЗначение));
				
			ИначеЕсли ТипЗнч(ВычисленноеЗначение) = Тип("Массив") Тогда
				
				Результат = Новый СписокЗначений;
				Результат.ЗагрузитьЗначения(ВычисленноеЗначение);
				
			Иначе
				Результат = ВычисленноеЗначение;
			КонецЕсли;
			
		Иначе
			
			Если СписокДоступенДляПараметра(ВычисленноеЗначение, ТипЗначения) Тогда
				Результат = ПреобразоватьЗначениеПараметраКТипу(ВычисленноеЗначение, ТипЗначения, ТипВычисленногоЗначения, КТипу, ТекстОшибки);
			Иначе
				
				ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Для значений типа %1 редактирование в списке недоступно';
													|en = 'For values of type %1 editing is not available in the list'"), ТипЗнч(ВычисленноеЗначение));
				ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_КонсольРазработчикаКлиентСервер.Представление());
				
				Результат = Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьЭлементыПоследниеРабочиеДанные(Тип = Неопределено, ИмяДобавляемого = "", ИмяУдаляемого = "")
	
	Если ЗначениеЗаполнено(ИмяУдаляемого) Тогда
		ИТК_КонсольРазработчика.УдалитьИзПоследнихРабочихДанных(ИмяУдаляемого, Тип);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяДобавляемого) Тогда
		ИТК_КонсольРазработчика.ДобавитьВПоследниеРабочиеДанные(ИмяДобавляемого, Тип);
	КонецЕсли;
	
	ПоследниеРабочиеДанные = ИТК_КонсольРазработчика.ПоследниеРабочиеДанныеВсе();
	
	Если Тип = Неопределено ИЛИ Тип = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда
		ОбновитьЭлементыНабораПоследнихРабочихДанных(Элементы.ПоследниеРабочиеФайлы, ИТК_Перечисления.ТипХраненияДанныхФайл());
	КонецЕсли;
	
	Если Тип = Неопределено ИЛИ Тип = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
		ОбновитьЭлементыНабораПоследнихРабочихДанных(Элементы.ПоследниеРабочиеНастройки, ИТК_Перечисления.ТипХраненияДанныхНастройка());
	КонецЕсли;
	
	ОбновитьЭлементыНабораПоследнихРабочихДанных(Элементы.ПоследниеРабочиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыНабораПоследнихРабочихДанных(ЭлементРодитель, Тип = Неопределено)
	
	// Уберем видимость всех кнопок
	Для Каждого Кнопка Из ЭлементРодитель.ПодчиненныеЭлементы Цикл
		Кнопка.Видимость = Ложь;
	КонецЦикла;
	
	Если Тип = Неопределено Тогда
		НаборДанных = ПоследниеРабочиеДанные.Все;
	ИначеЕсли Тип = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
		НаборДанных = ПоследниеРабочиеДанные.Настройки;
	ИначеЕсли Тип = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда
		НаборДанных = ПоследниеРабочиеДанные.Файлы;
	КонецЕсли;
	
	Индекс = 0;
	Для Каждого ЭлементДанных Из НаборДанных Цикл 
		
		Если ТипЗнч(ЭлементДанных) = Тип("Структура") Тогда
			
			ИмяДанных = ЭлементДанных.Имя;
			ТипПоследнихРабочихДанных = ЭлементДанных.Тип;
			Если ТипПоследнихРабочихДанных = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
				ИндексКоманды = ПоследниеРабочиеДанные.Настройки.Найти(ИмяДанных);
			ИначеЕсли ТипПоследнихРабочихДанных = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда
				ИндексКоманды = ПоследниеРабочиеДанные.Файлы.Найти(ИмяДанных);
			КонецЕсли;
			
		Иначе
			
			ИмяДанных = ЭлементДанных;
			ТипПоследнихРабочихДанных = Тип;
			ИндексКоманды = Индекс;
			
		КонецЕсли;
		
		КартинкаКнопки = Новый Картинка;
		Если ТипПоследнихРабочихДанных = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда
			
			ИмяКоманды = "ОткрытьПоследнийФайл" + ИндексКоманды;
			ИмяДействия = "ПодключаемаяКомандаОткрытьПоследнийФайл";
			КартинкаКнопки = ИТК_ОбщийКлиентСерверПовтИсп.БиблиотекаКартинок("ИТК_ТипХраненияДанныхФайл");
			
		ИначеЕсли ТипПоследнихРабочихДанных = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
			
			ИмяКоманды = "ОткрытьПоследнююНастройку" + ИндексКоманды;
			ИмяДействия = "ПодключаемаяКомандаОткрытьПоследнююНастройку";
			КартинкаКнопки = ИТК_ОбщийКлиентСерверПовтИсп.БиблиотекаКартинок("ИТК_ТипХраненияДанныхНастройка");
			
		КонецЕсли;
		
		Если Тип = Неопределено Тогда
			ИмяКнопки = "КнопкаОткрытьПоследниеРабочиеДанные" + Индекс;
		ИначеЕсли Тип = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда
			ИмяКнопки = "КнопкаОткрытьПоследнююНастройку" + Индекс;
		ИначеЕсли Тип = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
			ИмяКнопки = "КнопкаОткрытьПоследнийФайл" + Индекс;
		КонецЕсли;
		
		Команда = Команды.Найти(ИмяКоманды);
		Если Команда = Неопределено Тогда
			Команда = Команды.Добавить(ИмяКоманды);
			Команда.Действие = ИмяДействия;
		КонецЕсли;
		
		Кнопка = Элементы.Найти(ИмяКнопки);
		Если Кнопка = Неопределено Тогда
			Кнопка = ИТК_Форма.ДобавитьЭлемент(ЭтотОбъект, ИмяКнопки, "Кнопка", , ЭлементРодитель); // Новая кнопка
		КонецЕсли;
		Кнопка.ИмяКоманды = ИмяКоманды; 
		
		Кнопка.Видимость = Истина;
		
		Если ТипПоследнихРабочихДанных = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда 
			Кнопка.Заголовок = ИТК_ФайлыКлиентСервер.ПолноеИмяФайлаКратко(ИмяДанных);
		Иначе 
			Кнопка.Заголовок = ИмяДанных;
		КонецЕсли;	
		
		Кнопка.Картинка = КартинкаКнопки;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбластиПодключаемый() Экспорт
	ИТК_ТабличныйДокументКлиент.ПриАктивизацииОбластиОбработка(ЭтотОбъект, ТабличныйДокументРезультат);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанных()
	
	ОсновнаяСтрокаСКД = ОсновнаяСхемаКомпоновкиДанных(ТекущаяСтрока);
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОсновнаяСтрокаСКД);
	ИТК_ФормаКлиент.ОткрытьКонструкторСхемыКомпоновкиДанных(ЭтотОбъект, ТекущиеДанные.Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Режим, ИгнорироватьЛимитСтрок = Ложь, ОбрабатываемаяСтрока = Неопределено)
	
	Если ОбрабатываемаяСтрока = Неопределено Тогда
		ОбрабатываемаяСтрока = ТекущаяСтрока;
	КонецЕсли;

	Если Не ИТК_КонсольРазработчикаДанныеКлиентСервер.КорректнаяОперацияВыполнения(ОбрабатываемаяСтрока.Тип, Режим) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеОперации = ИТК_КонсольРазработчикаКлиентСервер.НаименованиеВыполняемойОперации(Режим);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Режим", Режим);
	ДополнительныеПараметры.Вставить("НаименованиеОперации", НаименованиеОперации);
	ДополнительныеПараметры.Вставить("ОбрабатываемаяСтрока", ОбрабатываемаяСтрока);
	ДополнительныеПараметры.Вставить("ИгнорироватьЛимитСтрок", ИгнорироватьЛимитСтрок);
	
	ОписаниеОбработчика = Новый ОписаниеОповещения("ВыполнитьОперациюОбработчикОповещения", ЭтотОбъект, ДополнительныеПараметры);
	ЗапуститьОбработчикСПроверкойНаВозможностьВыполнения(ОписаниеОбработчика, НаименованиеОперации, ОбрабатываемаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюНаКлиенте(Строка, Режим)
	
	//Выполнить 
	Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(Строка);

	РезультатВыполнения = ИТК_КодКлиентСервер.Исполнить(Данные.Текст, Режим);
	
	ДополненныйРезультат = Новый Структура;
	ДополненныйРезультат.Вставить("Результат", РезультатВыполнения.Результат);
	ДополненныйРезультат.Вставить("Сообщения", Неопределено);
	
	РезультатВыполнения.Вставить("Результат", ДополненныйРезультат);
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", "Выполнено");
	
	АдресРезультата = ПоместитьВоВременноеХранилище(РезультатВыполнения, УникальныйИдентификатор);
	Результат.Вставить("АдресРезультата", АдресРезультата);
	
	ОповещениеОЗавершении = ОповещениеОЗавершенииВыполнения(Строка);
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюЧерезДлительныеОперации(Строка, НаименованиеОперации, Режим, ИгнорироватьЛимитСтрок)
	
	ОписаниеОперации = Новый Структура;
	ОписаниеОперации.Вставить("Источник", ИТК_Перечисления.ИнструментКонсольРазработчика());
	ОписаниеОперации.Вставить("Наименование", НаименованиеОперации);
	
	// Запуск длительной операции выполнения
	ИТК_ДлительныеОперацииКлиент.НачатьОперацию(ЭтотОбъект, Новый ОписаниеОповещения("НачалоДлительнойОперации", ЭтотОбъект), ОписаниеОперации);
	
	Данные = ПодготовитьДанныеПередВыполнением(Строка);
	
	ФоновоеВыполнение = ИТК_БСПКлиентСервер.ВозможноВыполнениеВФоне()
							И ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "ФоновоеВыполнение");
	
	АнализируетсяПланЗапроса = (Режим = ИТК_Перечисления.РежимВыполненияЗапросаВыполнение())
									И ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "ПолучениеПлана") <> ИТК_Перечисления.ПолучениеПланаОтключено();
									
	Если АнализируетсяПланЗапроса Тогда
		ДлительнаяОперация = ЗапуститьВыполнениеСАнализомПланаНаСервере(Данные, Режим, ИгнорироватьЛимитСтрок, УникальныйИдентификатор, ФоновоеВыполнение);
	Иначе
		ДлительнаяОперация = ЗапуститьВыполнениеНаСервере(Данные, Режим, ИгнорироватьЛимитСтрок, УникальныйИдентификатор, ФоновоеВыполнение);
	КонецЕсли;
	
	ИТК_ДлительныеОперацииКлиент.ЗаполнитьОписаниеОперации(ДлительнаяОперация, ОписаниеОперации);
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработкаПрогрессаВыполненияДлительнойОперации", ЭтотОбъект);
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект, ОповещениеОПрогрессеВыполнения);
	
	ИТК_ДлительныеОперацииКлиент.ДобавитьОповещениеПользователя(ЭтотОбъект, ПараметрыОжидания);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершенииВыполнения(Строка), ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Функция ОповещениеОЗавершенииВыполнения(Строка)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("UID", Строка.UID);
	
	Результат = Новый ОписаниеОповещения("ЗавершениеВыполненияДанных", ЭтотОбъект, ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьВыполнениеСАнализомПланаНаСервере(Знач Данные, Режим, ИгнорироватьЛимитСтрок, УникальныйИдентификатор, ФоновоеВыполнение)
	
	Возврат ЗапуститьВыполнениеНаСервере(Данные, Режим, ИгнорироватьЛимитСтрок, УникальныйИдентификатор, ФоновоеВыполнение);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьВыполнениеНаСервере(Знач Данные, Режим, ИгнорироватьЛимитСтрок, УникальныйИдентификатор, ФоновоеВыполнение)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Данные", ПодготовитьДанныеПередВыполнениемНаСервере(Данные));
	ПараметрыПроцедуры.Вставить("Режим", Режим);
	
	Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиЗапрос(Данные.Тип) Тогда
		
		ПолноеИмяМетода = "ИТК_Запрос.ПолучитьРезультат";
		ПараметрыПроцедуры.Вставить("ИгнорироватьЛимитСтрок", ИгнорироватьЛимитСтрок);
		
	ИначеЕсли ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(Данные.Тип) Тогда
		ПолноеИмяМетода = "ИТК_СКД.ПолучитьРезультат";
	ИначеЕсли Данные.Тип = ИТК_Перечисления.ЭлементДанныхКод() Тогда
		ПолноеИмяМетода = "ИТК_Код.Исполнить";
	КонецЕсли;
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор, ФоновоеВыполнение);
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне(ПолноеИмяМетода, ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеВыполненияДанных(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.СкрытьПрогресс(ЭтотОбъект);
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодробноеПредставлениеОшибки = ИТК_ОбщийКлиентСервер.Свойство(Результат, "ПодробноеПредставлениеОшибки");
	Если ЗначениеЗаполнено(ПодробноеПредставлениеОшибки) Тогда
		
		ПоказатьПредупреждение( , СтрШаблон(НСтр("ru = 'Ошибка при выполнении:
												|%1';
												|en = 'Runtime error:
												|%1'"), ПодробноеПредставлениеОшибки), , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;
	
	ОбработаннаяСтрока = НайтиСтрокуПоUID(ДеревоДанных, ДополнительныеПараметры.UID);
	Если ОбработаннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("АдресРезультата") Тогда
		Результат = ПрочитатьРезультатВыполненияДанных(Результат, УникальныйИдентификатор);
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОбработаннаяСтрока);
	
	Если Результат.Свойство("ВремяВыполнения") Тогда
		ТекущиеДанные.ВремяВыполнения = Результат.ВремяВыполнения;
	КонецЕсли;
	
	ОшибкаПриВыполнении = Результат.ОшибкаПриВыполнении;
	ТекущиеДанные.ОшибкаПриВыполнении = ОшибкаПриВыполнении;
	
	ОбновитьЭлементыФормы();
	
	ТребуетсяОбновлениеРезультатаВыполнения = Истина;
	Если ЗначениеЗаполнено(ОшибкаПриВыполнении) Тогда 
		
		ПоказатьОшибкуПослеОжидания();
		ТребуетсяОбновлениеРезультатаВыполнения = ТекущиеДанные.Свойство("Тип") И (ТекущиеДанные.Тип = ИТК_Перечисления.ЭлементДанныхКод());
		
	КонецЕсли;
	
	Если НЕ ТребуетсяОбновлениеРезультатаВыполнения Тогда
		Возврат;
	КонецЕсли;
	
	РежимВыполнения = ИТК_ОбщийКлиентСервер.Свойство(Результат, "РежимВыполнения");
	Если ИТК_ОбщийКлиентСервер.ЭтоРежимВыполненияСРезультатом(РежимВыполнения) Тогда
		
		ОбновитьРезультатВыполнения(Результат);
		
	ИначеЕсли РежимВыполнения = ИТК_Перечисления.РежимВыполненияСКДПолучениеИсполняемыхЗапросов() Тогда
		
		ОткрытьФормуАнализаИсполняемыхЗапросов(Результат.АдресИсполняемыхЗапросовСКД);
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьРезультатВыполненияДанных(РезультатВыполнения, УникальныйИдентификатор)
	
	Результат = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	
	Если Результат.Свойство("Результат") Тогда
		Результат.Вставить("АдресРезультата", ИТК_ВременноеХранилище.Поместить(Результат.Результат, , УникальныйИдентификатор));
		Результат.Удалить("Результат");
	КонецЕсли;
	
	Если Результат.Свойство("ДанныеРасшифровки") Тогда
		Результат.Вставить("АдресДанныхРасшифровки", ИТК_ВременноеХранилище.Поместить(Результат.ДанныеРасшифровки, , УникальныйИдентификатор));
		Результат.Удалить("ДанныеРасшифровки");
	КонецЕсли;
	
	Если Результат.Свойство("СхемаКомпоновкиДанных") Тогда
		Результат.Вставить("АдресСхемыКомпоновкиДанных", ИТК_ВременноеХранилище.Поместить(Результат.СхемаКомпоновкиДанных, , УникальныйИдентификатор));
		Результат.Удалить("СхемаКомпоновкиДанных");
	КонецЕсли;
	
	Если Результат.Свойство("ИсполняемыеЗапросы") Тогда
		Результат.Вставить("АдресИсполняемыхЗапросовСКД", ИТК_ВременноеХранилище.Поместить(Результат.ИсполняемыеЗапросы, , УникальныйИдентификатор));
		Результат.Удалить("ИсполняемыеЗапросы");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПрогрессаВыполненияДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт

	ИТК_ДлительныеОперацииКлиент.ПоказатьПрогресс(ЭтотОбъект);
	
	Прогресс = Результат.Прогресс;
	Если ЗначениеЗаполнено(Прогресс) Тогда
		
		ПрогрессДлительнойОперации = СтрШаблон("%1: %2", ДлительнаяОперация.Наименование, Результат.Прогресс.Текст);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемыКомпоновкиДанныхИзФайлаПослеПомещенияФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСхемыКомпоновкиДанных = ЗагрузитьФайлСхемыКомпоновкиДанныхНаСервере(ПомещенныеФайлы[0].Хранение);

	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("Текст", ТекстСхемыКомпоновкиДанных);
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
	ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
	
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
	
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ПроверитьСхемуКомпоновкиДанных(ТекущиеДанные);
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьФайлСхемыКомпоновкиДанныхНаСервере(Адрес)
	
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	
	ЧтениеТекста = Новый ЧтениеТекста(Данные.ОткрытьПотокДляЧтения());
	Результат = ЧтениеТекста.Прочитать();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СохранитьСхемуКомпоновкиДанныхВФайлПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	XMLТекст = ИТК_РедакторКодаКлиент.Текст(ЭтотОбъект, "СхемаКомпоновкиДанныхXML");
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(XMLТекст);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершенаЗаписьСхемуКомпоновкиДанныхВФайл", ЭтотОбъект, ДополнительныеПараметры);
	ТекстовыйДокумент.НачатьЗапись(ОписаниеОповещения, ПолноеИмяФайла, КодировкаТекста.UTF8);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершенаЗаписьСхемуКомпоновкиДанныхВФайл(Результат, ДополнительныеПараметры) Экспорт
	
	//ИТК_ФайлыКлиент.ОткрытьВПроводнике(ДополнительныеПараметры.ПолноеИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибку(Нажатие = Ложь)
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	Ошибка = ОшибкаВДанных(ТекущиеДанные);
	
	ЭлементТекст = ЭлементТекстПоТипуСтроки(ТекущаяСтрока.Тип);
	Если ЭлементТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(Ошибка) = Тип("Структура") Тогда
		
		Если ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхКод() Тогда
			ПоказатьОшибкуВКоде(ЭлементТекст, Ошибка, Нажатие);
		Иначе
			ИТК_РедакторКодаКлиент.ПоказатьОшибку(ЭлементТекст, Ошибка.НомерСтроки, Ошибка.НомерСтолбца);
		КонецЕсли;
		
	КонецЕсли;
		
	ТекущийЭлемент	= ЭлементТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуПослеОжидания()
	
	ПодключитьОбработчикОжидания("ПодключаемыйПоказатьОшибку", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйПоказатьОшибку()
	
	ПоказатьОшибку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуВКоде(ЭлементТекст, Ошибка, Нажатие = Ложь)
	
	ОписаниеОшибки = Ошибка.ОписаниеОшибки;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки.ИмяМодуля) Тогда
		
		ТекущийЭлемент = ЭлементТекст;
		
		Если Нажатие Тогда
			ИТК_РедакторКодаКлиент.ОткрытьКодМодуля(ОписаниеОшибки.ИмяМодуля, ОписаниеОшибки.НомерСтроки);
		КонецЕсли;
		
	Иначе
		
		ИТК_РедакторКодаКлиент.ПоказатьОшибку(ЭлементТекст, ОписаниеОшибки.НомерСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОшибкаВДанных(Данные)
	
	Если Данные.Свойство("Ошибка")
			И ЗначениеЗаполнено(Данные.Ошибка) Тогда
			
		Результат = Данные.Ошибка;
			
	Иначе
		
		Результат = Данные.ОшибкаПриВыполнении;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КартинкаОшибкиВДанных(Данные)
	
	Если Данные.Свойство("Ошибка") 
			И ЗначениеЗаполнено(Данные.Ошибка) Тогда
			
		Результат = БиблиотекаКартинок.ИТК_ОшибкаВТексте;
		
	ИначеЕсли ЗначениеЗаполнено(Данные.ОшибкаПриВыполнении) Тогда
		
		Результат = БиблиотекаКартинок.ИТК_ОшибкаПриВыполнении;
		
	Иначе
		
		Результат = Новый Картинка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПоказатьОшибку(ВыводитьПредупреждениеОшибокНет = Ложь)
	
	ОписаниеОшибки = ПроверитьДанныеСтроки(ТекущаяСтрока);
	
	ОбновитьЭлементыФормы();
	
	Если ЗначениеЗаполнено(ОписаниеОшибки.Текст) Тогда 
		ПоказатьОшибку();
	Иначе
		
		Если ВыводитьПредупреждениеОшибокНет Тогда
			
			Если ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
				
				ТекстОшибокНет = НСтр("ru = 'Запрос проверен. Ошибок нет';
										|en = 'Query verified. There are no errors'");
				
			ИначеЕсли ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
				
				ТекстОшибокНет = НСтр("ru = 'Схема компоновки данных проверена. Ошибок нет';
										|en = 'Data layout scheme has been verified. There are no errors'");
				
			КонецЕсли;
			
			ПоказатьОповещениеПользователя(ИТК_КонсольРазработчикаКлиентСервер.Представление(), , ТекстОшибокНет, БиблиотекаКартинок.СинтаксическийКонтроль);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПоказатьОшибкуПослеОжидания()
	
	ПодключитьОбработчикОжидания("ПодключаемыйПроверитьПоказатьОшибкуПослеОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйПроверитьПоказатьОшибкуПослеОжидания()

	ПроверитьПоказатьОшибку();

КонецПроцедуры

&НаКлиенте
Функция ПроверитьДанныеСтроки(ДанныеСтроки, Данные = Неопределено)
	
	Если Данные = Неопределено Тогда
		Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	КонецЕсли;
	
	ТипДанных = ДанныеСтроки.Тип;
	
	Если Данные.Свойство("ТребуетсяПроверка") Тогда
		
		Если Данные.ТребуетсяПроверка Тогда
			
			Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ДанныеСтроки);
			
			Если ТипДанных = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
				
				ПроверитьЗапрос(Данные);
				ОбновитьСтруктуруЗапросов(ДанныеСтроки);
				
			ИначеЕсли ТипДанных = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
				
				ПроверитьСхемуКомпоновкиДанных(Данные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Текст = ИТК_ОбщийКлиентСервер.ПредставлениеОшибкиВТекстеЗапросаИлиСхемеКомпоновкиДанных(Данные.Ошибка);
		
	Иначе
		
		Текст = "";
		
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Текст", Текст);
	Результат.Вставить("ТипДанных", ТипДанных);
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Функция ЗапускНевозможенПроверкаОповещение(Операция, Данные = Неопределено)
	
	СохранитьИзмененныеДанныеСтроки();
	
	// Проверяем, получаем описание
	ОписаниеОшибки = ПроверитьДанныеСтроки(ТекущаяСтрока, Данные);	
	
	Если ЗначениеЗаполнено(ОписаниеОшибки.Текст) Тогда
		
		// Выводим оповещение
		Пояснение = СтрШаблон(НСтр("ru = '%1 содержит ошибку: 
		|%2';
		|en = '%1 contains an error:
		|%2'"), ИТК_Перечисления.Представление(ОписаниеОшибки.ТипДанных), ОписаниеОшибки.Текст);
		
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Невозможно запустить ""%1""';
														|en = 'Unable to start ""%1""'"), Операция), , Пояснение, БиблиотекаКартинок.ИТК_ПредупреждениеВажное);
		ПроверитьПоказатьОшибкуПослеОжидания();
		
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ОписаниеОшибки.Текст);
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьОбработчикСПроверкойНаВозможностьВыполнения(ОписаниеОбработчика, Операция, Строка)
	
	Перем ОписаниеОповещенияОЗакрытии;
	
	СохранитьИзмененныеДанныеСтроки();
	Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(Строка);
	
	Если Строка.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос()
			И ЗначениеЗаполнено(Данные.Текст)
			И ЗначениеЗаполнено(Данные.Ошибка) Тогда
			
		ЗаголовокВопроса = ИТК_КонсольРазработчикаКлиентСервер.Представление();
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗавершенВопросВТекстеЗапросаИмеютсяОшибки", ЭтотОбъект, ОписаниеОбработчика);
		ТекстВопроса = НСтр("ru = 'В тексте запроса имеются ошибки. Выполнить?'; en = 'There are errors in the request text. Execute?'");
		
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить(Ложь, НСтр("ru = 'Перейти к ошибке'; en = 'Go to error'"));
		КнопкиВопроса.Добавить(Истина, НСтр("ru = 'Выполнить'; en = 'Execute'"));
		КнопкиВопроса.Добавить(Неопределено, НСтр("ru = 'Отмена'; en = 'Cancel'"));
		
		ИТК_ФормаКлиент.ЗадатьВопрос(ОписаниеОповещенияОЗакрытии, ТекстВопроса, КнопкиВопроса, Истина, ЗаголовокВопроса, ЭтотОбъект, "ПередВыполнениемЗапросаСОшибкой");
		
	Иначе
		
		Если ЗапускНевозможенПроверкаОповещение(Операция, Данные) Тогда
			Возврат;
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершенВопросВТекстеЗапросаИмеютсяОшибки(Результат, ОписаниеОбработчика) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = Истина Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
	Иначе
		ПроверитьПоказатьОшибкуПослеОжидания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапрос(Данные)
	
	Если ЗначениеЗаполнено(Данные.Текст) Тогда
		
		РезультатПроверки = ИТК_Запрос.ПроверитьТекст(Данные.Текст);
		
		ПолученныеПараметры = РезультатПроверки.Параметры;
		ПолученныеВременныеТаблицы = РезультатПроверки.ВременныеТаблицы;
		ПолученноеОписаниеВнешнихИсточников = РезультатПроверки.ВнешниеИсточники;
		ТекстОшибки = РезультатПроверки.ТекстОшибки;
		
	Иначе
		
		ПолученныеПараметры = Новый Соответствие;
		ПолученныеВременныеТаблицы = Новый Соответствие;
		ПолученноеОписаниеВнешнихИсточников = Новый Соответствие;
		ТекстОшибки = ИТК_ЗапросКлиентСервер.ТекстОшибкиПустойЗапрос();
		
	КонецЕсли;
		
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Ложь);
	ИзменяемыеПоля.Вставить("Параметры", ПолученныеПараметры);
	ИзменяемыеПоля.Вставить("ВременныеТаблицы", ПолученныеВременныеТаблицы);
	ИзменяемыеПоля.Вставить("Ошибка", ИТК_ЗапросКлиентСервер.ИнформацияООшибке(ТекстОшибки));
	ИзменяемыеПоля.Вставить("ОписаниеВнешнихИсточников", ПолученноеОписаниеВнешнихИсточников);
	ИзменяемыеПоля.Вставить("ВнешниеИсточники", ДополненныеВнешниеИсточники(Данные, ПолученноеОписаниеВнешнихИсточников));
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля, Ложь);
	
	// Начальная инициализация значений параметров типа таблица по тексту запроса
	Для Каждого Параметр Из ПолученныеПараметры Цикл 
		
		ОписаниеПараметра = Параметр.Значение;
		Если ИТК_КонсольРазработчикаКлиентСервер.ЭтоСложныйПараметр(ТипЗнч(ОписаниеПараметра))
				И ОписаниеПараметра.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
			
			ОписаниеСтарогоПараметра = Данные.ЗначенияПараметров.Получить(Параметр.Ключ);
			КолонкиТаблицы = ОписаниеПараметра.Значение;
			НовоеЗначениеПараметра = НовоеЗначениеПараметраТаблицыЗначений(ОписаниеСтарогоПараметра, КолонкиТаблицы, УникальныйИдентификатор);
			НовоеОписаниеПараметра = ИТК_ЗапросКлиентСервер.ЗначениеСложногоПараметра(
				ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений(), НовоеЗначениеПараметра);
			Данные.ЗначенияПараметров.Вставить(Параметр.Ключ, НовоеОписаниеПараметра);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовоеЗначениеПараметраТаблицыЗначений(ОписаниеСтарогоПараметра, СписокКолонок, УникальныйИдентификаторФормы)
	
	Если ИТК_КонсольРазработчикаКлиентСервер.ЭтоСложныйПараметр(ТипЗнч(ОписаниеСтарогоПараметра))
			И ОписаниеСтарогоПараметра.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
		
		УникальныйИдентификатор = ОписаниеСтарогоПараметра.Значение;
		ТаблицаЗначений = ПолучитьИзВременногоХранилища(УникальныйИдентификатор);
		
	Иначе
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		УникальныйИдентификатор = УникальныйИдентификаторФормы;
		
	КонецЕсли;
	
	Для Каждого ЭлементКолонка Из СписокКолонок Цикл 
		
		ИмяКолонки = ЭлементКолонка.Представление;
		Если ТаблицаЗначений.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			ТаблицаЗначений.Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСхемуКомпоновкиДанных(Данные, Строка = Неопределено)
	
	Если Строка = Неопределено Тогда
		Строка = ТекущаяСтрока;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Текст) Тогда
		
		Результат = ИТК_СКД.ПроверитьТекст(Данные.Текст);
		
		ТекстОшибки = Результат.ТекстОшибки;
		ПолученноеОписаниеВнешнихИсточников = Результат.ОписаниеВнешнихИсточников;
		
	Иначе
		
		ТекстОшибки = ИТК_СКДКлиентСервер.ТекстОшибкиПустаяСхема();
		ПолученноеОписаниеВнешнихИсточников = Новый Соответствие;
		
	КонецЕсли;
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Ложь);
	ИзменяемыеПоля.Вставить("Ошибка", ИТК_СКДКлиентСервер.ИнформацияООшибке(ТекстОшибки));
	ИзменяемыеПоля.Вставить("ОписаниеВнешнихИсточников", ПолученноеОписаниеВнешнихИсточников);
	ИзменяемыеПоля.Вставить("ВнешниеИсточники", ДополненныеВнешниеИсточники(Данные, ПолученноеОписаниеВнешнихИсточников));
	
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, Строка, ИзменяемыеПоля, Ложь);
	
КонецПроцедуры

&НаКлиенте
Функция ДополненныеВнешниеИсточники(Данные, ДобавляемыеВнешниеИсточники)
	
	Результат = ИТК_КонсольРазработчикаДанныеКлиентСервер.ВнешниеИсточники(Данные);
	Для Каждого ДобавляемыйВнешнийИсточник Из ДобавляемыеВнешниеИсточники Цикл 
		
		Имя = ДобавляемыйВнешнийИсточник.Ключ;
		Добавлять = Истина;
				
		Для Каждого ВнешнийИсточник Из Результат Цикл 
			
			ОписаниеВнешнегоИсточника = ВнешнийИсточник.Значение;
			Если ОписаниеВнешнегоИсточника.Имя = Имя Тогда
				
				Добавлять = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Добавлять Тогда
			
			ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйВнешнийИсточник(Имя,	ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение());
			ИТК_КонсольРазработчикаДанныеКлиент.ВставитьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока, Новый УникальныйИдентификатор, ОписаниеВнешнегоИсточника);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СписокПараметровЗапроса(Строка)
	
	Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(Строка);
	
	Результат = Новый СписокЗначений;
	
	Если Строка.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
		
		ОшибкаВТекстеЗапроса = (Данные.Ошибка <> Неопределено);
		Если ОшибкаВТекстеЗапроса Тогда
			
			Для Каждого ПараметрЗапроса Из Данные.ЗначенияПараметров Цикл 
				
				ТипЗначения = ИТК_ТипыКлиентСервер.ОписаниеТиповПоТипу(ТипЗнч(ПараметрЗапроса.Значение));
				ДанныеПараметра = Новый Структура("Тип, Значение", ТипЗначения, ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(Данные, ПараметрЗапроса.Ключ, ТипЗначения));
				
				Результат.Добавить(ДанныеПараметра, ПараметрЗапроса.Ключ);
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого ПараметрЗапроса Из Данные.Параметры Цикл 
				
				ДанныеПараметра = Новый Структура;
				
				ТипЗначенияПараметра = ПараметрЗапроса.Значение;
				ДанныеПараметра.Вставить("Тип", ОписаниеДоступныхТиповПараметра(ТипЗначенияПараметра));
				
				ОписаниеЗначенияПараметра = ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(Данные, ПараметрЗапроса.Ключ, ТипЗначенияПараметра);
				ДанныеПараметра.Вставить("Значение", ОписаниеЗначенияПараметра);
				
				Результат.Добавить(ДанныеПараметра, ПараметрЗапроса.Ключ);
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(Строка.Тип) Тогда
		
		ДанныеОсновногоЗапроса = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОсновнойЗапрос(Строка));
		
		Для Каждого ИмяПараметра Из Данные.Параметры Цикл 
			
			ТипЗначения = ДанныеОсновногоЗапроса.Параметры[ИмяПараметра];
			ДанныеПараметра = Новый Структура("Тип, Значение", ТипЗначения, ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(ДанныеОсновногоЗапроса, ИмяПараметра, ТипЗначения));
			
			Результат.Добавить(ДанныеПараметра, ИмяПараметра);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.СортироватьПоПредставлению();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДанныеПараметраЗапроса(Строка, Имя)
	
	Если ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(Строка.Тип) Тогда
		СтрокаЗапрос = ОсновнойЗапрос(Строка);
	Иначе
		СтрокаЗапрос = Строка;
	КонецЕсли;
	
	Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(СтрокаЗапрос);
	
	ТипЗначенияПараметра = Данные.Параметры[Имя];
	
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеТипов", ОписаниеДоступныхТиповПараметра(ТипЗначенияПараметра));
	Результат.Вставить("Значение", ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(Данные, Имя, ТипЗначенияПараметра));
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеДоступныхТиповПараметра(ТипЗначения)
	
	Если ТипЗнч(ТипЗначения) = Тип("СписокЗначений") Тогда
		Результат = ТипЗначения.ТипЗначения;
	Иначе
		Результат = ТипЗначения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодготовитьДанныеДляСравнения(СтрокаИсточник, СписокЗначений, ОбрабатываемыеТипы)
	
	Для Каждого Строка Из СтрокаИсточник.ПолучитьЭлементы() Цикл
		
		Если Строка.Тип = ИТК_Перечисления.ЭлементДанныхГруппа() Тогда
			
			ПодготовитьДанныеДляСравнения(Строка, СписокЗначений, ОбрабатываемыеТипы); 
			
		Иначе
			
			Если ОбрабатываемыеТипы.Найти(Строка.Тип) <> Неопределено Тогда
				
				ДанныеСтроки = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(Строка);
				ТребуетсяПроверка = ИТК_ОбщийКлиентСервер.Свойство(ДанныеСтроки, "ТребуетсяПроверка", Ложь);
				Ошибка = ИТК_ОбщийКлиентСервер.Свойство(ДанныеСтроки, "Ошибка");
				Если Не ТребуетсяПроверка 
						ИЛИ ЗначениеЗаполнено(Ошибка) Тогда
					
					ПредставлениеСтроки = ПолноеПредставлениеСтрокиДереваЗапросов(Строка);
					Если Строка.Выделение Тогда
						ПредставлениеСтроки = Новый ФорматированнаяСтрока(ПредставлениеСтроки, ИТК_ОбщийКлиентСервер.ШрифтЖирный());
					КонецЕсли;
					
					СписокЗначений.Добавить(Строка(Строка.UID), ПредставлениеСтроки);
					ПодготовитьДанныеДляСравнения(Строка, СписокЗначений, ОбрабатываемыеТипы);
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ПолноеПредставлениеСтрокиДереваЗапросов(Строка)
	
	ПолноеИмя = Строка.Имя;
	РодительСтроки = Строка.ПолучитьРодителя();
	
	Пока РодительСтроки <> Неопределено Цикл
		
		ПолноеИмя = РодительСтроки.Имя + " - " + ПолноеИмя;
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
		
	КонецЦикла;
	
	Возврат ПолноеИмя;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСравнения(СтрокаЭталон, ДополнительныеПараметры)
	
	СохранитьИзмененныеДанныеСтроки();
	
	Если Не ИТК_ФормаКлиент.ВозможенЗапускСравненияПредупреждение() Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектов = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "ТипОбъектов", Неопределено);
	ТипСравнения = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "ТипСравнения", Неопределено);
	НеизменяемыеПоля = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "НеизменяемыеПоля", Новый Структура);
	СтрокаНовый = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "СтрокаНовый", Неопределено);
	
	ПараметрыФормы = Новый Структура;
	МинимальноеКоличествоОбъектовСравнения = 2;
	
	СписокЗапросов = Новый СписокЗначений;
	ПодготовитьДанныеДляСравнения(ДеревоДанных, СписокЗапросов, ИТК_КонсольРазработчикаДанныеКлиентСервер.ТипыСтрокЗапросПодзапрос());
	ПараметрыФормы.Вставить("СписокЗапросов", СписокЗапросов);

	СписокСхемКомпоновкиДанных = Новый СписокЗначений;
	ПодготовитьДанныеДляСравнения(ДеревоДанных, СписокСхемКомпоновкиДанных, ИТК_КонсольРазработчикаДанныеКлиентСервер.ТипыСтрокСКД());
	ПараметрыФормы.Вставить("СписокСхемКомпоновкиДанных", СписокСхемКомпоновкиДанных);
	
	// Список элементов код
	СписокКод = Новый СписокЗначений;
	
	ТипыСтрокКода = Новый Массив;
	ТипыСтрокКода.Добавить(ИТК_Перечисления.ЭлементДанныхКод());
	
	ПодготовитьДанныеДляСравнения(ДеревоДанных, СписокКод, ТипыСтрокКода);
	ПараметрыФормы.Вставить("СписокКод", СписокКод);

	Если СтрокаЭталон <> Неопределено Тогда
		ПараметрыФормы.Вставить("ОбъектЭталон", СтрокаЭталон.UID);
	КонецЕсли;
	Если СтрокаНовый <> Неопределено Тогда
		ПараметрыФормы.Вставить("ОбъектНовый", СтрокаНовый.UID);
	КонецЕсли;

	НедостаточноДанных = Ложь;
	Если (СписокЗапросов.Количество() < МинимальноеКоличествоОбъектовСравнения
			И СписокСхемКомпоновкиДанных.Количество() < МинимальноеКоличествоОбъектовСравнения
			И СписокКод.Количество() < МинимальноеКоличествоОбъектовСравнения) Тогда
		НедостаточноДанных = Истина;
	КонецЕсли;
	
	Если НеизменяемыеПоля.Свойство("ТипОбъектов") Тогда
		
		Если (ТипОбъектов = ИТК_Перечисления.ЭлементДанныхЗапрос() И СписокЗапросов.Количество() < МинимальноеКоличествоОбъектовСравнения)
				ИЛИ (ТипОбъектов = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() И СписокСхемКомпоновкиДанных.Количество() < МинимальноеКоличествоОбъектовСравнения) Тогда
			НедостаточноДанных = Истина;
		КонецЕсли;

	КонецЕсли;
	
	Если НедостаточноДанных Тогда
		
		ПоказатьПредупреждение( , НСтр("ru = 'Недостаточно данных для сравнения. Данные должны быть проверены и не иметь ошибок.';
										|en = 'Not enough data to compare. The data should be checked and there should be no errors.'"), , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;
	
	ТипОбъектов = СтрокаЭталон.Тип;
	НеизменяемыеПоля.Вставить("ТипОбъектов");
	Если ТипОбъектов = ИТК_Перечисления.ЭлементДанныхКод() Тогда
		НеизменяемыеПоля.Вставить("ТипСравнения");
	КонецЕсли;

	ПараметрыФормы.Вставить("ТипОбъектов", ТипОбъектов);
	ПараметрыФормы.Вставить("ТипСравнения", ТипСравнения);
	ПараметрыФормы.Вставить("НеизменяемыеПоля", НеизменяемыеПоля);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаСравненияЗавершена", ЭтотОбъект);
	ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.НастройкаСравнения", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРабочиеДанные(РабочиеДанные, Тип = Неопределено, Имя = "", Комментарий = "")
	
	РабочиеДанные.Тип = Тип;
	РабочиеДанные.Имя = Имя;
	РабочиеДанные.Комментарий = Комментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеВНастройки(Имя)
	
	Состояние(НСтр("ru = 'Сохранение настройки:';
					|en = 'Saving settings:'"), , Имя, БиблиотекаКартинок.ИТК_ДлительнаяОперацияАнимация48);
	
	СохранитьИзмененныеДанныеСтроки();
	СохранитьДанныеВНастройкиСервер(Имя);
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьМодифицированность(ЭтотОбъект);
	ПослеСохраненияДанных();
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзНастроек(Имя, Пользователь = Неопределено, Объединение = Ложь)
	
	Если Объединение Тогда
		ЗаголовокСостояния = НСтр("ru = 'Объединение с настройкой';
									|en = 'Merge with customization'");
	Иначе
		ЗаголовокСостояния = НСтр("ru = 'Загрузка настройки';
									|en = 'Loading settings'");
	КонецЕсли;
	
	Если Пользователь = Неопределено Тогда
		Пояснение = Имя;
	Иначе
		Пояснение = СтрШаблон("%1\%2", Пользователь, Имя);
	КонецЕсли;
	
	Состояние(ЗаголовокСостояния, , Пояснение, БиблиотекаКартинок.ИТК_ДлительнаяОперацияАнимация48);
	
	ЗагрузитьДанныеИзНастроекСервер(Имя, Пользователь, Объединение);
	АктивироватьСтрокуДереваДанныхПослеОбновления();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРезультатВыполнения(Результат)
	
	РежимВыполнения = Результат.РежимВыполнения;
	РезультатКоличество = ИТК_ОбщийКлиентСервер.Свойство(Результат, "Количество");
	
	АдресРезультата = Результат.АдресРезультата;
	РезультатОбновления = ОбновитьРезультатСервер(Результат.АдресРезультата);
	
	// Заполнение данных текущего результата
	ЗаполнитьЗначенияСвойств(ТекущийРезультат, Результат);
	
	ТекущийРезультат.Пустой = Ложь;
	ТекущийРезультат.АктуаленПоСтроке = ТекущаяСтрока.UID;
	ТекущийРезультат.Представление = ПолноеПредставлениеСтрокиДереваЗапросов(ТекущаяСтрока);
	ТекущийРезультат.ОкончаниеВыполненияНаКлиенте = ИТК_ОбщийВызовСервера.ТекущаяДатаСервера();
	
	ТекущийРезультат.Адрес = АдресРезультата;
	
	Если РежимВыполнения = ИТК_Перечисления.РежимВыполненияКодаВыполнение()
			ИЛИ РежимВыполнения = ИТК_Перечисления.РежимВыполненияКодаНаКлиенте() Тогда
		
		ТекущаяСтраница = Элементы.СтраницаРезультатКод;
		ТекущийЭлементНовый = Элементы.ПанельРезультат;
		
	Иначе
		
		СкорректироватьВыделениеВТабличномДокументеРезультата(Элементы.ТабличныйДокументРезультат, ТабличныйДокументРезультат, РезультатОбновления);
		
		// Фиксация шапки в табличном документе
		Если Результат.Свойство("КоличествоЗапросовСРезультатом") Тогда
			
			ЗапросСОднимРезультатом = (Результат.КоличествоЗапросовСРезультатом = 1);
			ФиксацияШапкиДоступность = ЗапросСОднимРезультатом;
			ФиксацияШапки = ЗапросСОднимРезультатом;
			
		Иначе
			
			ФиксацияШапки = Ложь;
			ФиксацияШапкиДоступность = Ложь;
			
		КонецЕсли;
		
		Элементы.КнопкаФиксацияШапки.Доступность = ФиксацияШапкиДоступность;
		Элементы.КнопкаФиксацияШапки.Пометка = ФиксацияШапки;
		ИТК_ТабличныйДокументКлиентСервер.ЗафиксироватьШапку(ТабличныйДокументРезультат, ФиксацияШапки);
		
		ИТК_ТабличныйДокументКлиентСервер.ОбновитьЭлементыПодменюУровеньГруппировок(
			Элементы.ТабличныйДокументРезультатКонтекстноеМенюУровеньГруппировки, ТабличныйДокументРезультат);
		
		ТекущаяСтраница = Элементы.СтраницаРезультатТабличныйДокумент;
		ТекущийЭлементНовый = Элементы.ТабличныйДокументРезультат;
		
	КонецЕсли;
	
	ИТК_ФормаКлиентСервер.ПоказатьГруппу(Элементы.ПанельРезультат);
	Элементы.СтраницыРезультат.ТекущаяСтраница = ТекущаяСтраница;
	ТекущийЭлемент = ТекущийЭлементНовый;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьРезультатСервер(АдресРезультата = Неопределено)
	
	ИТК_ВременноеХранилище.Удалить(ТекущийРезультат.Адрес);
	ИТК_ВременноеХранилище.Удалить(ТекущийРезультат.АдресСхемыКомпоновкиДанных);
	ИТК_ВременноеХранилище.Удалить(ТекущийРезультат.АдресДанныхРасшифровки);
	ИТК_ВременноеХранилище.Удалить(ТекущийРезультат.АдресИсполняемыхЗапросовСКД);
	
	ТабличныйДокументРезультат.Очистить();
	РезультатСообщения.Очистить();
	
	Если НЕ ЗначениеЗаполнено(АдресРезультата) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) = Тип("ТабличныйДокумент") Тогда
		
		ТабличныйДокументРезультат = Результат;
		
		ОписаниеТабличногоДокумента = Новый Структура;
		ОписаниеТабличногоДокумента.Вставить("ВысотаТаблицы", Результат.ВысотаТаблицы);
		ОписаниеТабличногоДокумента.Вставить("ШиринаТаблицы", Результат.ШиринаТаблицы);
		Возврат ОписаниеТабличногоДокумента;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Элементы.РезультатКодГруппа.Видимость = Истина;
		
		ПредставлениеРезультата = ИТК_КодКлиентСервер.СокращенноеПредставлениеРезультата(Результат.Результат);
		Элементы.РезультатКодДекорацияЗначение.Заголовок = ПредставлениеРезультата;
		
		Попытка
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат.Результат, УникальныйИдентификатор);
		Исключение
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТипЗнч(Результат.Результат), УникальныйИдентификатор);
		КонецПопытки;
		ТекущийРезультат.Адрес = АдресВоВременномХранилище;
		
		Сообщения = Результат.Сообщения;
		Если Сообщения <> Неопределено Тогда
			
			ТекущийРезультат.АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(Результат.Сообщения, УникальныйИдентификатор);
			ЗначениеВРеквизитФормы(Результат.Сообщения, "РезультатСообщения");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПодготовкиСравнения(Результат, ДополнительныеПараметры) Экспорт

	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СравнениеРезультатов = Новый Структура;
	
	РезультатСравнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	СравнениеРезультатов.Вставить("Результат", РезультатСравнения);
	
	СравнениеРезультатов.Вставить("ИмяПервогоФайла", ДополнительныеПараметры.ИмяПервогоФайла);
	СравнениеРезультатов.Вставить("ИмяВторогоФайла", ДополнительныеПараметры.ИмяВторогоФайла);
	
	ПодключитьОбработчикОжидания("ПодключаемыйЗавершениеСравнениеРезультатов", 0.1, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйЗавершениеСравнениеРезультатов()

	#Если ТолстыйКлиентУправляемоеПриложение Тогда
	
	ИмяПервогоФайла = СравнениеРезультатов.ИмяПервогоФайла;
	ИмяВторогоФайла = СравнениеРезультатов.ИмяВторогоФайла;
	РезультатСравнения = СравнениеРезультатов.Результат;
	
	НаименованиеОперации = НСтр("ru = 'Сохранение файлов для сравнения';
								|en = 'Save files for comparison'");
	Состояние(НаименованиеОперации, , НСтр("ru = '(1/2) Сохранение файла эталон';
											|en = '(1/2) Saving the master file'"), БиблиотекаКартинок.ИТК_ДлительнаяОперацияАнимация48);
	РезультатСравнения.Эталон.Записать(ИмяПервогоФайла, ТипФайлаТабличногоДокумента.MXL);
	
	Состояние(НаименованиеОперации, , НСтр("ru = '(2/2) Сохранение файла новый';
											|en = '(2/2) Saving the file new'"), БиблиотекаКартинок.ИТК_ДлительнаяОперацияАнимация48);
	РезультатСравнения.Новый.Записать(ИмяВторогоФайла, ТипФайлаТабличногоДокумента.MXL);
	
	ИТК_ДлительныеОперацииКлиент.СкрытьПрогресс(ЭтотОбъект);
	
	ИТК_ФормаКлиент.ПоказатьСравнениеФайловМодально(ИмяПервогоФайла, ИмяВторогоФайла, СпособСравненияФайлов.ТабличныйДокумент);
	
	#КонецЕсли

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьПодготовкуСравненияНаСервере(Знач ДанныеЭталон, Знач ДанныеНовый, УникальныйИдентификатор, ФоновоеВыполнение)

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Эталон", ПодготовитьДанныеПередВыполнениемНаСервере(ДанныеЭталон));
	ПараметрыПроцедуры.Вставить("Новый", ПодготовитьДанныеПередВыполнениемНаСервере(ДанныеНовый));
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор, ФоновоеВыполнение);
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_КонсольРазработчика.ПодготовитьДанныеДляСравнения", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДеревоДанныхИмя", Новый Структура("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный()), "ДеревоДанных.Выделение", Истина);
	
	ОформлениеПоля = Новый Структура;
	ОформлениеПоля.Вставить("Текст", НСтр("ru = '<Результат>';
											|en = '<Result>'"));

	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "НастройкиВыводаТаблицИмя", ОформлениеПоля, "НастройкиВыводаТаблиц.Имя", "");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруЗапроса(Строка, Данные, Уровень = 0)
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Уровень = 0 Тогда
		ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапросПакета();
	Иначе
		ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапросВСтруктуре();
	КонецЕсли;
	
	Для Каждого Элемент Из Данные Цикл 
		
		НачальныеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ТипСтроки);
		НачальныеДанные.Вставить("ТекстИнициализации", Элемент.ТекстИнициализации);
		НачальныеДанные.Вставить("Текст", Элемент.Текст);
		НачальныеДанные.Вставить("Параметры", Элемент.Параметры);
		НачальныеДанные.Вставить("ИндексВСтруктуре", Элемент.Индекс);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Родитель", Строка);
		ДополнительныеПараметры.Вставить("Активизировать", Ложь);
		ДополнительныеПараметры.Вставить("НачальныеДанные", НачальныеДанные);
		ДополнительныеПараметры.Вставить("Картинка", Элемент.Картинка);
		ДополнительныеПараметры.Вставить("УстанавливатьМодифицированность", Ложь);
		
		НоваяСтрока = ДобавитьСтрокуВДеревоДанных(ТипСтроки, Элемент.Представление, ДополнительныеПараметры);
		
		Уровень = Уровень + 1;
		ОбновитьСтруктуруЗапроса(НоваяСтрока, Элемент.Элементы, Уровень);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруЗапросов(Объект, ОбновлениеСтруктуры = Истина)
	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		ОбрабатываемыеСтроки = Объект;
	Иначе
		ОбрабатываемыеСтроки = Новый Массив;
		ОбрабатываемыеСтроки.Добавить(Объект);
	КонецЕсли;
	
	// Обновление структуры
	ОбрабатываемыеСтрокиДанные = Новый Соответствие;
	Для Каждого ОбрабатываемаяСтрока Из ОбрабатываемыеСтроки Цикл 
		
		ДанныеСтроки = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОбрабатываемаяСтрока);
		Если ДанныеСтроки.Ошибка = Неопределено 
				И НЕ ДанныеСтроки.ТребуетсяПроверка Тогда
			ОбрабатываемыеСтрокиДанные.Вставить(ОбрабатываемаяСтрока.UID, ДанныеСтроки.Текст);
		КонецЕсли;
		
		ОбрабатываемаяСтрока.ПолучитьЭлементы().Очистить();
		
	КонецЦикла;
	
	Если ОбновлениеСтруктуры 
			И ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "РазбиратьСтруктуруЗапроса") Тогда
		
		СтруктурыСтрок = СтруктурыСтрокЗапросов(ОбрабатываемыеСтрокиДанные);
		Для Каждого ОбрабатываемаяСтрока Из ОбрабатываемыеСтроки Цикл 
			ОбновитьСтруктуруЗапроса(ОбрабатываемаяСтрока, СтруктурыСтрок.Получить(ОбрабатываемаяСтрока.UID));
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктурыСтрокЗапросов(ОбрабатываемыеСтрокиДанные)
	
	Результат = Новый Соответствие;
	Для Каждого ОбрабатываемаяСтрока Из ОбрабатываемыеСтрокиДанные Цикл 
		Результат.Вставить(ОбрабатываемаяСтрока.Ключ, ИТК_АнализЗапроса.РазборСтруктуры(ОбрабатываемаяСтрока.Значение));
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВопросПередУдалениемСтрокДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
	// Удаляем строки
	УдаляемыеСтроки = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоДанных.ВыделенныеСтроки Цикл 
		УдаляемыеСтроки.Добавить(ДеревоДанных.НайтиПоИдентификатору(ВыделеннаяСтрока));
	КонецЦикла;
	
	ИТК_КонсольРазработчикаДанныеКлиент.УдалитьСтроки(ЭтотОбъект, УдаляемыеСтроки);
	
	ОбновлениеЭлементовФормыПослеОжидания();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередУдалениемВнешнегоИсточникаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеАдреса = Новый Массив; УдаляемыеСтроки = Новый Массив;
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ВнешниеИсточники.ВыделенныеСтроки Цикл 
		
		ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
		СтрокаВнешнийИсточник = ВнешниеИсточники.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, СтрокаВнешнийИсточник.UID);
		
		Если ОписаниеВнешнегоИсточника <> Неопределено Тогда
			
			УдаляемыеАдреса.Добавить(ОписаниеВнешнегоИсточника.Значение);
			
		КонецЕсли;
		
		УдаляемыеСтроки.Добавить(СтрокаВнешнийИсточник);
		ИТК_КонсольРазработчикаДанныеКлиент.УдалитьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока, СтрокаВнешнийИсточник.UID);
		
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл 
		ВнешниеИсточники.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	ИТК_ВременноеХранилище.Удалить(УдаляемыеАдреса);
	
	ОбновитьИнформациюВнешнихИсточников();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеЗначенияВнешнегоИсточникаЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, ДополнительныеПараметры.UID);
	
	Если ОписаниеВнешнегоИсточника = Неопределено Тогда
		ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйВнешнийИсточник();
	КонецЕсли;
	
	ОписаниеВнешнегоИсточника.Значение = Результат;
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока, ДополнительныеПараметры.UID, ОписаниеВнешнегоИсточника);
	
	ЗагрузитьПользовательскиеОбъектыПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеЗначенияТаблицаМВТЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиент.ТаблицаМВТ(ТекущиеДанные, ДополнительныеПараметры.UID);
	
	Если ОписаниеТаблицыМВТ = Неопределено Тогда
		ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиентСервер.НоваяТаблицаМВТ();
	КонецЕсли;
	
	ОписаниеТаблицыМВТ.Значение = Результат;
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьТаблицуМВТ(ЭтотОбъект, ТекущаяСтрока, ДополнительныеПараметры.UID, ОписаниеТаблицыМВТ);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСложногоПараметраЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
	ИмяПараметра = ДополнительныеПараметры.Имя;
	НовоеЗначение = ИТК_ЗапросКлиентСервер.ЗначениеСложногоПараметра(ДополнительныеПараметры.ВидСложногоПараметра, Результат);
	
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, ИмяПараметра, НовоеЗначение);
	ПараметрЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	ОбновитьСтрокуПараметра(ПараметрЗапросаТекущиеДанные, ИмяПараметра, ПараметрЗапросаТекущиеДанные.ТипЗначения, НовоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВнешниеИсточники()

	ВнешниеИсточники.Очистить();
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	Для Каждого ВнешнийИсточник Из ИТК_КонсольРазработчикаДанныеКлиентСервер.ВнешниеИсточники(ТекущиеДанные) Цикл 
		
		ОписаниеВнешнегоИсточника = ВнешнийИсточник.Значение;
		НоваяСтрока = ВнешниеИсточники.Добавить();
		НоваяСтрока.Имя = ОписаниеВнешнегоИсточника.Имя;
		НоваяСтрока.Тип = ОписаниеВнешнегоИсточника.Тип;
		НоваяСтрока.UID = ВнешнийИсточник.Ключ;
		
		ОбновитьСтрокуВнешнийИсточник(НоваяСтрока);
		
	КонецЦикла;
	
	ОбновитьИнформациюВнешнихИсточников();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуВнешнийИсточник(Строка)
	
	Если Строка.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
		
		ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
		ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, Строка.UID);
		ПредставлениеВнешнегоИсточника = ИТК_Строки.Сокращенно(ОписаниеВнешнегоИсточника.Значение, 70);
		
	ИначеЕсли Строка.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
		
		ПредставлениеВнешнегоИсточника = НСтр("ru = '<Таблица значений>';
												|en = '<Table of values>'");
		
	КонецЕсли;
	
	Строка.Представление = ПредставлениеВнешнегоИсточника;
	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьЗначениеВнешнегоИсточникаКТипу(Значение, ИзТипа, КТипу)
	
	Если ИзТипа = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда 
		
		Если КТипу = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
			Возврат ИТК_КодВызовСервера.ТаблицаЗначений(Значение, "ТаблицаЗначений");
		КонецЕсли;
		
	ИначеЕсли ИзТипа = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда 
		
		Возврат ИТК_КодВызовСервера.ТаблицаЗначенийИзВыражения(Значение, УникальныйИдентификатор);

	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицыМВТ()
	
	ТаблицыМВТ.Очистить();
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	Для Каждого ТаблицаМВТ Из ИТК_КонсольРазработчикаДанныеКлиентСервер.ТаблицыМВТ(ТекущиеДанные) Цикл 
		
		ОписаниеТаблицыМВТ = ТаблицаМВТ.Значение;
		НоваяСтрока = ТаблицыМВТ.Добавить();
		НоваяСтрока.Имя = ОписаниеТаблицыМВТ.Имя;
		НоваяСтрока.Тип = ОписаниеТаблицыМВТ.Тип;
		НоваяСтрока.UID = ТаблицаМВТ.Ключ;
		
		ОбновитьСтрокуТаблицыМВТ(НоваяСтрока);
		
	КонецЦикла;
	
	ОбновитьКоличествоТаблицМВТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуТаблицыМВТ(Строка)
	
	Если Строка.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
		
		ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
		ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиент.ТаблицаМВТ(ТекущиеДанные, Строка.UID);
		ПредставлениеТаблицыМВТ = ИТК_Строки.Сокращенно(ОписаниеТаблицыМВТ.Значение, 70);
		
	ИначеЕсли Строка.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
		
		ПредставлениеТаблицыМВТ = НСтр("ru = '<Таблица значений>';
												|en = '<Table of values>'");
		
	КонецЕсли;
	
	Строка.Представление = ПредставлениеТаблицыМВТ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоТаблицМВТ()
	
	КоличествоТаблицМВТ = ТаблицыМВТ.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередУдалениемТаблицыМВТЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеАдреса = Новый Массив; УдаляемыеСтроки = Новый Массив;
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ТаблицыМВТ.ВыделенныеСтроки Цикл 
		
		ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
		СтрокаТаблицаМВТ = ТаблицыМВТ.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиент.ТаблицаМВТ(ТекущиеДанные, СтрокаТаблицаМВТ.UID);
		
		Если ОписаниеТаблицыМВТ <> Неопределено Тогда
			УдаляемыеАдреса.Добавить(ОписаниеТаблицыМВТ.Значение);
		КонецЕсли;
		
		УдаляемыеСтроки.Добавить(СтрокаТаблицаМВТ);
		ИТК_КонсольРазработчикаДанныеКлиент.УдалитьТаблицуМВТ(ЭтотОбъект, ТекущаяСтрока, СтрокаТаблицаМВТ.UID);
		
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл 
		ТаблицыМВТ.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	ИТК_ВременноеХранилище.Удалить(УдаляемыеАдреса);
	
	ОбновитьКоличествоТаблицМВТ();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранениеНастройкиЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СохранитьДанныеВНастройки(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНастройкиЗавершена(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ЗагрузитьДанныеИзНастроек(Результат.Имя, Результат.Пользователь, ДополнительныеПараметры.Объединение);
		
	Иначе
		
		ЗагрузитьДанныеИзНастроек(Результат, , ДополнительныеПараметры.Объединение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСравненияЗавершена(ПараметрыСравнения, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыСравнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ИТК_ФормаКлиент.ВозможенЗапускСравненияПредупреждение(ПараметрыСравнения.ТипСравнения) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЭталон = НайтиСтрокуПоUID(ДеревоДанных, ПараметрыСравнения.ОбъектЭталон);
	СтрокаНовый = НайтиСтрокуПоUID(ДеревоДанных, ПараметрыСравнения.ОбъектНовый);
	
	ДанныеЭталон = ПодготовитьДанныеПередВыполнением(СтрокаЭталон);
	ДанныеНовый = ПодготовитьДанныеПередВыполнением(СтрокаНовый);
	
	Если ПараметрыСравнения.ТипСравнения = ИТК_Перечисления.ВариантСравненияДанныхТексты() Тогда
		
		Текст1 = ПолучитьТекстДляСравнения(ДанныеЭталон);
		Текст2 = ПолучитьТекстДляСравнения(ДанныеНовый);
		
		Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиЗапрос(СтрокаЭталон.Тип) Тогда
			ТипЯзыка = ИТК_Перечисления.ТипЯзыкаРедактораЗапросы();
		ИначеЕсли СтрокаЭталон.Тип = ИТК_Перечисления.ЭлементДанныхКод() Тогда
			ТипЯзыка = ИТК_Перечисления.ТипЯзыкаРедактораВстроенный();
		ИначеЕсли ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(СтрокаЭталон.Тип) Тогда
			ТипЯзыка = ИТК_Перечисления.ТипЯзыкаРедактораXML();
		Иначе 
			ТипЯзыка = Неопределено;
		КонецЕсли;
		
		ИТК_ФормаКлиент.ОткрытьСравнениеТекстов(ЭтотОбъект, Текст1, Текст2, ТипЯзыка);
		
	ИначеЕсли ПараметрыСравнения.ТипСравнения = ИТК_Перечисления.ВариантСравненияДанныхРезультаты() Тогда
		
		#Если ТолстыйКлиентУправляемоеПриложение Тогда
			
			ОписаниеОперации = Новый Структура;
			ОписаниеОперации.Вставить("Источник", ИТК_Перечисления.ИнструментКонсольРазработчика());
			ОписаниеОперации.Вставить("Наименование", НСтр("ru = 'Подготовка сравнения';
															|en = 'Comparison preparation'"));
			
			Расширение = "mxl";
			ИмяПервогоФайла = ПолучитьИмяВременногоФайла(Расширение);
			ИмяВторогоФайла = ПолучитьИмяВременногоФайла(Расширение);
			
			ИТК_ДлительныеОперацииКлиент.НачатьОперацию(ЭтотОбъект, Новый ОписаниеОповещения("НачалоДлительнойОперации", ЭтотОбъект), ОписаниеОперации);
			
			ФоновоеВыполнение = ИТК_БСПКлиентСервер.ВозможноВыполнениеВФоне();
			ДлительнаяОперация = ЗапуститьПодготовкуСравненияНаСервере(ДанныеЭталон, ДанныеНовый, УникальныйИдентификатор, ФоновоеВыполнение);
			ИТК_ДлительныеОперацииКлиент.ЗаполнитьОписаниеОперации(ДлительнаяОперация, ОписаниеОперации);
			
			ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработкаПрогрессаВыполненияДлительнойОперации", ЭтотОбъект);
			ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект, ОповещениеОПрогрессеВыполнения);
			
			ИТК_ДлительныеОперацииКлиент.ДобавитьОповещениеПользователя(ЭтотОбъект, ПараметрыОжидания);
			
			ДополнительныеПараметры = Новый Структура("ИмяПервогоФайла, ИмяВторогоФайла", ИмяПервогоФайла, ИмяВторогоФайла);
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеПодготовкиСравнения", ЭтотОбъект, ДополнительныеПараметры);
			ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
			
		#КонецЕсли
		
	ИначеЕсли ПараметрыСравнения.ТипСравнения = ИТК_Перечисления.ВариантСравненияКодСхемыЗапроса() Тогда
		
		Текст1 = ПолучитьТекстДляСравнения(ДанныеЭталон, ПараметрыСравнения.ТипСравнения);
		Текст2 = ПолучитьТекстДляСравнения(ДанныеНовый, ПараметрыСравнения.ТипСравнения);
		
		ТипЯзыка = ИТК_Перечисления.ТипЯзыкаРедактораВстроенный();
		ИТК_ФормаКлиент.ОткрытьСравнениеТекстов(ЭтотОбъект, Текст1, Текст2, ТипЯзыка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеЗначенияПараметраЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
		
	ПараметрЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, ПараметрЗапросаТекущиеДанные.Имя, Результат);
	ОбновитьСтрокуПараметра(ПараметрЗапросаТекущиеДанные, ПараметрЗапросаТекущиеДанные.Имя, ПараметрЗапросаТекущиеДанные.ТипЗначения, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияПараметраЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	НовоеЗначение = Неопределено;
	ЕстьРезультат = ИТК_ФормаКлиент.ОбработкаЗавершенВводЗначенияВФорме(Элементы.ПараметрыЗапросаЗначениеПредставление, Результат, ДополнительныеПараметры,
																НовоеЗначение, ПараметрЗапросаТекущиеДанные.ТипЗначения); 
																
	Если ТипЗнч(НовоеЗначение) = Тип("Граница") Тогда
				
		НовоеЗначение = ИТК_ЗапросКлиентСервер.ЗначениеСложногоПараметра(ИТК_Перечисления.СложныйПараметрЗапросаГраница(),
														ИТК_Запрос.ОписаниеИзГраницы(НовоеЗначение));
				
	КонецЕсли;
																
	Если ЕстьРезультат Тогда
		
		ИмяПараметра = ПараметрЗапросаТекущиеДанные.Имя;
		ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, ИмяПараметра, НовоеЗначение);
		ОбновитьСтрокуПараметра(ПараметрЗапросаТекущиеДанные, ИмяПараметра, ПараметрЗапросаТекущиеДанные.ТипЗначения, НовоеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразованиеТипаЗначенияПараметраЗавершено(ОписаниеТипов, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеТипов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ВыбранныйТипЗначения = ОписаниеТипов.Типы()[0];
	Для Каждого ИдентификаторСтрокиПараметр Из Элементы.ПараметрыЗапроса.ВыделенныеСтроки Цикл 
		
		СтрокаПараметр = ПараметрыЗапроса.НайтиПоИдентификатору(ИдентификаторСтрокиПараметр);
		
		Если НЕ (СтрокаПараметр.ТипЗначения.СодержитТип(ВыбранныйТипЗначения)
					ИЛИ СтрокаПараметр.ТипЗначения.СодержитТип(Тип("Дата"))) Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеЗначение = Неопределено;
		СтароеЗначение = ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(ТекущиеДанные, СтрокаПараметр.Имя, СтрокаПараметр.ТипЗначения);
		Если ТипЗнч(СтароеЗначение) = Тип("Дата") Тогда
			
			Если ВыбранныйТипЗначения = Тип("Граница") Тогда
				
				НовоеЗначение = ИТК_ЗапросКлиентСервер.ЗначениеСложногоПараметра(ИТК_Перечисления.СложныйПараметрЗапросаГраница(),
				ИТК_ЗапросКлиентСервер.ОписаниеГраницы(СтароеЗначение));
				
			ИначеЕсли ВыбранныйТипЗначения = Тип("МоментВремени") Тогда
				
				НовоеЗначение = ИТК_ОбщийВызовСервера.НовыйМоментВремени(СтароеЗначение);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(СтароеЗначение) = Тип("МоментВремени") Тогда
			
			Если ВыбранныйТипЗначения = Тип("Дата") Тогда
				НовоеЗначение = ИТК_Запрос.ДатаИзМоментаВремени(СтароеЗначение);
			ИначеЕсли ВыбранныйТипЗначения = Тип("Граница") Тогда
				
				НовоеЗначение = ИТК_ЗапросКлиентСервер.ЗначениеСложногоПараметра(ИТК_Перечисления.СложныйПараметрЗапросаГраница(),
				ИТК_ЗапросКлиентСервер.ОписаниеГраницы(СтароеЗначение));
				
			КонецЕсли;
			
		ИначеЕсли ИТК_ОбщийКлиентСервер.ЭтоЗначениеПараметраГраница(СтароеЗначение) Тогда
			
			ОписаниеЗначенияПараметра = СтароеЗначение.Значение;
			Если ВыбранныйТипЗначения = Тип("Дата") Тогда
				НовоеЗначение = ИТК_Запрос.ДатаИзОписанияГраницы(ОписаниеЗначенияПараметра);
			ИначеЕсли ВыбранныйТипЗначения = Тип("МоментВремени") Тогда
				НовоеЗначение = ИТК_Запрос.МоментВремениИзОписанияГраницы(ОписаниеЗначенияПараметра);
			КонецЕсли;
			
		КонецЕсли;
		
		Если НовоеЗначение = Неопределено Тогда
			НовоеЗначение = ОписаниеТипов.ПривестиЗначение(Неопределено);
		КонецЕсли;
		
		ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, СтрокаПараметр.Имя, НовоеЗначение);
		ОбновитьСтрокуПараметра(СтрокаПараметр, СтрокаПараметр.Имя, СтрокаПараметр.ТипЗначения, НовоеЗначение);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДанныеЗаполненияПараметров(Имена, ИсточникСтрок)
	
	ДанныеЗаполнения = Новый Массив;
	Для Каждого СтрокаДерева Из ИсточникСтрок.ПолучитьЭлементы() Цикл 
		
		Если СтрокаДерева = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
			
			ЗначенияПараметров = ПодготовитьЗначенияПараметровДляЗаполнения(Имена, СтрокаДерева);
			
			Если ЗначениеЗаполнено(ЗначенияПараметров) Тогда
				
				ОписаниеСтроки = Новый Структура;
				ОписаниеСтроки.Вставить("Имя", СтрокаДерева.Имя);
				ОписаниеСтроки.Вставить("Выделение", СтрокаДерева.Выделение);
				ОписаниеСтроки.Вставить("Картинка", СтрокаДерева.Картинка);
				ОписаниеСтроки.Вставить("Параметры", ЗначенияПараметров);
				
				ДанныеЗаполнения.Добавить(ОписаниеСтроки);
				
			КонецЕсли;
			
		ИначеЕсли СтрокаДерева.Тип = ИТК_Перечисления.ЭлементДанныхГруппа() Тогда
			
			Строки = ПодготовитьДанныеЗаполненияПараметров(Имена, СтрокаДерева);
			
			Если ЗначениеЗаполнено(Строки) Тогда
				ОписаниеСтроки = Новый Структура;
				ОписаниеСтроки.Вставить("Имя", СтрокаДерева.Имя);
				ОписаниеСтроки.Вставить("Выделение", СтрокаДерева.Выделение);
				ОписаниеСтроки.Вставить("Картинка", СтрокаДерева.Картинка);
				ОписаниеСтроки.Вставить("Строки", Строки);
				
				ДанныеЗаполнения.Добавить(ОписаниеСтроки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьЗначенияПараметровДляЗаполнения(Имена, СтрокаДерева)
	
	НесколькоПараметров = (Имена.Количество() > 1);
	ЗначенияПараметров = Новый Соответствие;
	
	ДанныеСтроки = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(СтрокаДерева);
	
	Для Каждого ПараметрИсточник Из ДанныеСтроки.ЗначенияПараметров Цикл 
		
		ДобавляемЭтоЗначение = Ложь;
		Если НесколькоПараметров Тогда
			
			Если Имена.Найти(ПараметрИсточник.Ключ) <> Неопределено 
					И ПодходящийПараметрДляЗаполнения(ПараметрИсточник.Ключ, ПараметрИсточник.Ключ, ТекущаяСтрока, СтрокаДерева) Тогда
				ДобавляемЭтоЗначение = Истина;
			КонецЕсли;
			
		Иначе
			
			Если ПодходящийПараметрДляЗаполнения(Имена[0], ПараметрИсточник.Ключ, ТекущаяСтрока, СтрокаДерева) Тогда
				ДобавляемЭтоЗначение = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДобавляемЭтоЗначение Тогда
			ЗначенияПараметров.Вставить(ПараметрИсточник.Ключ, ПараметрИсточник.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗначенияПараметров;
	
КонецФункции

&НаКлиенте
Функция ПодходящийПараметрДляЗаполнения(ИмяПриемник, ИмяИсточник, СтрокаПриемника, СтрокаИсточника)
	
	Результат = Ложь;
	
	Приемник = ДанныеПараметраЗапроса(СтрокаПриемника, ИмяПриемник);
	Источник = ДанныеПараметраЗапроса(СтрокаИсточника, ИмяИсточник);
	
	Если (Приемник.Значение <> Источник.Значение 
				ИЛИ  ИТК_КонсольРазработчикаДанныеКлиентСервер.ТипПараметраТаблицаЗначений(Приемник.ОписаниеТипов))
			И (Приемник.ОписаниеТипов = Источник.ОписаниеТипов
				ИЛИ (ТипЗнч(Приемник.ОписаниеТипов) = Тип("ОписаниеТипов") И Приемник.ОписаниеТипов.СодержитТип(ТипЗнч(Источник.Значение)))
				ИЛИ (Приемник.ОписаниеТипов.СодержитТип(Тип("Дата")) 
							И (ИТК_ОбщийКлиентСервер.ЭтоЗначениеПараметраГраница(Источник.Значение)
								ИЛИ ТипЗнч(Источник.Значение) = Тип("МоментВремени")))) Тогда
				
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеПараметровЗакончено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеПараметры.Свойство("Имя") Тогда
		
		ЗаполнитьЗначениеПараметра(ДополнительныеПараметры.Имя, Результат);
		
	Иначе
		
		Для Каждого ЗначениеПараметра Из Результат Цикл 
			ЗаполнитьЗначениеПараметра(ЗначениеПараметра.Ключ, ЗначениеПараметра.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьЗакладкуПараметры();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначениеПараметра(ИмяПараметраПриемника, Значение)
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	СтароеЗначениеПараметра = ТекущиеДанные.ЗначенияПараметров.Получить(ИмяПараметраПриемника);
	
	Если ТипЗнч(СтароеЗначениеПараметра) = Тип("Структура")
			И СтароеЗначениеПараметра.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
		ИТК_ВременноеХранилище.Удалить(СтароеЗначениеПараметра.Значение);
	КонецЕсли;
	
	ЗначениеПараметра = СкопироватьЗначениеПараметра(Значение);
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, ИмяПараметраПриемника, ЗначениеПараметра);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереименованиеПараметраЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
	
	СтароеИмя = ДополнительныеПараметры.Имя;
	НовоеИмя = Результат;
	
	// Заменить в тексте параметр
	НовыйТекст = ИТК_ЗапросКлиентСервер.ЗаменитьПараметрВТексте(ТекущиеДанные.Текст, СтароеИмя, "&" + НовоеИмя);
	ИзменяемыеПоля.Вставить("Текст", НовыйТекст);
	
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
	
	// Перенести значение для нового параметра
	ЗначенияПараметров = ТекущиеДанные.ЗначенияПараметров;
	ЗначенияПараметров.Вставить(НовоеИмя, ЗначенияПараметров[СтароеИмя]);
	
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
	ПроверитьПоказатьОшибку();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Функция СкопироватьЗначениеПараметра(Результат)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Вид = ИТК_Перечисления.СложныйПараметрЗапросаВыражение() Тогда
			НовоеЗначение = ИТК_ОбщийКлиентСервер.СкопироватьОбъект (Результат);
		ИначеЕсли Результат.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
			НовоеЗначение = ИТК_ОбщийКлиентСервер.СкопироватьОбъект (Результат);
			НовоеЗначение.Значение = ИТК_ОбщийВызовСервера.КопияТаблицыЗначений(Результат.Значение, УникальныйИдентификатор);
		ИначеЕсли Результат.Вид = ИТК_Перечисления.СложныйПараметрЗапросаГраница() Тогда
			НовоеЗначение = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(Результат);
		КонецЕсли;
		
	Иначе 
		
		НовоеЗначение = Результат;
		
	КонецЕсли;
	
	Возврат НовоеЗначение;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьПолучениеРезультатаДляОбработкиНаСервере(Знач Данные, УникальныйИдентификатор, ФоновоеВыполнение = Истина)

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Данные", ПодготовитьДанныеПередВыполнениемНаСервере(Данные));
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор, ФоновоеВыполнение);
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_Запрос.РезультатДляОбработки", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПолученияРезультатаДляОбработки(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	
	РезультатВыполнения = ПрочитатьРезультатВыполненияДанных(Результат, УникальныйИдентификатор);

	ОбработаннаяСтрока = НайтиСтрокуПоUID(ДеревоДанных, ДополнительныеПараметры.UID);
	
	Если ОбработаннаяСтрока <> Неопределено Тогда
		
		ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОбработаннаяСтрока);
		
		Если ЗначениеЗаполнено(РезультатВыполнения.Ошибка) Тогда
			
			ТекущиеДанные.ОшибкаПриВыполнении = РезультатВыполнения.Ошибка;
			ОбновитьЭлементыОшибки();
			ПоказатьОшибку();
			
		Иначе 
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Алгоритмы", ТекущиеДанные.АлгоритмыОбработки);
			ПараметрыФормы.Вставить("АдресОбрабатываемыхДанных", РезультатВыполнения.АдресРезультата);
			ПараметрыФормы.Вставить("Данные", ТекущиеДанные);
			
			ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.ОбработкаРезультата", ПараметрыФормы, ЭтотОбъект, , , ,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИТК_ДлительныеОперацииКлиент.СкрытьПрогресс(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВКомпоновщикНастроек(ДанныеСКД)
	
	СхемаКомпоновкиДанных = ИТК_СКД.СхемаКомпоновкиДанных(ДанныеСКД.XMLСхемаКомпоновкиДанных);
	АдресВременногоХранилищаСхемыКомпоновкиДанных = ИТК_ВременноеХранилище.Поместить(СхемаКомпоновкиДанных, АдресВременногоХранилищаСхемыКомпоновкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВременногоХранилищаСхемыКомпоновкиДанных));
	
	Если ДанныеСКД.Свойство("XMLВариантОтчета") И ЗначениеЗаполнено(ДанныеСКД.XMLВариантОтчета) Тогда
		НастройкиВарианта = ИТК_СКД.ВариантНастроек(ДанныеСКД.XMLВариантОтчета);
	Иначе
		НастройкиВарианта = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	
	Если ДанныеСКД.Свойство("XMLПользовательскиеНастройки") Тогда
		ПользовательскиеНастройки = ИТК_СКД.ПользовательскиеНастройки(ДанныеСКД.XMLПользовательскиеНастройки);
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолныеДанныеСКД(Строка)
	
	Результат = Новый Структура;
	
	СтрокаВариантаОтчета = Неопределено;
	СтрокаПользовательскихНастроек = Неопределено;
	Если Строка.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
		
		СтрокаСхемыКомпоновкиДанных = Строка;
		
	ИначеЕсли Строка.Тип = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД() Тогда
		
		СтрокаВариантаОтчета = Строка;
		СтрокаСхемыКомпоновкиДанных = Строка.ПолучитьРодителя();
		
	ИначеЕсли Строка.Тип = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД() Тогда
		
		СтрокаПользовательскихНастроек = Строка;
		РодительСтроки = Строка.ПолучитьРодителя();
		
		Если РодительСтроки.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
			СтрокаСхемыКомпоновкиДанных = РодительСтроки;
		ИначеЕсли РодительСтроки.Тип = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД() Тогда
			СтрокаВариантаОтчета = РодительСтроки;
			СтрокаСхемыКомпоновкиДанных = РодительСтроки.ПолучитьРодителя();
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаСхемыКомпоновкиДанных <> Неопределено Тогда
		
		ДанныеСхемаКомпоновкиДанных = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(СтрокаСхемыКомпоновкиДанных);
		Результат.Вставить("XMLСхемаКомпоновкиДанных", ДанныеСхемаКомпоновкиДанных.Текст);
		Результат.Вставить("ИспользованиеВнешнихФункций", ДанныеСхемаКомпоновкиДанных.ИспользованиеВнешнихФункций);
		Результат.Вставить("ВнешниеИсточники", ДанныеСхемаКомпоновкиДанных.ВнешниеИсточники);
		Результат.Вставить("ТаблицыМВТ", ДанныеСхемаКомпоновкиДанных.ТаблицыМВТ);
		
	КонецЕсли;
	
	Если СтрокаВариантаОтчета <> Неопределено Тогда
		Результат.Вставить("XMLВариантОтчета", ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(СтрокаВариантаОтчета).Текст);	
	КонецЕсли;
	
	Если СтрокаПользовательскихНастроек <> Неопределено Тогда
		Результат.Вставить("XMLПользовательскиеНастройки", ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(СтрокаПользовательскихНастроек).Текст);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СохранитьИзмененныеДанныеСтроки()
	
	Если ИдентификаторПоследнейВыделеннойСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = ДеревоДанных.НайтиПоИдентификатору(ИдентификаторПоследнейВыделеннойСтроки);
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтроки = Строка.Тип;
	Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемТекста(ТипСтроки) Тогда
		
		ЭлементТекст = ЭлементТекстПоТипуСтроки(ТипСтроки);
		
		ГраницыВыделения = ИТК_РедакторКодаКлиент.ГраницыВыделения(ЭлементТекст);
		Если ГраницыВыделения <> Неопределено Тогда
			ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, Строка, "ГраницыВыделенияТекста", ГраницыВыделения, Ложь);
		КонецЕсли;
			
		Закладки = ИТК_РедакторКодаКлиент.УстановленныеЗакладки(ЭлементТекст);
		Если Закладки <> Неопределено Тогда
			ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, Строка, "Закладки", Закладки, Ложь);
		КонецЕсли;
	 	
		СостояниеРедактора = ИТК_РедакторКодаКлиент.СостояниеРедактора(ЭлементТекст);
		Если СостояниеРедактора <> Неопределено Тогда
			ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, Строка, "СостояниеРедактора", СостояниеРедактора, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипСтроки = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД() Тогда
		
		АдресЗначения = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПользовательскиеНастройки);
		ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, Строка, "Текст", ИТК_СКД.XMLТекстИзАдреса(АдресЗначения));
		
	ИначеЕсли ТипСтроки = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД() Тогда
		
		АдресЗначения = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки);
		ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, Строка, "Текст", ИТК_СКД.XMLТекстИзАдреса(АдресЗначения));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДанныеПередВыполнением(Строка)
	
	Результат = Новый Структура;
	
	Если ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(Строка.Тип) Тогда
		
		Результат = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ИТК_Перечисления.ЭлементДанныхЗапрос());
		ДанныеСтроки = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(Строка);
		
		ДанныеОсновногоЗапроса = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОсновнойЗапрос(Строка));
		ЗаполнитьЗначенияСвойств(Результат, ДанныеОсновногоЗапроса);
		
		Результат.Текст = ДанныеСтроки.Текст;
		Результат.Вставить("ТекстИнициализации", ДанныеСтроки.ТекстИнициализации);
		
	ИначеЕсли ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСКД(Строка.Тип) Тогда
		
		ДанныеСКД = ПолныеДанныеСКД(Строка);
		Для Каждого ПараметрДанныхСКД Из ДанныеСКД Цикл 
			Результат.Вставить(ПараметрДанныхСКД.Ключ, ПараметрДанныхСКД.Значение);
		КонецЦикла;
		
	Иначе
		
		Результат = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(Строка);
		
	КонецЕсли;
	
	Результат.Вставить("Тип", Строка.Тип);
	Результат.Вставить("Представление", Строка.Имя);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекстДляСравнения(Данные, ТипСравнения = Неопределено)
	
	ТипДанных = Данные.Тип;
	Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиЗапрос(ТипДанных)
			ИЛИ ТипДанных = ИТК_Перечисления.ЭлементДанныхКод() Тогда
		
		Если ТипСравнения = ИТК_Перечисления.ВариантСравненияКодСхемыЗапроса() Тогда
			
			НастройкиГенерации = Новый Структура;
			НастройкиГенерации.Вставить("Язык", ИТК_ОбщийВызовСервера.КодЯзыкаПрограммирования());
			НастройкиГенерации.Вставить("ДобавлятьКомментарии", Ложь);
			НастройкиГенерации.Вставить("ДобавлятьЗначенияСвойствПоУмолчанию", Ложь);
			
			Результат = ИТК_Код.СхемаЗапроса(Данные, НастройкиГенерации);
			
		Иначе
			Результат = Данные.Текст;
		КонецЕсли;
		
	ИначеЕсли ТипДанных = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
		Результат = Данные.XMLСхемаКомпоновкиДанных;
	ИначеЕсли ТипДанных = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД() Тогда
		Результат = Данные.XMLВариантОтчета;
	ИначеЕсли ТипДанных = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД() Тогда
		Результат = Данные.XMLПользовательскиеНастройки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СписокДоступенДляПараметра(Значение, ОписаниеТипов)
	
	Возврат НЕ (ИТК_КонсольРазработчикаДанныеКлиентСервер.ТипПараметраТаблицаЗначений(ОписаниеТипов) 
					ИЛИ ТипЗнч(Значение) = Тип("МоментВремени")
					ИЛИ ТипЗнч(Значение) = Тип("Граница")
					ИЛИ ИТК_ОбщийКлиентСервер.ЭтоЗначениеПараметраГраница(Значение));
	
КонецФункции

&НаКлиенте
Процедура ВводИдентификатораВнешнегоИсточникаЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВнешниеИсточникиТекущиеДанные = Элементы.ВнешниеИсточники.ТекущиеДанные;
	ВнешниеИсточникиТекущиеДанные.Имя = Результат;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ОписаниеВнешнегоИсточника = ИТК_КонсольРазработчикаДанныеКлиент.ВнешнийИсточник(ТекущиеДанные, ВнешниеИсточникиТекущиеДанные.UID);
	ОписаниеВнешнегоИсточника.Имя = Результат;
	
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьВнешнийИсточник(ЭтотОбъект, ТекущаяСтрока, ВнешниеИсточникиТекущиеДанные.UID, ОписаниеВнешнегоИсточника);
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
	ВнешниеИсточники.Сортировать("Имя");
	ОбновитьИнформациюВнешнихИсточников();
	
	ЗагрузитьПользовательскиеОбъектыПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводИдентификатораТаблицыМВТЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыМВТТекущиеДанные = Элементы.ТаблицыМВТ.ТекущиеДанные;
	ТаблицыМВТТекущиеДанные.Имя = Результат;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ОписаниеТаблицыМВТ = ИТК_КонсольРазработчикаДанныеКлиент.ТаблицаМВТ(ТекущиеДанные, ТаблицыМВТТекущиеДанные.UID);
	ОписаниеТаблицыМВТ.Имя = Результат;
	
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьТаблицуМВТ(ЭтотОбъект, ТекущаяСтрока, ТаблицыМВТТекущиеДанные.UID, ОписаниеТаблицыМВТ);
	
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	
	ТаблицыМВТ.Сортировать("Имя");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокиДереваДанных(Строка, ОтборТип)
	
	Результат = Новый Массив;
	Для Каждого ВложеннаяСтрока Из Строка.ПолучитьЭлементы() Цикл 
		
		Если ВложеннаяСтрока.Тип = ОтборТип Тогда
			Результат.Добавить(ВложеннаяСтрока);
		ИначеЕсли ВложеннаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхГруппа() Тогда
			
			СтрокиГруппы = ПолучитьСтрокиДереваДанных(ВложеннаяСтрока, ОтборТип);
			Для Каждого СтрокаВГруппе Из СтрокиГруппы Цикл 
				Результат.Добавить(СтрокаВГруппе);
			КонецЦикла;
			
		КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТребуетсяПроверкаСтроки()
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	Возврат ИТК_ОбщийКлиентСервер.Свойство(ТекущиеДанные, "ТребуетсяПроверка", Ложь);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СкорректироватьВыделениеВТабличномДокументеРезультата(Элемент, ТабличныйДокумент, РезультатОбновления)
	
	ТекущаяОбласть = ТабличныйДокумент.ТекущаяОбласть;
	Если ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШиринаТаблицы = ПолеТаблицыРезультатаСУчетомОбновления(ТабличныйДокумент, "ШиринаТаблицы", РезультатОбновления);
	
	Лево = ТекущаяОбласть.Лево;
	Если Лево > ШиринаТаблицы Тогда
		Лево = ШиринаТаблицы;
	КонецЕсли;
	
	Право = ТекущаяОбласть.Право;
	Если Право > ШиринаТаблицы Тогда
		Право = ШиринаТаблицы;
	КонецЕсли;
	
	ВысотаТаблицы = ПолеТаблицыРезультатаСУчетомОбновления(ТабличныйДокумент, "ВысотаТаблицы", РезультатОбновления);
	
	Низ = ТекущаяОбласть.Низ;
	Если Низ > ВысотаТаблицы Тогда
		Низ = ВысотаТаблицы;
	КонецЕсли;
	
	Верх = ТекущаяОбласть.Верх;
	Если Верх > ВысотаТаблицы Тогда
		Верх = ВысотаТаблицы;
	КонецЕсли;
	
	Элемент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево, Низ, Право);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолеТаблицыРезультатаСУчетомОбновления(ТабличныйДокумент, Поле, РезультатОбновления)
	
	Если ЗначениеЗаполнено(РезультатОбновления) Тогда
		Результат = Мин(ТабличныйДокумент[Поле], РезультатОбновления[Поле]);
	Иначе
		Результат = ТабличныйДокумент[Поле];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьДанныеПередВыполнениемНаСервере(Данные) Экспорт
	
	Если Данные.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
		
		Для Каждого Параметр Из Данные.Параметры Цикл
			
			ЗначениеПараметра = Данные.ЗначенияПараметров.Получить(Параметр.Ключ);
			Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") Тогда
				
				Если ЗначениеПараметра.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
					ЗначениеПараметра.Значение = ПолучитьИзВременногоХранилища(ЗначениеПараметра.Значение);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемВнешнихИсточников(Данные.Тип) Тогда
		
		Для Каждого ВнешнийИсточник Из Данные.ВнешниеИсточники Цикл 
			
			ОписаниеВнешнегоИсточника = ВнешнийИсточник.Значение;
			
			Если ОписаниеВнешнегоИсточника.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
				
				Если ЗначениеЗаполнено(ОписаниеВнешнегоИсточника.Значение) Тогда
					ОписаниеВнешнегоИсточника.Значение = ПолучитьИзВременногоХранилища(ОписаниеВнешнегоИсточника.Значение);
				Иначе
					ОписаниеВнешнегоИсточника.Значение = Неопределено;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ЭкспортФайлаЗакончен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ВыводРезультатаВТабличныйДокументНаСервер(ТабличныйДокумент, Результат.УдалитьЗаголовок);
	
	ИТК_ТабличныйДокументКлиент.ЭкспортФайлаЗакончен(ТабличныйДокумент, Результат, ПоследняяАктивнаяОбласть);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортВоВнешнийОтчетФайлаЗакончен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ДвоичныеДанные = ДвоичныеДанныеВнешнегоОтчета(ТекущиеДанные.Текст, Результат.Имя, Результат.Синоним);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПустойОбработчикОповещенийДополнительныеПараметры", ИТК_ОбщийКлиент);
	ДвоичныеДанные.НачатьЗапись(ОписаниеОповещения, Результат.ПолноеИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеВнешнегоОтчета(XMLСхема, Имя, Синоним)
	
	Возврат ИТК_Конфигуратор.ГенерироватьВнешнийОтчет(XMLСхема, Имя, Синоним);
	
КонецФункции

&НаСервере
Процедура ВыводРезультатаВТабличныйДокументНаСервер(ТабличныйДокумент, УдалитьЗаголовок)
	
	ТабличныйДокумент.Вывести(ТабличныйДокументРезультат);
	
	Если УдалитьЗаголовок Тогда
		Область = ТабличныйДокумент.Область("R1:R2");
		ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиВыводаТаблиц()
	
	НастройкиВыводаТаблиц.Очистить();
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ДобавитьТаблицуВНастройкиВывода(ТекущиеДанные, "");
	Для Каждого ВременнаяТаблица Из ИТК_КонсольРазработчикаДанныеКлиент.ВременныеТаблицы(ТекущиеДанные) Цикл 
		
		ОписаниеВременнойТаблицы = ВременнаяТаблица.Значение;
		ДобавитьТаблицуВНастройкиВывода(ТекущиеДанные, ВременнаяТаблица.Ключ, ОписаниеВременнойТаблицы.Индекс);
		
	КонецЦикла;
	
	НастройкиВыводаТаблиц.Сортировать("Имя");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицуВНастройкиВывода(Данные, Имя, Индекс = Неопределено)
	
	ОписаниеНастройкиВыводаТаблицы = ИТК_КонсольРазработчикаДанныеКлиентСервер.ПолучитьОписаниеНастройкиВыводаТаблицы(Данные, Имя);
	
	НоваяСтрока = НастройкиВыводаТаблиц.Добавить();
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Вывод = ОписаниеНастройкиВыводаТаблицы.Вывод;
	НоваяСтрока.Индекс = Индекс;
	Если Индекс <> Неопределено Тогда
		НоваяСтрока.Номер = Индекс + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиВыводаТаблицыПакета(Вывод)
	
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.НастройкиВыводаТаблиц.ВыделенныеСтроки Цикл 
		
		ВыделеннаяСтрока = НастройкиВыводаТаблиц.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		УстановитьДляСтрокиНастройкуВыводаТаблицы(ВыделеннаяСтрока, Вывод);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляСтрокиНастройкуВыводаТаблицы(Строка, Вывод)
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	Строка.Вывод = Вывод;
	
	ОписаниеНастройкиВыводаТаблицы = ИТК_КонсольРазработчикаДанныеКлиентСервер.ПолучитьОписаниеНастройкиВыводаТаблицы(ТекущиеДанные, Строка.Имя);
	ОписаниеНастройкиВыводаТаблицы.Вывод = Вывод;
	
	ИТК_КонсольРазработчикаДанныеКлиент.УстановитьОписаниеНастройкиВыводаТаблицы(ЭтотОбъект, ТекущиеДанные, Строка.Имя, ОписаниеНастройкиВыводаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикНовыеДанные(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыеДанные();
	
КонецПроцедуры

&НаКлиенте
Функция ОповещениеЗагрузкиДанных(ИмяОбработчика, Объединение = Ложь)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объединение", Объединение);
	
	Результат = Новый ОписаниеОповещения(ИмяОбработчика, ЭтотОбъект, ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеОбработчикаЗагрузкиФайла(Объединение = Ложь)
	
	Возврат ОповещениеЗагрузкиДанных("ОбработчикЗагрузитьФайл", Объединение);
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗагрузитьФайл(Результат, ДополнительныеПараметры) Экспорт
	
	ЗагрузитьФайл(ДополнительныеПараметры.Объединение);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеОбработчикаЗагрузкиНастройки(Объединение = Ложь)
	
	Возврат ОповещениеЗагрузкиДанных("ОбработчикЗагрузитьНастройку", Объединение);
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗагрузитьНастройку(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущееИмяНастройки = Неопределено;
	Если РабочиеДанные.Тип = ИТК_Перечисления.ТипХраненияДанныхНастройка() Тогда
		ТекущееИмяНастройки = РабочиеДанные.Имя;
	КонецЕсли;

	КлючНастроек = ИТК_КонсольРазработчикаДанныеКлиентСервер.КлючНастроек();
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаНастройкиЗавершена", ЭтотОбъект, ДополнительныеПараметры);
	ИТК_ФормаКлиент.ОткрытьДиалогВыбораНастроекДанных(ЭтотОбъект, ИТК_Перечисления.РежимДиалогаУправлениеДаннымиВНастройкахЗагрузка(),
														КлючНастроек, ТекущееИмяНастройки, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытиеРазрешеноЗакрыть(Результат, ДополнительныеПараметры) Экспорт
	
	ЗакрытиеРазрешено = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОткрытьПоследнийФайл(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Индекс = ДополнительныеПараметры;
	ИмяФайла = ПоследниеРабочиеДанные.Файлы[Индекс];
	ЗагрузитьДанныеИзФайла(ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОткрытьПоследнююНастройку(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Индекс = ДополнительныеПараметры;
	ИмяДанных = ПоследниеРабочиеДанные.Настройки[Индекс];
	ЗагрузитьДанныеИзНастроек(ИмяДанных);
	
КонецПроцедуры 

&НаСервере
Процедура НастройкиИзмененыСервер()
	
	ОбновитьСтруктуруЗапросовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиИзменены()
	
	Если ТекущаяСтрока <> Неопределено
			И ИТК_КонсолиКлиентСервер.ЭтоТипСтрокиДереваДанныхЗапросСтруктуры(ТекущаяСтрока.Тип) Тогда // Проблема когда строка удаляется
		Элементы.ДеревоДанных.ТекущаяСтрока = ОсновнойЗапрос(ТекущаяСтрока).ПолучитьИдентификатор();
	КонецЕсли;
	
	НастройкиИзмененыСервер();
	ОбновитьОбработчикАвтоСохранения();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеЭлементовФормыПослеОжидания()
	
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеЭлементовФормыПослеОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбновлениеЭлементовФормыПослеОжидания()

	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляСохранения(Знач СтрокаДерева)
	
	ДанныеДляСохранения = Новый Массив;
	
	Для Каждого ЭлементДерева Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		ДанныеЗаписываемойСтроки = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ЭлементДерева.Тип, Истина);
		ЗаполнитьЗначенияСвойств(ДанныеЗаписываемойСтроки, ЭлементДерева);
		
		ДанныеСтроки = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ЭлементДерева);
		ЗаполнитьЗначенияСвойств(ДанныеЗаписываемойСтроки, ДанныеСтроки);
		
		Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСодержащийСохраняемыеСтроки(ЭлементДерева.Тип) Тогда
			
			Строки = ПодготовитьДанныеДляСохранения(ЭлементДерева);
			Если ЗначениеЗаполнено(Строки) Тогда
				ДанныеЗаписываемойСтроки.Вставить("Строки", Строки);
			КонецЕсли;
			
		ИначеЕсли ЭлементДерева.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
			
			Если НЕ ДанныеСтроки.ТребуетсяПроверка И ДанныеСтроки.Ошибка = Неопределено Тогда
				
				// Записываем только те значения параметров которые есть в запросе
				ЗначенияПараметров = Новый Соответствие;
				Для Каждого ЗначениеПараметра Из ДанныеСтроки.ЗначенияПараметров Цикл 
					
					Если ДанныеСтроки.Параметры.Получить(ЗначениеПараметра.Ключ) <> Неопределено Тогда
						ЗначенияПараметров.Вставить(ЗначениеПараметра.Ключ, ЗначениеПараметра.Значение);
					КонецЕсли;
					
				КонецЦикла;
				ДанныеЗаписываемойСтроки.ЗначенияПараметров = ЗначенияПараметров;
				
				// Записываем только те настройки вывода таблиц, которые есть в запросе
				ЗаписываемыеНастройкиВыводаТаблиц = Новый Соответствие;
				Для Каждого НастройкаВыводаТаблицы Из ДанныеСтроки.НастройкиВыводаТаблиц Цикл 
					
					ИмяТаблицы = НастройкаВыводаТаблицы.Ключ;
					Если ДанныеСтроки.ВременныеТаблицы.Получить(ИмяТаблицы) <> Неопределено
							ИЛИ ИмяТаблицы = "" Тогда
						
						ОписаниеНастройкиВыводаТаблицы = НастройкаВыводаТаблицы.Значение;
						
						Если ОписаниеНастройкиВыводаТаблицы.Вывод <> ИТК_MCRФорматКлиентСервер.ВыводТаблицыЗначениеПоУмолчанию() Тогда
							ЗаписываемыеНастройкиВыводаТаблиц.Вставить(ИмяТаблицы, ОписаниеНастройкиВыводаТаблицы);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ДанныеЗаписываемойСтроки.НастройкиВыводаТаблиц = ЗаписываемыеНастройкиВыводаТаблиц;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Получение таблиц из временных хранилищ - ЗначенияПараметров
		Если ЭлементДерева.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
			
			ДанныеЗаписываемойСтроки.ЗначенияПараметров = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ДанныеЗаписываемойСтроки.ЗначенияПараметров);
			Для Каждого КлючИЗначениеЗначениеПараметра Из ДанныеЗаписываемойСтроки.ЗначенияПараметров Цикл
				
				ОписаниеЗначенияПараметра = КлючИЗначениеЗначениеПараметра.Значение;
				Если ИТК_КонсольРазработчикаКлиентСервер.ЭтоСложныйПараметр(ТипЗнч(ОписаниеЗначенияПараметра))
							И ОписаниеЗначенияПараметра.Вид = ИТК_Перечисления.СложныйПараметрЗапросаТаблицаЗначений() Тогда
					
					НовоеОписаниеЗначенияПараметра = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ОписаниеЗначенияПараметра);
					Если ЗначениеЗаполнено(ОписаниеЗначенияПараметра.Значение) Тогда
						НовоеОписаниеЗначенияПараметра.Значение = ПолучитьИзВременногоХранилища(ОписаниеЗначенияПараметра.Значение);
					КонецЕсли;
					ДанныеЗаписываемойСтроки.ЗначенияПараметров.Вставить(КлючИЗначениеЗначениеПараметра.Ключ, НовоеОписаниеЗначенияПараметра);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Получение таблиц из временных хранилищ - ВнешниеИсточники
		Если ЭлементДерева.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос()
				ИЛИ ЭлементДерева.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
			
			ДанныеЗаписываемойСтроки.ВнешниеИсточники = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ДанныеЗаписываемойСтроки.ВнешниеИсточники);
			Для Каждого КлючИЗначениеВнешнегоИсточника Из ДанныеЗаписываемойСтроки.ВнешниеИсточники Цикл
				
				ОписаниеВнешнегоИсточника = КлючИЗначениеВнешнегоИсточника.Значение;
				
				Если ОписаниеВнешнегоИсточника.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
					
					НовоеОписаниеВнешнегоИсточника = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ОписаниеВнешнегоИсточника);
					Если ЗначениеЗаполнено(ОписаниеВнешнегоИсточника.Значение) Тогда
						НовоеОписаниеВнешнегоИсточника.Значение = ПолучитьИзВременногоХранилища(ОписаниеВнешнегоИсточника.Значение);
					КонецЕсли;
					ДанныеЗаписываемойСтроки.ВнешниеИсточники.Вставить(КлючИЗначениеВнешнегоИсточника.Ключ, НовоеОписаниеВнешнегоИсточника);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Получение таблиц из временных хранилищ - ТаблицыМВТ
		Если ЭлементДерева.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
			
			ДанныеЗаписываемойСтроки.ТаблицыМВТ = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ДанныеЗаписываемойСтроки.ТаблицыМВТ);
			Для Каждого КлючИЗначениеТаблицыМВТ Из ДанныеЗаписываемойСтроки.ТаблицыМВТ Цикл
				
				ОписаниеТаблицыМВТ = КлючИЗначениеТаблицыМВТ.Значение;
				
				Если ОписаниеТаблицыМВТ.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаЗначение() Тогда
					
					НовоеОписаниеТаблицыМВТ = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ОписаниеТаблицыМВТ);
					
					Если ЗначениеЗаполнено(НовоеОписаниеТаблицыМВТ.Значение) Тогда
						НовоеОписаниеТаблицыМВТ.Значение = ПолучитьИзВременногоХранилища(НовоеОписаниеТаблицыМВТ.Значение);
					Иначе
						НовоеОписаниеТаблицыМВТ.Значение = Неопределено;
					КонецЕсли;
					ДанныеЗаписываемойСтроки.ТаблицыМВТ.Вставить(КлючИЗначениеТаблицыМВТ.Ключ, НовоеОписаниеТаблицыМВТ);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Перевод терминов
		СловарьПереводаИменПолей = ИТК_MCRФорматПовтИсп.СловарьПереводаИменПолей("ru");
		Для Каждого Поле Из ДанныеЗаписываемойСтроки Цикл 
			
			ДанныеЗаписываемойСтроки.Вставить(СловарьПереводаИменПолей[Поле.Ключ], Поле.Значение);
			ДанныеЗаписываемойСтроки.Удалить(Поле.Ключ);
			
		КонецЦикла;
		
		ДанныеДляСохранения.Добавить(ДанныеЗаписываемойСтроки);
		
	КонецЦикла;
	
	Возврат ДанныеДляСохранения;

КонецФункции

&НаСервере
Функция ПодготовленныДанныеДляСохраненияВоВременномХранилище()
	
	ПодготовленныеДанные = ПодготовитьДанныеДляСохранения(ДеревоДанных);
	Возврат ИТК_MCRФормат.ПоместитьДанныеВоВременноеХранилище(ПодготовленныеДанные);
	
КонецФункции

&НаКлиенте
Функция ДобавитьСтрокуВДеревоДанных(Тип, Имя = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Родитель = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Родитель");
	Активизировать = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Активизировать", Истина);
	НачальныеДанные = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "НачальныеДанные");
	UID = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "UID");
	Картинка = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Картинка");
	УстанавливатьМодифицированность = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "УстанавливатьМодифицированность", Истина);
	
	Если Родитель = Неопределено Тогда
		
		// Определим исходя из выделения куда добавляем
		Если ТекущаяСтрока = Неопределено Тогда
			Родитель = ДеревоДанных;
		ИначеЕсли ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхГруппа()
				ИЛИ (ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных()
						И (Тип = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД()
							ИЛИ Тип = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД()))
				ИЛИ (ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхВариантОтчетаСКД()
						И Тип = ИТК_Перечисления.ЭлементДанныхПользовательскаяНастройкаСКД()) Тогда
					
			Родитель = ТекущаяСтрока;
			
		ИначеЕсли ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
			
			Родитель = ДеревоДанных;
			
		Иначе
			
			Родитель = ТекущаяСтрока.ПолучитьРодителя();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Имя = Неопределено Тогда
		Имя = НовоеИмяСтрокиДереваДанных(Родитель, Тип);
	КонецЕсли;
	
	Если УстанавливатьМодифицированность Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	// Добавление новой строки
	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	ИТК_КонсольРазработчикаКлиентСервер.ЗаполнениеДанныхСтроки(НоваяСтрока, Имя, Тип, UID, НачальныеДанные, Картинка);
	
	Если Активизировать Тогда
		Элементы.ДеревоДанных.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция НовоеИмяСтрокиДереваДанных(Родитель, Тип)
	
	МаксИндекс = МаксимальныйИндексСтрокДереваДанных(Родитель, Тип);
	Представление = ИТК_Перечисления.Представление(Тип);
	
	Возврат СтрШаблон("%1 №%2", Представление, МаксИндекс + 1);
	
КонецФункции

&НаКлиенте
Функция МаксимальныйИндексСтрокДереваДанных(Родитель, Тип)
	
	Результат = 0;
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл 
		
		Если Строка.Тип <> Тип Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = Строка["Имя"];
		Индекс = ИТК_Строки.ИндексИдентификатора(Значение);
		
		Если Индекс > Результат Тогда
			
			Результат = Индекс;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДобавитьСтрокуВДеревоДанныхСервер(ИмяДанных, ТипСтроки, Родитель, ДополнительныеПараметры = Неопределено)
	
	НачальныеДанные = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "НачальныеДанные");
	UID = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "UID");
	Картинка = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Картинка");
	
	// Добавление новой строки
	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	ИТК_КонсольРазработчикаКлиентСервер.ЗаполнениеДанныхСтроки(НоваяСтрока, ИмяДанных, ТипСтроки, UID, НачальныеДанные, Картинка);
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанные(Данные)
	
	Попытка
		
		МассивДанных = ИТК_MCRФормат.Прочитать(Данные.Получить(), УникальныйИдентификатор);
		ЗагрузитьДанныеПострочно(МассивДанных, ДеревоДанных);
		ОбновитьСтруктуруЗапросовСервер();
		
	Исключение

		Шаблон = НСтр("ru = 'Ошибка при загрузке данных: %1';
						|en = 'Error loading data: %1'");
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить(СтрШаблон(Шаблон, ПредставлениеОшибки));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеПострочно(МассивДанных, СтрокаДерева)
	
	СловарьПереводаИменПолей = ИТК_MCRФорматПовтИсп.СловарьПереводаИменПолей("en");

	Для Каждого СтрокаСтруктура Из МассивДанных Цикл
		
		Для Каждого Поле Из СтрокаСтруктура Цикл 
			
			ПереводИмениПоля = СловарьПереводаИменПолей.Получить(Поле.Ключ);
			Если ЗначениеЗаполнено(ПереводИмениПоля) Тогда
				СтрокаСтруктура.Вставить(ПереводИмениПоля, Поле.Значение);
				СтрокаСтруктура.Удалить(Поле.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		ТипСтроки = СтрокаСтруктура.Тип;
		НачальныеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ТипСтроки);
		ЗаполнитьЗначенияСвойств(НачальныеДанные, СтрокаСтруктура);
		
		Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемОригинальногоТекста(ТипСтроки) Тогда
			ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьОригинальныйТекст(НачальныеДанные);
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("UID", СтрокаСтруктура.UID);
		ДополнительныеПараметры.Вставить("НачальныеДанные", НачальныеДанные);
		
		НоваяСтрока = ДобавитьСтрокуВДеревоДанныхСервер(СтрокаСтруктура.Имя, ТипСтроки, СтрокаДерева, ДополнительныеПараметры);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСтруктура);
		
		// Обработаем вложенные строки
		Если СтрокаСтруктура.Свойство("Строки") Тогда
			ЗагрузитьДанныеПострочно(СтрокаСтруктура.Строки, НоваяСтрока); 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруЗапросовСервер()
	
	РазбиратьСтруктуру = ИТК_Настройки.ЗначениеНастройкиВФорме(ЭтотОбъект, "РазбиратьСтруктуруЗапроса");
	
	Для Каждого ОбрабатываемаяСтрока Из ИТК_КонсольРазработчикаКлиентСервер.СтрокиДереваДанных(ДеревоДанных, ИТК_Перечисления.ЭлементДанныхЗапрос()) Цикл 
		
		ОбрабатываемаяСтрока.ПолучитьЭлементы().Очистить();
		
		Если РазбиратьСтруктуру Тогда
			
			Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОбрабатываемаяСтрока);
			Если Данные.ТребуетсяПроверка ИЛИ ЗначениеЗаполнено(Данные.Ошибка) Тогда
				Возврат;
			КонецЕсли;
			
			ОбновитьСтруктуруЗапросаСервер(ОбрабатываемаяСтрока, ИТК_АнализЗапроса.РазборСтруктуры(Данные.Текст));
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСтруктуруЗапросаСервер(Строка, Данные, Уровень = 0)
	
	Если Уровень = 0 Тогда
		ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапросПакета();
	Иначе
		ТипСтроки = ИТК_Перечисления.ЭлементДанныхЗапросВСтруктуре();
	КонецЕсли;
	
	Для Каждого Элемент Из Данные Цикл 
		
		НачальныеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(ТипСтроки);
		НачальныеДанные.Вставить("ТекстИнициализации", Элемент.ТекстИнициализации);
		НачальныеДанные.Вставить("Текст", Элемент.Текст);
		НачальныеДанные.Вставить("Параметры", Элемент.Параметры);
		НачальныеДанные.Вставить("ИндексВСтруктуре", Элемент.Индекс);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("НачальныеДанные", НачальныеДанные);
		ДополнительныеПараметры.Вставить("Картинка", Элемент.Картинка);
		
		НоваяСтрока = ДобавитьСтрокуВДеревоДанныхСервер(Элемент.Представление, ТипСтроки, Строка, ДополнительныеПараметры);
		
		Уровень = Уровень + 1;
		ОбновитьСтруктуруЗапросаСервер(НоваяСтрока, Элемент.Элементы, Уровень);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьВеткиДереваВСоответствииСДанными(ОбрабатываемаяСтрока)
	
	Для Каждого ЭлементДерева Из ОбрабатываемаяСтрока.ПолучитьЭлементы() Цикл
		
		Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиСодержащийСохраняемыеСтроки(ЭлементДерева.Тип) Тогда
				
			Если ЭлементДерева.Развернуто Тогда
				Элементы.ДеревоДанных.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
			КонецЕсли;
			
		КонецЕсли;
		
		РаскрытьВеткиДереваВСоответствииСДанными(ЭлементДерева);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуПоUID(СтрокаИсточник, UID)
	
	Результат = Неопределено;
	
	Для Каждого Строка Из СтрокаИсточник.ПолучитьЭлементы() Цикл
		
		Если Строка.UID = UID Тогда
			Результат = Строка;
			Прервать;
		КонецЕсли;
		
		НайденнаяСтрока = НайтиСтрокуПоUID(Строка, UID);
		
		Если НайденнаяСтрока <> Неопределено Тогда
			Результат = НайденнаяСтрока; 
			Прервать;
		КонецЕсли;
			
	КонецЦикла;
		
	Возврат Результат;	

КонецФункции

&НаСервере
Процедура СохранитьДанныеВНастройкиСервер(Имя)
	
	ПодготовленныеДанные = ПодготовитьДанныеДляСохранения(ДеревоДанных);
	ИТК_КонсольРазработчика.СохранитьДанные(Имя, ПодготовленныеДанные);
	
	ТипХраненияДанных = ИТК_Перечисления.ТипХраненияДанныхНастройка();
	УстановитьРабочиеДанные(РабочиеДанные, ТипХраненияДанных, Имя);
	ОбновитьЭлементыПоследниеРабочиеДанные(ТипХраненияДанных, Имя);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзНастроекСервер(Имя, Пользователь = Неопределено, Объединение = Ложь)
	
	Попытка
		Данные = ИТК_КонсольРазработчика.ЗагрузитьДанныеИзНастроек(Имя, Пользователь);
	Исключение
		Возврат;
	КонецПопытки;
	
	Если НЕ Объединение Тогда
		ОчиститьДанныеСервер();
	КонецЕсли;
	
	ЗагрузитьДанные(Данные);
	
	Если НЕ Объединение 
			И Пользователь = Неопределено Тогда
			
		УстановитьРабочиеДанные(РабочиеДанные, ИТК_Перечисления.ТипХраненияДанныхНастройка(), Имя);
		ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьМодифицированность(ЭтотОбъект);
		
		ОбновитьЭлементыПоследниеРабочиеДанные(ИТК_Перечисления.ТипХраненияДанныхНастройка(), Имя);
		
	Иначе
		ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзФайлаСервер(Адрес, ПолноеИмяФайла, Объединение)
	
	ИндексСимвола = СтрНайти(ПолноеИмяФайла, ".", НаправлениеПоиска.СКонца);
	Расширение = НРег(Сред(ПолноеИмяФайла, ИндексСимвола + 1));
	ОсновноеРасширение = (Расширение = ИТК_ОбщийКлиентСервер.ОсновноеРасширениеФайловДанных());
	
	Попытка
		
		Если ОсновноеРасширение Тогда
			МассивДанных = ИТК_MCRФормат.Прочитать(Адрес, УникальныйИдентификатор);
		Иначе
			
			Если Расширение = "dcr" Тогда
				МассивДанных = ИТК_КонсольРазработчикаЭкспортДанных.DCRИзВременногоХранилища(Адрес, УникальныйИдентификатор);
			ИначеЕсли Расширение = "q1c" Тогда
				МассивДанных = ИТК_КонсольРазработчикаЭкспортДанных.Q1CИзВременногоХранилища(Адрес, УникальныйИдентификатор);
			ИначеЕсли Расширение = "erf" Тогда
				МассивДанных = ИТК_КонсольРазработчикаЭкспортДанных.ERFИзВременногоХранилища(Адрес, УникальныйИдентификатор);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить(ТекстОшибки);
		Возврат;
		
	КонецПопытки;
	
	Если Объединение Тогда
		ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
	Иначе
		
		Если ОсновноеРасширение Тогда
			
			УстановитьРабочиеДанные(РабочиеДанные, ИТК_Перечисления.ТипХраненияДанныхФайл(), ПолноеИмяФайла);
			
		Иначе
			
			УстановитьРабочиеДанные(РабочиеДанные, , , СтрШаблон(НСтр("ru = 'экспортирован из %1';
																		|en = 'exported from %1'"), Расширение));
			
		КонецЕсли;
		
		ОчиститьДанныеСервер();
		
	КонецЕсли;
	
	ЗагрузитьДанныеПострочно(МассивДанных, ДеревоДанных);
	
	ОбновитьСтруктуруЗапросовСервер();
	ОбновитьЭлементыПоследниеРабочиеДанные(ИТК_Перечисления.ТипХраненияДанныхФайл(), ПолноеИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущейСтрокойДереваПервую()
	
	СтрокиДерева = ДеревоДанных.ПолучитьЭлементы();
	Если ЗначениеЗаполнено(СтрокиДерева) Тогда
		
		ТекущаяСтрока = СтрокиДерева[0];
		Если ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
			
			СтрокиДерева = ТекущаяСтрока.ПолучитьЭлементы();
			Если ЗначениеЗаполнено(СтрокиДерева) Тогда
				
				ТекущаяСтрока = СтрокиДерева[0];
				Элементы.ПанельНастроек.ТекущаяСтраница = Элементы.СтраницаВариантОтчетаСКД;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ДеревоДанных.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбработчикАвтоСохранения()
	
	ОтключитьОбработчикОжидания("ПодключаемыйАвтоСохранениеДанных");
	
	ПериодичностьАвтоСохранения = ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "ПериодичностьАвтоСохранения");
	Если ЗначениеЗаполнено(ПериодичностьАвтоСохранения) Тогда
		
		ПодключитьОбработчикОжидания("ПодключаемыйАвтоСохранениеДанных", ПериодичностьАвтоСохранения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйАвтоСохранениеДанных()
	АвтосохранениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура АвтоСохранениеДанных()
	
	Если МодифицированностьАвтосохранение Тогда
		
		Элементы.ФормаАвтоСохранение.Видимость = Истина;
		
		ДлительнаяОперацияАвтоматическоеСохранение = АвтоматическоеСохранениеНаСервере();
		ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеАвтоматическогоСохранения", ЭтотОбъект);
		ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияАвтоматическоеСохранение, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АвтоматическоеСохранениеНаСервере()
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Данные", ПодготовитьДанныеДляСохранения(ДеревоДанных));
	ПараметрыПроцедуры.Вставить("Тип", РабочиеДанные);
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_КонсольРазработчика.АвтоматическоеСохранение", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеАвтоматическогоСохранения(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МодифицированностьАвтоСохранение = Ложь;
	Элементы.ФормаАвтоСохранение.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоДлительнойОперации(ОписаниеОперации, ДополнительныеПараметры) Экспорт
	
	ПрогрессДлительнойОперации = ОписаниеОперации.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаПараметраВТекстеНаЗначениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	ГраницыВыделения = Неопределено;
	ТекстЗначенияПараметра = ИТК_Запрос.ЗначениеПараметраВТекст(ТекущиеДанные, ДополнительныеПараметры.Имя);
	НовыйТекст = ИТК_ЗапросКлиентСервер.ЗаменитьПараметрВТексте(ТекущиеДанные.Текст, ДополнительныеПараметры.Имя, ТекстЗначенияПараметра, ГраницыВыделения);
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
	ИзменяемыеПоля.Вставить("Текст", НовыйТекст);
	ИзменяемыеПоля.Вставить("ГраницыВыделенияТекста", ГраницыВыделения);
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
	
	Элементы.ПанельНастроек.ТекущаяСтраница = Элементы.СтраницаТекстЗапроса;
	ТекущийЭлемент = Элементы.ТекстЗапроса;
	
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
	ПроверитьПоказатьОшибку();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьЗамераПакетногоЗапросаНаСервере(Знач Данные, УникальныйИдентификатор, ФоновоеВыполнение)

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Данные", ПодготовитьДанныеПередВыполнениемНаСервере(Данные));
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор, ФоновоеВыполнение);
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_Запрос.ДетальныйЗамер", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗамераПакетногоЗапроса(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	ИТК_ДлительныеОперацииКлиент.СкрытьПрогресс(ЭтотОбъект);
	
	РезультатЗамера = РезультатЗамераПакетногоЗапроса(Результат, УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", РезультатЗамера.АдресРезультата);
	
	ПредставлениеЗапроса = ТекущаяСтрока.Имя;
	ПараметрыФормы.Вставить("ДополнениеЗаголовка", ПредставлениеЗапроса);
	
	ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.АнализПакетаЗапросов", ПараметрыФормы, , Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатЗамераПакетногоЗапроса(Знач РезультатЗамера, УникальныйИдентификатор)
	
	РезультатЗамера = ПолучитьИзВременногоХранилища(РезультатЗамера.АдресРезультата);
	
	Результат = Новый Структура;
	Результат.Вставить("АдресРезультата", ИТК_ВременноеХранилище.Поместить(РезультатЗамера.Результат, , УникальныйИдентификатор));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗавершенВопросПреобразоватьЗначениеПараметраВыражения(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокаПараметр = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	ИмяПараметра = СтрокаПараметр.Имя;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		НовоеЗначение = ДополнительныеПараметры.НовоеЗначение;
		НовыйТип = ДополнительныеПараметры.Тип;
		
		ПоследнийТипПараметра = НовыйТип;
		
		ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, ИмяПараметра, НовоеЗначение);
		
	Иначе
		НовоеЗначение = ДополнительныеПараметры.Значение;
	КонецЕсли;
	
	ОбновитьСтрокуПараметра(СтрокаПараметр, ИмяПараметра, СтрокаПараметр.ТипЗначения, НовоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаполняемыеПараметры(ДанныеЗаполнения, ИменаПараметров)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Имена", ИменаПараметров);
		ПараметрыФормы.Вставить("ДанныеЗаполнения", ДанныеЗаполнения);
		
		ДополнительныеПараметры = Новый Структура;
		Если ИменаПараметров.Количество() = 1 Тогда
			ДополнительныеПараметры.Вставить("Имя", ИменаПараметров[0]);
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("ЗаполнениеПараметровЗакончено", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.ЗаполнениеПараметров", ПараметрыФормы, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе 
		
		ПоказатьПредупреждение(, НСтр("ru = 'Нет данных для заполнения параметров';
										|en = 'There is no data to populate parameters'"), , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КолонкиВнешнегоИсточника(Описание)
	
	Если Описание.Тип = ИТК_Перечисления.ТипЗначенияВнешнегоИсточникаВыражение() Тогда
			
		Комментарий = СтрШаблон(НСтр("ru = 'Внешний источник: %1';
									|en = 'External source: %1'"), Описание.Имя);
		Значение = ИТК_ОбщийВызовСервера.ВычислитьВыражениеНаВстроенномЯзыке(Описание.Значение, Комментарий);
		
	Иначе 
		
		Значение = ПолучитьИзВременногоХранилища(Описание.Значение);
		
	КонецЕсли;
	
	Результат = Новый СписокЗначений;
	Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого Колонка Из Значение.Колонки Цикл 
			
			Результат.Добавить(Колонка.ТипЗначения, Колонка.Имя, ИТК_ТаблицаЗначений.ИндексируетсяКолонка(Значение, Колонка.Имя));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуАнализаИсполняемыхЗапросов(Адрес)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", Адрес);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("АнализИсполняемыхЗапросовЗавершен", ЭтотОбъект);
	ОткрытьФорму("Обработка.ИТК_КонсольРазработчика.Форма.АнализИсполняемыхЗапросов", ПараметрыФормы, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализИсполняемыхЗапросовЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем строку запрос в данные для анализа
	Тип = ИТК_Перечисления.ЭлементДанныхЗапрос();
	
	ШаблонИмени = НСтр("ru = 'Запрос СКД (%1)';
						|en = 'Query DCS (%1)'");
	Имя = СтрШаблон(ШаблонИмени, Результат.Имя);
	
	ДополнительныеПараметры = Новый Структура;
	
	// Подготовка начальных данных
	НачальныеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.НовыйЭлемент(Тип);	
	ЗаполнитьЗначенияСвойств(НачальныеДанные, Результат, "Текст, ЗначенияПараметров");
	НачальныеДанные["Ошибка"] = Неопределено;
	НачальныеДанные["ТребуетсяПроверка"] = Истина;
	
	ДополнительныеПараметры.Вставить("НачальныеДанные", НачальныеДанные);
	
	// Определение родителя
	Родитель = ТекущаяСтрока.ПолучитьРодителя();
	Пока НЕ (Родитель = Неопределено 
			ИЛИ Родитель.Тип = ИТК_Перечисления.ЭлементДанныхГруппа()) Цикл 
			
		Родитель = Родитель.ПолучитьРодителя();

	КонецЦикла;
	Если Родитель = Неопределено Тогда
		Родитель = ДеревоДанных;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Родитель", Родитель);
	
	ДобавитьСтрокуВДеревоДанных(Тип, Имя, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияРедактораКода()
	
	ЯзыкПрограммирования = ИТК_Настройки.ЗначениеОбщейНастройки(ЭтотОбъект, "ЯзыкПрограммирования");
	ИмяПеременной = ИТК_РедакторКодаКлиентСервер.ИмяПеременнойВозвратаРезультата(ЯзыкПрограммирования);
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("Подсказка", СтрШаблон(НСтр("ru = 'Возврат результата производится через переменную ""%1""';
																|en = 'The result is returned through the variable ""%1""'"), ИмяПеременной));
	ИТК_РедакторКода.Инициализация(ЭтотОбъект, "Код", ДополнительныеСвойства);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияРедактораЗапроса()
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ТипЯзыка", ИТК_Перечисления.ТипЯзыкаРедактораЗапросы());
	ИТК_РедакторКода.Инициализация(ЭтотОбъект, "ТекстЗапроса", ДополнительныеСвойства);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияСхемаКомпоновкиДанныхXML()
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ТипЯзыка", ИТК_Перечисления.ТипЯзыкаРедактораXML());
	ИТК_РедакторКода.Инициализация(ЭтотОбъект, "СхемаКомпоновкиДанныхXML", ДополнительныеСвойства);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКодПриИзменении(Результат, ДополнительныеПараметры) Экспорт
	
	ТекстКод = ИТК_РедакторКодаКлиент.Текст(ЭтотОбъект, "Код");
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоле(ЭтотОбъект, ТекущаяСтрока, "Текст", ТекстКод);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаТекстЗапросаПриИзменении(Результат, ДополнительныеПараметры) Экспорт
	
	Результат = ИТК_РедакторКодаКлиент.Текст(ЭтотОбъект, "ТекстЗапроса");
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
	ИзменяемыеПоля.Вставить("Текст", Результат);
	ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСхемаКомпоновкиДанныхXMLПриИзменении(Результат, ДополнительныеПараметры) Экспорт
	
	Результат = ИТК_РедакторКодаКлиент.Текст(ЭтотОбъект, "СхемаКомпоновкиДанныхXML");
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
	ИзменяемыеПоля.Вставить("Текст", Результат);
	ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, ТекущаяСтрока, ИзменяемыеПоля);
	
КонецПроцедуры

&НаКлиенте
Функция КартинкаКнопкиСохранить()
	
	Если РабочиеДанные.Тип = Неопределено Тогда
		
		ИмяНастройкиСохранятьДанныеПоУмолчаниюВ = ИТК_НастройкиКлиентСерверПовтИсп.ИмяНастройкиСохранятьДанныеПоУмолчаниюВ();
		СохранятьДанныеПоУмолчаниюВ = ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, ИмяНастройкиСохранятьДанныеПоУмолчаниюВ);
		
	Иначе
		
		СохранятьДанныеПоУмолчаниюВ = РабочиеДанные.Тип;
		
	КонецЕсли;
	
	Если СохранятьДанныеПоУмолчаниюВ = ИТК_Перечисления.ТипХраненияДанныхФайл() Тогда
		
		Результат = БиблиотекаКартинок.Записать;
		
	Иначе
		
		Результат = БиблиотекаКартинок.ИТК_ЗаписатьВНастройки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКомандыРедактораКодаЗавершена(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_РедакторКодаКлиент.СтандартныйОбработчикЗавершенияКоманды(Результат, ДополнительныеПараметры);	
	
	НайденнаяСтрока = НайтиСтрокуПоUID(ДеревоДанных, ДополнительныеПараметры.UID);
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("Текст", Результат);
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
	ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
	
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, НайденнаяСтрока, ИзменяемыеПоля);
	
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
	ОбновитьСтруктуруЗапросов(ТекущаяСтрока);
	ПроверитьПоказатьОшибку();
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаКонструктораЗапросаЗавершена(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = НайтиСтрокуПоUID(ДеревоДанных, ДополнительныеПараметры.UID);
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменяемыеПоля = Новый Структура;
	ИзменяемыеПоля.Вставить("Текст", Результат);
	ИзменяемыеПоля.Вставить("ТребуетсяПроверка", Истина);
	ИзменяемыеПоля.Вставить("Ошибка", Неопределено);
	ИТК_КонсольРазработчикаДанныеКлиент.ИзменитьПоля(ЭтотОбъект, НайденнаяСтрока, ИзменяемыеПоля);
	
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
	ОбновитьСтруктуруЗапросов(НайденнаяСтрока);
	ТекущаяСтрока = НайденнаяСтрока;
	
	ПроверитьПоказатьОшибку();
	
КонецПроцедуры

&НаКлиенте
Функция ЭлементТекстПоТипуСтроки(Тип)
	
	Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоОдинИзТиповСтрокиЗапрос(Тип) Тогда
		
		Результат = Элементы.ТекстЗапроса;
		
	ИначеЕсли Тип = ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных() Тогда
		
		Результат = Элементы.СхемаКомпоновкиДанныхXML;
		
	ИначеЕсли Тип = ИТК_Перечисления.ЭлементДанныхКод() Тогда
		
		Результат = Элементы.Код;
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключаемыйЗагрузитьСостояниеРедактораКода()
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтроки = ТекущаяСтрока.Тип;
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	ЭлементТекст = ЭлементТекстПоТипуСтроки(ТипСтроки);
	
	Если ЭлементТекст = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ИТК_РедакторКодаКлиент.Инициализирован(ЭлементТекст) Тогда
		
		ПодключитьОбработчикОжидания("ПодключаемыйЗагрузитьСостояниеРедактораКода", 0.1, Истина);
		Возврат;
		
	КонецЕсли;
	
	Текст = ТекущиеДанные["Текст"];
	ДоступноРедактированиеТекста = ИТК_КонсольРазработчикаДанныеКлиентСервер.ДоступноРедактированиеТекстаДляСтроки(ТипСтроки);
	
	ИТК_РедакторКодаКлиент.УстановитьДоступностьРедактирования(ЭтотОбъект, ЭлементТекст, ДоступноРедактированиеТекста);
	ИТК_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, ЭлементТекст, Текст);
	
	// Восстановление выделения
	ИТК_РедакторКодаКлиент.УстановитьВыделение(ЭлементТекст, ТекущиеДанные["ГраницыВыделенияТекста"]);
	Если ИТК_РедакторКодаКлиентСервер.ЭтоРедакторКодаMonaco(ЭлементТекст) Тогда
		
		// Восстановление закладок
		ИТК_РедакторКодаКлиент.УстановитьЗакладки(ЭлементТекст, ТекущиеДанные["Закладки"]);
		
		// Установим оригинальный текст
		Если ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемОригинальногоТекста(ТипСтроки) Тогда
			ИТК_РедакторКодаКлиент.УстановитьОригинальныйТекст(ЭлементТекст, ТекущиеДанные["ОригинальныйТекст"]);
		КонецЕсли;
		
		// Восстановление состояния редактора
		ИТК_РедакторКодаКлиент.УстановитьСостояниеРедактора(ЭлементТекст, ТекущиеДанные["СостояниеРедактора"]);
		
	КонецЕсли;
	
	ЗагрузитьПользовательскиеОбъектыПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТребуетсяИнициализацияРедактора()
	
	Если Элементы.СтраницаКод.Видимость = Ложь Тогда
		
		Элемент = Элементы["Код"];
		ИТК_РедакторКодаКлиент.УстановитьТребуетсяДополнительнаяИнициализация(Элемент);
		
	КонецЕсли;
	
	Если Элементы.СтраницаТекстЗапроса.Видимость = Ложь Тогда
		
		Элемент = Элементы["ТекстЗапроса"];
		ИТК_РедакторКодаКлиент.УстановитьТребуетсяДополнительнаяИнициализация(Элемент);
		
	КонецЕсли;
	
	Если Элементы.СтраницаСхемаКомпоновкиДанныхXML.Видимость = Ложь Тогда
		
		Элемент = Элементы["СхемаКомпоновкиДанныхXML"];
		ИТК_РедакторКодаКлиент.УстановитьТребуетсяДополнительнаяИнициализация(Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеОтладкиИзБуфераОбмена(СтрокаXML)
	
	МассивДанных = ИТК_КонсольРазработчикаЭкспортДанных.ДанныеОтладкиИзСтрокиXML(СтрокаXML, УникальныйИдентификатор);
		
	УстановитьРабочиеДанные(РабочиеДанные, , , НСтр("ru = 'загружен из отладки';
													|en = 'loaded from debug'"));
	ОчиститьДанныеСервер();
	
	ЗагрузитьДанныеПострочно(МассивДанных, ДеревоДанных);
	
	ОбновитьСтруктуруЗапросовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗагрузитьДанныеОтладкиИзБуфераОбмена(Результат, ДополнительныеПараметры) Экспорт
	
	Текст = ИТК_БуферОбменаКлиент.Текст();
	
	Попытка
		
		ЗагрузитьДанныеОтладкиИзБуфераОбмена(Текст);
		ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект);
		
	Исключение
		
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение( , ПредставлениеОшибки, , ИТК_КонсольРазработчикаКлиентСервер.Представление());
		
	КонецПопытки;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПользовательскиеОбъектыПодсказки()
	
	ТипСтроки = ТекущаяСтрока.Тип;
	
	ЭлементТекст = ЭлементТекстПоТипуСтроки(ТипСтроки);
	Если НЕ ИТК_РедакторКодаКлиентСервер.ЭтоРедакторКодаMonaco(ЭлементТекст) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипСтроки <> ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательскиеОбъекты = ПользовательскиеОбъектыТекстЗапроса();
	ИТК_РедакторКодаКлиент.ЗагрузитьПользовательскиеОбъекты(ЭлементТекст, ПользовательскиеОбъекты);

КонецПроцедуры

&НаКлиенте
Функция ПользовательскиеОбъектыТекстЗапроса()
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	Результат = Новый Структура;
	
	Если ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос()
			И ЗначениеЗаполнено(ТекущиеДанные.ВнешниеИсточники) Тогда
		
		Результат = ПользовательскиеОбъектыТекстЗапросаСервер(ТекущиеДанные);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПользовательскиеОбъектыТекстЗапросаСервер(Данные)
	
	ЗначенияВнешнихИсточников = ИТК_КонсольРазработчика.ЗначенияВнешнихИсточников(Данные);
	Возврат ИТК_РедакторКода.ПользовательскиеОбъектыТекстЗапросаВКонсоли(ЗначенияВнешнихИсточников);
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияДанных()
	
	СброситьОригинальныйТекст(ДеревоДанных);
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьОригинальныйТекст(СтрокаРодитель)
	
	Для Каждого Строка Из СтрокаРодитель.ПолучитьЭлементы() Цикл
		
		Если НЕ ИТК_КонсольРазработчикаДанныеКлиентСервер.ЭтоТипСтрокиСИспользованиемОригинальногоТекста(Строка.Тип) Тогда
			Продолжить;
		КонецЕсли;
		
		Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(Строка);
		ИТК_КонсольРазработчикаДанныеКлиентСервер.СброситьОригинальныйТекст(Данные);
		
		СброситьОригинальныйТекст(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановлениеДанныхПослеАварийногоЗавершения(АвтоматическоеСохранениеДанных)
	
	ЗагрузитьДанные(АвтоматическоеСохранениеДанных.Данные);
	ЗаполнитьЗначенияСвойств(РабочиеДанные, АвтоматическоеСохранениеДанных.Тип);
	РабочиеДанные.Комментарий = НСтр("ru = 'восстановлен, аварийное завершение';
									|en = 'restored crash'");
		
	ИТК_КонсольРазработчикаДанныеКлиентСервер.ДанныеМодифицированы(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатИсполненияКода(Адрес)
	
	РезультатИсполнения = ПолучитьИзВременногоХранилища(Адрес);
	Возврат РезультатИсполнения.Результат;

КонецФункции

&НаКлиенте
Функция ОсновнаяСтрока(Строка, Тип)
	
	Результат = Неопределено;
	
	Родитель = Строка;
	Пока Истина Цикл 
		
		Если Родитель.Тип = Тип Тогда
			
			Результат = Родитель;
			Прервать;
			
		КонецЕсли;
		
		Родитель = Родитель.ПолучитьРодителя();
		Если Родитель = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОсновнойЗапрос(Строка)
	Возврат ОсновнаяСтрока(Строка, ИТК_Перечисления.ЭлементДанныхЗапрос());
КонецФункции

&НаКлиенте
Функция ОсновнаяСхемаКомпоновкиДанных(Строка)
	
	Возврат ОсновнаяСтрока(Строка, ИТК_Перечисления.ЭлементДанныхСхемаКомпоновкиДанных());
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОперациюОбработчикОповещения(Результат, ДополнительныеПараметры) Экспорт

	Режим = ДополнительныеПараметры.Режим;
	НаименованиеОперации = ДополнительныеПараметры.НаименованиеОперации;
	
	ОбрабатываемаяСтрока = ДополнительныеПараметры.ОбрабатываемаяСтрока;
	ИгнорироватьЛимитСтрок = ДополнительныеПараметры.ИгнорироватьЛимитСтрок;
	
	// Автосохранение перед выполнением
	Если ИТК_НастройкиКлиент.ЗначениеНастройки(ЭтотОбъект, "АвтоСохранениеПередВыполнением") Тогда
		АвтосохранениеДанных();
	КонецЕсли;
	
	Если Режим = ИТК_Перечисления.РежимВыполненияКодаНаКлиенте() Тогда
		ВыполнитьОперациюНаКлиенте(ОбрабатываемаяСтрока, Режим);
	Иначе
		ВыполнитьОперациюЧерезДлительныеОперации(ОбрабатываемаяСтрока, НаименованиеОперации, Режим, ИгнорироватьЛимитСтрок);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершенВыборЗначенияПараметра(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	ИмяПараметра = ПараметрЗапросаТекущиеДанные.Имя;
	ИТК_КонсольРазработчикаДанныеКлиент.ВставитьЗначениеПараметраЗапроса(ЭтотОбъект, ТекущаяСтрока, ИмяПараметра, Значение);
	ОбновитьСтрокуПараметра(ПараметрЗапросаТекущиеДанные, ИмяПараметра, ПараметрЗапросаТекущиеДанные.ТипЗначения, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторТекстаЗапроса()
	
	Если ТекущаяСтрока.Тип = ИТК_Перечисления.ЭлементДанныхЗапрос() Тогда
		
		ПерейтиКЗапросу = Неопределено;
		СтрокаЗапрос = ТекущаяСтрока;
		
	Иначе
		
		ПерейтиКЗапросу = ТекущаяСтрока.Данные.ИндексВСтруктуре;
		СтрокаЗапрос = ОсновнаяСтрока(ТекущаяСтрока, ИТК_Перечисления.ЭлементДанныхЗапрос());
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("UID", СтрокаЗапрос.UID);
	
	Данные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(СтрокаЗапрос);
	ДополнительныеПараметры.Вставить("Данные", Данные);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РаботаКонструктораЗапросаЗавершена", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыКонструктора = Новый Структура;
	ПараметрыКонструктора.Вставить("ПерейтиКЗапросу", ПерейтиКЗапросу);
	
	ИТК_ЗапросКлиент.ОткрытьКонструктор(Данные.Текст, ОповещениеОЗавершении, ПараметрыКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюВнешнихИсточников()
	
	КоличествоВнешнихИсточников = ВнешниеИсточники.Количество();
	
	Номер = 1;
	Для Каждого СтрокаВнешнийИсточник Из ВнешниеИсточники Цикл
		
		СтрокаВнешнийИсточник.Номер = Номер;
		Номер = Номер + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НачальныеДанныеИВосстановлениеАварийногоЗавершения(ОткрытыеОкнаКонсоли)
	
	// Начальные данные и восстановление аварийного завершения
	АварийноеЗавершение = ИТК_КонсольРазработчика.ЗначениеПеременной("АварийноеЗавершение");
	Если АварийноеЗавершение = Неопределено Тогда
		АварийноеЗавершение = Новый Соответствие;
	КонецЕсли;
	
	АварийноеЗавершение.Вставить(УникальныйИдентификатор, Истина);
	ИТК_КонсольРазработчика.ЗаписатьЗначениеПеременной("АварийноеЗавершение", АварийноеЗавершение);
	
	АварийноеВосстановление = Ложь;
	Для Каждого КлючИЗначениеОкно Из АварийноеЗавершение Цикл
		
		Если ОткрытыеОкнаКонсоли.Найти(КлючИЗначениеОкно.Ключ) = Неопределено Тогда
			АварийноеВосстановление = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если АварийноеВосстановление Тогда
		
		АвтоматическоеСохранениеДанных = ИТК_КонсольРазработчика.ЗначениеПеременной("АвтоматическоеСохранениеДанных");
		Если ЗначениеЗаполнено(АвтоматическоеСохранениеДанных) Тогда
			ВосстановлениеДанныхПослеАварийногоЗавершения(АвтоматическоеСохранениеДанных);
		Иначе
			НовыеДанныеСервер();
		КонецЕсли;
		
		ИТК_КонсольРазработчика.ЗаписатьЗначениеПеременной("АварийноеЗавершение", Неопределено);
		
	Иначе
		
		ИТК_КонсольРазработчика.ЗаписатьЗначениеПеременной("АвтоматическоеСохранениеДанных", Неопределено);
		
		Если ЗначениеЗаполнено(ВходныеДанныеОтладки) Тогда
			
			ЗагрузкаВходныхДанныеОтладки(ВходныеДанныеОтладки);
			ВходныеДанныеОтладки = Неопределено;
			
		Иначе
			НовыеДанныеСервер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытыеОкнаКонсолиРазработчика()
	
	Результат = Новый Массив;
	Результат.Добавить(УникальныйИдентификатор);
	
	Для Каждого ОкноКлиентское Из ПолучитьОкна() Цикл
		
		Для Каждого ПодчиненноеОкно Из ОкноКлиентское.Содержимое Цикл
			
			Если ПодчиненноеОкно.ИмяФормы = ИмяФормы Тогда
				Результат.Добавить(ПодчиненноеОкно.УникальныйИдентификатор);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВосстановитьСостояниеСтроки()

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодключаемыйЗагрузитьСостояниеРедактораКода();
	
	ТекущиеДанные = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ТекущаяСтрока);
	
	// Активация страница которая была последней
	Если ЗначениеЗаполнено(ТекущиеДанные.Страница) Тогда
		
		ЭлементСтраница = Элементы["Страница" + ТекущиеДанные.Страница];
		Элементы.ПанельНастроек.ТекущаяСтраница = ЭлементСтраница;
		
		Если ЭлементСтраница = Элементы.СтраницаТекстЗапроса Тогда
			ТекущийЭлемент = Элементы.ТекстЗапроса;
		ИначеЕсли ЭлементСтраница = Элементы.СтраницаСхемаКомпоновкиДанныхXML Тогда
			ТекущийЭлемент = Элементы.СхемаКомпоновкиДанныхXML;
		ИначеЕсли ЭлементСтраница = Элементы.СтраницаКод Тогда
			ТекущийЭлемент = Элементы.Код;
		ИначеЕсли ЭлементСтраница = Элементы.СтраницаПрочее Тогда
			ТекущийЭлемент = Элементы.Представление;
		КонецЕсли;
		
	Иначе
		ТекущийЭлемент = Элементы.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция АктивироватьСтрокуДереваДанныхПослеОбновления()
	
	ТекущаяСтрока = Неопределено;
	ЭлементДеревоДанных = Элементы.ДеревоДанных;
	
	КоллекцияСтрок = ДеревоДанных.ПолучитьЭлементы();
	Если ЗначениеЗаполнено(КоллекцияСтрок) Тогда
		
		ЭлементДеревоДанных.ТекущаяСтрока = КоллекцияСтрок[0].ПолучитьИдентификатор();
		
		Если НЕ ИТК_ФормаКлиент.ЭлементВиден(ЭлементДеревоДанных) Тогда
			ДеревоДанныхПриАктивизацииСтроки(ЭлементДеревоДанных);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементыПанелиРезультата()
	
	Если ПанельРезультатСокращенная Тогда
		
		ЭлементСвернутьЗаголовок = Неопределено;
		ЭлементСвернутьКартинка = БиблиотекаКартинок.ИТК_ПанельСправаОткрыть;
		
		ОтображениеКнопок = ОтображениеКнопки.Картинка;
		ВидимостьПрочих = Ложь;
		
		ШиринаГруппы = 3;
		
	Иначе
		
		ЭлементСвернутьЗаголовок = НСтр("ru = 'Свернуть'; en = 'Collapse'");
		ЭлементСвернутьКартинка = БиблиотекаКартинок.ИТК_ПанельСправаЗакрыть;
		
		ОтображениеКнопок = ОтображениеКнопки.КартинкаИТекст;
		ВидимостьПрочих = Истина;
		
		ШиринаГруппы = 15;
		
	КонецЕсли;
	
	ЭлементСвернуть = Элементы.ПанельРезультатаСократитьПоказать;
	ЭлементСвернуть.Заголовок = ЭлементСвернутьЗаголовок;
	ЭлементСвернуть.Отображение = ОтображениеКнопок;
	ЭлементСвернуть.Картинка = ЭлементСвернутьКартинка;
	
	ЭлементГруппа = Элементы.ТабличныйДокументРезультатПанель;
	ЭлементГруппа.Ширина = ШиринаГруппы;
	ОбновитьПодчиненныеЭлементыПанелиРезультата(ЭлементГруппа, ОтображениеКнопок, ВидимостьПрочих);
	
	ЭлементГруппаНеВсеВыведены = Элементы.Найти("ГруппаНеВсеСтрокиВыведены");
	Если ЭлементГруппаНеВсеВыведены <> Неопределено Тогда
		ЭлементГруппаНеВсеВыведены.Видимость = НЕ ПанельРезультатСокращенная;
	КонецЕсли;
	
	КнопкаВывестиВсеСтрокиРезультатаСвернутая = Элементы.Найти("ВывестиВсеСтрокиРезультатаСвернутая");
	Если КнопкаВывестиВсеСтрокиРезультатаСвернутая <> Неопределено Тогда
		
		ВсеСтрокиВыведены = (ТекущийРезультат.ВсеСтрокиВыведены <> Ложь);
		КнопкаВывестиВсеСтрокиРезультатаСвернутая.Видимость = ПанельРезультатСокращенная И НЕ ВсеСтрокиВыведены;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодчиненныеЭлементыПанелиРезультата(Элемент, Отображение, Видимость)
	
	Если Элемент.Имя = "ГруппаНеВсеСтрокиВыведены" Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("КнопкаФормы") Тогда
			ПодчиненныйЭлемент.Отображение = Отображение;
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			ОбновитьПодчиненныеЭлементыПанелиРезультата(ПодчиненныйЭлемент, Отображение, Видимость);
		ИначеЕсли СтрЗаканчиваетсяНа(ПодчиненныйЭлемент.Имя, "Декорация") Тогда
			Продолжить;
		Иначе
			ПодчиненныйЭлемент.Видимость = Видимость;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметровЗапросаОбновитьЭлементыСтроки(ДанныеСтроки, УстанавливатьОграничениеТипа = Истина)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнаяСтрока = ОсновнаяСтрока(ТекущаяСтрока, ИТК_Перечисления.ЭлементДанныхЗапрос());
	ДанныеОсновнойСтроки = ИТК_КонсольРазработчикаДанныеКлиентСервер.Получить(ОсновнаяСтрока);
	
	ТипЗначенияПараметра = ДанныеОсновнойСтроки.Параметры[ДанныеСтроки.Имя];
	ЗначениеПараметра = ИТК_КонсольРазработчикаДанныеКлиент.ЗначениеПараметраЗапроса(ДанныеОсновнойСтроки, ДанныеСтроки.Имя, ТипЗначенияПараметра);
	
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элементы.ПараметрыЗапросаЗначениеПредставление, ЗначениеПараметра, ДанныеСтроки.ТипЗначения, УстанавливатьОграничениеТипа);
	
КонецПроцедуры

#КонецОбласти
