
&НаКлиенте
Процедура ВыбратьВсех(Команда)
	
	Для Каждого СтрокаКонтрагента Из Контрагенты Цикл
		СтрокаКонтрагента.Отбирать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеНеотмеченных(Команда)
	
	Отбор = Новый Структура("Отбирать", Ложь);
	НайденныеСтроки = Контрагенты.НайтиСтроки(Отбор);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Контрагенты.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодборКонтрагентовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Отбирать,
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.тн_РаботаетСЭД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Контрагенты.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКонтрагентов(Команда)
	
	ПодборКонтрагентовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьСчетаФактурыНаСервере6202()
	
	Запрос = Новый Запрос;
	ДатаЗапроса = ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Запрос.УстановитьПараметр("Граница", Новый Граница(ДатаЗапроса));
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отбирать", Истина);
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты.Выгрузить(ПараметрыОтбора).ВыгрузитьКолонку("Контрагент"));
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.Касса);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
    МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
    Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	-ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ХозрасчетныйОстатки.Субконто1 КАК Контрагент
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&Граница, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), &МассивСубконто, Субконто1 В (&Контрагенты)) КАК ХозрасчетныйОстатки
	               |ГДЕ
	               |	ХозрасчетныйОстатки.СуммаОстаток < 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК ДокументРегистратор,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК Контрагент,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаПоДокументу
	               |ПОМЕСТИТЬ ВТ_Обороты
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаЗапроса, ГОД, -3), ДЕНЬ),
	               |			&ДатаЗапроса,
	               |			Регистратор,
	               |			СчетДт В ИЕРАРХИИ (&МассивСчетов),
	               |			,
	               |			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным),
	               |			&МассивСубконто,
	               |			СубконтоКт1 В
	               |				(ВЫБРАТЬ
	               |					ВТ_Остатки.Контрагент КАК Контрагент
	               |				ИЗ
	               |					ВТ_Остатки КАК ВТ_Остатки)) КАК ХозрасчетныйОборотыДтКт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_Обороты.ДокументРегистратор КАК ДокументРегистратор,
	               |	ВТ_Обороты.Контрагент КАК Контрагент,
	               |	ВТ_Остатки.СуммаОстаток КАК СуммаОстаток,
	               |	ВТ_Обороты.СуммаПоДокументу КАК СуммаПоДокументу
	               |ИЗ
	               |	ВТ_Обороты КАК ВТ_Обороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	               |		ПО ВТ_Обороты.Контрагент = ВТ_Остатки.Контрагент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_Обороты.ДокументРегистратор.Дата УБЫВ,
	               |	ВТ_Обороты.ДокументРегистратор.Ссылка УБЫВ
	               |ИТОГИ
	               |	МАКСИМУМ(СуммаОстаток)
	               |ПО
	               |	Контрагент";	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаКонтрагент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		
		СуммаОстаткаПоКонтрагенту = ВыборкаКонтрагент.СуммаОстаток;
		СуммаПоДокументам = 0;
		
		Выборка = ВыборкаКонтрагент.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СчетФактура = НайтиСчетФактуруПоДокументуОснования(Выборка.ДокументРегистратор);
			
			Если ЗначениеЗаполнено(СчетФактура) Тогда
				
				СуммаПоДокументам = СуммаПоДокументам + Выборка.СуммаПоДокументу;
				
				НоваяСтрока = СчетаФактуры.Добавить();
				НоваяСтрока.СчетФактура = СчетФактура;
				
				Если СуммаОстаткаПоКонтрагенту <= СуммаПоДокументам Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиСчетФактуруПоДокументуОснования(ДокументОснование)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйАванс.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданныйАванс КАК СчетФактураВыданныйАванс
		|ГДЕ
		|	СчетФактураВыданныйАванс.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НайденныйДокумент = Неопределено;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НайденныйДокумент = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НайденныйДокумент;
	
КонецФункции

&НаСервере
Процедура ОтобратьСчетаФактурыНаСервереКвартал()
	
	Запрос = Новый Запрос;
	ДатаНачала = ?(ЗначениеЗаполнено(Дата), НачалоКвартала(Дата), НачалоКвартала(НачалоКвартала(ТекущаяДатаСеанса())-1));
	ДатаОкончания = ?(ЗначениеЗаполнено(Дата), КонецКвартала(Дата), КонецКвартала(НачалоКвартала(ТекущаяДатаСеанса())-1));
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отбирать", Истина);
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты.Выгрузить(ПараметрыОтбора).ВыгрузитьКолонку("Контрагент"));
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СчетФактураВыданный.Ссылка КАК Ссылка,
	               |	СчетФактураВыданный.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.СчетФактураВыданныйАванс КАК СчетФактураВыданный
	               |ГДЕ
	               |	НЕ СчетФактураВыданный.ПометкаУдаления
	               |	И СчетФактураВыданный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И СчетФактураВыданный.Контрагент В(&Контрагенты)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СчетФактураВыданный.Дата УБЫВ,
	               |	Ссылка УБЫВ
	               |ИТОГИ
	               |	МАКСИМУМ(Ссылка)
	               |ПО
	               |	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаКонтрагент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		
		Выборка = ВыборкаКонтрагент.Выбрать();		
		Пока Выборка.Следующий() Цикл			
			НоваяСтрока = СчетаФактуры.Добавить();
			НоваяСтрока.СчетФактура = Выборка.Ссылка;			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСчетаФактуры(Команда)

	СчетаФактуры.Очистить();
	Если ВариантОтбора = 0 Тогда
		ОтобратьСчетаФактурыНаСервере6202();
	ИначеЕсли ВариантОтбора = 1 Тогда
		ОтобратьСчетаФактурыНаСервереКвартал();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаФактурыСчетФактураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = НайтиСчетаФактурыПоНомеру(Текст);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиСчетаФактурыПоНомеру(Текст)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 50
	               |	СчетФактураВыданный.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СчетФактураВыданныйАванс КАК СчетФактураВыданный
	               |ГДЕ
	               |	СчетФактураВыданный.Номер ПОДОБНО &Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СчетФактураВыданный.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номер", "%" + Текст + "%");
	
	Результат = Новый СписокЗначений;
	Результат.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СчетаФактурыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ВариантОтбора <> 2 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ЗарегистрироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПланОбмена_Интеграция_УПП_ОКС.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.тн_Интеграция_УПП_ОКС КАК ПланОбмена_Интеграция_УПП_ОКС
		|ГДЕ
		|	НЕ ПланОбмена_Интеграция_УПП_ОКС.ЭтотУзел
		|	И НЕ ПланОбмена_Интеграция_УПП_ОКС.ПометкаУдаления";
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Для Каждого СчетФактура Из СчетаФактуры Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, СчетФактура.СчетФактура);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	
	Элементы.ОтобратьСчетаФактуры.Доступность = ВариантОтбора <> 2;
	
КонецПроцедуры
