#Область ПрограммныйИнтерфейс

// см. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
		
	ИндексПрофилей = ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	//++ Локализация
	
	#Область Дополнить_профиль_СупервайзерТорговыхПредставителей
	ОписаниеПрофиля = НайтиПрофиль("СупервайзерТорговыхПредставителей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "СупервайзерТорговыхПредставителей");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		
		// Дополнительные права
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
		
		// Документы, чтение.

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		//-- НЕ УТ
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
		
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_Маркетолог
	ОписаниеПрофиля = НайтиПрофиль("Маркетолог", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
	
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Маркетолог");
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_РуководительОтделаПродаж
	ОписаниеПрофиля = НайтиПрофиль("РуководительОтделаПродаж", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "РуководительОтделаПродаж");

		// Справочники, чтение.

		// Документы, чтение.

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПоАренде");
		//-- НЕ УТ
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");

		// Дополнительные права
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
		// Работа с сервисом Share.
		ИнтеграцияShare.ДобавитьПраваИспользованияСервиса(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_МенеджерПоПродажам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоПродажам", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоПродажам");
		// Документы, чтение.

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПоАренде");
		//-- НЕ УТ
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляОнлайнОплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);

		// Работа с сервисом Share.
		ИнтеграцияShare.ДобавитьПраваИспользованияСервиса(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Кассир
	ОписаниеПрофиля = НайтиПрофиль("Кассир", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Кассир");
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		
		// Документы, чтение.

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДепонированнойЗарплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОператораСистемыПлатон");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПолученияУведомленийОбЭЛН");
		//-- НЕ УТ 

		// Документы, создание.

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДенежныхДокументов");
		//-- НЕ УТ
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Казначей
	ОписаниеПрофиля = НайтиПрофиль("Казначей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Казначей");
		// Нормативно-справочная информация
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		
		// Документы чтение

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДепонированнойЗарплаты");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНалоговИВзносов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСБанкамиПоЗарплатнымПроектам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменаСБанкамиПоЛицевымСчетамЗарплатныхПроектов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменаСБанкамиПоЗачислениюЗарплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаДокументовОбменаСБанкамиПоЗарплатнымПроектам");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиОбменСБанкамиПоЗарплатнымПроектам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыплаченнойЗарплаты");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыплаченнойЗарплатыРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыплатПрочихДоходов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПоАренде");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОператораСистемыПлатон");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПолученияУведомленийОбЭЛН");
		//-- НЕ УТ
		
		// Добавление документы.

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДепонированнойЗарплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		//-- НЕ УТ

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОперацийПоЯндексКассе");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовОнлайнОплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменСБанками");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
		
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоОбеспечениюПотребностей
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоОбеспечениюПотребностей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоОбеспечениюПотребностей");
		// Нормативно-справочная информация
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
		
		// БизнесСеть.КоммерческиеПредложения
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ФинансовыйАналитик
	ОписаниеПрофиля = НайтиПрофиль("ФинансовыйАналитик", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ФинансовыйАналитик");
		// Прикладные роли
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаймовСотрудникам");
		//-- НЕ УТ
		
		// Документы, чтение

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПоАренде");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОператораСистемыПлатон");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовРезервовПодОбесценениеЗапасов");
		//-- НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомитента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНаНеподтвержденнуюРеализацию0");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Кладовщик
	ОписаниеПрофиля = НайтиПрофиль("Кладовщик", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Кладовщик");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоЗакупкам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоЗакупкам", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоЗакупкам");

		// Документы, чтение.

		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПоАренде");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОператораСистемыПлатон");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовРезервовПодОбесценениеЗапасов");
		//-- НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
		
		// БизнесСеть.КоммерческиеПредолжения
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомитента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);

		// Работа с сервисом Share.
		ИнтеграцияShare.ДобавитьПраваИспользованияСервиса(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Клиент
	ОписаниеПрофиля = НайтиПрофиль("Клиент", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Клиент");

		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеПартнеров
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеПартнеров", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ОтветственныйЗаВедениеПартнеров");

	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеНоменклатуры
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеНоменклатуры", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ОтветственныйЗаВедениеНоменклатуры");
		
		// отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаПересеченияШтрихкодовНоменклатурыСоСпецКодами");
	КонецЕсли;

	#КонецОбласти

	#Область Дополнить_профиль_РаботникСклада
	ОписаниеПрофиля = НайтиПрофиль("РаботникСклада", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "РаботникСклада");

	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоДоставке
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоДоставке", ОписанияПрофилей, ИндексПрофилей);	
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоДоставке");
		
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ОтправкаЗаказовНаДоставкуПеревозчикуСервисДоставки");
		
		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
		//-- НЕ УТ
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_ПродавецКассирККМ
	ОписаниеПрофиля = НайтиПрофиль("ПродавецКассирККМ", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ПродавецКассирККМ");
		
		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
		//-- НЕ УТ
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
	КонецЕсли;
	#КонецОбласти
	
	//++ НЕ УТ
	#Область Дополнить_профиль_МенеджерПоПроизводствуНаСтороне
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоПроизводствуНаСтороне", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоПроизводствуНаСтороне");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		
		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");

		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_ЭкономистПроизводства
	ОписаниеПрофиля = НайтиПрофиль("ЭкономистПроизводства", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ЭкономистПроизводства");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовРезервовПодОбесценениеЗапасов");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	//-- НЕ УТ

	//++ НЕ УТКА
	#Область Дополнить_профиль_МенеджерПроизводства
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПроизводства", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПроизводства");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_КонтролерОТК
	ОписаниеПрофиля = НайтиПрофиль("КонтролерОТК", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "КонтролерОТК");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_МенеджерПоПереработкеДавальческогоСырья
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоПереработкеДавальческогоСырья", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоПереработкеДавальческогоСырья");

			// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область Дополнить_профиль_МенеджерПоРозничнойТорговле
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоРозничнойТорговле", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоРозничнойТорговле");

		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		//++ НЕ УТ
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
		//-- НЕ УТ
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");

	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_УчастникСогласованияУсловийПродаж
	
	ОписаниеПрофиля = НайтиПрофиль("УчастникСогласованияУсловийПродаж", ОписанияПрофилей, ИндексПрофилей);
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	#КонецОбласти 
	
	#Область Дополнить_профиль_Ремонтник
	
	ОписаниеПрофиля = НайтиПрофиль("Ремонтник", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

	// ЛокализацияРаботыСЭПД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
	КонецЕсли;
	
	#КонецОбласти 
	
	#Область Дополнить_профиль_Ремонтник
	
	ОписаниеПрофиля = НайтиПрофиль("Ремонтник", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

	// ЛокализацияРаботыСЭПД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
	КонецЕсли;
	
	#КонецОбласти 
	
	#Область Дополнить_профиль_ДиспетчерСборкиИКурьерскойДоставки
	
	ОписаниеПрофиля = НайтиПрофиль("ДиспетчерСборкиИКурьерскойДоставки", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Дополнить_профиль_Бухгалтер
	
	ОписаниеПрофиля = НайтиПрофиль("Бухгалтер", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Дополнить_профиль_ИнициаторЗаявокНаРасходованиеДенежныхСредств
	
	ОписаниеПрофиля = НайтиПрофиль("ИнициаторЗаявокНаРасходованиеДенежныхСредств", ОписанияПрофилей, ИндексПрофилей);
	
	Если ОписаниеПрофиля <> Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");
	КонецЕсли;
	
	#КонецОбласти 
	
	//-- Локализация

КонецПроцедуры

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// см. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
		
	ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	//++ Локализация

	// Папка профилей "Государственные информационные системы".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "ГосударственныеИнформационныеСистемы";
	ОписаниеПапки.Идентификатор = "05de7c25-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Государственные информационные системы';
			|en = 'State information systems'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);

	#Область Создать_профиль_ОтветственныйЗаОбменЭД
	// Профиль "Ответственный за обмен электронными документами (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаОбменЭД";
	ОписаниеПрофиля.Идентификатор = "1c7bc32a-60eb-4395-ab8d-87fd6103a095";
	ОписаниеПрофиля.Родитель      = "Прочее";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за обмен электронными документами (дополнительный)';
										|en = 'Employee responsible for exchanging electronic documents (additional)'");

	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекEDI");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDIЗакупка");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDIПродажа");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDI");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДелEDI");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	
	// ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоАктированияЕИС");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, назначается пользователям, осуществляющим настройку
	                                      |соглашений по обмену электронными документами';
	                                      |en = 'Additional profile is assigned to users who configure
	                                      |agreements on electronic document exchange'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	#КонецОбласти
	
	#Область Создать_профиль_ВетеринарныйВрач

	// Профиль "Ветеринарный врач".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ВетеринарныйВрач";
	ОписаниеПрофиля.Идентификатор = "2434ce08-e835-48a1-a1c9-d02e5ce8adba";
	ОписаниеПрофиля.Родитель      = "ГосударственныеИнформационныеСистемы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ветеринарный врач';
										|en = 'Veterinary'");
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ВетеринарныйВрач");

	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");

	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийПродукцииИМатериалов");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСтороне");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПереработчикам2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовПереработчиков2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводстваБезЗаказов");
	//-- НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовДавальцев2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовДавальцам2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства2_2");
	//-- НЕ УТКА

	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	//++ НЕ УТ
	
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПереработки");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПередачиВПереработку2_5");
	//-- НЕ УТ

	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПриемаВПереработку2_5");
	//-- НЕ УТКА
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	//-- НЕ УТ

	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПриемВПереработку");
	//-- НЕ УТКА
	
	// ЛокализацияУчета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит оформление ветеринарной сопроводительной документации,
	                                      |оформление транспортных, производственных и складских операций с продукцией,
	                                      |автоматическое взаимодействие с системой ""Меркурий"".';
	                                      |en = 'Use this profile to register veterinary supporting documents,
	                                      |transport, production and warehouse operations with manufactured products,
	                                      |and for automatic interaction with the Mercury system.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти
	
	//++ НЕ УТ
	#Область Создать_профиль_ЗарплатаИКадры
	ИнтеграцияБЗК.ДобавитьПрофилиЗарплатаИКадры(ОписанияПрофилей, ПараметрыОбновления);
	#КонецОбласти
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Если НЕ ОписаниеПрофиля.Свойство("Роли") Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексРоли = ОписаниеПрофиля.Роли.Найти("ДобавлениеИзменениеСертификатовВХранилище");
		Если ИндексРоли <> Неопределено Тогда
			ОписаниеПрофиля.Роли.Удалить(ИндексРоли);
		КонецЕсли;
		
		ДополнитьПрофильОграничениямиРегламентированнойОтчетности(ОписаниеПрофиля);
		
	КонецЦикла;
	//-- НЕ УТ
	
	
	//-- Локализация
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// см. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = Описание + "
//++ Локализация
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Чтение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Изменение.Организации
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КассовыеКниги.Чтение.Организации
	|Справочник.КассовыеКниги.Изменение.Организации
	|Справочник.КвитанцииДТСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КвитанцииДТСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КэшВизуализацииДокументовЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КэшВизуализацииДокументовЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Чтение.ГруппыПартнеров
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Изменение.ГруппыПартнеров
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.МаршрутыПодписания.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Изменение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НастройкиОбменСБанками.Изменение.Организации
	|Справочник.НастройкиОнлайнОплат.Чтение.Организации
	|Справочник.НастройкиОнлайнОплат.Изменение.Организации
	|Справочник.НастройкиПодключенияКОнлайнЗаказам.Чтение.Организации
	|Справочник.НастройкиПодключенияКОнлайнЗаказам.Изменение.Организации
	|Справочник.Патенты.Чтение.Организации
	|Справочник.Патенты.Изменение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Чтение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Изменение.Организации
	|Документ.АктОбУничтоженииПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.АктОбУничтоженииПерсональныхДанных.Чтение.Организации
	|Документ.АктОбУничтоженииПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.АктОбУничтоженииПерсональныхДанных.Изменение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.БлокировкаВычетаНДС.Чтение.Организации
	|Документ.БлокировкаВычетаНДС.Изменение.Организации
	|Документ.ВводОстатковНДСПредъявленного.Чтение.Организации
	|Документ.ВводОстатковНДСПредъявленного.Изменение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Чтение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Изменение.Организации
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Чтение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Изменение.Организации
	|Документ.ЗаписьКнигиПокупок.Чтение.Организации
	|Документ.ЗаписьКнигиПокупок.Изменение.Организации
	|Документ.ЗаписьКнигиПродаж.Чтение.Организации
	|Документ.ЗаписьКнигиПродаж.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Чтение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Изменение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Чтение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Изменение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Чтение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеПоставщика.Чтение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеПоставщика.Изменение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Чтение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Изменение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Чтение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.ЛистКассовойКниги.Чтение.Организации
	|Документ.ЛистКассовойКниги.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.МаркировкаТоваровИСМП.Чтение.Организации
	|Документ.МаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ОперацияПоЯндексКассе.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Чтение.Организации
	|Документ.ОперацияПоЯндексКассе.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Изменение.Организации
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Чтение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Изменение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.ОтчетЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ОтчетИСМП.Чтение.Организации
	|Документ.ОтчетИСМП.Изменение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетОбменСБанками.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.ПеремаркировкаТоваровИСМП.Чтение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ПеремещениеМеждуМОДИСМП.Чтение.Организации
	|Документ.ПеремещениеМеждуМОДИСМП.Изменение.Организации
	|Документ.ПисьмоОбменСБанками.Чтение.Организации
	|Документ.ПисьмоОбменСБанками.Изменение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПодключениеКегаКОборудованиюРозливаИСМП.Чтение.Организации
	|Документ.ПодключениеКегаКОборудованиюРозливаИСМП.Изменение.Организации
	|Документ.ПриемкаТоваровИСМП.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Изменение.Организации
	|Документ.РазрешениеНаОтгрузкуИСМП.Чтение.Организации
	|Документ.РазрешениеНаОтгрузкуИСМП.Изменение.Организации
	|Документ.СводнаяСправкаНДС.Чтение.Организации
	|Документ.СводнаяСправкаНДС.Изменение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СообщениеОбменСБанками.Изменение.Организации
	|Документ.СообщениеЭДО.Чтение.Организации
	|Документ.СообщениеЭДО.Изменение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Чтение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Изменение.Организации
	|Документ.СписаниеПартийЗЕРНО.Чтение.Организации
	|Документ.СписаниеПартийЗЕРНО.Изменение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Чтение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.ВнешниеПользователи
	|Документ.СчетФактураВыданный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураКомиссионеру.Чтение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Чтение.Организации
	|Документ.СчетФактураКомиссионеру.Изменение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Изменение.Организации
	|Документ.СчетФактураКомитента.Чтение.Организации
	|Документ.СчетФактураКомитента.Изменение.Организации
	|Документ.СчетФактураНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураНалоговыйАгент.Изменение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Чтение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.Организации
	|Документ.ТранспортнаяНакладная.Чтение.Организации
	|Документ.ТранспортнаяНакладная.Изменение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Чтение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.Склады
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.Склады
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Чтение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Изменение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Чтение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Изменение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Изменение.Организации
	|Документ.ЧекЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЭлектроннаяСопроводительнаяВедомость.Чтение.Организации
	|Документ.ЭлектроннаяСопроводительнаяВедомость.Изменение.Организации
	|Документ.ЭлектроннаяТранспортнаяНакладная.Чтение.Организации
	|Документ.ЭлектроннаяТранспортнаяНакладная.Изменение.Организации
	|Документ.ЭлектронныйДоговорФрахтования.Чтение.Организации
	|Документ.ЭлектронныйДоговорФрахтования.Изменение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Изменение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Изменение.Организации
	|Документ.ЭлектронныйЗаказЗаявка.Чтение.Организации
	|Документ.ЭлектронныйЗаказЗаявка.Изменение.Организации
	|Документ.ЭлектронныйЗаказНаряд.Чтение.Организации
	|Документ.ЭлектронныйЗаказНаряд.Изменение.Организации
	|Документ.ЭлектронныйПутевойЛист.Чтение.Организации
	|Документ.ЭлектронныйПутевойЛист.Изменение.Организации
	|ЖурналДокументов.КорректировкиНДС.Чтение.Организации
	|ЖурналДокументов.ПрослеживаемостьУведомления.Чтение.Организации
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|РегистрСведений.ВерсииТитуловЭПД.Чтение.Организации
	|РегистрСведений.ВерсииТитуловЭПД.Изменение.Организации
	|РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Чтение.Организации
	|РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Изменение.Организации
	|РегистрСведений.ДанныеОснованийСчетовФактур.Чтение.Организации
	|РегистрСведений.ДетализацияСебестоимостиТоваров.Чтение.Организации
	|РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП.Чтение.Организации
	|РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.Чтение.Организации
	|РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.Изменение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Чтение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Изменение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Чтение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Изменение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Чтение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Изменение.Организации
	|РегистрСведений.ЗаказыТорговыхПлощадок.Чтение.Организации
	|РегистрСведений.ЗаказыТорговыхПлощадок.Изменение.Организации
	|РегистрСведений.ЗначенияРеквизитовДокументовЭПД.Чтение.Организации
	|РегистрСведений.ЗначенияРеквизитовДокументовЭПД.Изменение.Организации
	|РегистрСведений.ИдентификаторыОнлайнЗаказов.Чтение.Организации
	|РегистрСведений.ИдентификаторыОнлайнЗаказов.Изменение.Организации
	|РегистрСведений.ИмпортируемыеТоварыТорговыхПлощадок.Чтение.Организации
	|РегистрСведений.ИмпортируемыеТоварыТорговыхПлощадок.Изменение.Организации
	|РегистрСведений.КэшВизуализацииДокументовЭДО.Чтение.Организации
	|РегистрСведений.КэшВизуализацииДокументовЭДО.Изменение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Чтение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Изменение.Организации
	|РегистрСведений.НастройкиОбменаЕИС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаЕИС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаЕИСДляЗаказчиков.Чтение.Организации
	|РегистрСведений.НастройкиОбменаЕИСДляЗаказчиков.Изменение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Изменение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНДСПриУСН.Чтение.Организации
	|РегистрСведений.НастройкиУчетаУСН.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Изменение.Организации
	|РегистрСведений.НеОтправленныеПрикладныеОбъектыEDI.Чтение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Чтение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Изменение.Организации
	|РегистрСведений.ОграниченияВыгрузкиОстатковМаркетплейсов.Чтение.Организации
	|РегистрСведений.ОграниченияВыгрузкиОстатковМаркетплейсов.Изменение.Организации
	|РегистрСведений.ОстаткиТоваровМаркетплейсов.Чтение.Организации
	|РегистрСведений.ОстаткиТоваровМаркетплейсов.Изменение.Организации
	|РегистрСведений.ОчередьЗапросовВизуализацииЭДО.Чтение.Организации
	|РегистрСведений.ОчередьЗапросовВизуализацииЭДО.Изменение.Организации
	|РегистрСведений.ОчередьСообщенийЗЕРНО.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Изменение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Чтение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Склады
	|РегистрСведений.ПримененияЕНВД.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Изменение.Склады
	|РегистрСведений.ПроверкиЭлектронныхПодписейЭДО.Чтение.Организации
	|РегистрСведений.ПроверкиЭлектронныхПодписейЭДО.Изменение.Организации
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Подразделения
	|РегистрСведений.РеестрЭПД.Чтение.Организации
	|РегистрСведений.РеестрЭПД.Изменение.Организации
	|РегистрСведений.РезультатыОбменаДаннымиСГИСНР.Чтение.Организации
	|РегистрСведений.РезультатыОбменаДаннымиСГИСНР.Изменение.Организации
	|РегистрСведений.СинхронизацияДанныхИСМП.Чтение.Организации
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|РегистрСведений.СоответствияАтрибутовМаркетплейсов.Чтение.Организации
	|РегистрСведений.СоответствияАтрибутовМаркетплейсов.Изменение.Организации
	|РегистрСведений.СоответствияОбъектовМаркетплейсов.Чтение.Организации
	|РегистрСведений.СоответствияОбъектовМаркетплейсов.Изменение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.ТипыДокументовEDI
	|РегистрСведений.СостоянияДокументовЭДО.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЭДО.Изменение.Организации
	|РегистрСведений.СрокиХраненияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыОнлайнОплат.Чтение.Организации
	|РегистрСведений.СтатусыОнлайнОплат.Изменение.Организации
	|РегистрСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon.Чтение.Организации
	|РегистрСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon.Изменение.Организации
	|РегистрСведений.СубъектыДляРасчетаСроковХранения.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СубъектыДляСкрытияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.ГруппыПартнеров
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.Организации
	|РегистрСведений.СчетаФактурыКомитентовКРегистрации.Чтение.Организации
	|РегистрСведений.СчетаФактурыПоставщиковКПеревыставлениюКомитентам.Чтение.Организации
	|РегистрСведений.ТекущиеОтправляемыеТранспортныеКонтейнерыЭДО.Чтение.Организации
	|РегистрСведений.ТоварыНаСкладахТорговыхПлощадокЗаДень.Чтение.Организации
	|РегистрСведений.ТоварыНаСкладахТорговыхПлощадокЗаДень.Изменение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Чтение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Изменение.Организации
	|РегистрСведений.УничтоженныеПерсональныеДанные.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УчетныеЗаписиЭДО.Чтение.Организации
	|РегистрСведений.УчетныеЗаписиЭДО.Изменение.Организации
	|РегистрСведений.ЧерновикиЭлектронныхДокументовЛегкийКлиентЭДО.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Изменение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Изменение.Организации
	|РегистрНакопления.ПартииЗатратНаВыпуск.Чтение.Организации
	|РегистрНакопления.ПартииПроизводственныхЗатрат.Чтение.Организации
	|РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ПартииТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Чтение.Организации
//++ НЕ УТ
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БанковскиеКартыКонтрагентов.Чтение.ГруппыФизическихЛиц
	|Справочник.БанковскиеКартыКонтрагентов.Изменение.ГруппыФизическихЛиц
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БухучетЗарплатыСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БухучетЗарплатыСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БухучетЗарплатыСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БухучетЗарплатыСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствие
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ИсполнениеЗаявкиСотрудника
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РегистрУчета
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствие
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ИсполнениеЗаявкиСотрудника
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РегистрУчета
	|Справочник.ВидыРасчетовРезервовПоОплатеТруда.Чтение.Организации
	|Справочник.ВидыРасчетовРезервовПоОплатеТруда.Изменение.Организации
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратСырьяОтПереработчикаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозобновлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВозобновлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозобновлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВозобновлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыплатыПоДоговорамОпекиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВыплатыПоДоговорамОпекиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыплатыПоДоговорамОпекиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВыплатыПоДоговорамОпекиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДанныеДляОформленияНаРаботуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДанныеДляОформленияНаРаботуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДанныеДляОформленияНаРаботуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДанныеДляОформленияНаРаботуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДанныеСФРДляРасчетаПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДанныеСФРДляРасчетаПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДанныеСФРДляРасчетаПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДанныеСФРДляРасчетаПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДокументооборотыОбменаСБанками.Чтение.Организации
	|Справочник.ДокументооборотыОбменаСБанками.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|Справочник.ДокументЭДОБЗКПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДокументЭДОБЗКПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДокументЭДОБЗКПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДокументЭДОБЗКПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДополнительныеСведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДополнительныеСведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДополнительныеСведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДополнительныеСведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЕжегодныеСтандартныеВычетыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЕжегодныеСтандартныеВычетыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЕжегодныеСтандартныеВычетыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЕжегодныеСтандартныеВычетыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросНедостающихСведенийПособияСФРПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗапросНедостающихСведенийПособияСФРПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросНедостающихСведенийПособияСФРПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗапросНедостающихСведенийПособияСФРПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросСтатусовВыплатыПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗапросСтатусовВыплатыПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросСтатусовВыплатыПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗапросСтатусовВыплатыПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗарплатныеПроекты.Чтение.Организации
	|Справочник.ЗарплатныеПроекты.Изменение.Организации
	|Справочник.ЗаявкаДСВКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаДСВКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаДСВКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаДСВКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаКомпенсацияОтпускаКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаКомпенсацияОтпускаКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаКомпенсацияОтпускаКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаКомпенсацияОтпускаКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНалоговыеВычетыКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНалоговыеВычетыКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНалоговыеВычетыКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНалоговыеВычетыКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаОтпускБезОплатыКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтпускБезОплатыКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаОтпускБезОплатыКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтпускБезОплатыКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаОтпускКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтпускКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаОтпускКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтпускКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаОтсутствиеКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтсутствиеКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаОтсутствиеКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаОтсутствиеКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаСоциальноеПособиеКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСоциальноеПособиеКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаСоциальноеПособиеКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСоциальноеПособиеКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаСправка2НДФЛКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСправка2НДФЛКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаСправка2НДФЛКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСправка2НДФЛКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаСправкаСМестаРаботыКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСправкаСМестаРаботыКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаСправкаСМестаРаботыКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаСправкаСМестаРаботыКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаУчебныйОтпускКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаУчебныйОтпускКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаУчебныйОтпускКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаУчебныйОтпускКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеОНазначенииПенсии.Чтение.Организации
	|Справочник.ЗаявлениеОНазначенииПенсии.Изменение.Организации
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявленияОбОтзывеМЧДФНС.Чтение.Организации
	|Справочник.ЗаявленияОбОтзывеМЧДФНС.Изменение.Организации
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзвещениеОПриемеИлиУвольненииДляВоенкоматаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзвещениеОПриемеИлиУвольненииДляВоенкоматаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзвещениеОПриемеИлиУвольненииДляВоенкоматаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзвещениеОПриемеИлиУвольненииДляВоенкоматаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.ИзмененияСведенийСотрудниковДляВоенкоматаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзмененияСведенийСотрудниковДляВоенкоматаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзмененияСведенийСотрудниковДляВоенкоматаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзмененияСведенийСотрудниковДляВоенкоматаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИнвентаризацияОбъектовУчетаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнвентаризацияОбъектовУчетаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИнвентаризацияРасчетовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнвентаризацияРасчетовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КомплектыОтчетностиПерсУчета.Чтение.Организации
	|Справочник.КомплектыОтчетностиПерсУчета.Изменение.Организации
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.МакетыПенсионныхДел.Чтение.Организации
	|Справочник.МакетыПенсионныхДел.Изменение.Организации
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Чтение.Организации
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиФНС.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиФНС.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиФСС.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиФСС.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиЦБ.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиЦБ.Изменение.Организации
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НазначениеРабочихМестСотрудникамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НазначениеРабочихМестСотрудникамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НазначениеРабочихМестСотрудникамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НазначениеРабочихМестСотрудникамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НастройкиРасчетаРезервовПоОплатеТруда.Чтение.Организации
	|Справочник.НастройкиРасчетаРезервовПоОплатеТруда.Изменение.Организации
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОбразованиеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.ОбразованиеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.ОбращениеКабинетСотрудникаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОбращениеКабинетСотрудникаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОбращениеКабинетСотрудникаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОбращениеКабинетСотрудникаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтветНаЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтветНаЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтветНаЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтветНаЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтгулПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтгулПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтгулПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтгулПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтказВВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтказВВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтказВВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтказВВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтправкиМинобороны.Чтение.Организации
	|Справочник.ОтправкиМинобороны.Изменение.Организации
	|Справочник.ОтправкиРегистрацияЮЛ.Чтение.Организации
	|Справочник.ОтправкиРегистрацияЮЛ.Изменение.Организации
	|Справочник.ОтправкиРПН.Чтение.Организации
	|Справочник.ОтправкиРПН.Изменение.Организации
	|Справочник.ОтправкиРЭЦ.Чтение.Организации
	|Справочник.ОтправкиРЭЦ.Изменение.Организации
	|Справочник.ОтправкиФСРАР.Чтение.Организации
	|Справочник.ОтправкиФСРАР.Изменение.Организации
	|Справочник.ОтправкиФСС.Чтение.Организации
	|Справочник.ОтправкиФСС.Изменение.Организации
	|Справочник.ОтправкиФТС.Чтение.Организации
	|Справочник.ОтправкиФТС.Изменение.Организации
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПервоначальнаяПостановкаНаВоинскийУчетПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПервоначальнаяПостановкаНаВоинскийУчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПервоначальнаяПостановкаНаВоинскийУчетПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПервоначальнаяПостановкаНаВоинскийУчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Изменение.Организации
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПризПодарокПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПризПодарокПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПризПодарокПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПризПодарокПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриказОБронированииРаботниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриказОБронированииРаботниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриказОБронированииРаботниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриказОБронированииРаботниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриказОПрекращенииБронированияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриказОПрекращенииБронированияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриказОПрекращенииБронированияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриказОПрекращенииБронированияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриостановлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриостановлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриостановлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриостановлениеТрудовыхДоговоровКонтрактовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрогулНеявкаСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрогулНеявкаСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрогулНеявкаСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрогулНеявкаСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РабочиеМестаОхраныТруда.Чтение.Организации
	|Справочник.РабочиеМестаОхраныТруда.Чтение.ПодразделенияОрганизаций
	|Справочник.РабочиеМестаОхраныТруда.Изменение.Организации
	|Справочник.РабочиеМестаОхраныТруда.Изменение.ПодразделенияОрганизаций
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацииВОрганеСтатистики.Чтение.Организации
	|Справочник.РегистрацииВОрганеСтатистики.Изменение.Организации
	|Справочник.РегистрацияОблагаемойБазыРуководителяПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РегистрацияОблагаемойБазыРуководителяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацияОблагаемойБазыРуководителяПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РегистрацияОблагаемойБазыРуководителяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегламентированныеОтчеты.Чтение.СведенияРегламентированныхОтчетов
	|Справочник.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РешениеОПриемеНаРаботуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РешениеОПриемеНаРаботуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РешениеОПриемеНаРаботуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РешениеОПриемеНаРаботуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РодственникиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.РодственникиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.СамостоятельныеКлассификационныеЕдиницы.Чтение.Организации
	|Справочник.СамостоятельныеКлассификационныеЕдиницы.Изменение.Организации
	|Справочник.СборГрафиковОтпусковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СборГрафиковОтпусковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияДляОплатыОтпускаСФРПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОПодлежащихВоинскомуУчетуГражданахПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОПодлежащихВоинскомуУчетуГражданахПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОПодлежащихВоинскомуУчетуГражданахПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОПодлежащихВоинскомуУчетуГражданахПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации
	|Справочник.СовмещениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СовмещениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СовмещениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СовмещениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СогласиеНаПрисоединениеКЭДОБЗКПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СогласиеНаПрисоединениеКЭДОБЗКПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СогласиеНаПрисоединениеКЭДОБЗКПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СогласиеНаПрисоединениеКЭДОБЗКПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СообщениеОНеСостоящихНаВоинскомУчетеГражданахПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СообщениеОНеСостоящихНаВоинскомУчетеГражданахПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СообщениеОНеСостоящихНаВоинскомУчетеГражданахПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СообщениеОНеСостоящихНаВоинскомУчетеГражданахПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Сотрудники.Чтение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Изменение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Изменение.Организации
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиФизическихЛицПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиФизическихЛицПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СтатусыВыплатыПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СтатусыВыплатыПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СтатусыВыплатыПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СтатусыВыплатыПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТерриторииВыполненияРабот.Чтение.Организации
	|Справочник.ТерриторииВыполненияРабот.Изменение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.ТранзакцииОбменаСБанками.Чтение.Организации
	|Справочник.ТранзакцииОбменаСБанками.Изменение.Организации
	|Справочник.УведомлениеОбИзмененииРасчетаПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОбИзмененииРасчетаПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОбИзмененииРасчетаПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОбИзмененииРасчетаПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УведомлениеОСтатусеВыплатыПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОСтатусеВыплатыПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОСтатусеВыплатыПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОСтатусеВыплатыПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УвольнениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УвольнениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УвольнениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УвольнениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствие
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ИсполнениеЗаявкиСотрудника
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.Файлы.Чтение.Объект.Документ.РегистрУчета
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствие
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ИсполнениеЗаявкиСотрудника
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.Файлы.Изменение.Объект.Документ.РегистрУчета
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ШтатноеРасписание.Чтение.Организации
	|Справочник.ШтатноеРасписание.Чтение.ПодразделенияОрганизаций
	|Справочник.ШтатноеРасписание.Изменение.Организации
	|Справочник.ШтатноеРасписание.Изменение.ПодразделенияОрганизаций
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.Организации
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Чтение.ГруппыФизическихЛиц
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Чтение.Организации
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Изменение.ГруппыФизическихЛиц
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Изменение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.Организации
	|Документ.АмортизацияНМА.Чтение.Организации
	|Документ.АмортизацияНМА.Изменение.Организации
	|Документ.АмортизацияОС.Чтение.Организации
	|Документ.АмортизацияОС.Изменение.Организации
	|Документ.БольничныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Чтение.Организации
	|Документ.БольничныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Изменение.Организации
	|Документ.БронированиеГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.БронированиеГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.БронированиеГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.БронированиеГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.БухучетЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.БухучетЗарплатыСотрудников.Чтение.Организации
	|Документ.БухучетЗарплатыСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.БухучетЗарплатыСотрудников.Изменение.Организации
	|Документ.БухучетНачисленийСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.БухучетНачисленийСотрудников.Чтение.Организации
	|Документ.БухучетНачисленийСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.БухучетНачисленийСотрудников.Изменение.Организации
	|Документ.ВводДанныхПоНалогуНаПрибыль.Чтение.Организации
	|Документ.ВводДанныхПоНалогуНаПрибыль.Изменение.Организации
	|Документ.ВводНачальныхОстатковОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.ВводНачальныхОстатковОтпусков.Чтение.Организации
	|Документ.ВводНачальныхОстатковОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.ВводНачальныхОстатковОтпусков.Изменение.Организации
	|Документ.ВводОстатковВнеоборотныхАктивов.Чтение.Организации
	|Документ.ВводОстатковВнеоборотныхАктивов.Изменение.Организации
	|Документ.ВводОстатковРасходовПриУСН.Чтение.Организации
	|Документ.ВводОстатковРасходовПриУСН.Изменение.Организации
	|Документ.ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога.Чтение.Организации
	|Документ.ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога.Изменение.Организации
	|Документ.ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество.Чтение.Организации
	|Документ.ВводПервоначальныхСведенийДляРасчетаНалогаНаИмущество.Изменение.Организации
	|Документ.ВводПервоначальныхСведенийДляРасчетаТранспортногоНалога.Чтение.Организации
	|Документ.ВводПервоначальныхСведенийДляРасчетаТранспортногоНалога.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Изменение.Организации
	|Документ.ВедомостьПрочихДоходовВБанк.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВБанк.Чтение.Организации
	|Документ.ВедомостьПрочихДоходовВБанк.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВБанк.Изменение.Организации
	|Документ.ВедомостьПрочихДоходовВКассу.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВКассу.Чтение.Организации
	|Документ.ВедомостьПрочихДоходовВКассу.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВКассу.Изменение.Организации
	|Документ.ВедомостьПрочихДоходовПеречислением.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовПеречислением.Чтение.Организации
	|Документ.ВедомостьПрочихДоходовПеречислением.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовПеречислением.Изменение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Чтение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Изменение.Организации
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Подразделения
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Склады
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Подразделения
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Склады
	|Документ.ВозвратНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Чтение.Организации
	|Документ.ВозвратНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Изменение.Организации
	|Документ.ВозвратОСИзАренды.Чтение.Организации
	|Документ.ВозвратОСИзАренды.Изменение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Чтение.ГруппыПартнеров
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Подразделения
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Склады
	|Документ.ВозвратСырьяОтПереработчика.Изменение.ГруппыПартнеров
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Подразделения
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Склады
	|Документ.ВозмещениеБольничныхВЧастиФБ.Чтение.ГруппыФизическихЛиц
	|Документ.ВозмещениеБольничныхВЧастиФБ.Чтение.Организации
	|Документ.ВозмещениеБольничныхВЧастиФБ.Изменение.ГруппыФизическихЛиц
	|Документ.ВозмещениеБольничныхВЧастиФБ.Изменение.Организации
	|Документ.ВозобновлениеТрудовыхДоговоровКонтрактов.Чтение.ГруппыФизическихЛиц
	|Документ.ВозобновлениеТрудовыхДоговоровКонтрактов.Чтение.Организации
	|Документ.ВозобновлениеТрудовыхДоговоровКонтрактов.Изменение.ГруппыФизическихЛиц
	|Документ.ВозобновлениеТрудовыхДоговоровКонтрактов.Изменение.Организации
	|Документ.ВосстановлениеВДолжности.Чтение.ГруппыФизическихЛиц
	|Документ.ВосстановлениеВДолжности.Чтение.Организации
	|Документ.ВосстановлениеВДолжности.Изменение.ГруппыФизическихЛиц
	|Документ.ВосстановлениеВДолжности.Изменение.Организации
	|Документ.ВосстановлениеНДСПоОбъектамНедвижимости.Чтение.Организации
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.Организации
	|Документ.ВходящийДокументСЭДОФСС.Чтение.Организации
	|Документ.ВходящийДокументСЭДОФСС.Изменение.Организации
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Чтение.Организации
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Изменение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Чтение.ГруппыПартнеров
	|Документ.ВыбытиеДенежныхДокументов.Чтение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Чтение.Подразделения
	|Документ.ВыбытиеДенежныхДокументов.Изменение.ГруппыПартнеров
	|Документ.ВыбытиеДенежныхДокументов.Изменение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Изменение.Подразделения
	|Документ.ВыбытиеРНПТМатериаловИзПроизводства.Чтение.Организации
	|Документ.ВыбытиеРНПТМатериаловИзПроизводства.Чтение.Подразделения
	|Документ.ВыбытиеРНПТМатериаловИзПроизводства.Изменение.Организации
	|Документ.ВыбытиеРНПТМатериаловИзПроизводства.Изменение.Подразделения
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыплатаБывшимСотрудникам.Чтение.ГруппыФизическихЛиц
	|Документ.ВыплатаБывшимСотрудникам.Чтение.Организации
	|Документ.ВыплатаБывшимСотрудникам.Изменение.ГруппыФизическихЛиц
	|Документ.ВыплатаБывшимСотрудникам.Изменение.Организации
	|Документ.ВыплатыПоДоговорамОпеки.Чтение.ГруппыФизическихЛиц
	|Документ.ВыплатыПоДоговорамОпеки.Чтение.Организации
	|Документ.ВыплатыПоДоговорамОпеки.Изменение.ГруппыФизическихЛиц
	|Документ.ВыплатыПоДоговорамОпеки.Изменение.Организации
	|Документ.ГрафикОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.ГрафикОтпусков.Чтение.Организации
	|Документ.ГрафикОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.ГрафикОтпусков.Изменение.Организации
	|Документ.ДанныеДляОформленияНаРаботу.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеДляОформленияНаРаботу.Чтение.Организации
	|Документ.ДанныеДляОформленияНаРаботу.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеДляОформленияНаРаботу.Изменение.Организации
	|Документ.ДанныеДляРасчетаЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеДляРасчетаЗарплаты.Чтение.Организации
	|Документ.ДанныеДляРасчетаЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеДляРасчетаЗарплаты.Изменение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.Организации
	|Документ.ДанныеСФРДляРасчетаПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеСФРДляРасчетаПособия.Чтение.Организации
	|Документ.ДанныеСФРДляРасчетаПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеСФРДляРасчетаПособия.Изменение.Организации
	|Документ.ДоговорАвторскогоЗаказа.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорАвторскогоЗаказа.Чтение.Организации
	|Документ.ДоговорАвторскогоЗаказа.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорАвторскогоЗаказа.Изменение.Организации
	|Документ.ДоговорЗаймаСотруднику.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорЗаймаСотруднику.Чтение.Организации
	|Документ.ДоговорЗаймаСотруднику.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорЗаймаСотруднику.Изменение.Организации
	|Документ.ДоговорРаботыУслуги.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Чтение.Организации
	|Документ.ДоговорРаботыУслуги.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Изменение.Организации
	|Документ.ДокументацияПоКонтролируемымСделкам.Чтение.Организации
	|Документ.ДокументацияПоКонтролируемымСделкам.Изменение.Организации
	|Документ.ДокументЭДОБЗК.Чтение.ГруппыФизическихЛиц
	|Документ.ДокументЭДОБЗК.Чтение.Организации
	|Документ.ДокументЭДОБЗК.Изменение.ГруппыФизическихЛиц
	|Документ.ДокументЭДОБЗК.Изменение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ДополнительныеСведенияДляОплатыОтпускаСФР.Чтение.ГруппыФизическихЛиц
	|Документ.ДополнительныеСведенияДляОплатыОтпускаСФР.Чтение.Организации
	|Документ.ДополнительныеСведенияДляОплатыОтпускаСФР.Изменение.ГруппыФизическихЛиц
	|Документ.ДополнительныеСведенияДляОплатыОтпускаСФР.Изменение.Организации
	|Документ.ДоходВНатуральнойФорме.Чтение.ГруппыФизическихЛиц
	|Документ.ДоходВНатуральнойФорме.Чтение.Организации
	|Документ.ДоходВНатуральнойФорме.Изменение.ГруппыФизическихЛиц
	|Документ.ДоходВНатуральнойФорме.Изменение.Организации
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Чтение.Организации
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Изменение.Организации
	|Документ.ЕжегодныеСтандартныеВычеты.Чтение.ГруппыФизическихЛиц
	|Документ.ЕжегодныеСтандартныеВычеты.Чтение.Организации
	|Документ.ЕжегодныеСтандартныеВычеты.Изменение.ГруппыФизическихЛиц
	|Документ.ЕжегодныеСтандартныеВычеты.Изменение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ЗаказПереработчику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПереработчику.Чтение.Организации
	|Документ.ЗаказПереработчику.Чтение.Подразделения
	|Документ.ЗаказПереработчику.Чтение.Склады
	|Документ.ЗаказПереработчику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПереработчику.Изменение.Организации
	|Документ.ЗаказПереработчику.Изменение.Подразделения
	|Документ.ЗаказПереработчику.Изменение.Склады
	|Документ.ЗаписьКУДиР.Чтение.Организации
	|Документ.ЗаписьКУДиР.Изменение.Организации
	|Документ.ЗапросВФССОПроверкеРаботодателя.Чтение.ГруппыФизическихЛиц
	|Документ.ЗапросВФССОПроверкеРаботодателя.Чтение.Организации
	|Документ.ЗапросВФССОПроверкеРаботодателя.Изменение.ГруппыФизическихЛиц
	|Документ.ЗапросВФССОПроверкеРаботодателя.Изменение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации
	|Документ.ЗапросНедостающихСведенийПособияСФР.Чтение.ГруппыФизическихЛиц
	|Документ.ЗапросНедостающихСведенийПособияСФР.Чтение.Организации
	|Документ.ЗапросНедостающихСведенийПособияСФР.Изменение.ГруппыФизическихЛиц
	|Документ.ЗапросНедостающихСведенийПособияСФР.Изменение.Организации
	|Документ.ЗапросРеквизитовДляВыплатыПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ЗапросРеквизитовДляВыплатыПособия.Чтение.Организации
	|Документ.ЗапросРеквизитовДляВыплатыПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ЗапросРеквизитовДляВыплатыПособия.Изменение.Организации
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Чтение.Организации
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Изменение.Организации
	|Документ.ЗапросСтатусовВыплатыПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ЗапросСтатусовВыплатыПособия.Чтение.Организации
	|Документ.ЗапросСтатусовВыплатыПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ЗапросСтатусовВыплатыПособия.Изменение.Организации
	|Документ.ЗаявкаДСВКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаДСВКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаДСВКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаДСВКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаКомпенсацияОтпускаКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаКомпенсацияОтпускаКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаКомпенсацияОтпускаКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаКомпенсацияОтпускаКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаНалоговыеВычетыКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНалоговыеВычетыКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаНалоговыеВычетыКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНалоговыеВычетыКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаОтпускБезОплатыКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтпускБезОплатыКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаОтпускБезОплатыКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтпускБезОплатыКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаОтпускКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтпускКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаОтпускКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтпускКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаОтсутствиеКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтсутствиеКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаОтсутствиеКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаОтсутствиеКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаПрежняяВерсияКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаПрежняяВерсияКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаПрежняяВерсияКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаПрежняяВерсияКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаСоциальноеПособиеКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСоциальноеПособиеКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаСоциальноеПособиеКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСоциальноеПособиеКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаСправка2НДФЛКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСправка2НДФЛКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаСправка2НДФЛКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСправка2НДФЛКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСправкаОстаткиОтпусковКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаСправкаСМестаРаботыКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСправкаСМестаРаботыКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаСправкаСМестаРаботыКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаСправкаСМестаРаботыКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкаУчебныйОтпускКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаУчебныйОтпускКабинетСотрудника.Чтение.Организации
	|Документ.ЗаявкаУчебныйОтпускКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаУчебныйОтпускКабинетСотрудника.Изменение.Организации
	|Документ.ЗаявкиНаЛьготныйКредит.Чтение.Организации
	|Документ.ЗаявкиНаЛьготныйКредит.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.Организации
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Чтение.Организации
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Изменение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеНаФормированиеСправкиОРасчетах.Чтение.Организации
	|Документ.ЗаявлениеНаФормированиеСправкиОРасчетах.Изменение.Организации
	|Документ.ЗаявлениеОВвозеТоваровПолученное.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваровПолученное.Изменение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.Организации
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Чтение.Организации
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Изменение.Организации
	|Документ.ЗаявленияПоЭлДокументооборотуСПФР.Чтение.Организации
	|Документ.ЗаявленияПоЭлДокументооборотуСПФР.Изменение.Организации
	|Документ.ИзвещениеОПриемеИлиУвольненииДляВоенкомата.Чтение.ГруппыФизическихЛиц
	|Документ.ИзвещениеОПриемеИлиУвольненииДляВоенкомата.Чтение.Организации
	|Документ.ИзвещениеОПриемеИлиУвольненииДляВоенкомата.Изменение.ГруппыФизическихЛиц
	|Документ.ИзвещениеОПриемеИлиУвольненииДляВоенкомата.Изменение.Организации
	|Документ.ИзвещениеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ИзвещениеФСС.Чтение.Организации
	|Документ.ИзвещениеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ИзвещениеФСС.Изменение.Организации
	|Документ.ИзменениеАванса.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеАванса.Чтение.Организации
	|Документ.ИзменениеАванса.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеАванса.Изменение.Организации
	|Документ.ИзменениеГрафикаРаботыСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеГрафикаРаботыСписком.Чтение.Организации
	|Документ.ИзменениеГрафикаРаботыСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеГрафикаРаботыСписком.Изменение.Организации
	|Документ.ИзменениеКвалификационногоРазряда.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеКвалификационногоРазряда.Чтение.Организации
	|Документ.ИзменениеКвалификационногоРазряда.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеКвалификационногоРазряда.Изменение.Организации
	|Документ.ИзменениеМестРаботы.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеМестРаботы.Чтение.Организации
	|Документ.ИзменениеМестРаботы.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеМестРаботы.Изменение.Организации
	|Документ.ИзменениеОплатыТруда.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеОплатыТруда.Чтение.Организации
	|Документ.ИзменениеОплатыТруда.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеОплатыТруда.Изменение.Организации
	|Документ.ИзменениеПараметровНМА.Чтение.Организации
	|Документ.ИзменениеПараметровНМА.Изменение.Организации
	|Документ.ИзменениеПараметровОС.Чтение.Организации
	|Документ.ИзменениеПараметровОС.Изменение.Организации
	|Документ.ИзменениеПлановыхНачислений.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеПлановыхНачислений.Чтение.Организации
	|Документ.ИзменениеПлановыхНачислений.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеПлановыхНачислений.Изменение.Организации
	|Документ.ИзменениеСостоянияОС.Чтение.Организации
	|Документ.ИзменениеСостоянияОС.Изменение.Организации
	|Документ.ИзменениеСпособаОтраженияИмущественныхНалогов.Чтение.Организации
	|Документ.ИзменениеСпособаОтраженияИмущественныхНалогов.Изменение.Организации
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Чтение.Организации
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Изменение.Организации
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Чтение.Организации
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Изменение.Организации
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.ИзменениеШтатногоРасписания.Чтение.Организации
	|Документ.ИзменениеШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.ИзменениеШтатногоРасписания.Изменение.Организации
	|Документ.ИзменениеШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ИзмененияСведенийСотрудниковДляВоенкомата.Чтение.ГруппыФизическихЛиц
	|Документ.ИзмененияСведенийСотрудниковДляВоенкомата.Чтение.Организации
	|Документ.ИзмененияСведенийСотрудниковДляВоенкомата.Изменение.ГруппыФизическихЛиц
	|Документ.ИзмененияСведенийСотрудниковДляВоенкомата.Изменение.Организации
	|Документ.ИнвентаризацияНМА.Чтение.Организации
	|Документ.ИнвентаризацияНМА.Изменение.Организации
	|Документ.ИнвентаризацияОбъектовУчета.Чтение.Организации
	|Документ.ИнвентаризацияОбъектовУчета.Чтение.Подразделения
	|Документ.ИнвентаризацияОбъектовУчета.Изменение.Организации
	|Документ.ИнвентаризацияОбъектовУчета.Изменение.Подразделения
	|Документ.ИнвентаризацияОС.Чтение.Организации
	|Документ.ИнвентаризацияОС.Изменение.Организации
	|Документ.ИнвентаризацияРасчетов.Чтение.Организации
	|Документ.ИнвентаризацияРасчетов.Изменение.Организации
	|Документ.ИндексацияЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ИндексацияЗаработка.Чтение.Организации
	|Документ.ИндексацияЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ИндексацияЗаработка.Изменение.Организации
	|Документ.ИндексацияШтатногоРасписания.Чтение.Организации
	|Документ.ИндексацияШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.ИндексацияШтатногоРасписания.Изменение.Организации
	|Документ.ИндексацияШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ИндивидуальныйГрафик.Чтение.ГруппыФизическихЛиц
	|Документ.ИндивидуальныйГрафик.Чтение.Организации
	|Документ.ИндивидуальныйГрафик.Изменение.ГруппыФизическихЛиц
	|Документ.ИндивидуальныйГрафик.Изменение.Организации
	|Документ.ИсполнительныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Чтение.Организации
	|Документ.ИсполнительныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Изменение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.Организации
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Чтение.Организации
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Изменение.Организации
	|Документ.КадровыйПеревод.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Чтение.Организации
	|Документ.КадровыйПеревод.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Изменение.Организации
	|Документ.КадровыйПереводСписком.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПереводСписком.Чтение.Организации
	|Документ.КадровыйПереводСписком.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПереводСписком.Изменение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.Командировка.Чтение.ГруппыФизическихЛиц
	|Документ.Командировка.Чтение.Организации
	|Документ.Командировка.Изменение.ГруппыФизическихЛиц
	|Документ.Командировка.Изменение.Организации
	|Документ.КомандировкиСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.КомандировкиСотрудников.Чтение.Организации
	|Документ.КомандировкиСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.КомандировкиСотрудников.Изменение.Организации
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Чтение.Организации
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Изменение.Организации
	|Документ.КонтролируемаяСделка.Чтение.Организации
	|Документ.КонтролируемаяСделка.Изменение.Организации
	|Документ.КорректировкаРасчетовПоНалогам.Чтение.Организации
	|Документ.КорректировкаРасчетовПоНалогам.Изменение.Организации
	|Документ.ЛистокСообщенияДляВоенкомата.Чтение.ГруппыФизическихЛиц
	|Документ.ЛистокСообщенияДляВоенкомата.Чтение.Организации
	|Документ.ЛистокСообщенияДляВоенкомата.Изменение.ГруппыФизическихЛиц
	|Документ.ЛистокСообщенияДляВоенкомата.Изменение.Организации
	|Документ.МатериальнаяПомощь.Чтение.ГруппыФизическихЛиц
	|Документ.МатериальнаяПомощь.Чтение.Организации
	|Документ.МатериальнаяПомощь.Изменение.ГруппыФизическихЛиц
	|Документ.МатериальнаяПомощь.Изменение.Организации
	|Документ.МодернизацияОС.Чтение.Организации
	|Документ.МодернизацияОС.Изменение.Организации
	|Документ.НазначениеПлановогоНачисления.Чтение.ГруппыФизическихЛиц
	|Документ.НазначениеПлановогоНачисления.Чтение.Организации
	|Документ.НазначениеПлановогоНачисления.Изменение.ГруппыФизическихЛиц
	|Документ.НазначениеПлановогоНачисления.Изменение.Организации
	|Документ.НазначениеПодработки.Чтение.ГруппыФизическихЛиц
	|Документ.НазначениеПодработки.Чтение.Организации
	|Документ.НазначениеПодработки.Изменение.ГруппыФизическихЛиц
	|Документ.НазначениеПодработки.Изменение.Организации
	|Документ.НазначениеРабочихМестСотрудникам.Чтение.ГруппыФизическихЛиц
	|Документ.НазначениеРабочихМестСотрудникам.Чтение.Организации
	|Документ.НазначениеРабочихМестСотрудникам.Изменение.ГруппыФизическихЛиц
	|Документ.НазначениеРабочихМестСотрудникам.Изменение.Организации
	|Документ.НаработкаТМЦВЭксплуатации.Чтение.Организации
	|Документ.НаработкаТМЦВЭксплуатации.Чтение.Подразделения
	|Документ.НаработкаТМЦВЭксплуатации.Изменение.Организации
	|Документ.НаработкаТМЦВЭксплуатации.Изменение.Подразделения
	|Документ.НачальнаяЗадолженностьПоЗарплате.Чтение.ГруппыФизическихЛиц
	|Документ.НачальнаяЗадолженностьПоЗарплате.Чтение.Организации
	|Документ.НачальнаяЗадолженностьПоЗарплате.Изменение.ГруппыФизическихЛиц
	|Документ.НачальнаяЗадолженностьПоЗарплате.Изменение.Организации
	|Документ.НачальнаяШтатнаяРасстановка.Чтение.ГруппыФизическихЛиц
	|Документ.НачальнаяШтатнаяРасстановка.Чтение.Организации
	|Документ.НачальнаяШтатнаяРасстановка.Изменение.ГруппыФизическихЛиц
	|Документ.НачальнаяШтатнаяРасстановка.Изменение.Организации
	|Документ.НачислениеДивидендов.Чтение.Организации
	|Документ.НачислениеДивидендов.Изменение.Организации
	|Документ.НачислениеЕНП.Чтение.Организации
	|Документ.НачислениеЕНП.Изменение.Организации
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Чтение.Организации
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.НачислениеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.Организации
	|Документ.НачислениеПоДоговорам.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеПоДоговорам.Чтение.Организации
	|Документ.НачислениеПоДоговорам.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеПоДоговорам.Изменение.Организации
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Чтение.Организации
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Изменение.Организации
	|Документ.ОбращениеКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|Документ.ОбращениеКабинетСотрудника.Чтение.Организации
	|Документ.ОбращениеКабинетСотрудника.Изменение.ГруппыФизическихЛиц
	|Документ.ОбращениеКабинетСотрудника.Изменение.Организации
	|Документ.ОбращениеСФРКСтрахователю.Чтение.Организации
	|Документ.ОбращениеСФРКСтрахователю.Изменение.Организации
	|Документ.ОграничениеВзысканий.Чтение.ГруппыФизическихЛиц
	|Документ.ОграничениеВзысканий.Чтение.Организации
	|Документ.ОграничениеВзысканий.Изменение.ГруппыФизическихЛиц
	|Документ.ОграничениеВзысканий.Изменение.Организации
	|Документ.ОперацияБух.Чтение.Организации
	|Документ.ОперацияБух.Изменение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.Организации
	|Документ.ОписьОДВ_1.Чтение.Организации
	|Документ.ОписьОДВ_1.Изменение.Организации
	|Документ.ОписьПачекСЗВ_6.Чтение.Организации
	|Документ.ОписьПачекСЗВ_6.Изменение.Организации
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Чтение.ГруппыФизическихЛиц
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Чтение.Организации
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Изменение.ГруппыФизическихЛиц
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Изменение.Организации
	|Документ.ОплатаПоСреднемуЗаработку.Чтение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработку.Чтение.Организации
	|Документ.ОплатаПоСреднемуЗаработку.Изменение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработку.Изменение.Организации
	|Документ.ОплатаПоСреднемуЗаработкуСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработкуСписком.Чтение.Организации
	|Документ.ОплатаПоСреднемуЗаработкуСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработкуСписком.Изменение.Организации
	|Документ.ОтветНаЗапросРеквизитовДляВыплатыПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ОтветНаЗапросРеквизитовДляВыплатыПособия.Чтение.Организации
	|Документ.ОтветНаЗапросРеквизитовДляВыплатыПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ОтветНаЗапросРеквизитовДляВыплатыПособия.Изменение.Организации
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Чтение.Организации
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Изменение.Организации
	|Документ.ОтветСтрахователяНаОбращениеСФР.Чтение.Организации
	|Документ.ОтветСтрахователяНаОбращениеСФР.Изменение.Организации
	|Документ.ОтветСтрахователяНаТребованиеПроверкиФСС.Чтение.Организации
	|Документ.ОтветСтрахователяНаТребованиеПроверкиФСС.Изменение.Организации
	|Документ.Отгул.Чтение.ГруппыФизическихЛиц
	|Документ.Отгул.Чтение.Организации
	|Документ.Отгул.Изменение.ГруппыФизическихЛиц
	|Документ.Отгул.Изменение.Организации
	|Документ.ОтгулСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ОтгулСписком.Чтение.Организации
	|Документ.ОтгулСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ОтгулСписком.Изменение.Организации
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Чтение.Организации
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Изменение.Организации
	|Документ.ОтзывСогласияНаУведомлениеОбЭЛН.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаУведомлениеОбЭЛН.Чтение.Организации
	|Документ.ОтзывСогласияНаУведомлениеОбЭЛН.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаУведомлениеОбЭЛН.Изменение.Организации
	|Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Чтение.ГруппыФизическихЛиц
	|Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Чтение.Организации
	|Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Изменение.ГруппыФизическихЛиц
	|Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Изменение.Организации
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Чтение.Организации
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Изменение.Организации
	|Документ.ОтменаСовмещения.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаСовмещения.Чтение.Организации
	|Документ.ОтменаСовмещения.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаСовмещения.Изменение.Организации
	|Документ.Отпуск.Чтение.ГруппыФизическихЛиц
	|Документ.Отпуск.Чтение.Организации
	|Документ.Отпуск.Изменение.ГруппыФизическихЛиц
	|Документ.Отпуск.Изменение.Организации
	|Документ.ОтпускаСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускаСотрудников.Чтение.Организации
	|Документ.ОтпускаСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускаСотрудников.Изменение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Чтение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Изменение.Организации
	|Документ.ОтпускБезСохраненияОплатыСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплатыСписком.Чтение.Организации
	|Документ.ОтпускБезСохраненияОплатыСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплатыСписком.Изменение.Организации
	|Документ.ОтпускПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускПоУходуЗаРебенком.Чтение.Организации
	|Документ.ОтпускПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускПоУходуЗаРебенком.Изменение.Организации
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Чтение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Изменение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Изменение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Чтение.ГруппыПартнеров
	|Документ.ОтчетОператораСистемыПлатон.Чтение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Чтение.Подразделения
	|Документ.ОтчетОператораСистемыПлатон.Изменение.ГруппыПартнеров
	|Документ.ОтчетОператораСистемыПлатон.Изменение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Изменение.Подразделения
	|Документ.ОтчетПереработчика.Чтение.ГруппыПартнеров
	|Документ.ОтчетПереработчика.Чтение.Организации
	|Документ.ОтчетПереработчика.Чтение.Подразделения
	|Документ.ОтчетПереработчика.Чтение.Склады
	|Документ.ОтчетПереработчика.Изменение.ГруппыПартнеров
	|Документ.ОтчетПереработчика.Изменение.Организации
	|Документ.ОтчетПереработчика.Изменение.Подразделения
	|Документ.ОтчетПереработчика.Изменение.Склады
	|Документ.ПараметрыНачисленияЗемельногоНалога.Чтение.Организации
	|Документ.ПараметрыНачисленияЗемельногоНалога.Изменение.Организации
	|Документ.ПараметрыНачисленияНалогаНаИмущество.Чтение.Организации
	|Документ.ПараметрыНачисленияНалогаНаИмущество.Изменение.Организации
	|Документ.ПараметрыНачисленияТранспортногоНалога.Чтение.Организации
	|Документ.ПараметрыНачисленияТранспортногоНалога.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Изменение.Организации
	|Документ.ПачкаДокументовДСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Чтение.Организации
	|Документ.ПачкаДокументовДСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Изменение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.Организации
	|Документ.ПервоначальнаяПостановкаНаВоинскийУчет.Чтение.ГруппыФизическихЛиц
	|Документ.ПервоначальнаяПостановкаНаВоинскийУчет.Чтение.Организации
	|Документ.ПервоначальнаяПостановкаНаВоинскийУчет.Изменение.ГруппыФизическихЛиц
	|Документ.ПервоначальнаяПостановкаНаВоинскийУчет.Изменение.Организации
	|Документ.ПереводКДругомуРаботодателю.Чтение.ГруппыФизическихЛиц
	|Документ.ПереводКДругомуРаботодателю.Чтение.Организации
	|Документ.ПереводКДругомуРаботодателю.Изменение.ГруппыФизическихЛиц
	|Документ.ПереводКДругомуРаботодателю.Изменение.Организации
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Чтение.ГруппыФизическихЛиц
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Чтение.Организации
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Изменение.ГруппыФизическихЛиц
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Изменение.Организации
	|Документ.ПереводНаРаботуСКоронавирусом.Чтение.ГруппыФизическихЛиц
	|Документ.ПереводНаРаботуСКоронавирусом.Чтение.Организации
	|Документ.ПереводНаРаботуСКоронавирусом.Изменение.ГруппыФизическихЛиц
	|Документ.ПереводНаРаботуСКоронавирусом.Изменение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Подразделения
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Склады
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Подразделения
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Склады
	|Документ.ПередачаОСВАренду.Чтение.Организации
	|Документ.ПередачаОСВАренду.Изменение.Организации
	|Документ.ПередачаСырьяПереработчику.Чтение.ГруппыПартнеров
	|Документ.ПередачаСырьяПереработчику.Чтение.Организации
	|Документ.ПередачаСырьяПереработчику.Чтение.Подразделения
	|Документ.ПередачаСырьяПереработчику.Чтение.Склады
	|Документ.ПередачаСырьяПереработчику.Изменение.ГруппыПартнеров
	|Документ.ПередачаСырьяПереработчику.Изменение.Организации
	|Документ.ПередачаСырьяПереработчику.Изменение.Подразделения
	|Документ.ПередачаСырьяПереработчику.Изменение.Склады
	|Документ.ПеремещениеВДругоеПодразделение.Чтение.ГруппыФизическихЛиц
	|Документ.ПеремещениеВДругоеПодразделение.Чтение.Организации
	|Документ.ПеремещениеВДругоеПодразделение.Изменение.ГруппыФизическихЛиц
	|Документ.ПеремещениеВДругоеПодразделение.Изменение.Организации
	|Документ.ПеремещениеМеждуТерриториями.Чтение.ГруппыФизическихЛиц
	|Документ.ПеремещениеМеждуТерриториями.Чтение.Организации
	|Документ.ПеремещениеМеждуТерриториями.Изменение.ГруппыФизическихЛиц
	|Документ.ПеремещениеМеждуТерриториями.Изменение.Организации
	|Документ.ПеремещениеОС.Чтение.Организации
	|Документ.ПеремещениеОС.Изменение.Организации
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Чтение.ГруппыФизическихЛиц
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Чтение.Организации
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Изменение.ГруппыФизическихЛиц
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Изменение.Организации
	|Документ.ПереносОтпуска.Чтение.ГруппыФизическихЛиц
	|Документ.ПереносОтпуска.Чтение.Организации
	|Документ.ПереносОтпуска.Изменение.ГруппыФизическихЛиц
	|Документ.ПереносОтпуска.Изменение.Организации
	|Документ.ПереносРНПТМатериаловНаПродукцию.Чтение.Организации
	|Документ.ПереносРНПТМатериаловНаПродукцию.Чтение.Подразделения
	|Документ.ПереносРНПТМатериаловНаПродукцию.Изменение.Организации
	|Документ.ПереносРНПТМатериаловНаПродукцию.Изменение.Подразделения
	|Документ.ПереоценкаНМА.Чтение.Организации
	|Документ.ПереоценкаНМА.Изменение.Организации
	|Документ.ПереоценкаОС.Чтение.Организации
	|Документ.ПереоценкаОС.Изменение.Организации
	|Документ.ПерерасчетИмущественныхНалогов.Чтение.Организации
	|Документ.ПерерасчетИмущественныхНалогов.Изменение.Организации
	|Документ.ПерерасчетНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Чтение.Организации
	|Документ.ПерерасчетНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Изменение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.Организации
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Чтение.ГруппыФизическихЛиц
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Чтение.Организации
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Изменение.ГруппыФизическихЛиц
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Изменение.Организации
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Чтение.ГруппыФизическихЛиц
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Чтение.Организации
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Изменение.ГруппыФизическихЛиц
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Изменение.Организации
	|Документ.ПодготовкаКПередачеНМА.Чтение.Организации
	|Документ.ПодготовкаКПередачеНМА.Изменение.Организации
	|Документ.ПодготовкаКПередачеОС.Чтение.Организации
	|Документ.ПодготовкаКПередачеОС.Изменение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Чтение.ГруппыФизическихЛиц
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Чтение.Организации
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Изменение.ГруппыФизическихЛиц
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Изменение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Подразделения
	|Документ.ПоступлениеДенежныхДокументов.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеОтПереработчика.Чтение.Организации
	|Документ.ПоступлениеОтПереработчика.Чтение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Чтение.Склады
	|Документ.ПоступлениеОтПереработчика.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеОтПереработчика.Изменение.Организации
	|Документ.ПоступлениеОтПереработчика.Изменение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Изменение.Склады
	|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации
	|Документ.ПрекращениеПлановогоНачисления.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПлановогоНачисления.Чтение.Организации
	|Документ.ПрекращениеПлановогоНачисления.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПлановогоНачисления.Изменение.Организации
	|Документ.ПрекращениеПодработки.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПодработки.Чтение.Организации
	|Документ.ПрекращениеПодработки.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПодработки.Изменение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.Организации
	|Документ.Премия.Чтение.ГруппыФизическихЛиц
	|Документ.Премия.Чтение.Организации
	|Документ.Премия.Изменение.ГруппыФизическихЛиц
	|Документ.Премия.Изменение.Организации
	|Документ.ПриемНаРаботу.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПриемНаРаботуСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботуСписком.Чтение.Организации
	|Документ.ПриемНаРаботуСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботуСписком.Изменение.Организации
	|Документ.ПризПодарок.Чтение.ГруппыФизическихЛиц
	|Документ.ПризПодарок.Чтение.Организации
	|Документ.ПризПодарок.Изменение.ГруппыФизическихЛиц
	|Документ.ПризПодарок.Изменение.Организации
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Чтение.Организации
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Изменение.Организации
	|Документ.ПриказОБронированииРаботников.Чтение.ГруппыФизическихЛиц
	|Документ.ПриказОБронированииРаботников.Чтение.Организации
	|Документ.ПриказОБронированииРаботников.Изменение.ГруппыФизическихЛиц
	|Документ.ПриказОБронированииРаботников.Изменение.Организации
	|Документ.ПриказОПрекращенииБронирования.Чтение.ГруппыФизическихЛиц
	|Документ.ПриказОПрекращенииБронирования.Чтение.Организации
	|Документ.ПриказОПрекращенииБронирования.Изменение.ГруппыФизическихЛиц
	|Документ.ПриказОПрекращенииБронирования.Изменение.Организации
	|Документ.ПринятиеКУчетуНМА.Чтение.Организации
	|Документ.ПринятиеКУчетуНМА.Изменение.Организации
	|Документ.ПринятиеКУчетуОС.Чтение.Организации
	|Документ.ПринятиеКУчетуОС.Изменение.Организации
	|Документ.ПриостановлениеТрудовыхДоговоровКонтрактов.Чтение.ГруппыФизическихЛиц
	|Документ.ПриостановлениеТрудовыхДоговоровКонтрактов.Чтение.Организации
	|Документ.ПриостановлениеТрудовыхДоговоровКонтрактов.Изменение.ГруппыФизическихЛиц
	|Документ.ПриостановлениеТрудовыхДоговоровКонтрактов.Изменение.Организации
	|Документ.ПрогулНеявка.Чтение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявка.Чтение.Организации
	|Документ.ПрогулНеявка.Изменение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявка.Изменение.Организации
	|Документ.ПрогулНеявкаСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявкаСписком.Чтение.Организации
	|Документ.ПрогулНеявкаСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявкаСписком.Изменение.Организации
	|Документ.ПродлениеКонтрактаДоговора.Чтение.ГруппыФизическихЛиц
	|Документ.ПродлениеКонтрактаДоговора.Чтение.Организации
	|Документ.ПродлениеКонтрактаДоговора.Изменение.ГруппыФизическихЛиц
	|Документ.ПродлениеКонтрактаДоговора.Изменение.Организации
	|Документ.ПростойСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПростойСотрудников.Чтение.Организации
	|Документ.ПростойСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПростойСотрудников.Изменение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Чтение.ГруппыФизическихЛиц
	|Документ.РаботаВВыходныеИПраздничныеДни.Чтение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Изменение.ГруппыФизическихЛиц
	|Документ.РаботаВВыходныеИПраздничныеДни.Изменение.Организации
	|Документ.РаботаСверхурочно.Чтение.ГруппыФизическихЛиц
	|Документ.РаботаСверхурочно.Чтение.Организации
	|Документ.РаботаСверхурочно.Изменение.ГруппыФизическихЛиц
	|Документ.РаботаСверхурочно.Изменение.Организации
	|Документ.РазовоеНачисление.Чтение.ГруппыФизическихЛиц
	|Документ.РазовоеНачисление.Чтение.Организации
	|Документ.РазовоеНачисление.Изменение.ГруппыФизическихЛиц
	|Документ.РазовоеНачисление.Изменение.Организации
	|Документ.РаспределениеОсновногоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.РаспределениеОсновногоЗаработка.Чтение.Организации
	|Документ.РаспределениеОсновногоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.РаспределениеОсновногоЗаработка.Изменение.Организации
	|Документ.РегистрацияОблагаемойБазыРуководителя.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияОблагаемойБазыРуководителя.Чтение.Организации
	|Документ.РегистрацияОблагаемойБазыРуководителя.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияОблагаемойБазыРуководителя.Изменение.Организации
	|Документ.РегистрацияПереработок.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияПереработок.Чтение.Организации
	|Документ.РегистрацияПереработок.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияПереработок.Изменение.Организации
	|Документ.РегистрацияПрочихДоходов.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихДоходов.Чтение.Организации
	|Документ.РегистрацияПрочихДоходов.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихДоходов.Изменение.Организации
	|Документ.РегистрацияПрочихКонтролируемыхСделок.Чтение.Организации
	|Документ.РегистрацияПрочихКонтролируемыхСделок.Изменение.Организации
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Чтение.Организации
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Изменение.Организации
	|Документ.РегистрацияТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияТрудовойДеятельности.Чтение.Организации
	|Документ.РегистрацияТрудовойДеятельности.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияТрудовойДеятельности.Изменение.Организации
	|Документ.РегистрУчета.Чтение.Организации
	|Документ.РегистрУчета.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РегламентированныйОтчет.Чтение.СведенияРегламентированныхОтчетов
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентированныйОтчет.Изменение.СведенияРегламентированныхОтчетов
	|Документ.РегламентнаяОперация.Чтение.Организации
	|Документ.РегламентнаяОперация.Изменение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Чтение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Изменение.Организации
	|Документ.РеестрДСВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Чтение.Организации
	|Документ.РеестрДСВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Изменение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.Организации
	|Документ.РеестрСЗВ_6_2.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Чтение.Организации
	|Документ.РеестрСЗВ_6_2.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Изменение.Организации
	|Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Чтение.Организации
	|Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Изменение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Чтение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Изменение.Организации
	|Документ.РезервыПоОплатеТруда.Чтение.ГруппыФизическихЛиц
	|Документ.РезервыПоОплатеТруда.Чтение.Организации
	|Документ.РезервыПоОплатеТруда.Изменение.ГруппыФизическихЛиц
	|Документ.РезервыПоОплатеТруда.Изменение.Организации
	|Документ.РешениеОПриемеНаРаботу.Чтение.ГруппыФизическихЛиц
	|Документ.РешениеОПриемеНаРаботу.Чтение.Организации
	|Документ.РешениеОПриемеНаРаботу.Изменение.ГруппыФизическихЛиц
	|Документ.РешениеОПриемеНаРаботу.Изменение.Организации
	|Документ.СборГрафиковОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.СборГрафиковОтпусков.Чтение.Подразделения
	|Документ.СборГрафиковОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.СборГрафиковОтпусков.Изменение.Подразделения
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Чтение.Организации
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Изменение.Организации
	|Документ.СведенияДляОплатыОтпускаСФР.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияДляОплатыОтпускаСФР.Чтение.Организации
	|Документ.СведенияДляОплатыОтпускаСФР.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияДляОплатыОтпускаСФР.Изменение.Организации
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Чтение.Организации
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Изменение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.Организации
	|Документ.СведенияОЗастрахованномЛицеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованномЛицеФСС.Чтение.Организации
	|Документ.СведенияОЗастрахованномЛицеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованномЛицеФСС.Изменение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.Организации
	|Документ.СведенияОПодлежащихВоинскомуУчетуГражданах.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОПодлежащихВоинскомуУчетуГражданах.Чтение.Организации
	|Документ.СведенияОПодлежащихВоинскомуУчетуГражданах.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОПодлежащихВоинскомуУчетуГражданах.Изменение.Организации
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Чтение.Организации
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Изменение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Чтение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Изменение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Чтение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Изменение.Организации
	|Документ.СверкаСВоеннымКомиссариатом.Чтение.ГруппыФизическихЛиц
	|Документ.СверкаСВоеннымКомиссариатом.Чтение.Организации
	|Документ.СверкаСВоеннымКомиссариатом.Изменение.ГруппыФизическихЛиц
	|Документ.СверкаСВоеннымКомиссариатом.Изменение.Организации
	|Документ.СверкаСДокументамиВоинскогоУчета.Чтение.ГруппыФизическихЛиц
	|Документ.СверкаСДокументамиВоинскогоУчета.Чтение.Организации
	|Документ.СверкаСДокументамиВоинскогоУчета.Изменение.ГруппыФизическихЛиц
	|Документ.СверкаСДокументамиВоинскогоУчета.Изменение.Организации
	|Документ.СверкаСФНСПоИмущественнымНалогам.Чтение.Организации
	|Документ.СверкаСФНСПоИмущественнымНалогам.Изменение.Организации
	|Документ.СнятиеСРегистрацииЗемельныхУчастков.Чтение.Организации
	|Документ.СнятиеСРегистрацииЗемельныхУчастков.Изменение.Организации
	|Документ.СнятиеСРегистрацииТранспортныхСредств.Чтение.Организации
	|Документ.СнятиеСРегистрацииТранспортныхСредств.Изменение.Организации
	|Документ.Совмещение.Чтение.ГруппыФизическихЛиц
	|Документ.Совмещение.Чтение.Организации
	|Документ.Совмещение.Изменение.ГруппыФизическихЛиц
	|Документ.Совмещение.Изменение.Организации
	|Документ.СогласиеНаПрисоединениеКЭДОБЗК.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаПрисоединениеКЭДОБЗК.Чтение.Организации
	|Документ.СогласиеНаПрисоединениеКЭДОБЗК.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаПрисоединениеКЭДОБЗК.Изменение.Организации
	|Документ.СогласиеНаУведомлениеОбЭЛН.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаУведомлениеОбЭЛН.Чтение.Организации
	|Документ.СогласиеНаУведомлениеОбЭЛН.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаУведомлениеОбЭЛН.Изменение.Организации
	|Документ.СообщениеОНеСостоящихНаВоинскомУчетеГражданах.Чтение.ГруппыФизическихЛиц
	|Документ.СообщениеОНеСостоящихНаВоинскомУчетеГражданах.Чтение.Организации
	|Документ.СообщениеОНеСостоящихНаВоинскомУчетеГражданах.Изменение.ГруппыФизическихЛиц
	|Документ.СообщениеОНеСостоящихНаВоинскомУчетеГражданах.Изменение.Организации
	|Документ.СопутствующиеУслугиКонтролируемойСделки.Чтение.Организации
	|Документ.СопутствующиеУслугиКонтролируемойСделки.Изменение.Организации
	|Документ.СписаниеНМА.Чтение.Организации
	|Документ.СписаниеНМА.Изменение.Организации
	|Документ.СписаниеОС.Чтение.Организации
	|Документ.СписаниеОС.Изменение.Организации
	|Документ.СправкаНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Чтение.Организации
	|Документ.СправкаНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Изменение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.Организации
	|Документ.СреднийЗаработокСЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.СреднийЗаработокСЭДО.Чтение.Организации
	|Документ.СреднийЗаработокСЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.СреднийЗаработокСЭДО.Изменение.Организации
	|Документ.СтатистикаПерсонала.Чтение.Организации
	|Документ.СтатистикаПерсонала.Изменение.Организации
	|Документ.СтатусыВыплатыПособия.Чтение.ГруппыФизическихЛиц
	|Документ.СтатусыВыплатыПособия.Чтение.Организации
	|Документ.СтатусыВыплатыПособия.Изменение.ГруппыФизическихЛиц
	|Документ.СтатусыВыплатыПособия.Изменение.Организации
	|Документ.СторнированиеНачислений.Чтение.ГруппыФизическихЛиц
	|Документ.СторнированиеНачислений.Чтение.Организации
	|Документ.СторнированиеНачислений.Изменение.ГруппыФизическихЛиц
	|Документ.СторнированиеНачислений.Изменение.Организации
	|Документ.ТабельУчетаРабочегоВремени.Чтение.ГруппыФизическихЛиц
	|Документ.ТабельУчетаРабочегоВремени.Чтение.Организации
	|Документ.ТабельУчетаРабочегоВремени.Изменение.ГруппыФизическихЛиц
	|Документ.ТабельУчетаРабочегоВремени.Изменение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Изменение.Организации
	|Документ.УведомлениеОбИзмененииРасчетаПособия.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОбИзмененииРасчетаПособия.Чтение.Организации
	|Документ.УведомлениеОбИзмененииРасчетаПособия.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОбИзмененииРасчетаПособия.Изменение.Организации
	|Документ.УведомлениеОбИсчисленныхСуммахНалогов.Чтение.Организации
	|Документ.УведомлениеОбИсчисленныхСуммахНалогов.Изменение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Чтение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Изменение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.Организации
	|Документ.УведомлениеОПредоставленииПолномочийПредставителю.Чтение.Организации
	|Документ.УведомлениеОПредоставленииПолномочийПредставителю.Изменение.Организации
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.УведомлениеОПрекращенииПолномочийПредставителя.Чтение.Организации
	|Документ.УведомлениеОПрекращенииПолномочийПредставителя.Изменение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации
	|Документ.УведомлениеОСтатусеВыплатыПособия.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОСтатусеВыплатыПособия.Чтение.Организации
	|Документ.УведомлениеОСтатусеВыплатыПособия.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОСтатусеВыплатыПособия.Изменение.Организации
	|Документ.Увольнение.Чтение.ГруппыФизическихЛиц
	|Документ.Увольнение.Чтение.Организации
	|Документ.Увольнение.Изменение.ГруппыФизическихЛиц
	|Документ.Увольнение.Изменение.Организации
	|Документ.УвольнениеСписком.Чтение.ГруппыФизическихЛиц
	|Документ.УвольнениеСписком.Чтение.Организации
	|Документ.УвольнениеСписком.Изменение.ГруппыФизическихЛиц
	|Документ.УвольнениеСписком.Изменение.Организации
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Чтение.Организации
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Изменение.Организации
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Чтение.Организации
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Изменение.Организации
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Чтение.Организации
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Изменение.Организации
	|Документ.УдержаниеПрофсоюзныхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеПрофсоюзныхВзносов.Чтение.Организации
	|Документ.УдержаниеПрофсоюзныхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеПрофсоюзныхВзносов.Изменение.Организации
	|Документ.УтверждениеШтатногоРасписания.Чтение.Организации
	|Документ.УтверждениеШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.УтверждениеШтатногоРасписания.Изменение.Организации
	|Документ.УтверждениеШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ФинОтчетВБанк.Чтение.Организации
	|Документ.ФинОтчетВБанк.Изменение.Организации
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Чтение.Организации
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Изменение.Организации
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.ЦепочкаСозданияСтоимостиКонтролируемойСделки.Чтение.Организации
	|Документ.ЦепочкаСозданияСтоимостиКонтролируемойСделки.Изменение.Организации
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.Организации
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Организации
	|ЖурналДокументов.БронированиеГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.БронированиеГражданПребывающихВЗапасе.Чтение.Организации
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.Организации
	|ЖурналДокументов.ВедомостиПрочихДоходов.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ВедомостиПрочихДоходов.Чтение.Организации
	|ЖурналДокументов.ГрафикиПереносыОтпусков.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ГрафикиПереносыОтпусков.Чтение.Организации
	|ЖурналДокументов.ДанныеНаНачалоЭксплуатации.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДанныеНаНачалоЭксплуатации.Чтение.Организации
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.Организации
	|ЖурналДокументов.ДоговорыГражданскоПравовогоХарактера.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДоговорыГражданскоПравовогоХарактера.Чтение.Организации
	|ЖурналДокументов.ДокументыВоинскогоУчета.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДокументыВоинскогоУчета.Чтение.Организации
	|ЖурналДокументов.ДокументыОбменаСБанкамиПоЗарплатнымПроектам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Организации
	|ЖурналДокументов.ДокументыПоУчетуНДСДляПередачиВЭлектронномВиде.Чтение.Организации
	|ЖурналДокументов.ДокументыУправленияШтатнымРасписанием.Чтение.Организации
	|ЖурналДокументов.ДокументыУправленияШтатнымРасписанием.Чтение.ПодразделенияОрганизаций
	|ЖурналДокументов.ЗаймыСотрудникам.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаймыСотрудникам.Чтение.Организации
	|ЖурналДокументов.ЗапросыПФРФСС.Чтение.Объект.Документ.ЗапросВФССОПроверкеРаботодателя
	|ЖурналДокументов.ЗапросыПФРФСС.Чтение.Объект.Документ.ЗаявлениеИЗапросВПФРОЗаработке
	|ЖурналДокументов.ЗаявкиКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаявкиКабинетСотрудника.Чтение.Организации
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.Организации
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Организации
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Организации
	|ЖурналДокументов.КадровыеДокументы.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.КадровыеДокументы.Чтение.Организации
	|ЖурналДокументов.Командировки.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Командировки.Чтение.Организации
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Организации
	|ЖурналДокументов.Отгулы.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Отгулы.Чтение.Организации
	|ЖурналДокументов.Отпуска.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Отпуска.Чтение.Организации
	|ЖурналДокументов.ОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ОтпускаПоУходуЗаРебенком.Чтение.Организации
	|ЖурналДокументов.Отсутствия.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Отсутствия.Чтение.Организации
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Организации
	|ЖурналДокументов.Подработки.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Подработки.Чтение.Организации
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Организации
	|ЖурналДокументов.ПрогулыНеявки.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПрогулыНеявки.Чтение.Организации
	|ЖурналДокументов.ПрочиеДоходы.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПрочиеДоходы.Чтение.Организации
	|ЖурналДокументов.РаботаСверхурочно.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.РаботаСверхурочно.Чтение.Организации
	|ЖурналДокументов.СведенияДляВоенкоматов.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.СведенияДляВоенкоматов.Чтение.Организации
	|ЖурналДокументов.СверкаКарточекВоинскогоУчета.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.СверкаКарточекВоинскогоУчета.Чтение.Организации
	|ЖурналДокументов.УведомленияОВыплатеПособий.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.УведомленияОВыплатеПособий.Чтение.Организации
	|ЖурналДокументов.ЭлектронныеТрудовыеКнижки.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЭлектронныеТрудовыеКнижки.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Чтение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Изменение.Организации
	|РегистрСведений.ВидыЗанятостиСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВидыЗанятостиСотрудников.Чтение.Организации
	|РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации
	|РегистрСведений.ВоинскийУчет.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВоинскийУчет.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ВходящиеСообщенияСЭДОФСС.Чтение.Организации
	|РегистрСведений.ВходящиеСообщенияСЭДОФСС.Изменение.Организации
	|РегистрСведений.ВычетыПредыдущегоМестаРаботыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВычетыПредыдущегоМестаРаботыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудников.Чтение.Организации
	|РегистрСведений.ГрафикРаботыСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствие
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ИсполнениеЗаявкиСотрудника
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|РегистрСведений.ДанныеДляПодбораСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеДляПодбораСотрудников.Чтение.Организации
	|РегистрСведений.ДанныеДляПодбораСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеДляПодбораСотрудников.Изменение.Организации
	|РегистрСведений.ДанныеЛичногоКабинетаЕНС.Чтение.Организации
	|РегистрСведений.ДанныеЛичногоКабинетаЕНС.Изменение.Организации
	|РегистрСведений.ДанныеОбОплатеТрудаДляПодбораСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеОбОплатеТрудаДляПодбораСотрудников.Чтение.Организации
	|РегистрСведений.ДанныеСостоянийСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеСохраняемогоЗаработкаПриВзысканиях.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеСохраняемогоЗаработкаПриВзысканиях.Чтение.Организации
	|РегистрСведений.ДистанционнаяРаботаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДистанционнаяРаботаСотрудников.Чтение.Организации
	|РегистрСведений.ДистанционнаяРаботаСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДистанционнаяРаботаСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок.Чтение.Организации
	|РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок.Изменение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЖурналЗагрузкиЕНС.Чтение.Организации
	|РегистрСведений.ЖурналЗагрузкиЕНС.Изменение.Организации
	|РегистрСведений.ЖурналЗапросовКСерверамФСС.Чтение.Организации
	|РегистрСведений.ЖурналЗапросовКСерверамФСС.Изменение.Организации
	|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
	|РегистрСведений.ЖурналНовыхСобытий.Изменение.Организации
	|РегистрСведений.ЖурналНовыхСобытийОбменаСБанками.Чтение.Организации
	|РегистрСведений.ЖурналНовыхСобытийОбменаСБанками.Изменение.Организации
	|РегистрСведений.ЖурналОперацийСФайламиОбменаСБанками.Чтение.Организации
	|РегистрСведений.ЖурналОперацийСФайламиОбменаСБанками.Изменение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации
	|РегистрСведений.ЖурналПереданнойОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.ЖурналПереданнойОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.ЖурналПередачиОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.ЖурналПередачиОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.ЖурналСобытийОбменаСЭДО.Чтение.Организации
	|РегистрСведений.ЖурналСобытийОбменаСЭДО.Изменение.Организации
	|РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.Чтение.Организации
	|РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.Изменение.Организации
	|РегистрСведений.ЗанятостьПозицийШтатногоРасписания.Чтение.Организации
	|РегистрСведений.ЗанятостьПозицийШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИнтервальный.Чтение.Организации
	|РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИнтервальный.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ЗапросыДляПовторнойОтправкиСЭДО.Чтение.Организации
	|РегистрСведений.ЗапросыДляПовторнойОтправкиСЭДО.Изменение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Чтение.Организации
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Изменение.Организации
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек.Чтение.Организации
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекОтозванные.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекОтозванные.Чтение.Организации
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные.Чтение.Организации
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Изменение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.Чтение.Организации
	|РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.Изменение.Организации
	|РегистрСведений.ЗначенияПоказателейРасчетаРезервов.Чтение.Организации
	|РегистрСведений.ЗначенияПоказателейРасчетаРезервов.Изменение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ИсправлениеПараметровНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.ИсторияЕжегодныхОтпусковПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияЕжегодныхОтпусковПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияИспользованияШтатногоРасписания.Чтение.Организации
	|РегистрСведений.ИсторияИспользованияШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияНачисленийПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияНачисленийПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияПоказателейПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияПоказателейПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Изменение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Изменение.Организации
	|РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиниц.Чтение.Организации
	|РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиниц.Изменение.Организации
	|РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.Чтение.Организации
	|РегистрСведений.ИсторияСпециальностейПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияСпециальностейПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсходныеДанныеПерерасчетов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ИсходныеДанныеПерерасчетов.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.КадровыеДанныеРедактированиеОрганизации.Чтение.Организации
	|РегистрСведений.КадровыеДанныеРедактированиеФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.Организации
	|РегистрСведений.МашиночитаемыеДоверенностиОбмена.Чтение.Организации
	|РегистрСведений.МашиночитаемыеДоверенностиОбмена.Изменение.Организации
	|РегистрСведений.МероприятияТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.МероприятияТрудовойДеятельности.Чтение.Организации
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Чтение.Организации
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Изменение.Организации
	|РегистрСведений.МестаВыплатыЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.МестаВыплатыЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.НаградыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НаградыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.НазначениеПоказателейРасчетаРезервов.Чтение.Организации
	|РегистрСведений.НазначениеПоказателейРасчетаРезервов.Изменение.Организации
	|РегистрСведений.НакопленныеСтажиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкаПереходаНаФСБУ5.Чтение.Организации
	|РегистрСведений.НастройкаПереходаНаФСБУ5.Изменение.Организации
	|РегистрСведений.НастройкиЗаполненияБухгалтерскойОтчетности.Чтение.Организации
	|РегистрСведений.НастройкиЗаполненияБухгалтерскойОтчетности.Изменение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Изменение.Организации
	|РегистрСведений.НастройкиЗарплатаКадрыРасширенная.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадрыРасширенная.Изменение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации
	|РегистрСведений.НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда.Чтение.Организации
	|РегистрСведений.НастройкиКлассификацииВыручкиПоОКВЭД.Чтение.Организации
	|РегистрСведений.НастройкиКлассификацииВыручкиПоОКВЭД.Изменение.Организации
	|РегистрСведений.НастройкиОбменаМинобороны.Чтение.Организации
	|РегистрСведений.НастройкиОбменаМинобороны.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРЭЦ.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРЭЦ.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации
	|РегистрСведений.НастройкиОтправкиОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.НастройкиПолученияУведомленийОбЭЛН.Чтение.Организации
	|РегистрСведений.НастройкиПолученияУведомленийОбЭЛН.Изменение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФССОрганизаций.Чтение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФССОрганизаций.Изменение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Чтение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Изменение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Чтение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Изменение.Организации
	|РегистрСведений.НастройкиРасчетаРезервовОтпусков.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования.Чтение.Организации
	|РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования.Изменение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Изменение.Организации
	|РегистрСведений.НачисленнаяЗарплатаПросмотрОрганизации.Чтение.Организации
	|РегистрСведений.НачисленнаяЗарплатаПросмотрФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НачисленнаяЗарплатаРедактированиеОрганизации.Чтение.Организации
	|РегистрСведений.НачисленнаяЗарплатаРедактированиеФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НумераторПачекПФР.Чтение.Организации
	|РегистрСведений.НумераторПачекПФР.Изменение.Организации
	|РегистрСведений.ОбязательностьЭДООрганизаций.Чтение.Организации
	|РегистрСведений.ОбязательностьЭДООрганизаций.Изменение.Организации
	|РегистрСведений.ОперацииСПрослеживаемымиТоварами.Чтение.Организации
	|РегистрСведений.ОперацииСПрослеживаемымиТоварами.Изменение.Организации
	|РегистрСведений.ОперацииСПрослеживаемымиТоварамиРасширенный.Чтение.Организации
	|РегистрСведений.ОперацииСПрослеживаемымиТоварамиРасширенный.Изменение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.Организации
	|РегистрСведений.ОплаченныеДоговоры.Чтение.Организации
	|РегистрСведений.ОснованияПолномочийОтветственныхЛиц.Чтение.Организации
	|РегистрСведений.ОснованияПолномочийОтветственныхЛиц.Изменение.Организации
	|РегистрСведений.ОснованияУвольненияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.Чтение.Организации
	|РегистрСведений.ОсновныеСотрудникиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОсновныеСотрудникиФизическихЛиц.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Чтение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Изменение.Организации
	|РегистрСведений.ОтражениеДокументовВРеглУчете.Чтение.Организации
	|РегистрСведений.ОтражениеДокументовВРеглУчете.Изменение.Организации
	|РегистрСведений.ОтчетыПереданныеВСПАРК.Чтение.Организации
	|РегистрСведений.ОтчетыПереданныеВСПАРК.Изменение.Организации
	|РегистрСведений.ОтчитывающиесяПоВзносамОрганизации.Чтение.Организации
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Чтение.Организации
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Изменение.Организации
	|РегистрСведений.ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПараметрыНачисленияНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.ПараметрыТорговыхТочек.Чтение.Организации
	|РегистрСведений.ПараметрыТорговыхТочек.Изменение.Организации
	|РегистрСведений.ПерерасчетДоговоров.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетДоговоров.Чтение.Организации
	|РегистрСведений.ПерерасчетДоговоров.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетДоговоров.Изменение.Организации
	|РегистрСведений.ПерерасчетЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетЗарплаты.Чтение.Организации
	|РегистрСведений.ПерерасчетЗарплаты.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетЗарплаты.Изменение.Организации
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Чтение.Организации
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Изменение.Организации
	|РегистрСведений.ПерерасчетУдержаний.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетУдержаний.Чтение.Организации
	|РегистрСведений.ПерерасчетУдержаний.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетУдержаний.Изменение.Организации
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.Организации
	|РегистрСведений.ПериодыОбновленияДанныхЕНС.Чтение.Организации
	|РегистрСведений.ПериодыОбновленияДанныхЕНС.Изменение.Организации
	|РегистрСведений.ПериодыРаботыСКоронавирусом.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПериодыРаботыСКоронавирусом.Чтение.Организации
	|РегистрСведений.ПлановыеАвансы.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансы.Чтение.Организации
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Чтение.Организации
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Изменение.Организации
	|РегистрСведений.ПлановыеНачисления.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисления.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияПросмотрОрганизации.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияПросмотрФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияРедактированиеОрганизации.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияРедактированиеФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Чтение.Организации
	|РегистрСведений.ПлановыйФОТ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыйФОТ.Чтение.Организации
	|РегистрСведений.ПлановыйФОТИтоги.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыйФОТИтоги.Чтение.Организации
	|РегистрСведений.ПодписиДокументовЭДОБЗК.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПодписиДокументовЭДОБЗК.Чтение.Организации
	|РегистрСведений.ПодписиДокументовЭДОБЗК.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПодписиДокументовЭДОБЗК.Изменение.Организации
	|РегистрСведений.ПодпискиНаУведомленияОбЭЛН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПодпискиНаУведомленияОбЭЛН.Чтение.Организации
	|РегистрСведений.ПодпискиНаУведомленияОбЭЛН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПодпискиНаУведомленияОбЭЛН.Изменение.Организации
	|РегистрСведений.ПодразделенияЗаПределамиРФ.Чтение.Организации
	|РегистрСведений.ПодразделенияЗаПределамиРФ.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияНаСчетахУчета.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияНаСчетахУчета.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияПрочихОпераций.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияПрочихОпераций.Изменение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Чтение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Изменение.Организации
	|РегистрСведений.ПорядокУплатыНалоговПоРегионам.Чтение.Организации
	|РегистрСведений.ПорядокУплатыНалоговПоРегионам.Изменение.Организации
	|РегистрСведений.ПредельныеСуммыУдержанийСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПредельныеСуммыУдержанийСотрудников.Чтение.Организации
	|РегистрСведений.ПредоставлениеСоциальныхВычетовУРаботодателя.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ПрименениеРегиональныхИНВ.Чтение.Организации
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПримененныеСтавкиОтложенногоНалога.Чтение.Организации
	|РегистрСведений.ПриостановленияТрудовыхДоговоровКонтрактов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПриостановленияТрудовыхДоговоровКонтрактов.Чтение.Организации
	|РегистрСведений.ПриостановленияТрудовыхДоговоровКонтрактовИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПриостановленияТрудовыхДоговоровКонтрактовИнтервальный.Чтение.Организации
	|РегистрСведений.ПрофессииФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрофессииФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Чтение.Организации
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Изменение.Организации
	|РегистрСведений.ПроцентыСевернойНадбавкиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПроцентыСевернойНадбавкиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РабочиеМестаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РабочиеМестаСотрудников.Чтение.Организации
	|РегистрСведений.РабочиеМестаСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РабочиеМестаСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.РасчетДолейБазыНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетЗемельногоНалога.Чтение.Организации
	|РегистрСведений.РасчетЗемельногоНалогаДо2020.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмуществоПоКадастровойСтоимости.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.Чтение.Организации
	|РегистрСведений.РасчетНалогаУСН.Чтение.Организации
	|РегистрСведений.РасчетНормированияРасходов.Чтение.Организации
	|РегистрСведений.РасчетныеЛисткиКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетныеЛисткиКабинетСотрудника.Чтение.Организации
	|РегистрСведений.РасчетОтложенногоНалога.Чтение.Организации
	|РегистрСведений.РасчетПереоценкиВалютныхСредствНУ.Чтение.Организации
	|РегистрСведений.РасчетПоказателейОтложенногоНалога.Чтение.Организации
	|РегистрСведений.РасчетПризнанияРасходовНИОКР.Чтение.Организации
	|РегистрСведений.РасчетРазницВОценкеАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетРасходовПоАренде.Чтение.Организации
	|РегистрСведений.РасчетРезерваОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетРезервовПоСомнительнымДолгам.Чтение.Организации
	|РегистрСведений.РасчетСтавкиНалогаНаПрибыльЗаМесяц.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетТранспортногоНалога.Чтение.Организации
	|РегистрСведений.РасчетЭффектаИзмененияСтавокНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Чтение.Организации
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Изменение.Организации
	|РегистрСведений.РегистрацииЗапросовСтатусовВыплатыПособий.Чтение.Организации
	|РегистрСведений.РегистрацииЗапросовСтатусовВыплатыПособий.Изменение.Организации
	|РегистрСведений.РегистрацииЗаявленийОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.Организации
	|РегистрСведений.РегистрацииЗаявленийОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.Организации
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Чтение.Организации
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Изменение.Организации
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Чтение.Организации
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Изменение.Организации
	|РегистрСведений.РегистрацииСведенийДляОплатыОтпускаСФР.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииСведенийДляОплатыОтпускаСФР.Чтение.Организации
	|РегистрСведений.РегистрацииСведенийДляОплатыОтпускаСФР.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииСведенийДляОплатыОтпускаСФР.Изменение.Организации
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.Организации
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.Организации
	|РегистрСведений.РеестрКадровыхПриказов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РеестрКадровыхПриказов.Чтение.Организации
	|РегистрСведений.РеестрКадровыхПриказовИспр.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РеестрКадровыхПриказовИспр.Чтение.Организации
	|РегистрСведений.РеестрОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РезультатыПубликацииДокументовЭДОБЗК.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РезультатыПубликацииДокументовЭДОБЗК.Чтение.Организации
	|РегистрСведений.РолиСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиСотрудников.Чтение.Организации
	|РегистрСведений.РолиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиФизическихЛиц.Чтение.Организации
	|РегистрСведений.РолиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РолиФизическихЛиц.Изменение.Организации
	|РегистрСведений.СведенияКонтрактаДоговораСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияКонтрактаДоговораСотрудника.Чтение.Организации
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбЭЛН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбЭЛН.Чтение.Организации
	|РегистрСведений.СведенияОбЭЛН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбЭЛН.Изменение.Организации
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.Организации
	|РегистрСведений.СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.Организации
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Изменение.Организации
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил19Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил19Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил20Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил20Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел1Поставки.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел1Поставки.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел1Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел1Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил23Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил23Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил24Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил24Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел1Обороты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел1Обороты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел2Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел2Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел3Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел3Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел1Обороты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел1Обороты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел2Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел2Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел3Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел3Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил27Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил27Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил28Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил28Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Поставщики.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Поставщики.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Производство.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Производство.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил30Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил30Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил31Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил31Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил32Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил32Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил33Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил33Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил34Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил34Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил35Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил35Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел1Поставки.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел1Поставки.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел1Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел1Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил38Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил38Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел1Обороты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел1Обороты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел2Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел2Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел3Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел3Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил40Раздел1Обороты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил40Раздел1Обороты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил40Раздел2Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил40Раздел2Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил40Раздел3Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил40Раздел3Возвраты.Изменение.Организации
	|РегистрСведений.СведенияТаможенныхДекларацийЭкспорт.Чтение.Организации
	|РегистрСведений.СвойстваТранзакцийОбменаСБанками.Чтение.Организации
	|РегистрСведений.СвойстваТранзакцийОбменаСБанками.Изменение.Организации
	|РегистрСведений.СертификатыОрганизацийДляОбменаСБанками.Чтение.Организации
	|РегистрСведений.СертификатыОрганизацийДляОбменаСБанками.Изменение.Организации
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Чтение.Организации
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Изменение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СогласияНаУведомленияОбЭЛН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаУведомленияОбЭЛН.Чтение.Организации
	|РегистрСведений.СогласияНаУведомленияОбЭЛН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаУведомленияОбЭЛН.Изменение.Организации
	|РегистрСведений.СообщенияФССОбИзмененииСостоянийЭЛН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СообщенияФССОбИзмененииСостоянийЭЛН.Чтение.Организации
	|РегистрСведений.СообщенияФССОбИзмененииСостоянийЭЛН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СообщенияФССОбИзмененииСостоянийЭЛН.Изменение.Организации
	|РегистрСведений.СоответствиеСообщенийСЭДОЗапросам.Чтение.Организации
	|РегистрСведений.СоответствиеСообщенийСЭДОЗапросам.Изменение.Организации
	|РегистрСведений.СоставГруппСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СоставГруппСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СостояниеНастройкиЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.СостояниеПодключенияКЭДОсПФР.Чтение.Организации
	|РегистрСведений.СостояниеПодключенияКЭДОсПФР.Изменение.Организации
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Изменение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Чтение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Изменение.Организации
	|РегистрСведений.СостоянияДокументовЭДОБЗК.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияДокументовЭДОБЗК.Чтение.Организации
	|РегистрСведений.СостоянияОбновленияЕНС.Чтение.Организации
	|РегистрСведений.СостоянияОбновленияЕНС.Изменение.Организации
	|РегистрСведений.СостоянияПодключенияЕНС.Чтение.Организации
	|РегистрСведений.СостоянияПодключенияЕНС.Изменение.Организации
	|РегистрСведений.СостоянияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СохраняемыйЗаработокПриВзысканиях.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СохраняемыйЗаработокПриВзысканиях.Чтение.Организации
	|РегистрСведений.СпециальностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СпециальностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете.Чтение.Организации
	|РегистрСведений.СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете.Изменение.Организации
	|РегистрСведений.СреднийЗаработокОбщийСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СреднийЗаработокОбщийСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СреднийЗаработокСтрахователейСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СреднийЗаработокСтрахователейСЭДО.Чтение.Организации
	|РегистрСведений.СреднийЗаработокСтрахователейСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СреднийЗаработокСтрахователейСЭДО.Изменение.Организации
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Чтение.Организации
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Изменение.Организации
	|РегистрСведений.СтавкаКомпенсацииЗаЗадержкуЗарплаты.Чтение.Организации
	|РегистрСведений.СтавкаКомпенсацииЗаЗадержкуЗарплаты.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Изменение.Организации
	|РегистрСведений.СтажиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтажиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыНаДетейНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыПоНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Чтение.Организации
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Изменение.Организации
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыОтправки.Чтение.Организации
	|РегистрСведений.СтатусыОтправки.Изменение.Организации
	|РегистрСведений.СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете.Чтение.Организации
	|РегистрСведений.СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете.Изменение.Организации
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Чтение.ГруппыПартнеров
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Изменение.ГруппыПартнеров
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СчетаРеглУчетаТребующиеНастройки.Чтение.Организации
	|РегистрСведений.СчетаРеглУчетаТребующиеНастройки.Изменение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Чтение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Изменение.Организации
	|РегистрСведений.ТерриторииСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТерриторииСотрудников.Чтение.Организации
	|РегистрСведений.ТерриторииСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТерриторииСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ТрудоваяДеятельностьФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТрудоваяДеятельностьФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияДоговораГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияДоговораГПХ.Чтение.Организации
	|РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенком.Чтение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.Организации
	|РегистрСведений.УченыеЗванияФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеЗванияФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеСтепениФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеСтепениФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УчетнаяПолитикаБухУчета.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаПоНДФЛ.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|РегистрСведений.ФизическиеЛицаПрисоединенныеКЭДОБЗК.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФотографииФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФотографииФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.Организации
	|РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоКонтрагентамАкционерам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоКонтрагентамАкционерам.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеДляРасчетаСреднегоЗаработкаПоНачислениям.Чтение.Организации
	|РегистрНакопления.ДанныеДляРасчетаСреднегоЗаработкаФССПоНачислениям.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.Организации
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеДокументы.Чтение.Организации
	|РегистрНакопления.ДенежныеДокументы.Чтение.Подразделения
	|РегистрНакопления.ДниЧасыОтгулов.Чтение.Организации
	|РегистрНакопления.ДополнениеРасчетнойБазыУдержаний.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДополнениеРасчетнойБазыУдержаний.Чтение.Организации
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Чтение.Организации
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Изменение.Организации
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Организации
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Подразделения
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Склады
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.Организации
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел2.Чтение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Чтение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Изменение.Организации
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.НДСЗаписиРаздела7Декларации.Чтение.Организации
	|РегистрНакопления.НДФЛКПеречислению.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НДФЛКПеречислению.Чтение.Организации
	|РегистрНакопления.НДФЛПеречисленный.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НДФЛПеречисленный.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Изменение.Организации
	|РегистрНакопления.ОценочныеОбязательства.Чтение.Организации
	|РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ПартииНезавершенногоПроизводства.Чтение.Организации
	|РегистрНакопления.ПериодыУходаЗаБольнымиРодственниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.Организации
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.Организации
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.ПрослеживаемыеТоварыВСоставеОС.Чтение.Организации
	|РегистрНакопления.РасходыПриУСН.Чтение.Организации
	|РегистрНакопления.РасходыПриУСН.Изменение.Организации
	|РегистрНакопления.РасходыПриУСНМатериалы.Чтение.Организации
	|РегистрНакопления.РасходыПриУСНОСиНМА.Чтение.Организации
	|РегистрНакопления.РасходыПриУСНТовары.Чтение.Организации
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыПоЕдиномуНалоговомуСчету.Чтение.Организации
	|РегистрНакопления.РасчетыПоЕдиномуНалоговомуСчету.Изменение.Организации
	|РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.Чтение.Организации
	|РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.Изменение.Организации
	|РегистрНакопления.РасчетыПоСанкциямНаЕдиномНалоговомСчете.Чтение.Организации
	|РегистрНакопления.РасчетыПоСанкциямНаЕдиномНалоговомСчете.Изменение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Чтение.Организации
	|РегистрНакопления.РНПТМатериаловВПроизводстве.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.Организации
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.Организации
	|РегистрНакопления.УдержанияДоПределаПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.УдержанияДоПределаПоСотрудникам.Чтение.Организации
	|РегистрНакопления.УдержанияПоИсполнительнымДокументам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.УдержанияПоИсполнительнымДокументам.Чтение.Организации
	|РегистрНакопления.УдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.УдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению.Чтение.Организации
	|БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтпуск.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтпуск.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтсутствие.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтсутствие.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы.Изменение.Пользователи
	|БизнесПроцесс.ИсполнениеЗаявкиСотрудника.Чтение.ГруппыФизическихЛиц
	|БизнесПроцесс.ИсполнениеЗаявкиСотрудника.Чтение.Организации
	|БизнесПроцесс.ИсполнениеЗаявкиСотрудника.Изменение.ГруппыФизическихЛиц
	|БизнесПроцесс.ИсполнениеЗаявкиСотрудника.Изменение.Организации
	|БизнесПроцесс.ОбращениеСотрудника.Чтение.Пользователи
	|БизнесПроцесс.ОбращениеСотрудника.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаДобровольныеСтраховыеВзносы
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствие
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаОстаткиОтпусков
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправкаСМестаРаботы
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ИсполнениеЗаявкиСотрудника
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|РегистрБухгалтерии.Хозрасчетный.Чтение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Изменение.Организации
	|РегистрРасчета.Начисления.Чтение.ГруппыФизическихЛиц
	|РегистрРасчета.Начисления.Чтение.Организации
	|РегистрРасчета.Удержания.Чтение.ГруппыФизическихЛиц
	|РегистрРасчета.Удержания.Чтение.Организации
//-- НЕ УТ
//++ НЕ УТКА
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.Склады
	|Документ.АмортизацияНМАМеждународныйУчет.Чтение.Организации
	|Документ.АмортизацияНМАМеждународныйУчет.Изменение.Организации
	|Документ.АмортизацияОСМеждународныйУчет.Чтение.Организации
	|Документ.АмортизацияОСМеждународныйУчет.Изменение.Организации
	|Документ.ВозвратСырьяДавальцу.Чтение.ГруппыПартнеров
	|Документ.ВозвратСырьяДавальцу.Чтение.Организации
	|Документ.ВозвратСырьяДавальцу.Чтение.Подразделения
	|Документ.ВозвратСырьяДавальцу.Чтение.Склады
	|Документ.ВозвратСырьяДавальцу.Изменение.ГруппыПартнеров
	|Документ.ВозвратСырьяДавальцу.Изменение.Организации
	|Документ.ВозвратСырьяДавальцу.Изменение.Подразделения
	|Документ.ВозвратСырьяДавальцу.Изменение.Склады
	|Документ.ЗаказДавальца.Чтение.ГруппыПартнеров
	|Документ.ЗаказДавальца.Чтение.Организации
	|Документ.ЗаказДавальца.Чтение.Подразделения
	|Документ.ЗаказДавальца.Чтение.Склады
	|Документ.ЗаказДавальца.Изменение.ГруппыПартнеров
	|Документ.ЗаказДавальца.Изменение.Организации
	|Документ.ЗаказДавальца.Изменение.Подразделения
	|Документ.ЗаказДавальца.Изменение.Склады
	|Документ.ИзменениеПараметровНМАМеждународныйУчет.Чтение.Организации
	|Документ.ИзменениеПараметровНМАМеждународныйУчет.Изменение.Организации
	|Документ.ИзменениеПараметровОСМеждународныйУчет.Чтение.Организации
	|Документ.ИзменениеПараметровОСМеждународныйУчет.Изменение.Организации
	|Документ.ОтчетДавальцу.Чтение.ГруппыПартнеров
	|Документ.ОтчетДавальцу.Чтение.Организации
	|Документ.ОтчетДавальцу.Чтение.Подразделения
	|Документ.ОтчетДавальцу.Изменение.ГруппыПартнеров
	|Документ.ОтчетДавальцу.Изменение.Организации
	|Документ.ОтчетДавальцу.Изменение.Подразделения
	|Документ.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.Чтение.Организации
	|Документ.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.Изменение.Организации
	|Документ.ПередачаДавальцу.Чтение.ГруппыПартнеров
	|Документ.ПередачаДавальцу.Чтение.Организации
	|Документ.ПередачаДавальцу.Чтение.Подразделения
	|Документ.ПередачаДавальцу.Чтение.Склады
	|Документ.ПередачаДавальцу.Изменение.ГруппыПартнеров
	|Документ.ПередачаДавальцу.Изменение.Организации
	|Документ.ПередачаДавальцу.Изменение.Подразделения
	|Документ.ПередачаДавальцу.Изменение.Склады
	|Документ.ПеремещениеНМАМеждународныйУчет.Чтение.Организации
	|Документ.ПеремещениеНМАМеждународныйУчет.Изменение.Организации
	|Документ.ПеремещениеОСМеждународныйУчет.Чтение.Организации
	|Документ.ПеремещениеОСМеждународныйУчет.Изменение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Подразделения
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Склады
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Подразделения
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Склады
	|Документ.ПринятиеКУчетуНМАМеждународныйУчет.Чтение.Организации
	|Документ.ПринятиеКУчетуНМАМеждународныйУчет.Изменение.Организации
	|Документ.ПринятиеКУчетуОСМеждународныйУчет.Чтение.Организации
	|Документ.ПринятиеКУчетуОСМеждународныйУчет.Изменение.Организации
	|Документ.СписаниеНМАМеждународныйУчет.Чтение.Организации
	|Документ.СписаниеНМАМеждународныйУчет.Изменение.Организации
	|Документ.СписаниеОСМеждународныйУчет.Чтение.Организации
	|Документ.СписаниеОСМеждународныйУчет.Изменение.Организации
	|ЖурналДокументов.РегламентныеДокументыМеждународныйУчет.Чтение.Организации
//-- НЕ УТКА
//-- Локализация
	|";

КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
// 
// Параметры:
//  ВидДоступа - Строка - вид доступа.
//  Использование - Булево - значение соответствующих констант.
//
// см. УправлениеДоступомУТ.ПриЗаполненииИспользованияВидаДоступа
//
Процедура ЗаполнитьИспользованиеВидаДоступа(ВидДоступа, Использование) Экспорт

	//++ Локализация

	//++ НЕ УТ
	Если ВидДоступа = "ПодразделенияОрганизаций" Тогда
		Использование = Константы.ОграничиватьДоступНаУровнеЗаписейПодразделенияОрганизаций.Получить();

	ИначеЕсли ВидДоступа = "ГруппыФизическихЛиц" Тогда
		Использование = Константы.ОграничиватьДоступНаУровнеЗаписейФизическиеЛица.Получить();
		
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	//++ Локализация
	// RLS на объекты подсистемы ЗащитаПерсональныхДанных поставляется в ролях
	//   ДобавлениеИзменениеФизическихЛиц
	//   ЧтениеФизическихЛиц
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		Если Список = Метаданные.Документы["ОтзывСогласияНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.Документы["СогласиеНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.РегистрыСведений["СогласияНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.РегистрыСведений["СубъектыДляСкрытияПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Субъект)";
		КонецЕсли;
	КонецЕсли;
	//++ НЕ УТ
	ЗарплатаКадры.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	Если Список = Метаданные.Справочники.ФизическиеЛица Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЭтоГруппа
		|	ИЛИ ЗначениеРазрешено(Ссылка)";
	ИначеЕсли Список = Метаданные.Документы.РегламентированныйОтчет Тогда
		Ограничение.Текст =
		"ПрисоединитьДополнительныеТаблицы
		|ЭтотСписок КАК Т
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияРегламентированныхОтчетов КАК Т1
		|	ПО Т.ИсточникОтчета = Т1.ИмяОтчета
		|;
		|
		|РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Т.Организация)
		|	И ДляВсехСтрок(ЗначениеРазрешено(
		|		ЕСТЬNULL(Т1.ТипСведений, ЗНАЧЕНИЕ(Перечисление.ТипыСведенийРегламентированныхОтчетов.ПустаяСсылка)),
		|		NULL КАК ИСТИНА))";
	ИначеЕсли Список = Метаданные.Справочники.РегламентированныеОтчеты Тогда
		Ограничение.Текст =
		"ПрисоединитьДополнительныеТаблицы
		|ЭтотСписок КАК Т
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияРегламентированныхОтчетов КАК Т1
		|	ПО Т.Ссылка = Т1.РегламентированныйОтчет
		|;
		|
		|РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЭтоГруппа ИЛИ
		|	ДляВсехСтрок(ЗначениеРазрешено(
		|		ЕСТЬNULL(Т1.ТипСведений, ЗНАЧЕНИЕ(Перечисление.ТипыСведенийРегламентированныхОтчетов.ПустаяСсылка)),
		|		NULL КАК ИСТИНА))";
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
	
КонецПроцедуры

// см. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа
//
Процедура ЗаполнитьВидыДоступа(ВидыДоступа) Экспорт
	
	//++ Локализация
	
	//++ НЕ УТ
	ЗарплатаКадры.ПриЗаполненииВидовДоступа(ВидыДоступа);
	
	// локальное исправление 00-00170163, 30163804
	ГруппыФизическихЛицНайдены = Ложь;
	МассивУдаляемыхВидов = Новый Массив;
	Для Каждого Строка Из ВидыДоступа Цикл
		Если Строка.Имя = "ГруппыФизическихЛиц" И Не ГруппыФизическихЛицНайдены Тогда
			ГруппыФизическихЛицНайдены = Истина;
		ИначеЕсли Строка.Имя = "ГруппыФизическихЛиц" И ГруппыФизическихЛицНайдены Тогда
			МассивУдаляемыхВидов.Добавить(Строка);
		ИначеЕсли Строка.Имя = "СтруктураПредприятия" Тогда
			МассивУдаляемыхВидов.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из МассивУдаляемыхВидов Цикл
		ВидыДоступа.Удалить(Строка);
	КонецЦикла;
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СведенияРегламентированныхОтчетов";
	ВидДоступа.Представление = НСтр("ru = 'Сведения регламентированных отчетов';
									|en = 'Local report information'");
	ВидДоступа.ТипЗначений = Тип("ПеречислениеСсылка.ТипыСведенийРегламентированныхОтчетов");
	//-- НЕ УТ
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТипыДокументовEDI";
	ВидДоступа.Представление = НСтр("ru = 'Типы документов сервиса EDI';
									|en = 'EDI service document types'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ТипыДокументовEDI");
	
	//-- Локализация
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// Параметры:
//  Списки - см. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	Списки.Вставить(Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций, Истина);
	// Конец ЭлектронноеВзаимодействие
	
	УправлениеДоступомБП.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	// RLS на объекты подсистемы ЗащитаПерсональныхДанных поставляется в ролях
	//   ДобавлениеИзменениеФизическихЛиц
	//   ЧтениеФизическихЛиц
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		Списки.Вставить(Метаданные.Документы["ОтзывСогласияНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.Документы["СогласиеНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.РегистрыСведений["СогласияНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.РегистрыСведений["СубъектыДляСкрытияПерсональныхДанных"], Ложь);
	КонецЕсли;
	
	//++ НЕ УТ

	// Интеграция БРО
	РегламентированнаяОтчетность.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	Списки.Вставить(Метаданные.Справочники.РегламентированныеОтчеты, Ложь);
	Списки.Вставить(Метаданные.Документы.РегламентированныйОтчет, Ложь);
	
	// Интеграция БЗКР
	ЗарплатаКадры.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	//-- НЕ УТ
	
	
	УчетПрослеживаемыхТоваровЛокализация.ПриЗаполненииСписковСОграничениемДоступа(Списки);
		
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	// Конец РаспознаваниеДокументов
	
	Списки.Вставить(Метаданные.Документы.АктПостановкиНаБалансЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.АктСписанияЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковТМЦВЭксплуатации, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковНДСПредъявленного, Истина);
	Списки.Вставить(Метаданные.Документы.ВыводИзОборотаИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратВОборотИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратИзРегистра2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВнесениеСведенийОСобранномУрожаеЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросОстатковПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВыпускКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаОбособленногоУчетаЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.ЛистКассовойКниги, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияПоЯндексКассе, Истина);
	Списки.Вставить(Метаданные.Документы.ОстаткиЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтгрузкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОформлениеСДИЗЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаВРегистр2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеМеждуМОДИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПогашениеСДИЗЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ПодключениеКегаКОборудованиюРозливаИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПриемкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.РазрешениеНаОтгрузкуИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеКодовМаркировкиИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.СправкаОПодтверждающихДокументах, Истина);
	Списки.Вставить(Метаданные.Документы.ТранспортнаяНакладная, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНВходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНИсходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УточнениеСведенийОКодахМаркировкиИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИСВозврат, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОЗачисленииВалюты, Истина);
	Списки.Вставить(Метаданные.Документы.ФормированиеПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ФормированиеПартийИзДругихПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ФормированиеПартийПриПроизводствеЗЕРНО, Истина);
	
	Списки.Вставить(Метаданные.ЖурналыДокументов.РегламентныеДокументы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиОбменаСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиУчетаУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиУчетаНДСПриУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОграниченияВыгрузкиОстатковМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОстаткиТоваровМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИмпортируемыеТоварыТорговыхПлощадок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьСообщенийИСМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПримененияЕНВД, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПулКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РегистрацииВНалоговомОргане, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СоответствияАтрибутовМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СоответствияОбъектовМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СинхронизацияДанныхИСМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТоварыНаСкладахТорговыхПлощадокЗаДень, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаказыТорговыхПлощадок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьСообщенийЗЕРНО, Истина);
	
	Списки.Вставить(Метаданные.Справочники.Патенты, Истина);
	Списки.Вставить(Метаданные.Справочники.ПатентыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.КассовыеКниги, Истина);
	Списки.Вставить(Метаданные.Справочники.КлассификаторОрганизацийЕГАИС, Истина);
	Списки.Вставить(Метаданные.Справочники.ЛицензииПоставщиковАлкогольнойПродукции, Истина);
	Списки.Вставить(Метаданные.Справочники.РегистрацииВНалоговомОргане, Истина);
	Списки.Вставить(Метаданные.Справочники.ТранспортнаяНакладнаяПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СправкаОПодтверждающихДокументахПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.УчетныеЗаписиМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыХраненияПартийЗЕРНО, Истина);
	
	//++ НЕ УТ
	Списки.Вставить(Метаданные.Документы.ВводОстатковРасходовПриУСН, Истина);
	Списки.Вставить(Метаданные.Документы.ВводДанныхПоНалогуНаПрибыль, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратМатериаловИзПроизводства, Истина);
	Списки.Вставить(Метаданные.Документы.ВыбытиеДенежныхДокументов, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаписьКУДиР, Истина);
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияРасчетов, Истина); 
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияОбъектовУчета, Истина);
	Списки.Вставить(Метаданные.Документы.ДокументацияПоКонтролируемымСделкам, Истина);
	Списки.Вставить(Метаданные.Документы.КонтролируемаяСделка, Истина);
	Списки.Вставить(Метаданные.Документы.СопутствующиеУслугиКонтролируемойСделки, Истина);
	Списки.Вставить(Метаданные.Документы.ЦепочкаСозданияСтоимостиКонтролируемойСделки, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаРасчетовПоНалогам, Истина);
	Списки.Вставить(Метаданные.Документы.НачислениеДивидендов, Истина);
	Списки.Вставить(Метаданные.Документы.НачислениеЕНП, Истина);
	Списки.Вставить(Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияБух, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаМатериаловВПроизводство, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеДенежныхДокументов, Истина);
	Списки.Вставить(Метаданные.Документы.РегистрацияПрочихКонтролируемыхСделок, Истина);
	Списки.Вставить(Метаданные.Документы.РегламентнаяОперация, Истина);
	Списки.Вставить(Метаданные.Документы.СтатистикаПерсонала, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбИсчисленныхСуммахНалогов, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОКонтролируемыхСделках, Истина);
	Списки.Вставить(Метаданные.Документы.ФинОтчетВБанк, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДоговорыУчастниковКонтролируемыхСделок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВзаимозависимыеЛица, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЖурналНовыхСобытийОбменаСБанками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЖурналСтатусовФинОтчетностиВБанки, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиЗаполненияБухгалтерскойОтчетности, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОтражениеДокументовВРеглУчете, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПорядокОтраженияПрочихОпераций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПорядокОтраженияНаСчетахУчета, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПорядокУплатыНалоговНаМестах, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетНалогаУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетРасходовПоАренде, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СвойстваТранзакцийОбменаСБанками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СостояниеНастройкиЗаполненияФормСтатистики, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СчетаРеглУчетаТребующиеНастройки, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетСтоимостиНалоговыхАктивовИОбязательств, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетСтавкиНалогаНаПрибыльЗаМесяц, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетДолейБазыНалогаНаПрибыль, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетРазницВОценкеАктивовИОбязательств, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрименениеРегиональныхИНВ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПримененныеСтавкиОтложенногоНалога, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетОтложенногоНалога, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетПоказателейОтложенногоНалога, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетПризнанияРасходовНИОКР, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетЭффектаИзмененияСтавокНалогаНаПрибыль, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетРезервовПоСомнительнымДолгам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиКлассификацииВыручкиПоОКВЭД, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетНормированияРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеДокументы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыМатериаловСУчетомКорректировок, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходовРаздел2, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииНезавершенногоПроизводства, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасходыПриУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасходыПриУСНМатериалы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасходыПриУСНОСиНМА, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасходыПриУСНТовары, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоЕдиномуНалоговомуСчету, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоСанкциямНаЕдиномНалоговомСчете, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РНПТМатериаловВПроизводстве, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииНезавершенногоПроизводства, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УчетнаяПолитикаБухУчета, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиУчетаНалогаНаПрибыль, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ, Истина);
	Списки.Вставить(Метаданные.Справочники.ИнвентаризацияРасчетовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ИнвентаризацияОбъектовУчетаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ТранспортнаяНакладнаяПрисоединенныеФайлы, Истина);	
	Списки.Вставить(Метаданные.РегистрыНакопления.ПрослеживаемыеТоварыВСоставеОС, Истина);

	//++ НЕ УТКА
	Списки.Вставить(Метаданные.ЖурналыДокументов.РегламентныеДокументыМеждународныйУчет, Истина);
	//-- НЕ УТКА

	//-- НЕ УТ
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИндексироватьПрофили(ОписанияПрофилей, ПолеПрофиля = "Имя")
	
	Результат = Новый Соответствие;
	Для Индекс = 0 По ОписанияПрофилей.ВГраница() Цикл
		
		Профиль = ОписанияПрофилей[Индекс];
		Результат.Вставить(Профиль[ПолеПрофиля], Индекс);
		
	КонецЦикла;
	Возврат Результат;
	
КонецФункции
//++ Локализация
Функция НайтиПрофиль(ИмяПрофиля, ОписанияПрофилей, ИндексПрофилей)

	ИндексПрофиля = ИндексПрофилей[ИмяПрофиля];
	Если ИндексПрофиля = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОписанияПрофилей[ИндексПрофиля];
	
КонецФункции
//-- Локализация

// Служебная функция. Сделана экспортной для удобства внедрения.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСАТУРН");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБРО");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииССППР");
	//-- НЕ УТ
	
	// Необходимые роли БЭД
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// Новости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисДоставки");
	// ЭлектронноеВзаимодействие.СервисДоставки
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиТорговыйПредставитель(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоОбеспечениюПотребностей(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");

	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");

	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиФинансовогоАналитика(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоЗакупкам(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	//-- Локализация
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.

//++ НЕ УТ

// Используется при формировании профиля Бухгалтер МФУ.

//-- НЕ УТ

//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаЧтение(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппФинансовогоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");	
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппФинансовогоУчетаВнеоборотныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхНастраиваемойБухОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНематериальнымАктивам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОтраженияВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНематериальныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияНаСчетахУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТемЭтаповИсследованийИРазработок");

	//++ НЕ УТКА

	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	//-- Устарело_Производство21

	//-- НЕ УТКА

	//-- НЕ УТ
	
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркировокТоваровГИСМ");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоЯндексКассе");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовРезервовПодОбесценениеЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДепонированнойЗарплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовНМА");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаПервоначальныхСведенийДляРасчетаЗемельногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаПервоначальныхСведенийДляРасчетаНалогаНаИмущество");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаПервоначальныхСведенийДляРасчетаТранспортногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыбытияРНПТМатериаловИзПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПереносаРНПТМатериаловНаПродукцию");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровНачисленияЗемельногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровНачисленияТранспортногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерерасчетаИмущественныхНалогов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНаработкиТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНачисленийДивидендов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНачисленияСписанияРезервовПредстоящихРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтраженияЗарплатыВФинансовомУчете");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПогашенийСтоимостиТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодразделенийОрганизации");
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовИсправлениеИмущественныхНалогов");
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСтатистикаПерсонала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДепонированнойЗарплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБухгалтерскогоУчетаЗарплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБухгалтерскогоУчетаЗарплатыРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНалоговИВзносов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтатногоРасписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродолжительностиДоговоров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсУчета");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеНачисленияОценочныхОбязательствПоОтпускам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатистикиПерсоналаРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсУчетаРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОценочныхОбязательствЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПолученияУведомленийОбЭЛН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПатентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатистикиПерсонала");
	
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовМатериаловИзПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачМатериаловВПроизводство");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФинОтчетностьВБанки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРазделяемыхДанныхОбменаСБанками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНеразделяемыхДанныхОбменаСБанками");
	//++ НЕ УТКА

	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовНМАМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовОСМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовНМАМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОСМеждународныйУчет");
	//-- НЕ УХ
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхЛистовПроизводства");
	//-- Устарело_Производство21
	
	//-- НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	//-- НЕ УТ
	
	
	// Чтение регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРНПТМатериаловВПроизводстве");
	//-- НЕ УТ
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиБухгалтера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыПереданныеНаКомиссию");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаУчетныеПолитикиОрганизаций");
	//++ НЕ УТ

	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСправокРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрРегистровНалоговогоУчета");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоРезервированиюПодОбесценениеЗапасов");
	ОписаниеПрофиля.Роли.Добавить("СверкаДанныхОУиБУ");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаПодтверждениеРасходовПоКазначейскомуСопровождению");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийОбъектовУчета");
	//-- НЕ УТ
	
	// Регистры сведений, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПримененияЕНВД");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтавокНалогаНаПрибыль");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаУплатыНалоговНаМестах");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияНаСчетахУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетПереоценкиВалютныхСредствНУ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовРеглУчетаТребующихНастройки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтавокНалогаНаИмущество");
	//-- НЕ УТ
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");

	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРегламентированныйУчет");
	
	// Доступ на чтение к учету НДС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокВидовДеятельностиНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНДССостояниеРеализации0");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийЭкспорт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявленийОВвозеТоваровОтПокупателей");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомитента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНаНеподтвержденнуюРеализацию0");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	// Прослеживаемость импортных товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПрослеживаемыхТоваровВЕАЭС");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрослеживаемыхТоваровВСоставеОС");
	//-- НЕ УТ
	
	//-- Локализация
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.

//++ НЕ УТ

// Используется при формировании профиля Бухгалтер МФУ.

//-- НЕ УТ

//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаИзменение(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Справочники, чтение. 
	
	УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "БухгалтерРеглУчета");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	
	//++ НЕ УТ 
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОтраженияДокументовВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРегламентированногоУчета");
	//-- НЕ УТ 
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированияПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасчетовРезервовПодОбесценениеЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФинОтчетностьВБанки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделяемыхДанныхОбменаСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНеразделяемыхДанныхОбменаСБанками");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовМатериаловИзПроизводства");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковРасходовПриУСН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДенежныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДепонированнойЗарплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНачисленийДивидендов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНаработкиТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийРасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПатентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПогашенийСтоимостиТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтатистикиПерсонала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийОбъектовУчетов");
	//-- НЕ УТ
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчета");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчетаВнеоборотныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхНастраиваемойБухОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЗаполненияФормСтатистики");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНематериальныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщейБухгалтерскойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТемЭтаповИсследованийИРазработок");
	//-- НЕ УТ
	
	// Обработки и отчеты

	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("НастройкаНалоговИВзносовРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеНачисленияОценочныхОбязательствПоОтпускам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтраженияДокументовВРегламентированномУчете");
	//++ НЕ УТКА

	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОСМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовНМАМеждународныйУчет");
	//-- НЕ УХ

	//-- НЕ УТКА

	//-- НЕ УТ
	
	
	// Регистры сведений, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПримененияЕНВД");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаПервоначальныхСведенийДляРасчетаЗемельногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаПервоначальныхСведенийДляРасчетаНалогаНаИмущество");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаПервоначальныхСведенийДляРасчетаТранспортногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорядкаОтраженияНаСчетахУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорядкаОтраженияПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорядкаУплатыНалоговНаМестах");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПараметровНачисленияЗемельногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПараметровНачисленияТранспортногоНалога");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтавокНалогаНаИмущество");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтавокНалогаНаПрибыль");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовРеглУчетаТребующихНастройки");
	//-- НЕ УТ
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНачисленияСписанияРезервовПредстоящихРасходов");
	//-- НЕ УТ

	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРегламентированныйУчет");
	
	//++ НЕ УТ
	
	// Регламентированная отчетность
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделяемыхДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ПравоНаЗащищенныйДокументооборотСКонтролирующимиОрганами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
	ОписаниеПрофиля.Роли.Добавить("РаботаСЗаявкамиНаЛьготныйКредит");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаОтчетностиВИнтерфакс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМашиночитаемыхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОценкаРискаНалоговойПроверки");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаФинансовыйАнализ");
	
	// ЛК ЕНС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхЛичногоКабинетаЕНС");
	//-- НЕ УТ
	
	// Полный доступ к учету НДС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокВидовДеятельностиНДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНДССостояниеРеализации0");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТаможенныхДекларацийИмпорта");
	
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТаможенныхДекларацийЭкспорт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявленийОВвозеТоваровОтПокупателей");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомитента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурНаНеподтвержденнуюРеализацию0");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийПрослеживаемыхТоваров");
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	// Прослеживаемость импортных товаров
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияУчетПрослеживаемыхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПрослеживаемыхТоваровВЕАЭС");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрослеживаемыхТоваровВСоставеОС");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеОперацийСПрослеживаемымиТоварами");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРНПТМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыбытияРНПТМатериаловИзПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереносаРНПТМатериаловНаПродукцию");
	
	// Отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВедомостьПрослеживаемыхМатериаловВПроизводстве");
	//-- НЕ УТ
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиСупервайзерТорговыхПредставителей(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМаркетолог(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиРуководительОтделаПродаж(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");

	// ЛокализацияРаботыСЭПД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	
	// ЛокализацияРаботыСЯндексМаркет
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСтатусовПубликацииТоваровЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПродажиСФулфилментомЯндекса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажНаЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСоответствийОбъектовМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеОстатковТоваровМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов");
	
	// Обмен данными с маркетплейсом Ozon
	// Выше уже добавлены роли:
	//  "ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами",
	//  "РедактированиеСоответствийОбъектовМаркетплейсов",
	//  "РедактированиеОстатковТоваровМаркетплейсов",
	//  "ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов".
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажиНаOzon");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПродажамиНаOzon");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисДоставки");
	// Конец ЭлектронноеВзаимодействие.СервисДоставки
	
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыбытияРНПТМатериаловИзПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереносаРНПТМатериаловНаПродукцию");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВедомостьПрослеживаемыхМатериаловВПроизводстве");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоДоставке(ОписаниеПрофиля) Экспорт
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджерПоПродажам(ОписаниеПрофиля) Экспорт
	//++ Локализация
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСтатусовПубликацииТоваровЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПродажиСФулфилментомЯндекса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажНаЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСоответствийОбъектовМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеОстатковТоваровМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");
	
	// Обмен данными с маркетплейсом Ozon
	// Выше уже добавлены роли:
	//  "ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами",
	//  "РедактированиеСоответствийОбъектовМаркетплейсов",
	//  "РедактированиеОстатковТоваровМаркетплейсов",
	//  "ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов".
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажиНаOzon");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПродажамиНаOzon");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");

	// Обмен данными с мобильным приложением "1С:Заказы"
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");     
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоРозничнойТорговле(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиКассир(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиКазначей(ОписаниеПрофиля) Экспорт
	//++ Локализация
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
	
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиКладовщик(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	//-- НЕ УТ
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиАдминистраторПланирования(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	//++ НЕ УТ

	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	//-- Устарело_Производство21

	//-- НЕ УТ
	
	//++ НЕ УТКА

	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхЛистовПроизводства");
	//-- Устарело_Производство21

	//-- НЕ УТКА
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПланированияПроизводства(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	//++ НЕ УТ

	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	//-- Устарело_Производство21

	//-- НЕ УТ
	
	//++ НЕ УТКА

	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхЛистовПроизводства");
	//-- Устарело_Производство21

	//-- НЕ УТКА
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПланированияПродаж(ОписаниеПрофиля) Экспорт
	
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПрогнозированияПродаж(ОписаниеПрофиля) Экспорт
	
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельУправленияСервисомПрогнозирования");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервисаПрогнозированияПродаж");
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиАдминистраторПрогнозированияПродаж(ОписаниеПрофиля) Экспорт
	
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельУправленияСервисомПрогнозирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекСервисаПрогнозированияПродаж");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервисаПрогнозированияПродаж");
	
	//-- Локализация
	
КонецПроцедуры

//++ НЕ УТ

Процедура ДобавитьРолиГлавногоДиспетчера(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаСписаниеПоНормативам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровНДС");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийМатериаловПоНормативам");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтатногоРасписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодразделенийОрганизации");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИзделияИЗатратыНЗП");
	
	УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ДиспетчерПроизводства");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
	//-- НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудниковРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");
	
	// ЛокализацияРаботыСЭПД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПроизводства(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтатногоРасписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодразделенийОрганизации");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаСписаниеПоНормативам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудниковРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоПроизводствуНаСтороне(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	// Справочники, изменение
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");
	
	//++ Устарело_Переработка24
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПереработчику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость");
	//-- Устарело_Переработка24
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоПереработкеДавальческогоСырья(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	
	// Справочники, изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиКонтролераОТК(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаСписаниеПоНормативам");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиЭкономистПроизводства(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодразделенийОрганизации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтатногоРасписания");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОперацийСПрослеживаемымиТоварами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасходовПриУСН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИзделияИЗатратыНЗП");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыбытияРНПТМатериаловИзПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереносаРНПТМатериаловНаПродукцию");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийМатериаловПоНормативам");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаСписаниеПоНормативам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРНПТМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудниковРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");
	
	// Отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВедомостьПрослеживаемыхМатериаловВПроизводстве");
	
	//-- Локализация
	
КонецПроцедуры

//-- НЕ УТ

//++ НЕ УТКА
Процедура ДополнитьПрофильАналитикМеждународногоУчета(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовНМАМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовОСМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
	//-- Локализация
	
КонецПроцедуры

Процедура ДополнитьПрофильБухгалтерМеждународногоУчета(ОписаниеПрофиля) Экспорт
	
	//++ Локализация

	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовНМАМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовОСМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковНМАМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковОСМеждународныйУчет");
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДополнитьПрофильПользовательОтчетностиМеждународногоУчета(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовНМАМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовОСМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
	//-- Локализация
	
КонецПроцедуры

//-- НЕ УТКА

Процедура ДобавитьРолиТехнолог(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Облачные классификаторы 1С:Номенклатуры
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОблачныхКлассификаторов");
	//-- Локализация
	
КонецПроцедуры

//++ Локализация

//++ НЕ УТ

#Область РегламентированнаяОтчетность

Процедура ДополнитьПрофильОграничениямиРегламентированнойОтчетности(ОписаниеПрофиля)
	
	РаботаСОтчетностью = Ложь;
	
	ИндексРоли = ОписаниеПрофиля.Роли.Найти("ДобавлениеИзменениеРазделяемыхДанныхРегламентированнойОтчетности");
	Если ИндексРоли <> Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументаРегламентированныйОтчет");
		РаботаСОтчетностью = Истина;
	КонецЕсли;
	
	ИндексРоли = ОписаниеПрофиля.Роли.Найти("ЧтениеДанныхРегламентированнойОтчетности");
	Если ИндексРоли <> Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентированнойОтчетности");
		РаботаСОтчетностью = Истина;
	КонецЕсли;
	
	Если РаботаСОтчетностью Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("СведенияРегламентированныхОтчетов", "Предустановленный");
		Если ОписаниеПрофиля.Имя = "Бухгалтер" Тогда
			ОписаниеПрофиля.ЗначенияДоступа.Добавить("СведенияРегламентированныхОтчетов", "Перечисление.ТипыСведенийРегламентированныхОтчетов.ПустаяСсылка");
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляАудитор()
			ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляРасчетчик()
			ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровикРасчетчик()
			ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийРасчетчик()
			ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровикРасчетчик() Тогда
			ОписаниеПрофиля.ЗначенияДоступа.Добавить("СведенияРегламентированныхОтчетов", "Перечисление.ТипыСведенийРегламентированныхОтчетов.ОплатаТруда");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ

//-- Локализация
#КонецОбласти
