#Область ПрограммныйИнтерфейс

Процедура ОткрытьИнструмент(Инструмент, Параметр = Неопределено, Владелец = Неопределено) Экспорт
	
	// Обработка исключений
	Если Инструмент = ИТК_Перечисления.ИнструментОткрытьОбъект() Тогда
		
		ПоказатьЗначение( , Параметр);
		Возврат;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментКопироватьНавигационнуюСсылку() Тогда
		
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Параметр);
		ИТК_БуферОбменаКлиент.Копировать(НавигационнаяСсылка);
		Возврат;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментДобавитьВСравнениеОбъектов() Тогда
		
		СписокСсылок = СписокСсылокИнструмента(Параметр);
		ИТК_СравнениеОбъектовКлиент.ДобавитьВСравниваемыеОбъекты(СписокСсылок);
		Возврат;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментФормаСписка() Тогда
		
		ПолноеИмяФормы = ИТК_Форма.ПолноеИмяФормыСписка(Параметр);
		
		ПараметрыФормы = Новый Структура;
		
		Если ТипЗнч(Параметр) = Тип("Строка") Тогда
			Ключ = Неопределено;
		Иначе
			Ключ = Параметр;
		КонецЕсли;
		ПараметрыФормы.Вставить("Ключ", Ключ);
		
		ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.Независимый);
		Возврат;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментГрупповоеИзменениеРеквизитов() Тогда
		
		ИТК_БСПКлиент.ОткрытиеТиповойФормы("ГрупповоеИзменениеРеквизитов", Параметр);
		Возврат;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментПоискИУдалениеДублей() Тогда
		
		ИТК_БСПКлиент.ОткрытиеТиповойФормы("ПоискИУдалениеДублей");
		Возврат;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментУдалениеПомеченныхОбъектов() Тогда
		
		ИТК_БСПКлиент.ОткрытиеТиповойФормы("УдалениеПомеченныхОбъектов");
		Возврат;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментПользовательскийАлгоритм() Тогда
		
		ИТК_ПользовательскиеАлгоритмыКлиент.ВыполнитьПользовательскийАлгоритм(Параметр.Алгоритм, Параметр.Объект);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Если Инструмент = ИТК_Перечисления.ИнструментКонсольЗапросов() Тогда
		ПараметрыФормы.Вставить("Команда", "КонсольЗапросов");
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментКонсольСхемКомпоновкиДанных() Тогда
		ПараметрыФормы.Вставить("Команда", "КонсольСКД");
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментОтладкаДинамическогоСписка() Тогда
		ПараметрыФормы.Вставить("Команда", "КонсольСКД");
	КонецЕсли;
	
	ОписаниеИнструмента = ИТК_ТуллкитКлиентСервер.ОписаниеИнструмента(Инструмент);
	ПолноеИмяФормы = ОписаниеИнструмента["ПолноеИмяФормы"];
	Уникальность = Истина;
	
	ЗаполнитьПараметрыЗапускаИнструмента(Инструмент, ПолноеИмяФормы, ПараметрыФормы, Параметр, Уникальность);
	
	Если Владелец = Неопределено Тогда
		
		Если Инструмент = ИТК_Перечисления.ИнструментГлобальноеМеню()
				ИЛИ Инструмент = ИТК_Перечисления.ИнструментРедактированиеПользователяИБ()
				ИЛИ Инструмент = ИТК_Перечисления.ИнструментЗапуститьПодПользователем() Тогда
			РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментДобавитьПользовательскийАлгоритм() Тогда
			РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Иначе
			РежимОткрытия = РежимОткрытияОкнаФормы.Независимый;
		КонецЕсли;
		
	Иначе
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, Владелец, Уникальность, , , , РежимОткрытия);
	
КонецПроцедуры

Функция ИнформацияДляТехническойПоддержки() Экспорт
	
	Шаблон = "%1
	|
	|%2
	|
	|%3";
	
	ИнформацияДляТехническойПоддержкиКлиент = ИТК_ОбщийКлиент.ИнформацияДляТехническойПоддержки();
	ИнформацияДляТехническойПоддержкиСервер = ИТК_ОбщийВызовСервера.ИнформацияДляТехническойПоддержки();
	
	ИнформацияДляТехническойПоддержки = СтрШаблон(Шаблон, ИТК_ТуллкитКлиентСервер.ПолноеПредставление(),
		ИнформацияДляТехническойПоддержкиСервер, ИнформацияДляТехническойПоддержкиКлиент);
		
	Возврат ИнформацияДляТехническойПоддержки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПараметрыЗапускаИнструмента(Инструмент, ПолноеИмяФормы, ПараметрыФормы, Параметр, Уникальность)
	
	Если Параметр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Инструмент = ИТК_Перечисления.ИнструментПоискИЗаменаСсылок() Тогда
		
		ПараметрыФормы.Вставить("Ссылки", СписокСсылокИнструмента(Параметр));
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментЗафиксироватьИзмененияНаУзлах() Тогда
		
		ПараметрыФормы.Вставить("Ссылки", СписокСсылокИнструмента(Параметр));
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментВыгрузкаДанных() Тогда
		
		ПараметрыФормы.Вставить("Ссылки", СписокСсылокИнструмента(Параметр));
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментОбработкаВКонсолиКода() Тогда
		
		ПараметрыФормы.Вставить("ОбрабатываемыеОбъекты", СписокСсылокИнструмента(Параметр));
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментСравнениеОбъектов() Тогда
		
		СформироватьПриОткрытии = ПараметрСписокСсылокИнструмента(Параметр)
										И Параметр.Количество() > 1;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", СформироватьПриОткрытии);
		ПараметрыФормы.Вставить("Ссылки", СписокСсылокИнструмента(Параметр));
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментГлобальноеМеню() Тогда
		
		ПараметрыФормы.Вставить("НавигационнаяСсылка", ПолучитьНавигационнуюСсылку(Параметр));
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментФормаСпискаУниверсальная() Тогда
		
		ПараметрыФормы.Вставить("Объект", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментНастройкиПользователей() Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			
			Если Параметр.Свойство("Пользователи") Тогда
				ПараметрыФормы.Вставить("Пользователи", Параметр.Пользователи);
			КонецЕсли;
			
		Иначе
			ПараметрыФормы.Вставить("КлючОбъекта", Параметр);
		КонецЕсли;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментРедакторЗаписиНезависимогоРегистраСведений() Тогда
		
		ПараметрыФормы.Вставить("КлючЗаписи", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментРедакторКонстант() Тогда
		
		ПараметрыФормы.Вставить("Имя", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментРедакторПараметровСеанса() Тогда
		
		ПараметрыФормы.Вставить("Имя", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания() Тогда
		
		ПараметрыФормы.Вставить("Имя", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментПоискСсылокНаОбъект()
				ИЛИ Инструмент = ИТК_Перечисления.ИнструментРедакторОбъекта()Тогда
		
		ПараметрыФормы.Вставить("Объект", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментМетаданные()
				ИЛИ Инструмент = ИТК_Перечисления.ИнструментСтруктураХранения() Тогда
		
		ПолноеИмяФормы = "Обработка.ИТК_Метаданные.Форма.СвойстваОбьекта";
		
		Если ТипЗнч(Параметр) = Тип("Строка") Тогда
			Ключ = Параметр;
		Иначе
			Ключ = ИТК_Форма.ОтборПоТипамСсылок(Параметр);
		КонецЕсли;
		ПараметрыФормы.Вставить("Ключ", Ключ);
		
		Если Инструмент = ИТК_Перечисления.ИнструментСтруктураХранения() Тогда
			ПараметрыФормы.Вставить("Страница", "СтруктураХранения");
		КонецЕсли;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментРедактированиеПользователяИБ() Тогда
		
		ПолноеИмяФормы = "ОбщаяФорма.ИТК_РедактированиеПользователяИБ";
		ПараметрыФормы.Вставить("Пользователь", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментЗапуститьПодПользователем() Тогда
		
		ПолноеИмяФормы = "Обработка.ИТК_Пользователи.Форма.ЗапускПодПользователем";
		
		ПараметрыФормы.Вставить("ЗапуститьПриОткрытии", Истина);
		
		УникальныйИдентификаторПользователя = ИТК_БСП.ИдентификаторПользователяИБИзСсылкиСправочникаПользователи(Параметр);
		ПараметрыФормы.Вставить("УникальныйИдентификаторПользователя", УникальныйИдентификаторПользователя);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментЖурналРегистрации() Тогда
		
		ПараметрыФормы.Вставить("Данные", Параметр);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментАнализПравДоступа() Тогда
		
		СформироватьПриОткрытии = (Параметр <> Неопределено);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", СформироватьПриОткрытии);
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			ПараметрыФормы.Вставить("НачальныеНастройки", Параметр);
		Иначе	
			ОтборМетаданных = ИТК_Форма.ОтборПоТипамСсылок(Параметр);
			ПараметрыФормы.Вставить("ОтборМетаданных", ОтборМетаданных);
		КонецЕсли;
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментРазмерИКоличествоДанных() Тогда
		
		СформироватьПриОткрытии = (Параметр <> Неопределено);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", СформироватьПриОткрытии);
		
		ОтборМетаданных = ИТК_Форма.ОтборПоТипамСсылок(Параметр);
		ПараметрыФормы.Вставить("ОтборМетаданных", ОтборМетаданных);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментПодпискиНаСобытия() Тогда
		
		ОтборМетаданных = ИТК_Форма.ОтборПоТипамСсылок(Параметр);
		ПараметрыФормы.Вставить("ОтборМетаданных", ОтборМетаданных);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментМенеджерФормы() Тогда
		
		Если ТипЗнч(Параметр) = Тип("ФормаКлиентскогоПриложения") Тогда
			УникальныйИдентификаторФормы = Параметр.УникальныйИдентификатор;
		Иначе
			УникальныйИдентификаторФормы = Параметр.Значение;
		КонецЕсли;
		ПараметрыФормы.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментОтладкаДинамическогоСписка() Тогда
		
		ВходныеДанныеОтладки = Новый Структура;
		ВходныеДанныеОтладки.Вставить("Имя", Параметр.Имя);
		ВходныеДанныеОтладки.Вставить("СхемаКомпоновкиДанных", Параметр.СхемаКомпоновкиДанных);
		ВходныеДанныеОтладки.Вставить("НастройкиКомпоновкиДанных", Параметр.НастройкиКомпоновкиДанных);
		
		ПараметрыФормы.Вставить("ВходныеДанныеОтладки", ВходныеДанныеОтладки);
		
	ИначеЕсли Инструмент = ИТК_Перечисления.ИнструментДобавитьПользовательскийАлгоритм() Тогда
		
		ЭтоПараметрСписок = (ТипЗнч(Параметр) = Тип("СписокЗначений"));
		
		ПараметрыФормы.Вставить("ЭтоНовый", Истина);
		Если ТипЗнч(Параметр) = Тип("Строка") Тогда
			
			ТипОбъектов = ИТК_ПользовательскиеАлгоритмыКлиентСервер.ТипОбрабатываемыхОбъектовОбъектМетаданных();
			ТипЗначенияОбъектов = Параметр;
			
		Иначе
			
			ТипОбъектов = ИТК_ПользовательскиеАлгоритмыКлиентСервер.ТипОбрабатываемыхОбъектовСсылка();
			Если ЭтоПараметрСписок Тогда
				
				ТипЗначенияОбъектов = Новый ОписаниеТипов;
				Для Каждого ЭлементСписка Из Параметр Цикл
					
					ДобавляемоеОписание = ИТК_ТипыКлиентСервер.ОписаниеТиповПоТипу(ТипЗнч(ЭлементСписка.Значение));
					ТипЗначенияОбъектов = ИТК_ТипыКлиентСервер.СложитьОписания(ТипЗначенияОбъектов, ДобавляемоеОписание);
					
				КонецЦикла;
				
			Иначе
				ТипЗначенияОбъектов = ИТК_ТипыКлиентСервер.ОписаниеТиповПоТипу(ТипЗнч(Параметр));
			КонецЕсли;
			
		КонецЕсли;
		ПараметрыФормы.Вставить("ТипОбъектов", ТипОбъектов);
		ПараметрыФормы.Вставить("ТипЗначенияОбъектов", ТипЗначенияОбъектов);
		ПараметрыФормы.Вставить("ОбработкаСписка", ЭтоПараметрСписок);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СписокСсылокИнструмента(Параметр)
	
	Если ТипЗнч(Параметр) = Тип("СписокЗначений") Тогда
		Результат = Параметр.ВыгрузитьЗначения();
	ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") Тогда
		Результат = Параметр;
	Иначе
		
		Результат = Новый Массив;
		Результат.Добавить(Параметр);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрСписокСсылокИнструмента(Параметр)
	
	Результат = ТипЗнч(Параметр) = Тип("СписокЗначений")
					ИЛИ ТипЗнч(Параметр) = Тип("Массив");
					
	Возврат Результат;
	
КонецФункции

#КонецОбласти
