#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область СтандартныеПодсистемыКоманды

// Добавляет команду создания объекта на основании.
// 
// Параметры:
// 	КомандыСозданияНаОсновании - ТаблицаЗначений - перечень команд
// Возвращаемое значение:
// 	Неопределено, СтрокаТаблицыЗначений - Добавленная Команда.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	
	Если ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
		
		КомандаСоздатьНаОсновании						= КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер				= МетаданныеДокумента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление			= ОбщегоНазначения.ПредставлениеОбъекта(МетаданныеДокумента);
		КомандаСоздатьНаОсновании.РежимЗаписи			= "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд создания на основании.
// 
// Параметры:
// 	КомандыСозданияНаОсновании - ТаблицаЗначений - перечень команд
// 	Параметры - Структура - параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ПланируемыйДоход.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ОтражениеФактическихДанныхБюджетирования.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	ОперативноеПланированиеКонтроль.ДобавитьКоманду_НачисленияОперацийМСФО(КомандыСозданияНаОсновании);
	
КонецПроцедуры

#КонецОбласти

Функция ПроверитьВозможностьУстановкиСостояния(ОбъектСсылка, СостояниеОбъекта, ПротоколОшибок = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектСсылка) <> Тип("ДокументСсылка.ПланируемыйДоход") Тогда
		ТекстОшибки = СтрШаблон( 
			НСтр("ru = 'Объект %1 не является заявкой на операцию.'"),
			ОбъектСсылка);
		УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(
			ПротоколОшибок, ОбъектСсылка, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ПроверкаПройдена = Истина;
	
	Если СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена Тогда
		
		// Организация, контрагент, договор, счет контрагента, статьи ДДС, ЦФО, Период контроля
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаОперацию.Ссылка КАК Ссылка,
		|	ЗаявкаНаОперацию.Организация КАК Организация,
		|	ЗаявкаНаОперацию.Контрагент КАК Контрагент,
		|	ЗаявкаНаОперацию.ЦФО КАК ЦФО,
		|	ЗаявкаНаОперацию.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ЗаявкаНаОперацию.ДвиженияОперации.(
		|		НомерСтроки КАК НомерСтроки,
		|		СтатьяДоходовИРасходов КАК СтатьяДоходовИРасходов
		|	) КАК ДвиженияОперации,
		|	ЗаявкаНаОперацию.СуммаДокумента КАК СуммаДокумента,
		|	ЗаявкаНаОперацию.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ЗаявкаНаОперацию.ВидОперацииУХ КАК ВидОперацииУХ
		|ИЗ
		|	Документ.ПланируемыйДоход КАК ЗаявкаНаОперацию
		|ГДЕ
		|	ЗаявкаНаОперацию.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
		
		ДанныеДокумента = Запрос.Выполнить().Выгрузить()[0];
		
		РеквизитыПроверяемыеНаЗаполнение = Новый СписокЗначений;
		РеквизитыПроверяемыеНаЗаполнение.Добавить("СуммаДокумента", 		НСтр("ru = 'Сумма документа'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("ВалютаВзаиморасчетов", 	НСтр("ru = 'Валюта документа'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("ЦФО", 					НСтр("ru = 'ЦФО'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("Организация", 			НСтр("ru = 'Организация'"));
		
		ЭтоРасчетыСКонтрагентом = ВидыОперацийУХКлиентСерверПовтИсп.ЭтоРасчетыСКонтрагентом(ДанныеДокумента.ВидОперацииУХ);
		ЕстьРасчетыСФизическимЛицом	= ВидыОперацийУХКлиентСерверПовтИсп.ЭтоРасчетыСФизическимЛицом(ДанныеДокумента.ВидОперацииУХ);	
		Если ЭтоРасчетыСКонтрагентом Тогда
			РеквизитыПроверяемыеНаЗаполнение.Добавить("Контрагент", НСтр("ru = 'Контрагент'"));
		ИначеЕсли ЕстьРасчетыСФизическимЛицом Тогда
			РеквизитыПроверяемыеНаЗаполнение.Добавить("Контрагент", НСтр("ru = 'Сотрудник'"));
		КонецЕсли;	
		
		Если ЭтоРасчетыСКонтрагентом 
			И НЕ ВидыОперацийУХКлиентСерверПовтИсп.ЭтоРасчетыБезДоговора(ДанныеДокумента.ВидОперацииУХ) Тогда
			
			РеквизитыПроверяемыеНаЗаполнение.Добавить("ДоговорКонтрагента", НСтр("ru = 'Договор контрагента'"));
		КонецЕсли;
		
		Для Каждого ПроверяемыйРеквизит Из РеквизитыПроверяемыеНаЗаполнение Цикл
			Если Не ЗначениеЗаполнено(ДанныеДокумента[ПроверяемыйРеквизит.Значение]) Тогда
				
				ПроверкаПройдена = Ложь;
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле","Заполнение",ПроверяемыйРеквизит.Представление);
				УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект." + ПроверяемыйРеквизит.Значение);
				
			КонецЕсли;
		КонецЦикла;
		
		Если Не ДанныеДокумента.ДвиженияОперации.Количество() Тогда
			
			ПроверкаПройдена = Ложь;
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список","Заполнение", ,,НСтр("ru = 'Аналитики учета и планирования'"));
			УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект.ДвиженияОперации");
			
		КонецЕсли;
		
		ПараметрыБюджета = ДвиженияБюджетированиеКлиентСерверУХ.ПараметрыБюджета(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов);
		
		Для Каждого ТекСтрокаРасшифровки Из ДанныеДокумента.ДвиженияОперации Цикл
			Если Не ЗначениеЗаполнено(ТекСтрокаРасшифровки[ПараметрыБюджета.КолонкаСтатья]) Тогда
				
				ПроверкаПройдена = Ложь;
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Заполнение", 
					ПараметрыБюджета.ЗаголовокКолонкиСтатья, 
					ТекСтрокаРасшифровки.НомерСтроки,
					НСтр("ru = 'Аналитики учета и планирования'"));
				ИмяПоля = СтрШаблон("Объект.ДвиженияОперации[%1].%2", ТекСтрокаРасшифровки.НомерСтроки - 1, ПараметрыБюджета.КолонкаСтатья);
				
				УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, ИмяПоля);
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбъектСсылка.ПометкаУдаления И (СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена 
		ИЛИ СостояниеОбъекта = Перечисления.СостоянияСогласования.Отклонена 
		ИЛИ СостояниеОбъекта = Перечисления.СостоянияСогласования.НаУтверждении) Тогда
		
		ТекстОшибки = НСтр("ru = 'Установлена пометка удаления'");
		УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(
			ПротоколОшибок, ОбъектСсылка, ТекстОшибки);
		ПроверкаПройдена = Ложь;
	КонецЕсли;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры
#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура РеквизитыЗаявки(РеквизитыЗаявки) Экспорт
	
	ОМ = ЗаявкиНаОперации;
	
	РеквизитыЗаявки.ПриходРасход 										= ОМ.Новый_ЗначениеРеквизита("Перечисление.ВидыДвиженийПриходРасход.Приход");
	РеквизитыЗаявки.ПриходРасходСтатьяДвиженияДенежныхСредствЗачисление = ОМ.Новый_ЗначениеРеквизита("Перечисление.ВидыДвиженийПриходРасход.Приход");
	РеквизитыЗаявки.ПриходРасходСтатьяДвиженияДенежныхСредств 			= ОМ.Новый_ЗначениеРеквизита("Перечисление.ВидыДвиженийПриходРасход.Расход");
	РеквизитыЗаявки.ВидБюджетаПВХ 				= ОМ.Новый_ЗначениеРеквизита("ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов");
	РеквизитыЗаявки.ВидБюджета 					= ОМ.Новый_ЗначениеРеквизита("Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов");
	РеквизитыЗаявки.БанковскийСчетКонтрагента 	= ОМ.Новый_Реквизит(Неопределено);
	РеквизитыЗаявки.ФормаОплаты 				= ОМ.Новый_Реквизит(Неопределено);
	РеквизитыЗаявки.ПланируемаяДатаОперации 	= ОМ.Новый_Реквизит("ДатаДохода");
	РеквизитыЗаявки.ОбъектРасчетов 				= ОМ.Новый_Реквизит("ОбъектРасчетов");
	РеквизитыЗаявки.ВалютаДокумента 			= ОМ.Новый_Реквизит("ВалютаВзаиморасчетов");
	
	// Аналитики
	ОМ.Изменить_Реквизит(РеквизитыЗаявки.СтатьяБюджета, "СтатьяДоходовИРасходов", "ДвиженияОперации");
	Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
		ОМ.Изменить_Реквизит(РеквизитыЗаявки["Аналитика"+Сч], "Аналитика"+Сч, "ДвиженияОперации");
	КонецЦикла;

	// Регистрируем параметры размещения аналитик статей бюджетов
	ЗаявкиНаОперации.РазместитьВКолонкахТаблицы(
		РеквизитыЗаявки, "ТаблицаДвижений", 
		РеквизитыЗаявки.СтатьяБюджета, "ТаблицаДвиженийСтатьяДоходовИРасходов",
		"Аналитика%1", "Аналитика%1",
		ФормыУХ.РазместитьВГруппе("ГруппаАналитика")
	);
	
КонецПроцедуры

#Область ИсточникиДляКонтроляДокумента
	
Функция ИсточникиДокумента(Объект,  ДопПараметры = Неопределено) Экспорт
	
	Источники = Новый Соответствие;
	
	// 1. Источник для контроля бюджетных лимитов и резервов
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХБюджетныеЛимиты, 
		Источник_БюджетныеЛимитыРезервы(Объект));
	
	Возврат Источники;
	
КонецФункции
	
Функция Источник_БюджетныеЛимитыРезервы(Объект)
	
	// Доп.параметры
	ДопПараметрыИсточника = Новый Структура;
	ДопПараметрыИсточника.Вставить("Дата", 				Объект.Дата);
	ДопПараметрыИсточника.Вставить("Ссылка", 			Объект.Ссылка);
	ДопПараметрыИсточника.Вставить("ЭтоНовый", 			Не ЗначениеЗаполнено(Объект.Ссылка));
	ДопПараметрыИсточника.Вставить("ДатаКонтроляЛимита", Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПланыДокумента(Объект);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ПланыДокумента.ВидБюджета КАК ВидБюджета,
	|	ВТ_ПланыДокумента.Организация КАК Организация,
	|	ВТ_ПланыДокумента.Валюта КАК Валюта,
	|	ВТ_ПланыДокумента.ДокументПланирования КАК ДокументПланирования,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРезервирования,
	|	ВТ_ПланыДокумента.Период КАК ДатаОперации,
	|	ВТ_ПланыДокумента.ЦФО КАК ЦФО,
	|	ВТ_ПланыДокумента.Проект КАК Проект,
	|	ВТ_ПланыДокумента.ПриходРасход КАК ПриходРасход,
	|	ВТ_ПланыДокумента.СтатьяБюджета КАК СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика1 КАК Аналитика1,
	|	ВТ_ПланыДокумента.Аналитика2 КАК Аналитика2,
	|	ВТ_ПланыДокумента.Аналитика3 КАК Аналитика3,
	|	ВТ_ПланыДокумента.Аналитика4 КАК Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика5 КАК Аналитика5,
	|	ВТ_ПланыДокумента.Аналитика6 КАК Аналитика6,
	|	0 КАК Лимит,
	|	0 КАК Зарезервировано,
	|	СУММА(ВТ_ПланыДокумента.Сумма) КАК Заявлено,
	|	0 КАК Исполнено
	|ПОМЕСТИТЬ ВТ_ТаблицаПлановССуммамиЛимитирования
	|ИЗ
	|	ВТ_ПланыДокумента КАК ВТ_ПланыДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПланыДокумента.Аналитика6,
	|	ВТ_ПланыДокумента.ДокументПланирования,
	|	ВТ_ПланыДокумента.Аналитика1,
	|	ВТ_ПланыДокумента.ВидБюджета,
	|	ВТ_ПланыДокумента.ЦФО,
	|	ВТ_ПланыДокумента.СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика3,
	|	ВТ_ПланыДокумента.Проект,
	|	ВТ_ПланыДокумента.Аналитика5,
	|	ВТ_ПланыДокумента.Организация,
	|	ВТ_ПланыДокумента.Период,
	|	ВТ_ПланыДокумента.Валюта,
	|	ВТ_ПланыДокумента.ПриходРасход,
	|	ВТ_ПланыДокумента.Аналитика2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПланыДокумента";
	
	Запрос.Выполнить();
	
	Источник = Новый Структура;
	Источник.Вставить("Параметры", 		ДопПараметрыИсточника);
	Источник.Вставить("ПланыДокумента", Запрос.МенеджерВременныхТаблиц);
	
	Возврат Источник;  
	
КонецФункции

#КонецОбласти 

#Область ПланыДокумента

// Процедура возвращает таблицу планов документа
//
// Параметры:
//  Источник  - ДокументСсылка, ДокументОбъект, Форма.Объект - Документ планирования
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица планов документа
//
Функция ПланыДокумента(Источник, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК ДатаРегистрации,
	|	&Организация КАК Организация,
	|	ВЫБОР КОГДА &ЭтоРасчетыСКонтрагентом ТОГДА &Контрагент ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КОНЕЦ КАК Контрагент,
	|	ВЫБОР КОГДА &ЭтоРасчетыПоДоговору ТОГДА &ДоговорКонтрагента ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР 
	|		КОГДА &ЭтоРасчетыПоДоговору = ЛОЖЬ ИЛИ &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПустаяСсылка) ТОГДА неопределено
	|		КОГДА &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ДвиженияОперации.ОбъектРасчетов
	|	КОНЕЦ КАК ОбъектРасчетов,
	|	&ВалютаВзаиморасчетов КАК Валюта,
	|	&Ссылка КАК ДокументПланирования,
	|	&ДатаДохода КАК Период,
	|	&ЦФО КАК ЦФО,
	|	&Проект КАК Проект,
	|	ДвиженияОперации.СтатьяДоходовИРасходов КАК СтатьяБюджета,
	|	ДвиженияОперации.Аналитика1 КАК Аналитика1,
	|	ДвиженияОперации.Аналитика2 КАК Аналитика2,
	|	ДвиженияОперации.Аналитика3 КАК Аналитика3,
	|	ДвиженияОперации.Аналитика4 КАК Аналитика4,
	|	ДвиженияОперации.Аналитика5 КАК Аналитика5,
	|	ДвиженияОперации.Аналитика6 КАК Аналитика6,
	|	ДвиженияОперации.Сумма КАК Сумма,
	|	&НаправлениеДвижения КАК ПриходРасход,
	|	&ВидБюджета КАК ВидБюджета
	|ПОМЕСТИТЬ ВТ_ПланыДокумента
	|ИЗ
	|	Документ.ПланируемыйДоход.ДвиженияОперации КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка";  
		
	Запрос.УстановитьПараметр("ВидБюджета",			ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов);
	Запрос.УстановитьПараметр("НаправлениеДвижения",Перечисления.ВидыДвиженийПриходРасход.Приход);
	
	ИменаРеквизитов = "ВидОперацииУХ, ЦФО, Проект, Дата, ДатаДохода, ВалютаВзаиморасчетов, Организация, Контрагент, ДоговорКонтрагента, Ссылка";
	
	Если ТипЗнч(Источник) = ТипЗнч(ПустаяСсылка()) Тогда
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, ИменаРеквизитов);
	Иначе
		РеквизитыДокумента = Источник;

		ОписаниеТипаСсылки = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ПустаяСсылка())));
		Реквизиты = "Сумма,  ОбъектРасчетов, СтатьяДоходовИРасходов," 
						+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("Аналитика%1");
		
		ДвиженияОперации = Источник.ДвиженияОперации.Выгрузить(,Реквизиты);
		ДвиженияОперации.Колонки.Добавить("Ссылка", ОписаниеТипаСсылки);
		ДвиженияОперации.ЗаполнитьЗначения(Источник.Ссылка, "Ссылка");
		
		Запрос.УстановитьПараметр("ДвиженияОперации", ДвиженияОперации);
		Запрос.Текст =
		"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ДвиженияОперации ИЗ &ДвиженияОперации КАК Коллекция ";
		Запрос.Выполнить();
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ПланируемыйДоход.", "ВТ_");
		
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Новый Структура(ИменаРеквизитов) Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, РеквизитыДокумента[КлючЗначение.Ключ]);
	КонецЦикла;

	// параметры из ВидОперацииУХ
	ЭтоРасчетыСКонтрагентом = ВидыОперацийУХВызовСервераПовтИсп.ЭтоРасчетыСКонтрагентом(РеквизитыДокумента.ВидОперацииУХ);
	ЭтоРасчетыПоДоговору = ЭтоРасчетыСКонтрагентом И НЕ ВидыОперацийУХВызовСервераПовтИсп.ЭтоРасчетыБезДоговора(РеквизитыДокумента.ВидОперацииУХ);
	
	Запрос.УстановитьПараметр("ЭтоРасчетыСКонтрагентом",	ЭтоРасчетыСКонтрагентом);
	Запрос.УстановитьПараметр("ЭтоРасчетыПоДоговору", 		ЭтоРасчетыПоДоговору);

	// Реквизиты договора
	ИменаРеквизитовДоговора = "ПорядокРасчетов, ГрафикДоговора";
	РеквизитыДоговора = Новый Структура(ИменаРеквизитовДоговора);
	РеквизитыДоговора.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПустаяСсылка();
	РеквизитыДоговора.ГрафикДоговора = Перечисления.ГрафикиДоговора.ПустаяСсылка();
	
	Если ЭтоРасчетыПоДоговору И РеквизитыДокумента.ДоговорКонтрагента <> неопределено Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ДоговорКонтрагента, ИменаРеквизитовДоговора);
	КонецЕсли;
	
	Для Каждого КлючЗначение Из РеквизитыДоговора Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

#КонецОбласти 

Процедура ПоляДанныхПредставления(СтруктураПолей) Экспорт
	
	//СтруктураПолей.Номер = "";
	//СтруктураПолей.Дата = "";
	СтруктураПолей.Сумма 			= "СуммаДокумента";
	СтруктураПолей.Валюта 			= "ВалютаВзаиморасчетов";
	СтруктураПолей.ДатаПланируемая 	= "ДатаДохода";
	СтруктураПолей.ДатаНеПозднее 	= "КрайняяДата";
	//Источник.Контрагент = "";
	//Источник.ВидОперацииУХ = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьИсходнымиДанными(ИсходныеДанныеЗаполнения, ИсточникДанных, РеквизитыОбъекта, ИмяИсходного, ИмяРеквизита = "", ИмяИсточника = "", ИсходныеДанныеПереданы)
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ИмяРеквизита = ИмяИсходного;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяИсточника) Тогда
		ИмяИсточника = ИмяРеквизита;
	КонецЕсли;
	
	РеквизитОбъектЗаполненИсходнымиДанными = Ложь;
	Если ИсходныеДанныеЗаполнения.Свойство(ИмяИсходного) И ЗначениеЗаполнено(ИсходныеДанныеЗаполнения[ИмяИсходного]) Тогда
		Если ИсходныеДанныеПереданы
			ИЛИ (НЕ РеквизитыОбъекта.Свойство(ИмяРеквизита) ИЛИ НЕ ЗначениеЗаполнено(РеквизитыОбъекта[ИмяРеквизита]))
			И (НЕ ИсточникДанных.Свойство(ИмяИсточника) ИЛИ НЕ ЗначениеЗаполнено(ИсточникДанных[ИмяИсточника])) Тогда
			РеквизитыОбъекта.Вставить(ИмяРеквизита, ИсходныеДанныеЗаполнения[ИмяИсходного]);
			РеквизитОбъектЗаполненИсходнымиДанными = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеквизитОбъектЗаполненИсходнымиДанными;
	
КонецФункции

#КонецОбласти

#КонецЕсли

