#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИнформацияОКлюче() Экспорт
	
	//
	Результат = Новый Структура;
	Результат.Вставить("СправочникИмя", 			"КлючиКонтроляОбъемаЗакупок");
	Результат.Вставить("СправочникМенеджер", 		Справочники.КлючиКонтроляОбъемаЗакупок);
	Результат.Вставить("СправочникМетаданные", 		Метаданные.Справочники.КлючиКонтроляОбъемаЗакупок);
	Результат.Вставить("РегистрИмя", 				"АналитикаКонтроляОбъемаЗакупок");
	Результат.Вставить("РегистрМенеджер", 			РегистрыСведений.АналитикаКонтроляОбъемаЗакупок);
	Результат.Вставить("РегистрМетаданные", 		Метаданные.РегистрыСведений.АналитикаКонтроляОбъемаЗакупок);
	
	Результат.Вставить("ИмяПоляАналитика", 			"АналитикаКонтроляОбъемаЗакупок");
	
	КонтрольУХКлючи.ДобавитьИзмеренияКлюча(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПолноеНаименованиеКлючаАналитики(МенеджерЗаписи) Экспорт

	Поля = Новый Массив;
	Поля.Добавить(СокрЛП(МенеджерЗаписи.ЦФО));
	Поля.Добавить(СокрЛП(МенеджерЗаписи.Номенклатура));   
	Поля.Добавить(СокрЛП(МенеджерЗаписи.ПериодПодтверждения));

	Возврат СтрСоединить(Поля, "; ");
	
КонецФункции


// Заполняет поле АналитикаКонтроляЗадолженностиПоКонтрагенту в коллекции, содержащей колонки ЦФО и Номенклатура.
//
// Параметры:
//
//	Коллекция - ТабличнаяЧасть - Коллекция, в которой производится заполнение аналитики контроля задолженности контрагентов.
//
//	ИменаПолей - Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля берется из имени ключа.
//		секция идентификации {ЦФО, Номенклатура, АналитикаКонтроляЗадолженностиПоКонтрагенту},
//	
//	ПараметрыЗаполнения - Структура - см. метод ПараметрыЗаполненияКлючейАналитики()
//
// Пример 1:
//	ИменаПолей = РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту.ИменаПолейКоллекцииПоУмолчанию();
//	РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту.ЗаполнитьВКоллекции(ДвиженияОперации, ИменаПолей);
//
// Пример 2:
//	РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту.ЗаполнитьВКоллекции(ДвиженияОперации);
//
Процедура ЗаполнитьВКоллекции(Коллекция, 
								ИменаПолей = Неопределено, ДополнитьКлюч = Ложь, ПараметрыЗаполнения = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = ПараметрыЗаполненияКлючейАналитики();
	КонецЕсли;
	
	Если ДополнитьКлюч Тогда
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
	Иначе
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
		
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.АналитикаКонтроляОбъемаЗакупок) Тогда
			Если ПараметрыЗаполнения.СоздаватьВКлючи Тогда
				КлючАналитики = ЗначениеКлючаАналитики(Выборка);
			Иначе
				ТекстИсключения = НСтр("ru = 'Ошибка при заполнении ключей в коллекции: есть аналитики, по которым ключи еще не созданы.'");
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.КлючиКонтроляЗадолженностиПоКонтрагенту,
					,
					ТекстИсключения);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		Иначе
			КлючАналитики = Выборка.АналитикаКонтроляОбъемаЗакупок;
		КонецЕсли;
		Если ДополнитьКлюч Тогда
			Коллекция[Выборка.Индекс][ИменаПолей.ЗаполняемаяАналитикаКонтроляОбъемаЗакупок] = КлючАналитики;
		Иначе
			Коллекция[Выборка.Индекс][ИменаПолей.АналитикаКонтроляОбъемаЗакупок] = КлючАналитики;
		КонецЕсли;
		ПараметрыЗаполнения.ИзмененаАналитика = Истина;
	КонецЦикла;
КонецПроцедуры

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики контроля объема закупок.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля должно браться из имени ключа.
//		секция идентификации {ЦФО, Номенклатура},
//			все ключи заданы.
//
Функция ИменаПолейКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("ЦФО", 					"ЦФО");
	ИменаПолей.Вставить("Номенклатура", 		"Номенклатура");
	ИменаПолей.Вставить("ПериодПодтверждения", 	"ПериодПодтверждения");    
	ИменаПолей.Вставить("Периодичность", 		"Периодичность");  
	ИменаПолей.Вставить("АналитикаКонтроляОбъемаЗакупок", "АналитикаКонтроляОбъемаЗакупок");
	
	Возврат ИменаПолей;
КонецФункции 

Функция ПараметрыЗаполненияКлючейАналитики() Экспорт
	Возврат Новый Структура("ИзмененаАналитика,СоздаватьВКлючи", Ложь, Истина);
КонецФункции



// Функция получает элемент справочника - ключ аналитики 
//
// Параметры:
//	ПараметрыАналитики - Выборка, Структура - Содержит полями "ЦФО, Номенклатура":
//		* ЦФО - СправочникСсылка.Организации.
//		* Номенклатура - СправочникСсылка.Номенклатура.
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиКонтроляЗадолженностиПоКонтрагенту - Созданный элемент справочника.
//
Функция ЗначениеКлючаАналитики(ПараметрыАналитики) Экспорт

	НаборЗаписей = ПолучитьНаборЗаписей(ПараметрыАналитики);
	
	Если НаборЗаписей <> Неопределено Тогда
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0
			И Не ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;

		Если НаборЗаписей.Количество() > 0
			И ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			Результат = НаборЗаписей[0].КлючАналитики;
		Иначе
			Результат = СоздатьКлючАналитики(ПараметрыАналитики);
		КонецЕсли;

		Возврат Результат;
	КонецЕсли;

КонецФункции    

// Функция получает элемент справочника - ключ аналитики контроля  .
//
// Параметры:
//	ПараметрыАналитики - Выборка или Структура  с полями "ЦФО, Номенклатура".
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиКонтроляОбъемаЗакупок - Созданный элемент справочника.
//
Функция СоздатьКлючАналитики(ПараметрыАналитики, ЗаписьПриОбновленииИБ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ПараметрыАналитики.ЦФО) 
			ИЛИ ЗначениеЗаполнено(ПараметрыАналитики.Номенклатура) Тогда
			
		НаборЗаписей = ПолучитьНаборЗаписей(ПараметрыАналитики);
		
		Если НаборЗаписей <> Неопределено Тогда
			
			НачатьТранзакцию(); // Создание нового ключа аналитики.
			Попытка
				СтрокаНабора = НаборЗаписей[0];
				
				СправочникОбъект = Справочники.КлючиКонтроляОбъемаЗакупок.СоздатьЭлемент();
				СправочникОбъект.Наименование = ПолучитьПолноеНаименованиеКлючаАналитики(СтрокаНабора);
				ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаНабора, "ЦФО, Номенклатура,ПериодПодтверждения,Периодичность");
				Если ЗаписьПриОбновленииИБ Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
				Иначе
					СправочникОбъект.Записать();
				КонецЕсли;

				Результат = СправочникОбъект.Ссылка;

				СтрокаНабора.КлючАналитики = Результат;
				
				Если ЗаписьПриОбновленииИБ Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Ложь, Истина);
				Иначе
					НаборЗаписей.Записать(Ложь);
				КонецЕсли;
				ЗафиксироватьТранзакцию();
			Исключение
				// во время инициализации ключа, данный ключ уже был создан в ИБ другим сеансом.
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда // запись не создана из-за ошибки заполнения полей.
					ОтменитьТранзакцию();
					ВызватьИсключение;
				Иначе
					ОтменитьТранзакцию();
					Результат = НаборЗаписей[0].КлючАналитики;
				КонецЕсли;
			КонецПопытки;

			Возврат Результат;
			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ПолучитьНаборЗаписей(ПараметрыАналитики)
	
	// В параметрах аналитики могут быть не все свойства
	СтруктураАналитики = Новый Структура("ЦФО, Номенклатура,ПериодПодтверждения,Периодичность");
	ЗаполнитьЗначенияСвойств(СтруктураАналитики, ПараметрыАналитики);
	Если НЕ ЗначениеЗаполнено(СтруктураАналитики.ЦФО)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Номенклатура) Тогда
		Возврат Неопределено
	Иначе
		НаборЗаписей = РегистрыСведений.АналитикаКонтроляОбъемаЗакупок.СоздатьНаборЗаписей();
		
		Для Каждого КлючЗначение Из СтруктураАналитики Цикл
			НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		КонецЦикла;
		
		НоваяСтрока = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитики, "ЦФО, Номенклатура,ПериодПодтверждения,Периодичность");
		ПроверитьЗаполнениеПоляСтруктуры(НоваяСтрока);
		Возврат НаборЗаписей;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьЗаполнениеПоляСтруктуры(МенеджерЗаписиАналитикаКонтроляЗадолженностиПоКонтрагенту)

	Если НЕ ЗначениеЗаполнено(МенеджерЗаписиАналитикаКонтроляЗадолженностиПоКонтрагенту.ЦФО) Тогда
		ВызватьИсключение НСтр("ru = 'Должно быть заполнено значение параметра ""ЦФО""'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МенеджерЗаписиАналитикаКонтроляЗадолженностиПоКонтрагенту.Номенклатура) Тогда
		ВызватьИсключение НСтр("ru = 'Должно быть заполнено значение параметра ""Номенклатура""'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКлючейАналитикиВКоллекции

Функция ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК Индекс,
	|	&ПолеАналитикаПланирования КАК АналитикаКонтроляОбъемаЗакупок,
	|	&ПолеЦФО КАК ЦФО,
	|	Коллекция.ПериодПодтверждения КАК ПериодПодтверждения,
	|	Коллекция.Периодичность КАК Периодичность,
	|	&ПолеНоменклатура КАК Номенклатура
	|ПОМЕСТИТЬ Коллекция
	|ИЗ
	|	&Коллекция КАК Коллекция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Коллекция.Индекс - 1 КАК Индекс,
	|	Аналитика.КлючАналитики КАК АналитикаКонтроляОбъемаЗакупок,
	|	Коллекция.ЦФО КАК ЦФО,
	|	Коллекция.ПериодПодтверждения КАК ПериодПодтверждения,
	|	Коллекция.Периодичность КАК Периодичность,
	|	Коллекция.Номенклатура КАК Номенклатура
	|ИЗ
	|	Коллекция КАК Коллекция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляОбъемаЗакупок КАК Аналитика
	|		ПО (Аналитика.ЦФО = Коллекция.ЦФО)
	|			И (Аналитика.Номенклатура = Коллекция.Номенклатура)
	|			И (Аналитика.Периодичность = Коллекция.Периодичность)
	|			И (Аналитика.ПериодПодтверждения = Коллекция.ПериодПодтверждения)
	|ГДЕ
	|	(Аналитика.КлючАналитики ЕСТЬ NULL
	|			ИЛИ Аналитика.КлючАналитики <> Коллекция.АналитикаКонтроляОбъемаЗакупок
	|			ИЛИ Аналитика.КлючАналитики = ЗНАЧЕНИЕ(Справочник.КлючиКонтроляОбъемаЗакупок.ПустаяСсылка))";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитикаПланирования", "Коллекция." + ИменаПолей.АналитикаКонтроляОбъемаЗакупок);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеЦФО", "Коллекция." + ИменаПолей.ЦФО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНоменклатура", "Коллекция." + ИменаПолей.Номенклатура);
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Коллекция.НомерСтроки - 1 КАК Индекс,
	               |	&ПолеАналитика КАК АналитикаКонтроляОбъемаЗакупок,
	               |	&ПолеПриемник КАК АналитикаКонтроляОбъемаЗакупокПриемник,
	               |	&ПолеЦФО КАК ЦФО,
	               |	Коллекция.ПериодПодтверждения КАК ПериодПодтверждения,
	               |	Коллекция.Периодичность КАК Периодичность,
	               |	&ПолеНоменклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВтКоллекция
	               |ИЗ
	               |	&Коллекция КАК Коллекция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Коллекция.Индекс КАК Индекс,
	               |	Коллекция.АналитикаКонтроляОбъемаЗакупок КАК АналитикаКонтроляЗадолженностиПоКонтрагенту,
	               |	Коллекция.АналитикаКонтроляОбъемаЗакупокПриемник КАК АналитикаКонтроляЗадолженностиПоКонтрагентуПриемник,
	               |	ВЫБОР
	               |		КОГДА Коллекция.ЦФО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(Аналитика.ЦФО, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |		ИНАЧЕ Коллекция.ЦФО
	               |	КОНЕЦ КАК ЦФО,
	               |	ВЫБОР
	               |		КОГДА Коллекция.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(Аналитика.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	               |		ИНАЧЕ Коллекция.Номенклатура
	               |	КОНЕЦ КАК Номенклатура,
	               |	Коллекция.ПериодПодтверждения КАК ПериодПодтверждения,
	               |	Коллекция.Периодичность КАК Периодичность
	               |ПОМЕСТИТЬ Коллекция
	               |ИЗ
	               |	ВтКоллекция КАК Коллекция
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляОбъемаЗакупок КАК Аналитика
	               |		ПО Коллекция.АналитикаКонтроляОбъемаЗакупок = Аналитика.КлючАналитики
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Коллекция.Индекс КАК Индекс,
	               |	Ключи.КлючАналитики КАК АналитикаКонтроляЗадолженностиПоКонтрагенту,
	               |	Коллекция.ЦФО КАК ЦФО,
	               |	Коллекция.Номенклатура КАК Номенклатура,
	               |	Коллекция.ПериодПодтверждения КАК ПериодПодтверждения,
	               |	Коллекция.Периодичность КАК Периодичность
	               |ИЗ
	               |	Коллекция КАК Коллекция
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляОбъемаЗакупок КАК Ключи
	               |		ПО (Ключи.Номенклатура = Коллекция.Номенклатура)
	               |			И (Ключи.ЦФО = Коллекция.ЦФО)
	               |			И (Ключи.ПериодПодтверждения = Коллекция.ПериодПодтверждения)
	               |			И (Ключи.Периодичность = Коллекция.Периодичность)
	               |ГДЕ
	               |	(Ключи.КлючАналитики ЕСТЬ NULL
	               |			ИЛИ Ключи.КлючАналитики <> Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагенту
	               |			ИЛИ Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагентуПриемник = ЗНАЧЕНИЕ(Справочник.КлючиКонтроляОбъемаЗакупок.ПустаяСсылка))";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика", "Коллекция." + ИменаПолей.АналитикаКонтроляОбъемаЗакупок);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриемник", "Коллекция." + ИменаПолей.АналитикаКонтроляОбъемаЗакупок);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеЦФО", "Коллекция." + ИменаПолей.ЦФО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНоменклатура", "Коллекция." + ИменаПолей.Номенклатура);

	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
