#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИТК_Перечисления.ЗаполнитьСписок(Элементы.Вид, ИТК_Перечисления.ВидыГраницы());
	
	ОписаниеЗначенияГраница = Параметры.Значение;
	
	Вид = ОписаниеЗначенияГраница.Вид;
	Значение = ОписаниеЗначенияГраница.Значение;
	Элементы.Значение.ВыбиратьТип = (Значение = Неопределено ИЛИ ИТК_ОбщийКлиентСервер.ЭтоПустаяДата(Значение));
	
	ИТК_ФормаКлиентСервер.Заголовок(ЭтотОбъект, СтрШаблон(НСтр("ru = 'Редактирование границы %1';
																|en = 'Editing the border %1'"), Параметры.Заголовок));
	
	ИТК_Форма.УстановитьНазначениеДействияКоманды(Команды.СохранитьИЗакрыть, "Завершение");
	ИТК_Форма.ОбработчикПриСозданииНаСервереПосле(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Закрыть(ИТК_ЗапросКлиентСервер.ОписаниеГраницы(Значение, Вид));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборТипаЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Модифицированность = Истина;
	
	ТекущийЭлемент.ОграничениеТипа = Результат;
	ТекущийЭлемент.ВыбиратьТип = Ложь;
	
	Значение = Результат.ПривестиЗначение(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.ВыбиратьТип Тогда
		
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВыборТипаЗавершен", ЭтотОбъект, Новый Структура);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Исключаемые", "Граница");
		ДополнительныеПараметры.Вставить("ДополнятьДату", Истина);
		
		ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(Элемент, НСтр("ru = 'Значение';
																		|en = 'Value'"),
							ИТК_Перечисления.РежимРедактированияТипаЗначенияВыборТипа(), Новый ОписаниеТипов("Дата"),
							ОписаниеОповещенияЗавершение, СтандартнаяОбработка, ДополнительныеПараметры);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеЗначенияЗавершено", ЭтотОбъект);
		
		ИТК_ФормаКлиент.ОткрытьРедактированиеМоментаВремени(
			ЭтотОбъект, Значение, СтандартнаяОбработка, ОписаниеОповещенияЗавершение, НСтр("ru = 'Значение';en = 'Value'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	ТекущийЭлемент.ОграничениеТипа = ОписаниеТипов;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеЗначенияЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Модифицированность = Истина;
	Значение = Результат;
	
КонецПроцедуры

#КонецОбласти