#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
//
// Параметры:
//  КомандыОтчетов - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.Команды
//
// Возвращаемое значение:
//  Неопределено, СтрокаТаблицыЗначений - описание добавленной команды.
//
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.КонтрольПоставкиСырьяИМатериаловДавальцем2_5) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КомандаОтчет = КомандыОтчетов.Добавить();
	КомандаОтчет.Менеджер           = Метаданные.Отчеты.КонтрольПоставкиСырьяИМатериаловДавальцем2_5.ПолноеИмя();
	КомандаОтчет.Представление      = НСтр("ru = 'Контроль поставки сырья и материалов давальцем';
											|en = 'Control of raw and consumable materials delivery from material provider'");
	КомандаОтчет.МножественныйВыбор = Ложь;
	КомандаОтчет.Важность           = "Обычное";
	КомандаОтчет.КлючВарианта       = "КонтрольПоставкиСырьяИМатериаловДавальцем2_5Контекст";
	
	Возврат КомандаОтчет;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПоставкиСырьяИМатериаловДавальцем2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько должно поступить и поступило материалов от давальцев?';
									|en = 'Check how many materials are expected and received from providers.'");
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПоставкиСырьяИМатериаловДавальцем2_5");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько должно поступить и поступило материалов от давальцев?';
									|en = 'Check how many materials are expected and received from providers.'");
		
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПоставкиСырьяИМатериаловДавальцем2_5Контекст");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли