#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - Форма отчета.
//  КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//  Настройки    - см. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - Форма отчета.
//  Отказ                - Булево -
//  СтандартнаяОбработка - Булево -
//
// См. также:
//  "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = Форма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		ФормаПараметры = Форма.ФормаПараметры;
		
		ФормаПараметры.КлючНазначенияИспользования = Параметры.ПараметрКоманды;
		ФормаПараметры.Отбор.Вставить("ЗаказПоставщику", Параметры.ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли