//////////////////////////////////////////////////////////////////
// Copyright (c) 21.11.2021 Варгасов Д.О. dovargasov@gmail.com  //
////////////////////////////////////////////////////////////////// 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СтруктураКартинокВФорматеHTML = ТекущийОбъект.КартинкиУведомления.Получить();
	
	Если СтруктураКартинокВФорматеHTML = Неопределено Тогда
		СтруктураКартинокВФорматеHTML = Новый Структура;
	КонецЕсли;
	
	СодержаниеФорматированныйДокумент.УстановитьHTML(ТекущийОбъект.Содержание, СтруктураКартинокВФорматеHTML);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.КартинкиУведомления = Неопределено;
	
	СодержаниеФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.Содержание, СтруктураКартинокВФорматеHTML);
	
	Если ТипЗнч(СтруктураКартинокВФорматеHTML) = Тип("Структура")
		И СтруктураКартинокВФорматеHTML.Количество() > 0 Тогда
		ТекущийОбъект.КартинкиУведомления = Новый ХранилищеЗначения(СтруктураКартинокВФорматеHTML, Новый СжатиеДанных(9));
	КонецЕсли;
	
	ТекущийОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	ТекущийОбъект.Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ДатаСоздания.Видимость = Не Объект.Ссылка.Пустая();
	Элементы.Автор.Видимость = Не Объект.Ссылка.Пустая();
	
КонецПроцедуры  

#КонецОбласти

