
#Область ПрограммныйИнтерфейс
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СобытияМодуляФормы

#Область ФормаДокумента

#Область СтандартныеОбработчики

Процедура ФормаДокумента_ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	АналитикиПланированияДокументов.ПриЧтенииНаСервере(Форма);  
	
КонецПроцедуры

Процедура ФормаДокумента_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	АналитикиПланированияДокументов.ПриСозданииНаСервере(Форма, Элементы.Комментарий.Родитель, Элементы.Комментарий);
	
КонецПроцедуры

Процедура ФормаДокумента_ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
#КонецОбласти
 
