#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ МожноСоздаватьДокументыРегУчета() Тогда
		Возврат;		
	КонецЕсли;   

	Если НЕ ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.Объект.ВидОбязательства) Тогда
		ТекстСообщения = НСтр("ru = 'Для продолжения необходимо заполнить вид обязательства'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 

	ПараметрыФормы = Новый Структура("Источник, ВидОбязательства", ПараметрыВыполненияКоманды.Источник.Объект.Ссылка,
													ПараметрыВыполненияКоманды.Источник.Объект.ВидОбязательства);

	ОткрытьФорму("Обработка.ОтражениеЦессийВУчете.Форма.Форма", 
						ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
						ПараметрыВыполненияКоманды.Уникальность, 
						ПараметрыВыполненияКоманды.Окно, 
						ПараметрыВыполненияКоманды.НавигационнаяСсылка,
						,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МожноСоздаватьДокументыРегУчета()

	Возврат ЦессииУХ.МожноСоздаватьДокументыРегУчета();

КонецФункции // ()

#КонецОбласти

