#Область ПрограммныйИнтерфейс

Процедура ФормаЭлементаРеквизитыКонтрагента_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Объект = Форма.Объект;
	// создать реквизиты формы 
    Реквизиты = РеквизитыФормы();
	Если Реквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(Реквизиты);
	КонецЕсли;
		
	СтруктураРеквизитов = РеквизитаКонтрагента();
	
	РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Форма.КонтрагентПартнера, СтруктураРеквизитов);
	ЗаполнитьЗначенияСвойств(Форма, РеквизитыКонтрагента); 
	
	Элементы = Форма.Элементы;
	
	// ПараметрыСтраницы
	ПараметрыСтраницы = Новый Структура;
	ПараметрыСтраницы.Вставить("Группировка", Элементы.ГруппаОбщаяИнформация.Группировка);
	
	// Параметры групп 
	ПараметрыГруппы = Новый Структура;
	ПараметрыГруппы.Вставить("ШрифтЗаголовка", Элементы.ГруппаНаименования.ШрифтЗаголовка);
	ПараметрыГруппы.Вставить("Отображение", Элементы.ГруппаНаименования.Отображение);
	ПараметрыГруппы.Вставить("Группировка", Элементы.ГруппаОбщаяИнформация.Группировка);
	ПараметрыГруппы.Вставить("Объединенная", Истина);
	
	//
	ПараметрыПоляВвода = Новый Структура;
	
	//
	ПараметрыФлажка = Новый Структура;
	ПараметрыФлажка.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	
	// Страница
	Страница = ФормыУХ.СоздатьГруппуФормы(Элементы, "СтраницаХолдинг", "Холдинг", ВидГруппыФормы.Страница, Элементы.ГруппаСтраницы, Элементы.ГруппаКонтактнаяИнформация, ПараметрыСтраницы);
	
	// ГруппаПериметр
	ГруппаПериметр = ФормыУХ.СоздатьГруппуФормы(Элементы, "ГруппаПериметр", НСтр("ru = 'Периметр'"), , Страница,, ПараметрыГруппы);
	ПолеФормы = ФормыУХ.СоздатьПолеФормы(Элементы, "ГруппаКонтрагента",		 НСтр("ru = 'Отношение к Группе'"), "ГруппаКонтрагента",,		ГруппаПериметр,, ПараметрыПоляВвода,
								Новый Структура("ПриИзменении", "Подключаемый_ХолдингПриИзменении"));
	ПолеФормы.ТолькоПросмотр = Истина; 
	
	ФормыУХ.СоздатьПолеФормы(Элементы, "ОрганизационнаяЕдиница", НСтр("ru = 'Организационная единица'"), "ОрганизационнаяЕдиница",,	ГруппаПериметр,, ПараметрыПоляВвода, 
								Новый Структура("ПриИзменении", "Подключаемый_ОрганизационнаяЕдиницаУХПриИзменении"));
	ПолеФормы = ФормыУХ.СоздатьПолеФормы(Элементы, "ФормаУчастияВКапитале",	 НСтр("ru = 'Форма участия в капитале'"), "ФормаУчастияВКапитале",,	ГруппаПериметр,, ПараметрыПоляВвода,
								Новый Структура("ПриИзменении", "Подключаемый_ХолдингПриИзменении"));
	ПолеФормы.ФорматРедактирования = "БЛ=Доли; БИ=Акции";
	
	//
	ГруппаАдресМеждународный = ФормыУХ.СоздатьГруппуФормы(Элементы, "ГруппаАдресМеждународный", "Адрес международный", , Страница,, ПараметрыГруппы);
	ФормыУХ.СоздатьПолеФормы(Элементы, "АдресМеждународный",		НСтр("ru = 'Адрес международный'"), "АдресМеждународный",,		ГруппаАдресМеждународный,, ПараметрыПоляВвода,
								Новый Структура("ПриИзменении", "Подключаемый_ХолдингПриИзменении"));
	ФормыУХ.СоздатьПолеФормы(Элементы, "ГородСтранаМеждународный",  НСтр("ru = 'Город, страна'"), "ГородСтранаМеждународный",,	ГруппаАдресМеждународный,, ПараметрыПоляВвода,
								Новый Структура("ПриИзменении", "Подключаемый_ХолдингПриИзменении"));
	
	// Группа ПоддержкаМногоязычности
	ГруппаПоддержкаМногоязычности = ФормыУХ.СоздатьГруппуФормы(Элементы, "ПоддержкаМногоязычности", "Поддержка многоязычности", , Страница,, ПараметрыГруппы);
	ФормыУХ.СоздатьПолеФормы(Элементы, "Наименование1", НСтр("ru = 'Наименование (Язык1)'"), "Наименование1",	, ГруппаПоддержкаМногоязычности,, ПараметрыПоляВвода,
								Новый Структура("ПриИзменении", "Подключаемый_ХолдингПриИзменении"));
	ФормыУХ.СоздатьПолеФормы(Элементы, "Наименование2", НСтр("ru = 'Наименование (Язык2)'"), "Наименование2",	, ГруппаПоддержкаМногоязычности,, ПараметрыПоляВвода,
								Новый Структура("ПриИзменении", "Подключаемый_ХолдингПриИзменении"));
	
	// Группа ГруппаФЗ223
	ГруппаФЗ223 = ФормыУХ.СоздатьГруппуФормы(Элементы, "ГруппаФЗ223", "ФЗ-223", , Страница,, ПараметрыГруппы);
	ГруппаФЗ223.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ФормыУХ.СоздатьПолеФормы(Элементы, "ДатаПостановкиНаУчетВНалоговой", НСтр("ru = 'Дата постановки на учет в налоговом органе'"), "ДатаПостановкиНаУчетВНалоговой",,	ГруппаФЗ223,, ПараметрыПоляВвода,
								Новый Структура("ПриИзменении", "Подключаемый_ХолдингПриИзменении"));
	//МСП
	ВстраиваниеУХ.ФормаЭлементаРеквизитыКонтрагента_ПриСозданииНаСервереГруппаМСП(ГруппаФЗ223, ПараметрыГруппы, Форма, Форма.КонтрагентПартнера, Элементы);
	
	ГруппаОтступКлассификаторы = ФормыУХ.СоздатьГруппуФормы(Элементы, "ГруппаОтступКлассификаторы", "Классификаторы:", , Страница,, ПараметрыГруппы);
	ГруппаОтступКлассификаторы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	Элемент = Элементы.Добавить("ОтступКлассификаторы", Тип("ДекорацияФормы"), ГруппаОтступКлассификаторы);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Ширина = 1;
	
	ГруппаКлассификаторов = ФормыУХ.СоздатьГруппуФормы(Элементы, "ГруппаКлассификаторов", "", , ГруппаОтступКлассификаторы,, ПараметрыГруппы);
	ГруппаКлассификаторов.ОтображатьЗаголовок = Ложь;
	
	Элемент = Элементы.Добавить("ДекорацияОписаниеКлассификаторов", Тип("ДекорацияФормы"), ГруппаКлассификаторов);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.РастягиватьПоГоризонтали = Истина;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина = 0;
	
	//
	ИмяКоманды = "ОткрытьПараметрыКлассификаторов";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, "Классификаторы", "Подключаемый_ОткрытьПараметрыКлассификаторов");
	
	//
	ГиперссылкаКлассификаторы = Элементы.Добавить("ГиперссылкаКлассификаторы", Тип("КнопкаФормы"), ГруппаКлассификаторов);
	ГиперссылкаКлассификаторы.Вид = ВидКнопкиФормы.Гиперссылка;
	ГиперссылкаКлассификаторы.Заголовок = НСтр("ru = 'Изменить'");
	ГиперссылкаКлассификаторы.ИмяКоманды = ИмяКоманды;
	
	Форма.ЗаполнитьОписаниеКлассификаторов();
	
КонецПроцедуры


Процедура ФормаЭлементаРеквизитыКонтрагента_ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Форма.КонтрагентПартнера) Тогда
		Возврат;
	КонецЕсли;
	
	КонтрагентОбъект = Форма.КонтрагентПартнера.ПолучитьОбъект();
	РеквизитаКонтрагента = "ГруппаКонтрагента, ОрганизационнаяЕдиница, ФормаУчастияВКапитале, АдресМеждународный,
							|ГородСтранаМеждународный, Наименование1, Наименование2, ДатаПостановкиНаУчетВНалоговой, СубъектМалогоИлиСреднегоПредпринимательстваУХ,
							|КодОКОПФ, НаименованиеОКОПФ";
	   
	ЗаполнитьЗначенияСвойств(КонтрагентОбъект, Форма, РеквизитаКонтрагента);
	
	Попытка
		КонтрагентОбъект.Записать();
	Исключение
    	ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(НСтр("ru = 'Не удалось записать контрагента, соответствующего партнеру ""%1"".'"), ТекущийОбъект.Наименование));
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РеквизитыФормы()
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить(Новый РеквизитФормы("Контрагент", 	Новый ОписаниеТипов("СправочникСсылка.Контрагенты")));
	Реквизиты.Добавить(Новый РеквизитФормы("ГруппаКонтрагента", 	Новый ОписаниеТипов("СправочникСсылка.ГруппыКонтрагентов")));
	Реквизиты.Добавить(Новый РеквизитФормы("ОрганизационнаяЕдиница", Новый ОписаниеТипов("СправочникСсылка.Организации")));
	Реквизиты.Добавить(Новый РеквизитФормы("ФормаУчастияВКапитале", Новый ОписаниеТипов("Булево")));
	Реквизиты.Добавить(Новый РеквизитФормы("АдресМеждународный", 	Новый ОписаниеТипов("Строка")));
	Реквизиты.Добавить(Новый РеквизитФормы("ГородСтранаМеждународный", Новый ОписаниеТипов("Строка")));
	Реквизиты.Добавить(Новый РеквизитФормы("Наименование1", 	Новый ОписаниеТипов("Строка")));
	Реквизиты.Добавить(Новый РеквизитФормы("Наименование2", 	Новый ОписаниеТипов("Строка")));
	Реквизиты.Добавить(Новый РеквизитФормы("ДатаПостановкиНаУчетВНалоговой", 	Новый ОписаниеТипов("Дата")));
	Реквизиты.Добавить(Новый РеквизитФормы("СубъектМалогоИлиСреднегоПредпринимательстваУХ", 	Новый ОписаниеТипов("Булево")));
	Реквизиты.Добавить(Новый РеквизитФормы("НаименованиеОКОПФ", Новый ОписаниеТипов("Строка")));
	Реквизиты.Добавить(Новый РеквизитФормы("КодОКОПФ",		 	Новый ОписаниеТипов("Строка")));
	
	Возврат Реквизиты;
КонецФункции // ()

// Возвращает имя команды ввода документа регистрации размера контрагента
// для текущего объекта формы.
Функция ПолучитьИмяКомандыРазмерКонтрагента(Форма)
	РезультатФункции = НСтр("ru = 'Регистратор'");
	СсылкаКонтрагент = Форма.КонтрагентПартнера;
	Если ЗначениеЗаполнено(СсылкаКонтрагент) Тогда
		НайденныйДокумент = РегистрыСведений.РазмерыКонтрагентовДляЕИС.НайтиДокументРегистрацииРазмера(СсылкаКонтрагент);
		Если ЗначениеЗаполнено(НайденныйДокумент) Тогда
			РезультатФункции = Строка(НайденныйДокумент);
		Иначе
			РезультатФункции = НСтр("ru = 'Ввести Размер контрагента для ЕИС'");
		КонецЕсли;
	Иначе
		РезультатФункции = НСтр("ru = 'Ввести Размер контрагента для ЕИС'");
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		 // ПолучитьИмяКомандыРазмерКонтрагента()         



Функция РеквизитаКонтрагента()

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ГруппаКонтрагента");
	СтруктураРеквизитов.Вставить("ОрганизационнаяЕдиница");
	СтруктураРеквизитов.Вставить("ФормаУчастияВКапитале");
	СтруктураРеквизитов.Вставить("АдресМеждународный");
	СтруктураРеквизитов.Вставить("ГородСтранаМеждународный");
	СтруктураРеквизитов.Вставить("Наименование1");
	СтруктураРеквизитов.Вставить("Наименование2");
	СтруктураРеквизитов.Вставить("ДатаПостановкиНаУчетВНалоговой");
    СтруктураРеквизитов.Вставить("СубъектМалогоИлиСреднегоПредпринимательстваУХ");
	СтруктураРеквизитов.Вставить("НаименованиеОКОПФ");
	СтруктураРеквизитов.Вставить("КодОКОПФ");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции // ()
 
#КонецОбласти
