#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует описание реквизитов объекта, заполняемых по статистике их использования.
//
// Параметры:
//  ОписаниеРеквизитов - Структура - описание реквизитов, для которых необходимо получить значения по статистике
//
//
Процедура ЗадатьОписаниеЗаполняемыхРеквизитовПоСтатистике(ОписаниеРеквизитов) Экспорт
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор";
	Параметры.РазрезыСбораСтатистики.ИспользоватьТолькоЗаполненные = "Партнер";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"Организация", Параметры);
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор, ДокументОснование, КтоЗаявил";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"Подразделение", Параметры);
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор, Организация";
	Параметры.РазрезыСбораСтатистики.ИспользоватьТолькоЗаполненные = "Договор, Валюта";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор, Организация";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"БанковскийСчет", Параметры);
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор, Организация";
	Параметры.РазрезыСбораСтатистики.ИспользоватьТолькоЗаполненные = "Валюта";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор, Организация";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"Касса", Параметры);
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Контрагент";
	Параметры.РазрезыСбораСтатистики.ИспользоватьТолькоЗаполненные = "Договор, Валюта";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Контрагент";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"БанковскийСчетКонтрагента", Параметры);
	
КонецПроцедуры

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("Взаиморасчеты");
	МеханизмыДокумента.Добавить("ОборотныеРегистрыУправленческогоУчета");
	МеханизмыДокумента.Добавить("ПланированиеКонтрольДенежныхСредств");
	МеханизмыДокумента.Добавить("РеестрДокументов");
	МеханизмыДокумента.Добавить("ФинансовыеИнструменты");
	//++ НЕ УТ
	МеханизмыДокумента.Добавить("КонтрольЛимитовБюджетирования");
	//-- НЕ УТ
	
	ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента);
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов - таблиц значений - данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаДенежныеСредстваКВыплате(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаЛимитыРасходаДенежныхСредств(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаРасчетыПоФинансовымИнструментам(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияДенежныхСредств(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияДенежныеСредстваКонтрагент(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		
		ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

// Возвращает структуру параметров для заполнения налогообложения НДС продажи.
//
// Параметры:
//  Объект - ДокументОбъект.РасходныйКассовыйОрдер - документ, по которому необходимо сформировать параметры.
//
// Возвращаемое значение:
//  См. УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСПродажи
//
Функция ПараметрыЗаполненияНалогообложенияНДСПродажи(Объект) Экспорт
	
	ПараметрыЗаполнения = УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСПродажи();
	
	ПараметрыЗаполнения.Организация = Объект.Организация;
	ПараметрыЗаполнения.Дата = Объект.Дата;
	ПараметрыЗаполнения.Договор = Объект.Договор;
	ПараметрыЗаполнения.НаправлениеДеятельности = Объект.НаправлениеДеятельности;
	ПараметрыЗаполнения.Подразделение = Объект.Подразделение;
	
	ПараметрыЗаполнения.РеализацияТоваров = Истина;
	ПараметрыЗаполнения.РеализацияРаботУслуг = Истина;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Возвращает структуру параметров для заполнения налогообложения НДС закупки.
//
// Параметры:
//  Объект - ДокументОбъект.РасходныйКассовыйОрдер - документ, по которому необходимо сформировать параметры.
//
// Возвращаемое значение:
//  См. УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСЗакупки
//
Функция ПараметрыЗаполненияНалогообложенияНДСЗакупки(Объект) Экспорт
	
	ПараметрыЗаполнения = УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСЗакупки();
	
	ПараметрыЗаполнения.Контрагент = Объект.Контрагент;
	ПараметрыЗаполнения.Договор = Объект.Договор; 
	ПараметрыЗаполнения.Период  = Объект.Дата;
	
	ПараметрыЗаполнения.ПриобретениеТоваров = Истина;
	ПараметрыЗаполнения.ПриобретениеРабот = Истина;
	ПараметрыЗаполнения.ПриобретениеНаСтатьи = Истина;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	НоваяКоманда = Документы.ОперацияПоПлатежнойКарте.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если НоваяКоманда <> Неопределено Тогда
		НоваяКоманда.Обработчик = "СозданиеНаОснованииУТКлиент.СоздатьОперациюПоПлатежнойКарте";
		НоваяКоманда.ВидимостьВФормах = "ФормаДокумента, ФормаСпискаДокументов, ФормаСписка, ФормаСпискаЗаявокКСогласованию";
		НоваяКоманда.ЕстьУсловияВидимости = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
			НоваяКоманда,
			"ХозяйственнаяОперация",
			Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту,
			ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	НоваяКоманда = Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если НоваяКоманда <> Неопределено Тогда
		#Область УХ_Встраивание
		//НоваяКоманда.Обработчик = "СозданиеНаОснованииУТКлиент.СоздатьРасходныйКассовыйОрдер";
		НоваяКоманда.Обработчик = "ПлатежныеПозицииКлиент.СоздатьРасходныйКассовыйОрдер";
		#КонецОбласти
		НоваяКоманда.ВидимостьВФормах =
			"ФормаДокумента, ФормаСпискаДокументов, ФормаСписка, ФормаСпискаЗаявокКСогласованию, ЗаявкиНаОплатуПоФинансовымИнструментам";
		НоваяКоманда.МножественныйВыбор = Истина;
		НоваяКоманда.ЕстьУсловияВидимости = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
			НоваяКоманда,
			"ФормаОплатыНаличная",
			Истина,
			ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	НоваяКоманда = Документы.СписаниеБезналичныхДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если НоваяКоманда <> Неопределено Тогда
		#Область УХ_Встраивание
		//НоваяКоманда.Обработчик = "СозданиеНаОснованииУТКлиент.СоздатьСписаниеБезналичныхДС";
		НоваяКоманда.Обработчик = "ПлатежныеПозицииКлиент.СоздатьСписаниеБезналичныхДС";
		#КонецОбласти
		НоваяКоманда.ВидимостьВФормах =
			"ФормаДокумента, ФормаСпискаДокументов, ФормаСписка, ФормаСпискаЗаявокКСогласованию, ЗаявкиНаОплатуПоФинансовымИнструментам";
		НоваяКоманда.МножественныйВыбор = Истина;
		НоваяКоманда.ЕстьУсловияВидимости = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
			НоваяКоманда,
			"ФормаОплатыБезналичная",
			Истина,
			ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	#Область УХ_Встраивание
	ВстраиваниеУХЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);
	#КонецОбласти
	
	ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	
КонецПроцедуры

// Добавляет команду создания документа "Заявка на расходование ДС".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Порядок - Число - Порядок команды.
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений:
//   * Менеджер - Строка
//   * Представление - Строка
//   * РежимЗаписи - Строка
//   * ФункциональныеОпции - Строка
//   * Порядок - Число
//  Неопределено.
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Порядок = 0) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаявкиНаРасходованиеДенежныхСредств";
		КомандаСоздатьНаОсновании.Порядок = Порядок;
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Заявка на расходование ДС".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании.
//
// Возвращаемое значение:
//  Неопределено
//
Функция ДобавитьКомандуСоздатьНаОснованииОтчетаПоКомиссии_Вознаграждение(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик =
			"СозданиеНаОснованииУТКлиент.ЗаявкаНаРасходованиеДсНаОснованииОтчетаПоКомиссии_Вознаграждение";
		КомандаСоздатьНаОсновании.Идентификатор = "ЗаявкаНаРасходованиеДсНаОснованииОтчетаПоКомиссии_Вознаграждение";
		КомандаСоздатьНаОсновании.Представление =
			ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств)
			+ " " + НСтр("ru = 'комитента (вознаграждение комиссионеру)';
						|en = 'consignor (remuneration to consignee)'");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаявкиНаРасходованиеДенежныхСредств";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Отчеты.ЛимитыРасходаДенежныхСредств.ДобавитьКомандуОтчета(КомандыОтчетов);
	Отчеты.ОплатаЗаявокНаРасходованиеДенежныхСредств.ДобавитьКомандуОтчета(КомандыОтчетов);
	НоваяКоманда = Отчеты.КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке.ДобавитьКомандуОтчета(КомандыОтчетов);
	Если НоваяКоманда <>  Неопределено Тогда
		НоваяКоманда.ЕстьУсловияВидимости = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
			НоваяКоманда,
			"ХозяйственнаяОперация",
			Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику,
			ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры)
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств) Тогда
		// Банковские реквизиты
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.СписаниеБезналичныхДенежныхСредств";
		КомандаПечати.Идентификатор = "РеквизитыПлатежа";
		КомандаПечати.Представление = НСтр("ru = 'Реквизиты международного платежа';
											|en = 'Bank details'");
	КонецЕсли;
	
	ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ДобавитьКомандыПечати(КомандыПечати);
	
КонецПроцедуры

// Заполняет таблицу реквизитов, зависимых от хозяйственной операции документа.
//
// Параметры:
//	Объект - ДокументОбъект - Объект заявка
//	МассивВсехРеквизитов - Массив из Строка - Массив всех реквизитов, зависимых от хозяйственной операции
//	МассивРеквизитовОперации - Массив из Строка - Массив имен реквизитов, используемых в выбранной хозяйственной операции.
//
Процедура ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
	
	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("БанковскийСчетКонтрагента");
	МассивВсехРеквизитов.Добавить("БанковскийСчетПолучатель");
	МассивВсехРеквизитов.Добавить("ВалютаКонвертации");
	МассивВсехРеквизитов.Добавить("ДатаАвансовогоОтчета");
	МассивВсехРеквизитов.Добавить("КассаПолучатель");
	МассивВсехРеквизитов.Добавить("Контрагент");
	МассивВсехРеквизитов.Добавить("КурсКонвертации");
	МассивВсехРеквизитов.Добавить("КратностьКурсаКонвертации");
	МассивВсехРеквизитов.Добавить("ОрганизацияПолучатель");
	МассивВсехРеквизитов.Добавить("ПланированиеСуммы");
	МассивВсехРеквизитов.Добавить("ПодотчетноеЛицо");
	МассивВсехРеквизитов.Добавить("СтатьяАктивовПассивов");
	МассивВсехРеквизитов.Добавить("АналитикаАктивовПассивов");
	МассивВсехРеквизитов.Добавить("СтатьяДвиженияДенежныхСредств");
	МассивВсехРеквизитов.Добавить("СуммаКонвертации");
	МассивВсехРеквизитов.Добавить("ХозяйственнаяОперацияПоЗарплате");
	МассивВсехРеквизитов.Добавить("БанковскийСчетСписанияКомиссии");
	МассивВсехРеквизитов.Добавить("ДоговорЭквайринга");
	МассивВсехРеквизитов.Добавить("ТипНалога");
	МассивВсехРеквизитов.Добавить("ПлатежСКонвертацией");
	
	МассивВсехРеквизитов.Добавить("ГруппаФинансовогоУчета");
	МассивВсехРеквизитов.Добавить("НаправлениеДеятельности");
	МассивВсехРеквизитов.Добавить("Договор");
	
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.АналитикаРасходов");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.АналитикаАктивовПассивов");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ДоговорКредитаДепозита");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ДоговорАренды");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ДоговорЗаймаСотруднику");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ОбъектРасчетов");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Комментарий");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.НаправлениеДеятельности");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Партнер");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.СтатьяРасходов");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.СтавкаНДС");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.СуммаНДС");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ТипПлатежаПоАренде");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ТипСуммыКредитаДепозита");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Подразделение");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Организация");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ДатаПогашения");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Контрагент");
	
	МассивВсехРеквизитов.Добавить("ЛицевыеСчетаСотрудников");
	МассивВсехРеквизитов.Добавить("ЛицевыеСчетаСотрудников.ФизическоеЛицо");
	МассивВсехРеквизитов.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
	МассивВсехРеквизитов.Добавить("ЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств");
	
	МассивРеквизитовОперации = Новый Массив;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("ГруппаФинансовогоУчета");
		МассивРеквизитовОперации.Добавить("НаправлениеДеятельности");
		МассивРеквизитовОперации.Добавить("Договор");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Партнер");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ОбъектРасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтавкаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДатаПогашения");
	
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("ГруппаФинансовогоУчета");
		МассивРеквизитовОперации.Добавить("НаправлениеДеятельности");
		МассивРеквизитовОперации.Добавить("Договор");

		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
			МассивРеквизитовОперации.Добавить("ДоговорЭквайринга");
		КонецЕсли;
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Партнер");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ОбъектРасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтавкаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("ДатаАвансовогоОтчета");
		МассивРеквизитовОперации.Добавить("ПодотчетноеЛицо");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		
		МассивРеквизитовОперации.Добавить("ЛицевыеСчетаСотрудников");
		МассивРеквизитовОперации.Добавить("ЛицевыеСчетаСотрудников.ФизическоеЛицо");
		МассивРеквизитовОперации.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
		МассивРеквизитовОперации.Добавить("ЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Подразделение");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.НаправлениеДеятельности");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяРасходов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.АналитикаРасходов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.АналитикаАктивовПассивов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("ГруппаФинансовогоУчета");
		МассивРеквизитовОперации.Добавить("НаправлениеДеятельности");
		МассивРеквизитовОперации.Добавить("Договор");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Партнер");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ОбъектРасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДатаПогашения");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ТипНалога");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетПолучатель");
		МассивРеквизитовОперации.Добавить("КассаПолучатель");
		МассивРеквизитовОперации.Добавить("ОрганизацияПолучатель");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("ГруппаФинансовогоУчета");
		МассивРеквизитовОперации.Добавить("НаправлениеДеятельности");
		МассивРеквизитовОперации.Добавить("Договор");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ОбъектРасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтавкаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДатаПогашения");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетПолучатель");
		МассивРеквизитовОперации.Добавить("КассаПолучатель");
		МассивРеквизитовОперации.Добавить("ОрганизацияПолучатель");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("ГруппаФинансовогоУчета");
		МассивРеквизитовОперации.Добавить("НаправлениеДеятельности");
		МассивРеквизитовОперации.Добавить("Договор");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ОбъектРасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтавкаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
		МассивРеквизитовОперации.Добавить("ОрганизацияПолучатель");
		МассивРеквизитовОперации.Добавить("БанковскийСчетПолучатель");
		МассивРеквизитовОперации.Добавить("КассаПолучатель");
		МассивРеквизитовОперации.Добавить("СтатьяДвиженияДенежныхСредств");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты Тогда
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("ВалютаКонвертации");
		МассивРеквизитовОперации.Добавить("КурсКонвертации");
		МассивРеквизитовОперации.Добавить("КратностьКурсаКонвертации");
		МассивРеквизитовОперации.Добавить("СуммаКонвертации");
		МассивРеквизитовОперации.Добавить("СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("БанковскийСчетПолучатель");
		МассивРеквизитовОперации.Добавить("КассаПолучатель");
		МассивРеквизитовОперации.Добавить("БанковскийСчетСписанияКомиссии");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("ХозяйственнаяОперацияПоЗарплате");
		
		МассивРеквизитовОперации.Добавить("ЛицевыеСчетаСотрудников");
		МассивРеквизитовОперации.Добавить("ЛицевыеСчетаСотрудников.ФизическоеЛицо");
		МассивРеквизитовОперации.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
		
		Если Не Константы.ИспользоватьНачислениеЗарплаты.Получить() Тогда
			МассивРеквизитовОперации.Добавить("СтатьяДвиженияДенежныхСредств");
		КонецЕсли;
		
		Если Константы.ИспользоватьНачислениеЗарплаты.Получить() Тогда
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		КонецЕсли;
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Партнер");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорКредитаДепозита");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТипСуммыКредитаДепозита");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Партнер");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорКредитаДепозита");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов Тогда
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Партнер");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорКредитаДепозита");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику Тогда
		
		МассивРеквизитовОперации.Добавить("ПодотчетноеЛицо");
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ") Тогда
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорЗаймаСотруднику");
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
		Иначе
			МассивРеквизитовОперации.Добавить("СтатьяДвиженияДенежныхСредств");
		КонецЕсли;
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту Тогда
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ДоговорЭквайринга");
		МассивРеквизитовОперации.Добавить("ПодразделениеРасходов");
		МассивРеквизитовОперации.Добавить("НаправлениеДеятельности");
		МассивРеквизитовОперации.Добавить("ОтражатьКомиссию");
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("СтатьяДвиженияДенежныхСредств");
		
	//++ НЕ УТ
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю Тогда
		
		МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПланированиеСуммы");
		МассивРеквизитовОперации.Добавить("ПлатежСКонвертацией");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Партнер");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорАренды");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТипПлатежаПоАренде");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтавкаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СуммаНДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Комментарий");
	//-- НЕ УТ
	
	КонецЕсли;
	
	#Область УХ_Встраивание
	ВстраиваниеУХЗаявкаНаРасходованиеДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации);
	#КонецОбласти
	
КонецПроцедуры

// Дополняет переданную структуру значениями реквизитов доступных формы оплаты в зависимости от хозяйственной операции.
//
// Параметры:
//    ДанныеЗаполнения - Структура - Структура, содержащая хоз. операцию.
//
Процедура ЗаполнитьФормуОплатыПоХозОперации(ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ХозяйственнаяОперация = Неопределено; ХозяйственнаяОперацияПоЗарплате = Неопределено;
	ДанныеЗаполнения.Свойство("ХозяйственнаяОперация", ХозяйственнаяОперация);
	ДанныеЗаполнения.Свойство("ХозяйственнаяОперацияПоЗарплате", ХозяйственнаяОперацияПоЗарплате);
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда
		ФормаОплаты = ОграничениеФормыОплаты(ХозяйственнаяОперацияПоЗарплате);
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
		ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;
	Иначе
		ФормаОплаты = ОграничениеФормыОплаты(ХозяйственнаяОперация);
	КонецЕсли;
	
	Если ФормаОплаты <> Неопределено Тогда
		ДанныеЗаполнения.Вставить("ФормаОплатыНаличная",         (ФормаОплаты = Перечисления.ФормыОплаты.Наличная));
		ДанныеЗаполнения.Вставить("ФормаОплатыБезналичная",      (ФормаОплаты = Перечисления.ФормыОплаты.Безналичная));
		ДанныеЗаполнения.Вставить("ФормаОплатыПлатежнаяКарта",   (ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта));
		ДанныеЗаполнения.Вставить("ФормаОплатыЗаявки",           ФормаОплаты);
	Иначе // Значения по умолчанию
		РеквизитыЗаявки = Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.Реквизиты;
		Если Не ДанныеЗаполнения.Свойство("ФормаОплатыНаличная") Тогда
			ДанныеЗаполнения.Вставить("ФормаОплатыНаличная",         РеквизитыЗаявки.ФормаОплатыНаличная.ЗначениеЗаполнения);
		КонецЕсли;
		Если Не ДанныеЗаполнения.Свойство("ФормаОплатыБезналичная") Тогда
			ДанныеЗаполнения.Вставить("ФормаОплатыБезналичная",      РеквизитыЗаявки.ФормаОплатыБезналичная.ЗначениеЗаполнения);
		КонецЕсли;
		Если Не ДанныеЗаполнения.Свойство("ФормаОплатыПлатежнаяКарта") Тогда
			ДанныеЗаполнения.Вставить("ФормаОплатыПлатежнаяКарта",   РеквизитыЗаявки.ФормаОплатыПлатежнаяКарта.ЗначениеЗаполнения);
		КонецЕсли;
		Если Не ДанныеЗаполнения.Свойство("ФормаОплатыЗаявки") Тогда
			ДанныеЗаполнения.Вставить("ФормаОплатыЗаявки",           РеквизитыЗаявки.ФормаОплатыЗаявки.ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	#Область УХ_Внедерение
	Если ДанныеЗаполнения.Свойство("ФормаОплатыЗаявки") И НЕ ЗначениеЗаполнено(ДанныеЗаполнения.ФормаОплатыЗаявки) Тогда
		ДанныеЗаполнения.ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Безналичная;
		ДанныеЗаполнения.ФормаОплатыБезналичная = Истина;
		ДанныеЗаполнения.ФормаОплатыНаличная = Ложь;
		ДанныеЗаполнения.ФормаОплатыПлатежнаяКарта = Ложь;
	КонецЕсли;
	#КонецОбласти 
	
КонецПроцедуры

// Функция определяет доступную для хозяйственной операции форму оплаты
//
// Параметры:
//    Операция - ПеречислениеСсылка.ХозяйственныеОперации - Хоз. операция, для которой производится проверка.
//
// Возвращаемое значение:
//    ПеречислениеСсылка.ФормыОплаты, Неопределено - Ограничение по форме оплаты, либо Неопределено, если нет ограничений.
//
Функция ОграничениеФормыОплаты(Операция) Экспорт
	
	Ограничения = Новый Соответствие;
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет,                    Перечисления.ФормыОплаты.Безналичная);
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты,                 Перечисления.ФормыОплаты.Безналичная);
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту,    Перечисления.ФормыОплаты.Безналичная);
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета,          Перечисления.ФормыОплаты.Безналичная);
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту,          Перечисления.ФормыОплаты.Безналичная);
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу,              Перечисления.ФормыОплаты.Наличная);
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыРаздатчиком,             Перечисления.ФормыОплаты.Наличная);
	
	#Область УХ_Встраивание
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.КонвертацияВалюты,							Перечисления.ФормыОплаты.Безналичная);
	#КонецОбласти
	
	Возврат Ограничения.Получить(Операция);
	
КонецФункции

// Определяет свойства полей формы в зависимости от данных
//
// Параметры:
//	Настройки - ТаблицаЗначений - таблица с колонками:
//		* Поля - Массив из Строка - поля, для которых определяются настройки отображения
//		* Условие - ОтборКомпоновкиДанных - условия применения настройки
//		* Свойства - Структура - имена и значения свойств
//
Процедура ЗаполнитьНастройкиПолейФормы(Настройки) Экспорт
	
	Финансы = ФинансоваяОтчетностьСервер;
	Операции = Перечисления.ХозяйственныеОперации;
	
	ОтборДопускаетсяБезналичнаяОплата = ДенежныеСредстваСервер.ОтборБезналичнаяОплатаЗаявки();
	
	ОтборПриПеречисленииСотрудникуЧерезБанк = Новый ОтборКомпоновкиДанных();
	
	ГруппаИ = Финансы.НовыйОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "ПеречислениеСотрудникуЧерезБанк", Истина);
	
	ПодГруппаИли = Финансы.НовыйОтбор(ГруппаИ, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ПодГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ПодГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	
	ПодГруппаИ = Финансы.НовыйОтбор(ПодГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ПодГруппаИ, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ПодГруппаИ, "ХозяйственнаяОперацияПоЗарплате", Операции.ВыплатаЗарплатыНаЛицевыеСчета);
	
	ОтборВыплатаСамозанятому = ДенежныеСредстваСервер.ОтборВыплатаСамозанятому();
	ОтборСписокКонтрагентов = ДенежныеСредстваСервер.ОтборСписокКонтрагентов(ОтборВыплатаСамозанятому);
	
	ОтборЗапретИзмененияСтатуса = Новый ОтборКомпоновкиДанных();
	ОтборКОплате = Финансы.НовыйОтбор(ОтборЗапретИзмененияСтатуса, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборКОплате.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ОтборКОплате, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(ОтборКОплате, "Дополнительно.ПравоУтверждения", Ложь);
	
	#Область Шапка
	// Статус
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Статус");
	Финансы.СкопироватьОтбор(ОтборЗапретИзмененияСтатуса, Элемент.Условие);
	Элемент.Свойства.Вставить("ТолькоПросмотр");
	
	// ТипНалога
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ТипНалога");
	Элемент.Поля.Добавить("ЗаполнитьПоПредыдущемуПлатежу");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	Элемент.Свойства.Вставить("Видимость");
	
	// ХозяйственнаяОперацияПоЗарплате
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ХозяйственнаяОперацияПоЗарплате");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Элемент.Свойства.Вставить("Видимость");
	
	// ФормаОплаты
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ФормаОплаты");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ФормаОплатыОграничена", Ложь);
	Элемент.Свойства.Вставить("Видимость");
	
	// Банковский счет
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчет");
	Финансы.НовыйОтбор(Элемент.Условие, "ФормаОплатыЗаявки", Перечисления.ФормыОплаты.Безналичная);
	Элемент.Свойства.Вставить("Видимость");
	
	// Касса
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Касса");
	Финансы.НовыйОтбор(Элемент.Условие, "ФормаОплатыЗаявки", Перечисления.ФормыОплаты.Наличная);
	Элемент.Свойства.Вставить("Видимость");
	
	// Контрагент
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Контрагент");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИлиИ = Финансы.НовыйОтбор(ГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИлиИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	Финансы.НовыйОтбор(ГруппаИлиИ, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИлиИ, "ОперацияССамозанятым", Ложь);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыНаПлатежнуюКарту);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперацияПоЗарплате", Операции.ВыплатаЗарплатыПоЗарплатномуПроекту);
	
	ПодГруппаИ = Финансы.НовыйОтбор(ГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, ПодГруппаИ);
	
	ПодГруппаИли = Финансы.НовыйОтбор(ПодГруппаИ, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.СкопироватьОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, ПодГруппаИли);
	Финансы.СкопироватьОтбор(ОтборСписокКонтрагентов, ПодГруппаИли);
	
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Контрагент");
	Элемент.Поля.Добавить("ДоговорЭквайринга");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.Контрагент");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Контрагент");
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Истина);
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, Элемент.Условие);
	Финансы.СкопироватьОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, Элемент.Условие);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Контрагент");
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Получатель';
												|en = 'Payee'"));
	ГруппаНе = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНе.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
	ГруппаИли = Финансы.НовыйОтбор(ГруппаНе, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыНаПлатежнуюКарту);
	Финансы.СкопироватьОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, ГруппаИли);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Контрагент");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВозвратОплатыНаПлатежнуюКарту);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Эквайер';
												|en = 'Acquirer'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Контрагент");
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Банк-получатель';
												|en = 'Receiving bank'"));
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, Элемент.Условие);
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.СкопироватьОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, ГруппаИли);
	Финансы.СкопироватьОтбор(ОтборСписокКонтрагентов, ГруппаИли);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Контрагент");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Брокер';
												|en = 'Broker'"));
	
	// Договор подключения к платежной системе
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДоговорЭквайринга");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВозвратОплатыНаПлатежнуюКарту);
	Элемент.Свойства.Вставить("Видимость");
	
	// БанковскийСчетКонтрагента
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, Элемент.Условие);
	
	ГруппаИли1 = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ВозвратОплатыНаПлатежнуюКарту);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли1,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперацияПоЗарплате", Операции.ВыплатаЗарплатыПоЗарплатномуПроекту);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли1,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИ2, "СписокФизЛиц", Ложь);
	
	Финансы.СкопироватьОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, ГруппаИли1);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли1);
	
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Финансы.НовыйОтбор(Элемент.Условие, "ПеречислениеСотрудникуЧерезБанк", Ложь);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Лицевой счет';
												|en = 'Personal account'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Финансы.НовыйОтбор(Элемент.Условие, "ПеречислениеСотрудникуЧерезБанк", Истина);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Счет получателя';
												|en = 'Payee account'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	ГруппаНе = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНе.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
	Финансы.НовыйОтбор(ГруппаНе, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Счет получателя';
												|en = 'Payee account'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Счет брокера';
												|en = 'Broker account'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(Элемент.Условие, "СписокФизЛиц", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "ПеречислениеСотрудникуЧерезБанк", Ложь);
	Элемент.Свойства.Вставить("Доступность", Ложь);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Истина);
	
	Финансы.СкопироватьОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, Элемент.Условие);
	
	// Подотчетное лицо
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПодотчетноеЛицо");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Сотрудник");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПодотчетноеЛицо");
	Финансы.НовыйОтбор(Элемент.Условие, "СписокФизЛиц", Истина);
	Элемент.Свойства.Вставить("Доступность", Ложь);
	
	// Список физ. лиц
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СписокФизЛицВключено");
	Элемент.Поля.Добавить("СписокФизЛицОтключено");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Элемент.Свойства.Вставить("Видимость");
	
	// ОрганизацияПолучатель
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ОрганизацияПолучатель");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВнутренняяПередачаДенежныхСредств);
	Элемент.Свойства.Вставить("Видимость");
	
	// БанковскийСчетПолучатель
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетПолучатель");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВнутренняяПередачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Финансы.НовыйОтбор(Элемент.Условие, "ФормаОплатыЗаявки", Перечисления.ФормыОплаты.Безналичная);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетПолучатель");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Счет конвертации';
												|en = 'Conversion account'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетПолучатель");
	ГруппаНе = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНе.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
	Финансы.НовыйОтбор(ГруппаНе, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Счет получателя';
												|en = 'Payee account'"));
	
	// КассаПолучатель
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("КассаПолучатель");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВнутренняяПередачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Финансы.НовыйОтбор(Элемент.Условие, "ФормаОплатыЗаявки", Перечисления.ФормыОплаты.Наличная);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("КассаПолучатель");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Касса конвертации';
												|en = 'Conversion cash account'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("КассаПолучатель");
	ГруппаНе = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНе.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
	Финансы.НовыйОтбор(ГруппаНе, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Касса получателя';
												|en = 'Receiving cash account'"));
	
	// Статья ДДС
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СтатьяДвиженияДенежныхСредств");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВнутренняяПередачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыНаПлатежнуюКарту);
	
	ГруппаИ1 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ1, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ГруппаИ1, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Ложь);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Финансы.НовыйОтбор(ГруппаИ2, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Ложь);
	
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СтатьяДвиженияДенежныхСредств");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	// ПланированиеСуммы
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПланированиеСуммы");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИ, "СписокФизЛиц", Ложь);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	// Тип перечисления подотчетнику
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПеречислениеСотрудникуЧерезБанк");
	Элемент.Свойства.Вставить("Видимость", Истина);
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперацияПоЗарплате", Операции.ВыплатаЗарплатыНаЛицевыеСчета);
	
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, Элемент.Условие);
	#КонецОбласти
	
	#Область Реквизиты
	// Кто решил
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("КтоРешил");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Элемент.Свойства.Вставить("Видимость");
	
	// Только просмотр
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Номер");
	Элемент.Поля.Добавить("Дата");
	Элемент.Поля.Добавить("ПланированиеСуммы");
	Элемент.Поля.Добавить("СуммаДокумента");
	Элемент.Поля.Добавить("Валюта");
	Элемент.Поля.Добавить("ФормаОплаты");
	Элемент.Поля.Добавить("Организация");
	Элемент.Поля.Добавить("Подразделение");
	Элемент.Поля.Добавить("Заявитель");
	Элемент.Поля.Добавить("ХозяйственнаяОперация");
	Элемент.Поля.Добавить("ТипНалога");
	Элемент.Поля.Добавить("ЛицевыеСчетаСотрудников");
	Элемент.Поля.Добавить("ХозяйственнаяОперацияПоЗарплате");
	Элемент.Поля.Добавить("ЖелательнаяДатаПлатежа");
	Элемент.Поля.Добавить("Контрагент");
	Элемент.Поля.Добавить("ДоговорЭквайринга");
	Элемент.Поля.Добавить("ОрганизацияПолучатель");
	Элемент.Поля.Добавить("ПодотчетноеЛицо");
	Элемент.Поля.Добавить("БанковскийСчетПолучатель");
	Элемент.Поля.Добавить("КассаПолучатель");
	Элемент.Поля.Добавить("СтатьяДвиженияДенежныхСредств");
	Элемент.Поля.Добавить("РасшифровкаПлатежа");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиения");
	Элемент.Поля.Добавить("НазначениеПлатежа");
	Элемент.Поля.Добавить("ВалютаКонвертации");
	Элемент.Поля.Добавить("КурсКонвертации");
	Элемент.Поля.Добавить("СуммаКонвертации");
	Элемент.Поля.Добавить("КратностьКурсаКонвертации");
	Элемент.Поля.Добавить("СверхЛимита");
	Элемент.Поля.Добавить("БанковскийСчет");
	Элемент.Поля.Добавить("Касса");
	Элемент.Поля.Добавить("ПериодАвансовогоОтчета");
	Элемент.Поля.Добавить("СписокФизЛицВключено");
	Элемент.Поля.Добавить("СписокФизЛицОтключено");
	Элемент.Поля.Добавить("ТипКомиссииЗаПеревод");
	Элемент.Поля.Добавить("КодыИнструкцийБанку");
	Элемент.Поля.Добавить("ИнформацияДляРегулирующихОрганов");
	Элемент.Поля.Добавить("ИнформацияПолучателюПлатежа");
	Элемент.Поля.Добавить("СуммаКомиссии");
	Элемент.Поля.Добавить("Подразделение");
	Элемент.Поля.Добавить("НаправлениеДеятельности");
	Элемент.Поля.Добавить("СтатьяРасходов");
	Элемент.Поля.Добавить("АналитикаРасходов");
	Элемент.Поля.Добавить("ПеречислениеСотрудникуЧерезБанк");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(ГруппаИли, "Закрыта", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Проведен", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.Модифицированность", Ложь);
	Элемент.Свойства.Вставить("ТолькоПросмотр");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскийСчетКонтрагента");
	Элемент.Свойства.Вставить("ТолькоПросмотр", Истина);
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ПодГруппаИ1 = Финансы.НовыйОтбор(ГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ПодГруппаИли1 = Финансы.НовыйОтбор(ПодГруппаИ1, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодГруппаИли1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ПодГруппаИли1, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ПодГруппаИли1, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(ПодГруппаИ1, "Проведен", Истина);
	Финансы.НовыйОтбор(ПодГруппаИ1, "Дополнительно.Модифицированность", Ложь);
	
	ГруппаКонтрагентНеЗаполнен = Финансы.НовыйОтбор(ГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаКонтрагентНеЗаполнен.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаКонтрагентНеЗаполнен, "Контрагент", , , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ПодгруппаДопУсловия = Финансы.НовыйОтбор(ГруппаКонтрагентНеЗаполнен, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодгруппаДопУсловия.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.СкопироватьОтбор(ОтборПриПеречисленииСотрудникуЧерезБанк, ПодгруппаДопУсловия);
	Финансы.СкопироватьОтбор(ОтборСписокКонтрагентов, ПодгруппаДопУсловия);
	
	ПодгруппаОстальныеОперации = Финансы.НовыйОтбор(ПодгруппаДопУсловия, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодгруппаОстальныеОперации.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
	
	ОперацииСФизЛицами = Новый Массив;
	ОперацииСФизЛицами.Добавить(Операции.ВыдачаДенежныхСредствПодотчетнику);
	ОперацииСФизЛицами.Добавить(Операции.ВыдачаЗаймаСотруднику);
	
	Финансы.НовыйОтбор(ПодгруппаОстальныеОперации, "ХозяйственнаяОперация", ОперацииСФизЛицами, , ВидСравненияКомпоновкиДанных.ВСписке);
	
	ГруппаФизЛицоНеЗаполнено = Финансы.НовыйОтбор(ГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаФизЛицоНеЗаполнено.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаФизЛицоНеЗаполнено, "ПодотчетноеЛицо", , , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	Финансы.НовыйОтбор(ГруппаФизЛицоНеЗаполнено, "ПеречислениеСотрудникуЧерезБанк", Ложь);
	
	ПодгруппаФизЛицоНеЗаполнено = Финансы.НовыйОтбор(ГруппаФизЛицоНеЗаполнено, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодгруппаФизЛицоНеЗаполнено.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ПодгруппаФизЛицоНеЗаполнено, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ПодгруппаФизЛицоНеЗаполнено, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Статус");
	Элемент.Поля.Добавить("Приоритет");
	Элемент.Поля.Добавить("СтраницаРаспределениеПоСчетам");
	Финансы.НовыйОтбор(Элемент.Условие, "Закрыта", Истина);
	Элемент.Свойства.Вставить("ТолькоПросмотр");
	
	// РаспределениеПоСчетам
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РаспределениеПоСчетам");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИ1 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаИли1 = Финансы.НовыйОтбор(ГруппаИ1,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли1, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли1, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(ГруппаИ1, "Проведен", Истина);
	Финансы.НовыйОтбор(ГруппаИ1, "Дополнительно.ПравоУтверждения", Ложь);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "Дополнительно.ПравоСогласования", Ложь);
	Финансы.НовыйОтбор(ГруппаИ2, "Дополнительно.ПравоУтверждения", Ложь);
	Элемент.Свойства.Вставить("ТолькоПросмотр");
	
	// Лицевые счета
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЛицевыеСчетаСотрудников");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИ1 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ1, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ГруппаИ1, "ХозяйственнаяОперацияПоЗарплате", Операции.ВыплатаЗарплатыНаЛицевыеСчета);
	Финансы.НовыйОтбор(ГруппаИ1, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Ложь);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИ2, "СписокФизЛиц", Истина);
	
	Элемент.Свойства.Вставить("Видимость");
	
	// Закрыть заявку
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЗакрытьЗаявку");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ОстатокОплаты", 0,, ВидСравненияКомпоновкиДанных.НеРавно);
	Финансы.НовыйОтбор(Элемент.Условие, "Проведен", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Закрыта", Ложь);
	Финансы.НовыйОтбор(Элемент.Условие, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена,, ВидСравненияКомпоновкиДанных.НеРавно);
	
	ГруппаИсключения = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИсключения.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
	Финансы.СкопироватьОтбор(ОтборЗапретИзмененияСтатуса, ГруппаИсключения);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Закрыта");
	Финансы.НовыйОтбор(Элемент.Условие, "Закрыта", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	// НадписьФактическаяОплата
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НадписьФактическаяОплата");
	Финансы.НовыйОтбор(Элемент.Условие, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Элемент.Свойства.Вставить("Видимость");
	
	// Конвертация
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ВалютаКонвертации");
	Элемент.Поля.Добавить("КурсКонвертации");
	Элемент.Поля.Добавить("СуммаКонвертации");
	Элемент.Поля.Добавить("КратностьКурсаКонвертации");
	Элемент.Поля.Добавить("ВалютаКурсаКонвертации");
	Элемент.Поля.Добавить("ВалютаКратностиКурсаКонвертации");
	Элемент.Поля.Добавить("БанковскийСчетСписанияКомиссии");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.КонвертацияВалюты);
	Элемент.Свойства.Вставить("Видимость");
	
	// ПериодАвансовогоОтчета, ДатаАвансовогоОтчета
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПериодАвансовогоОтчета");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДатаАвансовогоОтчета");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ПериодАвансовогоОтчетаДата", Ложь);
	Элемент.Свойства.Вставить("Видимость");
	
	// Валютный платеж
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ТипКомиссииЗаПеревод");
	Элемент.Поля.Добавить("КодыИнструкцийБанку");
	Элемент.Поля.Добавить("ИнформацияПолучателюПлатежа");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ВалютныйПлатеж", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьВалютныеПлатежи", Истина);
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, Элемент.Условие);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ИнформацияДляРегулирующихОрганов");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ВалютныйПлатеж", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьВалютныеПлатежи", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ТребуетсяИнформацияДляРегулирующихОрганов", Истина);
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, Элемент.Условие);
	Элемент.Свойства.Вставить("Видимость");
	
	// Сверх лимита
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СверхЛимита");
	Финансы.НовыйОтбор(Элемент.Условие, "СверхЛимита", Истина);
	Элемент.Свойства.Вставить("ЦветТекстаЗаголовка", ЦветаСтиля.ЦветОсобогоТекста);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СверхЛимита");
	Финансы.НовыйОтбор(Элемент.Условие, "СверхЛимита", Ложь);
	Элемент.Свойства.Вставить("ЦветТекстаЗаголовка", ЦветаСтиля.ЦветТекстаФормы);
	
	// ДокументОснование
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДокументОснование");
	Финансы.НовыйОтбор(Элемент.Условие, "ДокументОснование",,, ВидСравненияКомпоновкиДанных.Заполнено);
	Элемент.Свойства.Вставить("Видимость");
	
	// Комиссия
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ГруппаКомиссия");
	Финансы.НовыйОтбор(Элемент.Условие, "ОтражатьКомиссию", Истина);
	Элемент.Свойства.Вставить("Видимость");
	#КонецОбласти
	
	#Область РасшифровкаПлатежа
	// СтраницаРасшифровка
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СтраницаРасшифровка");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	
	ГруппаИли2 = Финансы.НовыйОтбор(ГруппаИ,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИ2, "СписокФизЛиц", Ложь);
	
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СтраницаРасшифровка");
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Расшифровка платежа';
												|en = 'Payment details'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("СтраницаРасшифровка");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Ведомости';
												|en = 'Statements'"));
	
	// СуммаНДС, СтавкаНДС
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.СуммаНДС");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияСуммаНДС");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.СтавкаНДС");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияСтавкаНДС");
	Элемент.Поля.Добавить("ВалютаНДС");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	ГруппаНе = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНе.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаНе);
	Элемент.Свойства.Вставить("Видимость");
	
	// Аналитика прочей выдачи
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.Подразделение");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияПодразделение");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.НаправлениеДеятельности");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияНаправлениеДеятельности");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	Элемент.Свойства.Вставить("Видимость");
	
	// СтатьяДвиженияДенежныхСредств
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	ГруппаИли2 = Финансы.НовыйОтбор(ГруппаИ,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ВыплатаЗарплаты);
	
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	// СуммаВзаиморасчетов, ВалютаВзаиморасчетов
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияСуммаВзаиморасчетов");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ВалютаВзаиморасчетов");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияВалютаВзаиморасчетов");
	
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНесколькоВалют", Истина);
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	// СуммаВзаиморасчетов
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияСуммаВзаиморасчетов");
	
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНесколькоВалют", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ВалютаВзаиморасчетов", "Валюта", , , Истина);
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("ТолькоПросмотр");
	
	// ДекорацияВалютыИКурсПлатежа, КурсЧислительВзаиморасчетов, КурсЗнаменательВзаиморасчетов
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДекорацияВалютыИКурсПлатежа");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.КурсЧислительВзаиморасчетов");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияКурсЧислительВзаиморасчетов");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.КурсЧислительВзаиморасчетовТекст");
	Элемент.Поля.Добавить("РасшифровкаПлатежаКурсЗнаменательВзаиморасчетовНадпись");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ВариантКурсаДоговора");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияВариантКурсаДоговора");
	
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНесколькоВалют", Истина);
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПрочаяВыдачаДенежныхСредств);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	
	Финансы.НовыйОтбор(Элемент.Условие, "Валюта", "Дополнительно.ВалютаВзаиморасчетов",, ВидСравненияКомпоновкиДанных.НеРавно, Истина);
	ПодгруппаИли = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ПодгруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ПодгруппаИли, "Дополнительно.НесколькоВалютВзаиморасчетов", Истина);
	Финансы.НовыйОтбор(ПодгруппаИли,
						"Дополнительно.ВалютаВзаиморасчетов",
						Справочники.Валюты.ПустаяСсылка(), ,
						ВидСравненияКомпоновкиДанных.НеРавно);
	Элемент.Свойства.Вставить("Видимость");
	
	// ДекорацияВалютыИКурсПлатежа
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДекорацияВалютыИКурсПлатежа");
	ГруппаИ = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "Дополнительно.ВалютаВзаиморасчетов",,, ВидСравненияКомпоновкиДанных.Заполнено);
	Финансы.НовыйОтбор(ГруппаИ, "Дополнительно.ВариантКурсаДоговора",,, ВидСравненияКомпоновкиДанных.Заполнено);
	Элемент.Свойства.Вставить("Доступность");
	
	// РасшифровкаБезРазбиенияВариантКурсаДоговора
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияВариантКурсаДоговора");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Дополнительно.ВариантКурсаДоговора", Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре,, ВидСравненияКомпоновкиДанных.Равно);
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "Дополнительно.ВариантКурсаДоговора", Перечисления.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки,, ВидСравненияКомпоновкиДанных.Равно);
	Финансы.НовыйОтбор(ГруппаИ, "Дополнительно.ТипОбъектаРасчетов", Перечисления.ТипыОбъектовРасчетов.Накладная,, ВидСравненияКомпоновкиДанных.Равно);
	Элемент.Свойства.Вставить("Гиперссылка");
	
	// ОбъектРасчетов
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ОбъектРасчетов");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияОбъектРасчетов");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	// Партнер
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.Партнер");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияПартнер");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	//++ НЕ УТ
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	//-- НЕ УТ
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.Партнер");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияПартнер");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	// ДоговорКредитаДепозита
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ДоговорКредитаДепозита");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияДоговорКредитаДепозита");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Элемент.Свойства.Вставить("Видимость");
	
	// ТипСуммыКредитаДепозита
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ТипСуммыКредитаДепозита");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияТипСуммыКредитаДепозита");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ОплатаПоКредитам);
	Элемент.Свойства.Вставить("Видимость");
	
	// ДоговорЗаймаСотруднику
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ДоговорЗаймаСотруднику");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияДоговорЗаймаСотруднику");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаЗаймаСотруднику);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	// ДоговорАренды
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ДоговорАренды");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияДоговорАренды");
	Элемент.Поля.Добавить("РасшифровкаПлатежа.ТипПлатежаПоАренде");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияТипПлатежаПоАренде");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ОплатаАрендодателю);
	Элемент.Свойства.Вставить("Видимость");
	
	// Организация
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.Организация");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияОрганизация");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ЕстьФилиалы", Истина);
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	// ГиперссылкаРеквизитыОбъектаРасчетов
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ГиперссылкаРеквизитыОбъектаРасчетов");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	// Нераспределенный платеж
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ГруппаФинансовогоУчета");
	Элемент.Поля.Добавить("НаправлениеДеятельности");
	ГруппаИ = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию,, ВидСравненияКомпоновкиДанных.НеРавно);
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту,, ВидСравненияКомпоновкиДанных.НеРавно);
	Финансы.НовыйОтбор(ГруппаИ, "Дополнительно.СуммаНераспределено", 0,, ВидСравненияКомпоновкиДанных.НеРавно);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ГруппаФинансовогоУчетаВозврата");
	Элемент.Поля.Добавить("НаправлениеДеятельностиВозврата");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Элемент.Свойства.Вставить("Видимость");
	
	// Договор
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Договор");
	
	Финансы.НовыйОтбор(Элемент.Условие, "СписокКонтрагентов", Ложь);
	
	ГруппаИ1 = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ГруппаИли = Финансы.НовыйОтбор(ГруппаИ1,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИ2, "Дополнительно.ИспользоватьДоговорыСПоставщиками", Истина);
	
	ГруппаИ3 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ3, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИ3, "Дополнительно.ИспользоватьДоговорыМеждуОрганизациями", Истина);
	
	ГруппаИ4 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ4.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ4, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИ4, "Дополнительно.ИспользоватьДоговорыСПоставщиками", Истина);
	
	ГруппаИ5 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ5.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИ5);
	Финансы.НовыйОтбор(ГруппаИ5, "Дополнительно.ИспользоватьДоговорыСПоставщиками", Истина);
	
	Элемент.Свойства.Вставить("Видимость");
	
	// Договор возврата
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДоговорВозврата");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИ1 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ1, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИ1, "Дополнительно.ИспользоватьДоговорыМеждуОрганизациями", Истина);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИ2, "Дополнительно.ИспользоватьДоговорыСКлиентами", Истина);
	
	Элемент.Свойства.Вставить("Видимость");
	
	// Договор объекта расчетов
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияОбъектРасчетовДоговор");
	
	ОсновныеУсловия = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОсновныеУсловия.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Финансы.НовыйОтбор(ОсновныеУсловия, "СписокКонтрагентов", Истина);
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИ1 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ1, "Дополнительно.ИспользоватьДоговорыСПоставщиками", Истина);
	ГруппаИли1 = Финансы.НовыйОтбор(ГруппаИ1,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли1);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "Дополнительно.ИспользоватьДоговорыМеждуОрганизациями", Истина);
	ГруппаИли2 = Финансы.НовыйОтбор(ГруппаИ2,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	
	ГруппаИ3 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ3, "Дополнительно.ИспользоватьДоговорыСКлиентами", Истина);
	ГруппаИли3 = Финансы.НовыйОтбор(ГруппаИ3,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли3, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежаДоговор");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИ1 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ1, "Дополнительно.ИспользоватьДоговорыСПоставщиками", Истина);
	ГруппаИли1 = Финансы.НовыйОтбор(ГруппаИ1,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли1, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли1);
	
	ГруппаИ2 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ2, "Дополнительно.ИспользоватьДоговорыМеждуОрганизациями", Истина);
	ГруппаИли2 = Финансы.НовыйОтбор(ГруппаИ2,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли2, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	
	ГруппаИ3 = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ3, "Дополнительно.ИспользоватьДоговорыСКлиентами", Истина);
	ГруппаИли3 = Финансы.НовыйОтбор(ГруппаИ3,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли3, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	
	Элемент.Свойства.Вставить("Видимость");
	
	// Дата погашения
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияДатаПогашения");
	Элемент.Поля.Добавить("РасшифровкаПлатежаДатаПогашения");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	
	Элемент.Свойства.Вставить("Видимость");
	
	#КонецОбласти
	
	#Область Команды
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежаПодборПоОстаткам");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ОплатаДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ВозвратДенежныхСредствВДругуюОрганизацию);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Операции.ПеречислениеТаможне);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЗаполнитьОстаткамиНевыданныхСуммКонтрагенту");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаЗаймов);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежаПодборПоОстаткам");
	Элемент.Поля.Добавить("ЗаполнитьОстаткамиНевыданныхСуммКонтрагенту");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(ГруппаИли, "Закрыта", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Проведен", Истина);
	Элемент.Свойства.Вставить("Доступность", Ложь);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЗаполнитьНазначениеПлатежа");
	Элемент.Поля.Добавить("ЛицевыеСчетаСотрудниковЗаполнитьСтатьюДвиженияДенежныхСредств");
	Элемент.Поля.Добавить("ПеречислениеСотрудникуЧерезБанк");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(Элемент.Условие, "Проведен", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.Модифицированность", Ложь);
	Элемент.Свойства.Вставить("Доступность", Ложь);
	#КонецОбласти
	
	#Область ЛицевыеСчетаСотрудников

	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЛицевыеСчетаСотрудниковЛицевойСчет");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(Элемент.Условие, "ФормаОплатыЗаявки", Перечисления.ФормыОплаты.Наличная);
	Элемент.Свойства.Вставить("Видимость", Ложь);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЛицевыеСчетаСотрудниковСтатьяДвиженияДенежныхСредств");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЛицевыеСчетаСотрудниковСтатьяДвиженияДенежныхСредств");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Операции.ВыдачаДенежныхСредствПодотчетнику);
	Элемент.Свойства.Вставить("Видимость");
	#КонецОбласти
	
	#Область УХ_Встраивание
	ВстраиваниеУХЗаявкаНаРасходованиеДенежныхСредств.ЗаполнитьНастройкиПолейФормы(Настройки);
	#КонецОбласти
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

//++ НЕ УТ

// Возвращает параметры настройки счетов учета в документе.
// 
// Параметры:
// 	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	ТипНалога - СправочникСсылка.ВидыНалоговВзносов - Тип налога документа.
// 	
// Возвращаемое значение:
// 	Массив Из См. НастройкаСчетовУчетаСервер.ПараметрыНастройки
//
Функция ПараметрыНастройкиСчетовУчета(ХозяйственнаяОперация, ТипНалога) Экспорт
	
	МассивПараметров = Новый Массив();
	
	#Область СтатьяРасходов
	ПараметрыНастройки = НастройкаСчетовУчетаСервер.ПараметрыНастройки();
	ПараметрыНастройки.ПутьКДанным = "Объект.РасшифровкаПлатежа";
	ПараметрыНастройки.ДоступностьПоОперации =
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств
		Или (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
			И РеглУчетСервер.ВидыНалоговСНастройкойСчетов().Найти(ТипНалога) <> Неопределено);
	ПараметрыНастройки.ТипСтатьи = "ТипСтатьи";
	
	ПараметрыНастройки.Представление = "ПредставлениеОтраженияВРеглУчете";
	
	ПараметрыНастройки.Организация = "Объект.Организация";
	
	ПараметрыНастройки.ЭлементыФормы.Добавить("РасшифровкаБезРазбиенияПредставлениеОтраженияВРеглУчете");
	ПараметрыНастройки.ЭлементыФормы.Добавить("РасшифровкаПлатежаПредставлениеОтраженияВРеглУчете");
	
	МассивПараметров.Добавить(ПараметрыНастройки);
	#КонецОбласти
	
	#Область СтатьяАктивовПассивов
	ПараметрыНастройки = НастройкаСчетовУчетаСервер.ПараметрыНастройки();
	ПараметрыНастройки.ПутьКДанным = "Объект";
	ПараметрыНастройки.ДоступностьПоОперации =
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
		И РеглУчетСервер.ВидыНалоговСНастройкойСчетов().Найти(ТипНалога) = Неопределено;
	
	ПараметрыНастройки.Представление = "ПредставлениеОтраженияВРеглУчете";
	ПараметрыНастройки.СтатьяАктивовПассивов = "СтатьяАктивовПассивов";
	ПараметрыНастройки.Организация = "Объект.Организация";
	
	ПараметрыНастройки.ЭлементыФормы.Добавить("ПредставлениеОтраженияВРеглУчете");
	
	МассивПараметров.Добавить(ПараметрыНастройки);
	#КонецОбласти
	
	Возврат МассивПараметров;
	
КонецФункции
//-- НЕ УТ

// Возвращает параметры выбора статей в документе.
// 
// Параметры:
// 	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	ДополнительнаяДоступность - Булево - Дополнительный признак доступности выбора статей и аналитик.
// 
// Возвращаемое значение:
// 	Массив - Массив параметров настройки счетов учета (См. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики)
//
Функция ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация, ДополнительнаяДоступность = Истина) Экспорт
	
	МассивПараметровВыбора = Новый Массив;
	
	#Область СтатьяРасходов
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект.РасшифровкаПлатежа";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.ТипСтатьи = "ТипСтатьи";
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
		ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка();
	КонецЕсли;
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("РасшифровкаБезРазбиенияСтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("РасшифровкаПлатежаСтатьяРасходов");	
	ПараметрыВыбора.ДоступностьПоОперации = ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств;
	
	#Область АналитикаАктивовПассивов
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("РасшифровкаБезРазбиенияАналитикаАктивовПассивов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("РасшифровкаПлатежаАналитикаАктивовПассивов");
	#КонецОбласти
	
	#Область АналитикаРасходов
	ПараметрыВыбора.ВыборСтатьиРасходов = ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("РасшифровкаБезРазбиенияАналитикаРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("РасшифровкаПлатежаАналитикаРасходов");
	#КонецОбласти
	
	МассивПараметровВыбора.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.ТипСтатьи = "ТипСтатьи";
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходов");
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходов");
	
	ПараметрыВыбора.ДоступностьПоОперации =
		(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту) И ДополнительнаяДоступность;
	
	МассивПараметровВыбора.Добавить(ПараметрыВыбора);
	
	Возврат МассивПараметровВыбора;
	
КонецФункции

// Возвращает параметры механизма взаиморасчетов.
//
// Параметры:
// 	ДанныеЗаполнения - ДокументОбъект, СправочникОбъект, ДокументСсылка, СправочникСсылка, Структура, ДанныеФормыСтруктура - Объект или коллекция для
//              расчета параметров взаиморасчетов.
//
// Возвращаемое значение:
// 	См. ВзаиморасчетыСервер.ПараметрыМеханизма
//
Функция ПараметрыВзаиморасчеты(ДанныеЗаполнения = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда
		СтруктураДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДанныеЗаполнения, 
			"ХозяйственнаяОперация, СписокКонтрагентов, ОперацияССамозанятым");
		ХозяйственнаяОперация = СтруктураДанныеЗаполнения.ХозяйственнаяОперация;
		СписокКонтрагентов = СтруктураДанныеЗаполнения.СписокКонтрагентов;
		ОперацияССамозанятым = СтруктураДанныеЗаполнения.ОперацияССамозанятым;
	ИначеЕсли ДанныеЗаполнения = Неопределено Тогда
		ХозяйственнаяОперация = Неопределено;
		СписокКонтрагентов = Ложь;
		ОперацияССамозанятым = Ложь;
	Иначе
		ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
		СписокКонтрагентов = ДанныеЗаполнения.СписокКонтрагентов;
		ОперацияССамозанятым = ДанныеЗаполнения.ОперацияССамозанятым;
	КонецЕсли;
	
	СтруктураПараметров = ВзаиморасчетыСервер.ПараметрыМеханизма();
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		СтруктураПараметров.ТипРасчетов                      = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне Тогда
		СтруктураПараметров.ТипРасчетов                      = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КонецЕсли;
	
	СтруктураПараметров.ИзменяетПланОплаты = ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне;
	
	СтруктураПараметров.ИзменяетПланОтгрузкиПоставки = Ложь;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		СтруктураПараметров.Контрагент                             = "Объект.ОрганизацияПолучатель";
	ИначеЕсли (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		И ОперацияССамозанятым)
		И СписокКонтрагентов Тогда
		СтруктураПараметров.Контрагент                             = "";
	Иначе
		СтруктураПараметров.Контрагент                             = "Объект.Контрагент";
	КонецЕсли;
	
	СтруктураПараметров.КурсЧислитель                    = "";
	СтруктураПараметров.КурсЗнаменатель                  = "";
	СтруктураПараметров.ПорядокРасчетов                  = "";
	
	СтруктураПараметров.ФормаОплаты                      = "Объект.ФормаОплатыЗаявки";
	СтруктураПараметров.ОплатаВВалюте                    = "";
	СтруктураПараметров.Партнер                          = "Объект.РасшифровкаПлатежа.Партнер";
	
	СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа  = "Объект.РасшифровкаПлатежа";
	СтруктураПараметров.Соглашение                       = "";
	СтруктураПараметров.БанковскийСчетОрганизации        = "Объект.БанковскийСчет"; 
	СтруктураПараметров.НалогообложениеНДС               = "Объект.НалогообложениеНДС";
	
	СтруктураПараметров.ЭлементыФормы.РасшифровкаПлатежа       = "РасшифровкаПлатежа";
	СтруктураПараметров.ЭлементыФормы.ПодборВРасшифровкуПлатежа  = "РасшифровкаПлатежаПодборПоОстаткам";
	СтруктураПараметров.ПлатежиПо275ФЗ                           = "Объект.ПлатежиПо275ФЗ";
	
	СтруктураПараметров.ОперацияССамозанятым = "Объект.ОперацияССамозанятым";
	
	Возврат СтруктураПараметров;
КонецФункции

// Производит закрытие заявок
// 
// Параметры:
//    Заявки - Массив Из ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств, ДокументСсылка.ЗаявкаНаКомандировку - Закрываемые заявки
//    Интерактивно - Булево - Признак закрытия заявки при проведении документа
//
// Возвращаемое значение:
//    Число - Количество закрытых заявок
//
Функция ЗакрытьЗаявки(Знач Заявки, Интерактивно = Ложь) Экспорт
	
	ЗамерПроизводительности = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"Документ.ЗаявкаНаРасходованиеДенежныхСредств.МодульМенеджера.ЗакрытьЗаявки");
	
	КоличествоОбработанных = 0;
	
	Если ТипЗнч(Заявки) <> Тип("Массив") Тогда
		Заявка = Заявки;
		Заявки = Новый Массив;
		Заявки.Добавить(Заявка);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Заявка", Заявки);
	
	ОбъектыКПересчетуГрафикаРасчетыСПоставщиками = Новый Массив;
	ОбъектыКПересчетуГрафикаРасчетыСКлиентами    = Новый Массив;
	ТекстЗапросаПересчетаГрафикаПлатежей =
	"ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ОбъектыРасчетов.Объект КАК ОбъектОплаты
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.Ссылка В(&ОбъектыКПересчетуГрафикаРасчетыСПоставщиками)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ОбъектыРасчетов.Объект КАК ОбъектОплаты
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.Ссылка В(&ОбъектыКПересчетуГрафикаРасчетыСКлиентами)";
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ЗапросЗакрытияДенежныеСредстваКВыплате(),              "ДенежныеСредстваКВыплате");
	ТекстыЗапроса.Добавить(ЗапросЗакрытияРасчетыСПоставщиками(),                  "РасчетыСПоставщиками");
	ТекстыЗапроса.Добавить(ЗапросЗакрытияРасчетыСКлиентами(),                     "РасчетыСКлиентами");
	ТекстыЗапроса.Добавить(ЗапросЗакрытияРасчетыПоФинансовымИнструментам(),       "РасчетыПоФинансовымИнструментам");
	ТекстыЗапроса.Добавить(ЗапросЗакрытияДвиженияДенежныхСредств(),               "ДвиженияДенежныхСредств");
	ТекстыЗапроса.Добавить(ЗапросЗакрытияДвиженияДенежныеСредстваДоходыРасходы(), "ДвиженияДенежныеСредстваДоходыРасходы");
	ТекстыЗапроса.Добавить(ЗапросЗакрытияДвиженияДенежныеСредстваКонтрагент(),    "ДвиженияДенежныеСредстваКонтрагент");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредств") Тогда
		ТекстыЗапроса.Добавить(ЗапросЗакрытияЛимитыРасходаДенежныхСредств(),      "ЛимитыРасходаДенежныхСредств");
		Запрос.УстановитьПараметр("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
		Запрос.УстановитьПараметр("ИспользоватьЛимитыРасходаПоОрганизациям",
			ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствПоОрганизациям"));
		Запрос.УстановитьПараметр("ИспользоватьЛимитыРасходаПоПодразделениям",
			ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствПоПодразделениям"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не Интерактивно Тогда
			
			ТаблицаБлокировки = Новый ТаблицаЗначений;
			ТаблицаБлокировки.Колонки.Добавить("Регистратор");
			Для каждого Заявка Из Заявки Цикл
				ТаблицаБлокировки.Добавить();
			КонецЦикла;
			ТаблицаБлокировки.ЗагрузитьКолонку(Заявки, "Регистратор");
			
			Блокировка = Новый БлокировкаДанных;
			
			Для каждого ТекстЗапроса Из ТекстыЗапроса Цикл
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления." + ТекстЗапроса.Представление + ".НаборЗаписей");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных = ТаблицаБлокировки;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
			КонецЦикла;
			
			Блокировка.Заблокировать();
		КонецЕсли;
		
		Результаты = ПроведениеДокументов.ВыгрузитьРезультатыЗапросаПроведения(Запрос, ТекстыЗапроса);
		
		СтруктураПоискаЗаписей = Новый Структура("ЗаявкаНаРасходованиеДенежныхСредств");
		
		Для каждого Заявка Из Заявки Цикл
			
			Если Не Интерактивно Тогда
				
				ЗаявкаОбъект = Заявка.ПолучитьОбъект();
				
				Попытка
					ЗаявкаОбъект.Заблокировать();
				Исключение
					ТекстСообщения = СтрШаблон(
						НСтр("ru = '%1 находится в процессе редактирования пользователем или системой и не может быть изменена.';
							|en = '%1 is being edited by a user or the application and cannot be changed.'"),
						ЗаявкаОбъект);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					Продолжить;
				КонецПопытки;
				
				ЗаявкаОбъект.Закрыта = Истина;
				ЗаявкаОбъект.Записать();
			КонецЕсли;
			
			Для каждого ЗаписиНабора Из Результаты Цикл
			
				СтруктураПоискаЗаписей.ЗаявкаНаРасходованиеДенежныхСредств = Заявка;
				СтрокиНабора = ЗаписиНабора.Значение.НайтиСтроки(СтруктураПоискаЗаписей);
				Если СтрокиНабора.Количество() Тогда
					
					НаборЗаписей = РегистрыНакопления[ЗаписиНабора.Ключ].СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Установить(Заявка);
					ДанныеДляЗаписиВНабор = ЗаписиНабора.Значение.Скопировать(СтрокиНабора);
					НаборЗаписей.Загрузить(ДанныеДляЗаписиВНабор);
					НаборЗаписей.Записать(Ложь);
					
					Если ЗаписиНабора.Ключ = "РасчетыСПоставщиками" Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбъектыКПересчетуГрафикаРасчетыСПоставщиками,
							ДанныеДляЗаписиВНабор.ВыгрузитьКолонку("ОбъектРасчетов"), Истина);
					ИначеЕсли ЗаписиНабора.Ключ = "РасчетыСКлиентами" Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбъектыКПересчетуГрафикаРасчетыСКлиентами,
							ДанныеДляЗаписиВНабор.ВыгрузитьКолонку("ОбъектРасчетов"), Истина);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			КоличествоОбработанных = КоличествоОбработанных + 1;
		КонецЦикла;
		
		// Пересчет графика. Клинеты и поставщики.
		//
		Запрос.Текст = ТекстЗапросаПересчетаГрафикаПлатежей;
		Запрос.УстановитьПараметр("ОбъектыКПересчетуГрафикаРасчетыСПоставщиками", ОбъектыКПересчетуГрафикаРасчетыСПоставщиками);
		Запрос.УстановитьПараметр("ОбъектыКПересчетуГрафикаРасчетыСКлиентами", ОбъектыКПересчетуГрафикаРасчетыСКлиентами);
		
		ДанныеКПересчетуГрафикаПлатежей      = Запрос.ВыполнитьПакет();
		РезультатОбъектыРасчетыСПоставщиками = ДанныеКПересчетуГрафикаПлатежей[0];
		РезультатОбъектыРасчетыСКлиентами    = ДанныеКПересчетуГрафикаПлатежей[1];
		
		Если НЕ РезультатОбъектыРасчетыСПоставщиками.Пустой() Тогда
			РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоРасчетамСПоставщиками(РезультатОбъектыРасчетыСПоставщиками.Выгрузить());
		КонецЕсли;
		
		Если НЕ РезультатОбъектыРасчетыСКлиентами.Пустой() Тогда
			РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоРасчетамСКлиентами(РезультатОбъектыРасчетыСКлиентами.Выгрузить());
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Не удалось закрыть заявки по причине: %1';
								|en = 'Cannot close the requests. Reason: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ТекстОшибки = НСтр("ru = 'Не удалось закрыть заявки.';
							|en = 'Cannot close the requests.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
			ТекстОшибки,
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ЗамерПроизводительности, КоличествоОбработанных);
	
	Возврат КоличествоОбработанных;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
// 
// Параметры:
//  Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст = "РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ЗначениеРазрешено(КтоЗаявил)
	|	И ВЫБОР
	|		КОГДА ХозяйственнаяОперация = Значение(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты) ТОГДА
	|			ЗначениеРазрешено(ХозяйственнаяОперацияПоЗарплате)
	|		ИНАЧЕ
	|			ЗначениеРазрешено(ХозяйственнаяОперация)
	|		КОНЕЦ
	|	И ВЫБОР
	|		КОГДА ХозяйственнаяОперация = Значение(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|			ИЛИ ХозяйственнаяОперация = Значение(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту) ТОГДА
	|			ЗначениеРазрешено(РасшифровкаПлатежа.Партнер) ИЛИ РасшифровкаПлатежа.Партнер ЕСТЬ NULL
	|		КОГДА ХозяйственнаяОперация = Значение(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) ТОГДА
	|			ЗначениеРазрешено(ПодотчетноеЛицо)
	|	ИНАЧЕ ИСТИНА КОНЕЦ";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных;
	
КонецФункции

Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт
	
	Запрос = Новый Запрос();
	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента = "Документ.ЗаявкаНаРасходованиеДенежныхСредств";
	
	ЗначенияПараметров = ЗначенияПараметровПроведения();
	ПереопределениеРасчетаПараметров = Новый Структура;
	ПереопределениеРасчетаПараметров.Вставить("НомерНаПечать", """""");
	
	Если ИмяРегистра = "ДенежныеСредстваКВыплате" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаДенежныеСредстваКВыплате(Запрос, ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "ДанныеДокумента";
		
	ИначеЕсли ИмяРегистра = "РеестрДокументов" Тогда
		
		ПереопределениеРасчетаПараметров.Вставить("ПартнерИзДокумента", "ДанныеДокумента.Партнер");
		ПереопределениеРасчетаПараметров.Вставить("КонтрагентИзДокумента", "ДанныеДокумента.Контрагент");
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "ДанныеДокумента";
		
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.';
								|en = 'In document %ПолноеИмяДокумента%, adaptation of request for generating records of register %ИмяРегистра% is not implemented.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
			ТекстЗапроса, ПолноеИмяДокумента, СинонимТаблицыДокумента, Истина, ПереопределениеРасчетаПараметров);
	Иначе
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
			ТекстЗапроса, ПолноеИмяДокумента, СинонимТаблицыДокумента);
	КонецЕсли;
	
	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметровПроведения();
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьПодарочныйСертификат
	|ПОМЕСТИТЬ НаличиеВидаОбъектаРасчетовПодарочныйСертификат
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасшифровкаПлатежа.ОбъектРасчетов = ОбъектыРасчетов.Ссылка)
	|ГДЕ
	|	ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата                                     КАК Период,
	|	ДанныеДокумента.ДатаПлатежа                              КАК ДатаПлатежа,
	|	ДанныеДокумента.ЖелательнаяДатаПлатежа                   КАК ЖелательнаяДатаПлатежа,
	|	ДанныеДокумента.Организация                              КАК Организация,
	|	ДанныеДокумента.Подразделение                            КАК Подразделение,
	|	ДанныеДокумента.ОрганизацияПолучатель                    КАК ОрганизацияПолучатель,
	|
	|	ВЫБОР
	|		КОГДА
	|			ЕСТЬNULL(НаличиеВидаПодарочныйСертификат.ЕстьПодарочныйСертификат, ЛОЖЬ)
	|		ТОГДА
	|			ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
	|	ИНАЧЕ
	|		ДанныеДокумента.Контрагент
	|	КОНЕЦ                                                    КАК Контрагент,
	|	ДанныеДокумента.СписокКонтрагентов                       КАК СписокКонтрагентов,
	|
	|	ВЫБОР
	|		КОГДА
	|			ЕСТЬNULL(НаличиеВидаПодарочныйСертификат.ЕстьПодарочныйСертификат, ЛОЖЬ)
	|		ТОГДА
	|			ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
	|	ИНАЧЕ
	|		ДанныеДокумента.Партнер
	|	КОНЕЦ                                                    КАК Партнер,
	|	ДанныеДокумента.Контрагент                               КАК КонтрагентИзДокумента,
	|	ДанныеДокумента.Партнер                                  КАК ПартнерИзДокумента,
	|	
	|	ДанныеДокумента.ПодотчетноеЛицо                          КАК ПодотчетноеЛицо,
	|	ДанныеДокумента.Валюта                                   КАК Валюта,
	|	ДанныеДокумента.Статус                                   КАК Статус,
	|	ДанныеДокумента.ХозяйственнаяОперация                    КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств            КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.СтатьяЦелевыхСредств                     КАК СтатьяЦелевыхСредств,
	|	ДанныеДокумента.ХозяйственнаяОперацияПоЗарплате          КАК ХозяйственнаяОперацияПоЗарплате,
	|	ДанныеДокумента.ФормаОплатыЗаявки                        КАК ФормаОплаты,
	|	ДанныеДокумента.СверхЛимита                              КАК СверхЛимита,
	|
	|	ДанныеДокумента.БанковскийСчет                           КАК БанковскийСчет,
	|	ДанныеДокумента.Номер                                    КАК Номер,
	|	ДанныеДокумента.НазначениеПлатежа                        КАК НазначениеПлатежа,
	|	ДанныеДокумента.Комментарий                              КАК Комментарий,
	|	ДанныеДокумента.Проведен                                 КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления                          КАК ПометкаУдаления,
	|	ДанныеДокумента.СуммаДокумента                           КАК СуммаДокумента,
	|	ДанныеДокумента.Договор                                  КАК Договор,
	|	ДанныеДокумента.НаправлениеДеятельности                  КАК НаправлениеДеятельности,
	|	ДанныеДокумента.КтоЗаявил                                КАК Ответственный,
	|	ДанныеДокумента.Автор                                    КАК Автор,
	|	ДанныеДокумента.КтоЗаявил                                КАК КтоЗаявил,
	|	ЕСТЬNULL(НаличиеВидаПодарочныйСертификат.ЕстьПодарочныйСертификат, ЛОЖЬ) КАК ЕстьПодарочныйСертификат,
	|	ДанныеДокумента.ПриоритетОплаты                          КАК ПриоритетОплаты,
	|	ДанныеДокумента.ПеречислениеСотрудникуЧерезБанк          КАК ПеречислениеСотрудникуЧерезБанк
	|ИЗ
	|	ДанныеДокументаШапка КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеВидаОбъектаРасчетовПодарочныйСертификат КАК НаличиеВидаПодарочныйСертификат
	|		ПО ИСТИНА
	|";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Для каждого КлючИЗначение Из ЗначенияПараметровПроведения(Реквизиты) Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьДанныеДокумента(Запрос, ДокументСсылка)

	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаДанныеДокументаШапка(СписокЗапросов);
	ТекстЗапросаДанныеДокументаТаблицаРасшифровкаПлатежа(СписокЗапросов);
	ТекстЗапросаДанныеДокументаТаблицаРаспределениеПоСчетам(СписокЗапросов);
	ТекстЗапросаДанныеДокументаТаблицаЛицевыеСчетаСотрудников(СписокЗапросов);

	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаШапка(СписокЗапросов)
	
	ТекстЗапросаШапка = "ВЫБРАТЬ
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеШапки.Проведен КАК Проведен,
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Статус КАК Статус,
	|	ДанныеШапки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеШапки.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеШапки.Валюта КАК Валюта,
	|	ДанныеШапки.ФормаОплатыНаличная КАК ФормаОплатыНаличная,
	|	ДанныеШапки.ФормаОплатыБезналичная КАК ФормаОплатыБезналичная,
	|	ДанныеШапки.ФормаОплатыПлатежнаяКарта КАК ФормаОплатыПлатежнаяКарта,
	|	ДанныеШапки.БанковскийСчет КАК БанковскийСчет,
	|	ДанныеШапки.Касса КАК Касса,
	|	ДанныеШапки.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ДанныеШапки.ЖелательнаяДатаПлатежа КАК ЖелательнаяДатаПлатежа,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ДанныеШапки.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	ДанныеШапки.БанковскийСчетПолучатель КАК БанковскийСчетПолучатель,
	|	ДанныеШапки.КассаПолучатель КАК КассаПолучатель,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ДанныеШапки.КтоЗаявил КАК КтоЗаявил,
	|	ДанныеШапки.КтоРешил КАК КтоРешил,
	|	ДанныеШапки.Комментарий КАК Комментарий,
	|	ДанныеШапки.ФормаОплатыЗаявки КАК ФормаОплатыЗаявки,
	|	ДанныеШапки.ДатаПлатежа КАК ДатаПлатежа,
	|	ДанныеШапки.ДокументОснование КАК ДокументОснование,
	|	ДанныеШапки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеШапки.Автор КАК Автор,
	|	ДанныеШапки.ВалютаКонвертации КАК ВалютаКонвертации,
	|	ДанныеШапки.СуммаКонвертации КАК СуммаКонвертации,
	|	ДанныеШапки.КурсКонвертации КАК КурсКонвертации,
	|	ДанныеШапки.ПланированиеСуммы КАК ПланированиеСуммы,
	|	ДанныеШапки.НомерВедомостиНаВыплатуЗарплаты КАК НомерВедомостиНаВыплатуЗарплаты,
	|	ДанныеШапки.ДатаВедомостиНаВыплатуЗарплаты КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	ДанныеШапки.СверхЛимита КАК СверхЛимита,
	|	ДанныеШапки.СтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	ДанныеШапки.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ДанныеШапки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ДанныеШапки.ХозяйственнаяОперацияПоЗарплате КАК ХозяйственнаяОперацияПоЗарплате,
	|	ДанныеШапки.ДатаАвансовогоОтчета КАК ДатаАвансовогоОтчета,
	|	ДанныеШапки.ДоговорСУчастникомГОЗ КАК ДоговорСУчастникомГОЗ,
	|	ДанныеШапки.ПлатежиПо275ФЗ КАК ПлатежиПо275ФЗ,
	|	ДанныеШапки.ТипПлатежаФЗ275 КАК ТипПлатежаФЗ275,
	|	ДанныеШапки.ПредметОплаты КАК ПредметОплаты,
	|	ДанныеШапки.ВариантОплаты КАК ВариантОплаты,
	|	ДанныеШапки.ПунктКонтрактаПредмета КАК ПунктКонтрактаПредмета,
	|	ДанныеШапки.ПунктКонтрактаОплаты КАК ПунктКонтрактаОплаты,
	|	ДанныеШапки.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
	|	ДанныеШапки.ВидПеречисленияВБюджет КАК ВидПеречисленияВБюджет,
	|	ДанныеШапки.КодОКАТО КАК КодОКАТО,
	|	ДанныеШапки.ПоказательОснования КАК ПоказательОснования,
	|	ДанныеШапки.ПоказательПериода КАК ПоказательПериода,
	|	ДанныеШапки.ПоказательНомера КАК ПоказательНомера,
	|	ДанныеШапки.ПоказательДаты КАК ПоказательДаты,
	|	ДанныеШапки.ПоказательТипа КАК ПоказательТипа,
	|	ДанныеШапки.СтатусСоставителя КАК СтатусСоставителя,
	|	ДанныеШапки.КодБК КАК КодБК,
	|	ДанныеШапки.ТипНалога КАК ТипНалога,
	|	ДанныеШапки.НДФЛПоВедомостям КАК НДФЛПоВедомостям,
	|	ДанныеШапки.ПриоритетОплаты КАК ПриоритетОплаты,
	|	ДанныеШапки.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ДанныеШапки.ИННПлательщика КАК ИННПлательщика,
	|	ДанныеШапки.КПППлательщика КАК КПППлательщика,
	|	ДанныеШапки.ТекстПлательщика КАК ТекстПлательщика,
	|	ДанныеШапки.ТипКомиссииЗаПеревод КАК ТипКомиссииЗаПеревод,
	|	ДанныеШапки.ИнформацияПолучателюПлатежа КАК ИнформацияПолучателюПлатежа,
	|	ДанныеШапки.УсловиеСделкиКонвертации КАК УсловиеСделкиКонвертации,
	|	ДанныеШапки.БанковскийСчетСписанияКомиссии КАК БанковскийСчетСписанияКомиссии,
	|	ДанныеШапки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеШапки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеШапки.Договор КАК Договор,
	|	ДанныеШапки.КратностьКурсаКонвертации КАК КратностьКурсаКонвертации,
	|	ДанныеШапки.Партнер КАК Партнер,
	|	ДанныеШапки.СписокФизЛиц КАК СписокФизЛиц,
	|	ДанныеШапки.КодВидаДохода КАК КодВидаДохода,
	|	ДанныеШапки.ДоговорЭквайринга КАК ДоговорЭквайринга,
	|	ДанныеШапки.ОтражатьКомиссию КАК ОтражатьКомиссию,
	|	ДанныеШапки.СуммаКомиссии КАК СуммаКомиссии,
	|	ДанныеШапки.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеШапки.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеШапки.НастройкаСчетовУчета КАК НастройкаСчетовУчета,
	|	ДанныеШапки.КодВыплат КАК КодВыплат,
	|	ДанныеШапки.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДанныеШапки.КонтролироватьОплатуПоОбъектамРасчетов КАК КонтролироватьОплатуПоОбъектамРасчетов,
	|	ДанныеШапки.Закрыта КАК Закрыта,
	|	ДанныеШапки.ПеречислениеСотрудникуЧерезБанк КАК ПеречислениеСотрудникуЧерезБанк,
	|	ДанныеШапки.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	ДанныеШапки.СписокКонтрагентов КАК СписокКонтрагентов,
	|	ДанныеШапки.Контрагент.Партнер КАК КонтрагентПартнер,
	|	ДанныеШапки.БанковскийСчет.НаправлениеДеятельности КАК БанковскийСчетНаправлениеДеятельности,
	|	ДанныеШапки.Касса.НаправлениеДеятельности КАК КассаНаправлениеДеятельности,
	|	ДанныеШапки.ДоговорЭквайринга.НаправлениеДеятельности КАК ДоговорЭквайрингаНаправлениеДеятельности
	|ПОМЕСТИТЬ ДанныеДокументаШапка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапросаШапка);
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаТаблицаРасшифровкаПлатежа(СписокЗапросов)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	ТаблицаРасшифровкаПлатежа.Партнер КАК Партнер,
	|	ТаблицаРасшифровкаПлатежа.Сумма КАК Сумма,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаРасшифровкаПлатежа.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	ТаблицаРасшифровкаПлатежа.Комментарий КАК Комментарий,
	|	ТаблицаРасшифровкаПлатежа.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита КАК ТипСуммыКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.Подразделение КАК Подразделение,
	|	ТаблицаРасшифровкаПлатежа.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|	ТаблицаРасшифровкаПлатежа.Ведомость КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.Организация КАК Организация,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТаблицаРасшифровкаПлатежа.НастройкаСчетовУчета КАК НастройкаСчетовУчета,
	|	ТаблицаРасшифровкаПлатежа.КурсЧислительВзаиморасчетов КАК КурсЧислительВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов КАК КурсЗнаменательВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	ТаблицаРасшифровкаПлатежа.ДатаПогашения КАК ДатаПогашения,
	//++ НЕ УТ
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды.Подразделение КАК ДоговорАрендыПодразделение,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды.НаправлениеДеятельности КАК ДоговорАрендыНаправлениеДеятельности,
	//-- НЕ УТ
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.НаправлениеДеятельности КАК ОбъектРасчетовНаправлениеДеятельности,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК ОбъектРасчетовДоговор,
	|	ТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСОсновногоДолга КАК
	|		ДоговорКредитаДепозитаСтатьяДДСОсновногоДолга,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСПоступленияВыдачи КАК
	|		ДоговорКредитаДепозитаСтатьяДДСПоступленияВыдачи,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСПроцентов КАК ДоговорКредитаДепозитаСтатьяДДСПроцентов,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСКомиссии КАК ДоговорКредитаДепозитаСтатьяДДСКомиссии,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.НаправлениеДеятельности КАК
	|		ДоговорКредитаДепозитаНаправлениеДеятельности
	|ПОМЕСТИТЬ ДанныеДокументаТаблицаРасшифровкаПлатежа
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ТаблицаРасшифровкаПлатежа.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаТаблицаРаспределениеПоСчетам(СписокЗапросов)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТаблицаРаспределениеПоСчетам.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРаспределениеПоСчетам.Ссылка КАК Ссылка,
	|	ТаблицаРаспределениеПоСчетам.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ТаблицаРаспределениеПоСчетам.Сумма КАК Сумма,
	|	ТаблицаРаспределениеПоСчетам.ДатаПлатежа КАК ДатаПлатежа
	|ПОМЕСТИТЬ ДанныеДокументаТаблицаРаспределениеПоСчетам
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РаспределениеПоСчетам КАК ТаблицаРаспределениеПоСчетам
	|ГДЕ
	|	ТаблицаРаспределениеПоСчетам.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаТаблицаЛицевыеСчетаСотрудников(СписокЗапросов)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТаблицаЛицевыеСчетаСотрудников.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЛицевыеСчетаСотрудников.Ссылка КАК Ссылка,
	|	ТаблицаЛицевыеСчетаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаЛицевыеСчетаСотрудников.ЛицевойСчет КАК ЛицевойСчет,
	|	ТаблицаЛицевыеСчетаСотрудников.Сумма КАК Сумма,
	|	ТаблицаЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ДанныеДокументаТаблицаЛицевыеСчетаСотрудников
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.ЛицевыеСчетаСотрудников КАК ТаблицаЛицевыеСчетаСотрудников
	|ГДЕ
	|	ТаблицаЛицевыеСчетаСотрудников.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ЗначенияПараметровПроведения(Реквизиты = Неопределено)
	
	Значения = Новый Структура;
	Значения.Вставить("ИдентификаторМетаданных",                         ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ЗаявкаНаРасходованиеДенежныхСредств"));
	Значения.Вставить("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств", ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств"));
	Значения.Вставить("ИспользоватьНачислениеЗарплаты",                  Константы.ИспользоватьНачислениеЗарплаты.Получить());
	Значения.Вставить("ИспользоватьЛимитыРасходаДенежныхСредств",        ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредств"));
	Значения.Вставить("ИспользоватьЛимитыРасходаПоОрганизациям",         ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствПоОрганизациям"));
	Значения.Вставить("ИспользоватьЛимитыРасходаПоПодразделениям",       ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствПоПодразделениям"));
	Значения.Вставить("ИспользоватьУчетПрочихАктивовПассивов",           ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихАктивовПассивов"));
	
	Если Реквизиты <> Неопределено Тогда
		Значения.Вставить("СтатьяДвиженияДенежныхСредств",               СтатьяДвиженияДенежныхСредствДокумента(Реквизиты));
		Значения.Вставить("СверхЛимита",                                 Реквизиты.СверхЛимита);
		Значения.Вставить("НомерНаПечать",                               ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	КонецЕсли;
	
	Возврат Значения;
	
КонецФункции

Процедура ИнициализироватьКлючиАналитикиУчетаПоПартнерам(Реквизиты, ДокументСсылка, МенеджерВременныхТаблиц, ДокументОбъект = Неопределено)

	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВЫБОР КОГДА ТаблицаРасшифровкаПлатежа.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		ТОГДА &Организация
	|		ИНАЧЕ ТаблицаРасшифровкаПлатежа.Организация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию))
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		ИНАЧЕ ТаблицаРасшифровкаПлатежа.Партнер
	|	КОНЕЦ КАК Партнер,
	|	ВЫБОР КОГДА &СписокКонтрагентов
	|			ТОГДА ТаблицаРасшифровкаПлатежа.Контрагент
	|		ИНАЧЕ &Контрагент
	|	КОНЕЦ КАК Контрагент,
	|
	|	ВЫБОР КОГДА &ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию))
	|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетовДоговор, ЗНАЧЕНИЕ(Справочник.ДоговорыМеждуОрганизациями.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетовДоговор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов)) ТОГДА
	|			ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозитаНаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	//++ НЕ УТ
	|		КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)) ТОГДА
	|			ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ДоговорАрендыНаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	//-- НЕ УТ
	|		ИНАЧЕ
	|			ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетовНаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|	КОНЕЦ КАК НаправлениеДеятельности
	|
	|ПОМЕСТИТЬ ТаблицаОбъектовРасчетов
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	
	|ГДЕ
	|	ТаблицаРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И &ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеТаможне),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
	//++ НЕ УТ
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю),
	//-- НЕ УТ
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОбъектовРасчетов.Организация КАК Организация,
	|	ТаблицаОбъектовРасчетов.Контрагент  КАК Контрагент,
	|	ТаблицаОбъектовРасчетов.Партнер     КАК Партнер,
	|	ТаблицаОбъектовРасчетов.Договор     КАК Договор,
	|	ТаблицаОбъектовРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ТаблицаОбъектовРасчетов КАК ТаблицаОбъектовРасчетов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		ТаблицаОбъектовРасчетов.Организация = Аналитика.Организация
	|		И ТаблицаОбъектовРасчетов.Контрагент = Аналитика.Контрагент
	|		И ТаблицаОбъектовРасчетов.Партнер = Аналитика.Партнер
	|		И ТаблицаОбъектовРасчетов.Договор = Аналитика.Договор
	|		И ТаблицаОбъектовРасчетов.НаправлениеДеятельности = Аналитика.НаправлениеДеятельности
	|ГДЕ
	|	Аналитика.КлючАналитики ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОбъектовРасчетов.Организация           КАК Организация,
	|	&ОрганизацияПолучатель                        КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие) КАК Партнер,
	|	ТаблицаОбъектовРасчетов.Договор   КАК Договор,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности
	|ИЗ
	|	ТаблицаОбъектовРасчетов КАК ТаблицаОбъектовРасчетов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		ТаблицаОбъектовРасчетов.Организация = Аналитика.Организация
	|		И &ОрганизацияПолучатель = Аналитика.Контрагент
	|		И ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие) = Аналитика.Партнер
	|		И ТаблицаОбъектовРасчетов.Договор = Аналитика.Договор
	|		И ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = Аналитика.НаправлениеДеятельности
	|ГДЕ
	|	Аналитика.КлючАналитики ЕСТЬ NULL
	|	И &ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию))
	|");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("ОрганизацияПолучатель", Реквизиты.ОрганизацияПолучатель);
	Запрос.УстановитьПараметр("Контрагент", Реквизиты.Контрагент);
	Запрос.УстановитьПараметр("СписокКонтрагентов", Реквизиты.СписокКонтрагентов);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Реквизиты.ХозяйственнаяОперация);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Если ДокументОбъект = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДанныеДокументаТаблицаРасшифровкаПлатежа", "Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаРасшифровкаПлатежа.ОбъектРасчетовДоговор", "ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.Договор");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозитаНаправлениеДеятельности", "ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.НаправлениеДеятельности");
		//++ НЕ УТ
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаРасшифровкаПлатежа.ДоговорАрендыНаправлениеДеятельности", "ТаблицаРасшифровкаПлатежа.ДоговорАренды.НаправлениеДеятельности");
		//-- НЕ УТ
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаРасшифровкаПлатежа.ОбъектРасчетовНаправлениеДеятельности", "ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.НаправлениеДеятельности");
	КонецЕсли;

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.АналитикаУчетаПоПартнерам.СоздатьКлючАналитики(Выборка);
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаВременнаяТаблицаРасшифровкаПлатежа(Запрос, ТекстыЗапроса, ДокументОбъект)
	
	ИмяРегистра = "ТаблицаРасшифровкаПлатежа";
	
	УстановитьПараметрЗапросаАналитикаУчетаПоПартнерам(Запрос, ДокументОбъект);
	
	ВидыНДФЛ = Новый Массив;
	ВидыНДФЛ.Добавить(Справочники.ВидыНалоговВзносов.ПолучитьСсылкуПредопределенногоЭлемента("НДФЛ"));
	ВидыНДФЛ.Добавить(Справочники.ВидыНалоговВзносов.ПолучитьСсылкуПредопределенногоЭлемента("НДФЛСПревышения"));
	Запрос.УстановитьПараметр("ВидыНДФЛ", ВидыНДФЛ);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
	|
	|	ТаблицаРасшифровкаПлатежа.Сумма КАК Сумма,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	
	|	ТаблицаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|
	|	ЕСТЬNULL(Аналитика.КлючАналитики, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита КАК ТипСуммыКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	НЕОПРЕДЕЛЕНО КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	ВЫБОР
	|		КОГДА &ЕстьПодарочныйСертификат = ИСТИНА
	|			ТОГДА &Партнер
	|		ИНАЧЕ ТаблицаРасшифровкаПлатежа.Партнер
	|	КОНЕЦ КАК Партнер,
	|	ЕСТЬNULL(ТаблицаОбъектовРасчетов.Контрагент, &Контрагент) КАК Контрагент,
	//++ НЕ УТ
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
	|		ТОГДА ТаблицаРасшифровкаПлатежа.ДоговорАрендыПодразделение 
	|		ИНАЧЕ
	//-- НЕ УТ
	|			НЕОПРЕДЕЛЕНО
	//++ НЕ УТ
	|	КОНЕЦ 
	//-- НЕ УТ
	|	КАК Подразделение,
	|
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|
	|ПОМЕСТИТЬ ТаблицаРасшифровкаПлатежа
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОбъектовРасчетов КАК ТаблицаОбъектовРасчетов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.ОбъектРасчетов = ТаблицаОбъектовРасчетов.ОбъектРасчетов
	|		И ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОбъектовРасчетов.Партнер
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		ТаблицаОбъектовРасчетов.Организация = Аналитика.Организация
	|		И ТаблицаОбъектовРасчетов.Контрагент = Аналитика.Контрагент
	|		И ВЫБОР КОГДА &ЕстьПодарочныйСертификат = ИСТИНА
	|			ТОГДА &Партнер
	|			ИНАЧЕ ТаблицаОбъектовРасчетов.Партнер
	|		КОНЕЦ = Аналитика.Партнер
	|		И ТаблицаОбъектовРасчетов.Договор = Аналитика.Договор
	|		И ТаблицаОбъектовРасчетов.НаправлениеДеятельности = Аналитика.НаправлениеДеятельности
	|ГДЕ
	|	&ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеТаможне)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|
	|	ТаблицаРасшифровкаПлатежа.Сумма КАК Сумма,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКредитаДепозита,
	|	НЕОПРЕДЕЛЕНО КАК ТипСуммыКредитаДепозита,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорЗаймаСотруднику,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАренды,
	|	НЕОПРЕДЕЛЕНО КАК ТипПлатежаПоАренде,
	|	ТаблицаРасшифровкаПлатежа.Ведомость КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	
	|ГДЕ
	|	&ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
	|
	|	ТаблицаРасшифровкаПлатежа.Сумма КАК Сумма,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	
	|	ТаблицаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|
	|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено) КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита КАК ТипСуммыКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет)
	|				И ДанныеДокумента.ТипНалога В (&ВидыНДФЛ)
	|		ТОГДА ТаблицаРасшифровкаПлатежа.Ведомость 
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	ТаблицаРасшифровкаПлатежа.Партнер КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
	|		ТОГДА ТаблицаРасшифровкаПлатежа.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Подразделение,
	|
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
	|		ТОГДА ТаблицаРасшифровкаПлатежа.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств))
	|		ТОГДА ТаблицаРасшифровкаПлатежа.СтатьяРасходов
	|		КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет))
	|		ТОГДА
	|			ВЫБОР КОГДА &ИспользоватьУчетПрочихАктивовПассивов ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатьяРасходов,
	|	ТаблицаРасшифровкаПлатежа.АналитикаРасходов КАК АналитикаРасходов,
	|	ВЫБОР КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет) 
	|		ТОГДА ДанныеДокумента.ТипНалога 
	|		ИНАЧЕ ТаблицаРасшифровкаПлатежа.АналитикаАктивовПассивов
	|	КОНЕЦ КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК ДанныеДокумента
	|		ПО ТаблицаРасшифровкаПлатежа.Ссылка = ДанныеДокумента.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		&Организация = Аналитика.Организация
	|		И &Контрагент = Аналитика.Контрагент
	|		И ТаблицаРасшифровкаПлатежа.Партнер = Аналитика.Партнер
	|		И Аналитика.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		И Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|ГДЕ
	|	&ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
	|
	|	ТаблицаРасшифровкаПлатежа.Сумма КАК Сумма,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	
	|	ТаблицаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|
	|	ЕСТЬNULL(Аналитика.КлючАналитики, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита КАК ТипСуммыКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	НЕОПРЕДЕЛЕНО КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|	
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОбъектовРасчетов КАК ТаблицаОбъектовРасчетов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.ОбъектРасчетов = ТаблицаОбъектовРасчетов.ОбъектРасчетов
	|		И ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие) = ТаблицаОбъектовРасчетов.Партнер
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		ТаблицаОбъектовРасчетов.Организация = Аналитика.Организация
	|		И &ОрганизацияПолучатель = Аналитика.Контрагент
	|		И ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие) = Аналитика.Партнер
	|		И ТаблицаОбъектовРасчетов.Договор = Аналитика.Договор
	|		И ТаблицаОбъектовРасчетов.НаправлениеДеятельности = Аналитика.НаправлениеДеятельности
	|ГДЕ
	|	&ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов,
	|
	|	ТаблицаРасшифровкаПлатежа.Сумма,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	
	|	ТаблицаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|
	|	ЕСТЬNULL(Аналитика.КлючАналитики, НЕОПРЕДЕЛЕНО),
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	НЕОПРЕДЕЛЕНО КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств,
	|	ВЫБОР
	|		КОГДА ТаблицаРасшифровкаПлатежа.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
	|			ТаблицаРасшифровкаПлатежа.Партнер
	|		ИНАЧЕ
	|			ДанныеДокумента.КонтрагентПартнер
	|	КОНЕЦ КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК ДанныеДокумента
	|		ПО ТаблицаРасшифровкаПлатежа.Ссылка = ДанныеДокумента.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО (&Организация = Аналитика.Организация)
	|			И (&Контрагент = Аналитика.Контрагент)
	|			И ВЫБОР
	|				КОГДА ТаблицаРасшифровкаПлатежа.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
	|					ТаблицаРасшифровкаПлатежа.Партнер
	|				ИНАЧЕ
	|					ТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.Партнер
	|			КОНЕЦ = Аналитика.Партнер
	|			И ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) = Аналитика.Договор
	|			И ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = Аналитика.НаправлениеДеятельности
	|ГДЕ
	|	&ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов,
	|
	|	ТаблицаРасшифровкаПлатежа.Сумма,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	
	|	ТаблицаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|
	|	ЕСТЬNULL(Аналитика.КлючАналитики, НЕОПРЕДЕЛЕНО),
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	НЕОПРЕДЕЛЕНО КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО (&Организация = Аналитика.Организация)
	|			И (&Контрагент = Аналитика.Контрагент)
	|			И ТаблицаРасшифровкаПлатежа.Партнер = Аналитика.Партнер
	|			И ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) = Аналитика.Договор
	|			И ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = Аналитика.НаправлениеДеятельности
	|ГДЕ
	|	&ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
	|	)
	|	И &ИспользоватьНачислениеЗарплаты
	//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ТаблицаРасшифровкаПлатежа.ОбъектРасчетов,
	|
	|	ТаблицаРасшифровкаПлатежа.Сумма,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	
	|	ТаблицаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|
	|	ЕСТЬNULL(Аналитика.КлючАналитики, НЕОПРЕДЕЛЕНО),
	|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
	|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
	|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	НЕОПРЕДЕЛЕНО КАК Ведомость,
	|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств,
	|	ВЫБОР
	|		КОГДА ТаблицаРасшифровкаПлатежа.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
	|			ТаблицаРасшифровкаПлатежа.Партнер
	|		ИНАЧЕ
	|			ДанныеДокумента.КонтрагентПартнер
	|	КОНЕЦ КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	ТаблицаРасшифровкаПлатежа.Ссылка КАК Ссылка
	|
	|ИЗ
	|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК ДанныеДокумента
	|		ПО ТаблицаРасшифровкаПлатежа.Ссылка = ДанныеДокумента.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО (&Организация = Аналитика.Организация)
	|			И (&Контрагент = Аналитика.Контрагент)
	|			И ВЫБОР
	|				КОГДА ТаблицаРасшифровкаПлатежа.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
	|					ТаблицаРасшифровкаПлатежа.Партнер
	|				ИНАЧЕ
	|					ДанныеДокумента.КонтрагентПартнер
	|			КОНЕЦ = Аналитика.Партнер
	|			И ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) = Аналитика.Договор
	|			И ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ДоговорАренды.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = Аналитика.НаправлениеДеятельности
	|ГДЕ
	|	&ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
	|	)
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	НЕОПРЕДЕЛЕНО,
	|
	|	Заявка.СуммаДокумента,
	|	Заявка.СуммаДокумента,
	|	Заявка.Валюта,
	|
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	
	|	&АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО КАК Ведомость,
	|	Заявка.СтатьяДвиженияДенежныхСредств,
	|	Заявка.СтатьяЦелевыхСредств,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	Заявка.Ссылка
	|
	|ИЗ
	|	ДанныеДокументаШапка КАК Заявка
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
	|	И НЕ &ИспользоватьНачислениеЗарплаты
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДенежныеСредстваКВыплате(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект = Неопределено)
	
	ИмяРегистра = "ДенежныеСредстваКВыплате";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаРаспределениеПоСчетам.ДатаПлатежа КАК Период,
	|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ТаблицаРаспределениеПоСчетам.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СписокФизЛиц ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
	|		) ТОГДА
	|			&ПодотчетноеЛицо
	|		КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
	|		) ТОГДА
	|			&ОрганизацияПолучатель
	|		КОГДА ДанныеДокумента.СписокКонтрагентов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			&КонтрагентИзДокумента
	|	КОНЕЦ КАК Получатель,
	|	
	|	&Организация КАК Организация,
	|	
	|	ТаблицаРаспределениеПоСчетам.Сумма КАК Сумма,
	|	
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ИЗ
	|	ДанныеДокументаШапка КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ДанныеДокументаТаблицаРаспределениеПоСчетам КАК ТаблицаРаспределениеПоСчетам
	|	ПО
	|		ТаблицаРаспределениеПоСчетам.Ссылка = ДанныеДокумента.Ссылка
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И &ИспользоватьЗаявкиНаРасходованиеДенежныхСредств
	|	И &Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|	И НЕ ТаблицаРаспределениеПоСчетам.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ДанныеДокумента.ЖелательнаяДатаПлатежа КАК Период,
	|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СписокФизЛиц ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
	|		) ТОГДА
	|			&ПодотчетноеЛицо
	|		КОГДА &ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
	|		) ТОГДА
	|			&ОрганизацияПолучатель
	|		КОГДА ДанныеДокумента.СписокКонтрагентов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			&КонтрагентИзДокумента
	|	КОНЕЦ КАК Получатель,
	|	
	|	&Организация КАК Организация,
	|	
	|	ДанныеДокумента.СуммаДокумента - СУММА(ЕСТЬNULL(ТаблицаРаспределениеПоСчетам.Сумма, 0)) КАК Сумма,
	|	
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|
	|ИЗ
	|	ДанныеДокументаШапка КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ДанныеДокументаТаблицаРаспределениеПоСчетам КАК ТаблицаРаспределениеПоСчетам
	|	ПО
	|		ТаблицаРаспределениеПоСчетам.Ссылка = ДанныеДокумента.Ссылка
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И &ИспользоватьЗаявкиНаРасходованиеДенежныхСредств
	|	И &Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.ЖелательнаяДатаПлатежа,
	|	ДанныеДокумента.СписокФизЛиц,
	|	ДанныеДокумента.СписокКонтрагентов,
	|	ДанныеДокумента.СуммаДокумента
	|
	|ИМЕЮЩИЕ
	|	ДанныеДокумента.СуммаДокумента - СУММА(ЕСТЬNULL(ТаблицаРаспределениеПоСчетам.Сумма, 0)) > 0
	|";
	
	Если ДокументОбъект = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокументаШапка", "Документ.ЗаявкаНаРасходованиеДенежныхСредств");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокументаТаблицаРаспределениеПоСчетам", "Документ.ЗаявкаНаРасходованиеДенежныхСредств.РаспределениеПоСчетам");
	КонецЕсли;
	#Область УХ_Встраивание
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	ВЫБОР
		|		КОГДА РазмещениеЗаявок.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ РазмещениеЗаявок.БанковскийСчетКасса
		|	КОНЕЦ КАК БанковскийСчетКасса,
		|	ВЫБОР
		|		КОГДА РазмещениеЗаявок.ЗаявкаНаОперацию.СписокФизЛиц
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА РазмещениеЗаявок.ЗаявкаНаОперацию.СписокКонтрагентов
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА &ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику))
		|			ТОГДА &ПодотчетноеЛицо
		|		КОГДА &ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств))
		|			ТОГДА &ОрганизацияПолучатель
		|		ИНАЧЕ &Контрагент
		|	КОНЕЦ КАК Получатель,
		|	РазмещениеЗаявок.Организация КАК Организация,
		|	СУММА(РазмещениеЗаявок.СуммаВзаиморасчетов) КАК Сумма,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	РазмещениеЗаявок.ДатаИсполнения КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
		|ИЗ
		|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
		|ГДЕ
		|	РазмещениеЗаявок.ЗаявкаНаОперацию = &Ссылка
		|	И РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
		|	И РазмещениеЗаявок.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РазмещениеЗаявок.ЗаявкаНаОперацию,
		|	РазмещениеЗаявок.Контрагент,
		|	РазмещениеЗаявок.Организация,
		|	ВЫБОР
		|		КОГДА РазмещениеЗаявок.ЗаявкаНаОперацию.СписокФизЛиц
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА РазмещениеЗаявок.ЗаявкаНаОперацию.СписокКонтрагентов
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА &ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику))
		|			ТОГДА &ПодотчетноеЛицо
		|		КОГДА &ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств))
		|			ТОГДА &ОрганизацияПолучатель
		|		ИНАЧЕ &Контрагент
		|	КОНЕЦ,
		|	РазмещениеЗаявок.ДатаИсполнения,
		|	ВЫБОР
		|		КОГДА РазмещениеЗаявок.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ РазмещениеЗаявок.БанковскийСчетКасса
		|	КОНЕЦ";

	#КонецОбласти
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаЛимитыРасходаДенежныхСредств(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	
	ИмяРегистра = "ЛимитыРасходаДенежныхСредств";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если Запрос.Параметры.Свойство("ИспользоватьЛимитыРасходаДенежныхСредств") Тогда
		ИспользоватьЛимитыРасходаДенежныхСредств = Запрос.Параметры.ИспользоватьЛимитыРасходаДенежныхСредств;
	Иначе
		ИспользоватьЛимитыРасходаДенежныхСредств = ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредств");
	КонецЕсли;
	
	Если НЕ ИспользоватьЛимитыРасходаДенежныхСредств Тогда
		Возврат "";
	КонецЕсли;

	Если НЕ (ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасшифровкаПлатежа", ТекстыЗапроса) Тогда
		ТекстЗапросаВременнаяТаблицаРасшифровкаПлатежа(Запрос, ТекстыЗапроса, ДокументОбъект);
	КонецЕсли; 
	
	УстановитьПараметрыЗапросаКоэффициентыВалют(Запрос);

	МассивТекстовЗапроса = Новый Массив;
	
	Если (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств
		//++ НЕ УТ
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю
		//-- НЕ УТ
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
		И НЕ ДокументОбъект.СписокФизЛиц Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтрокиЗаявки,
		|	0 КАК НомерСтрокиВедомости,
		|	
		|	ВЫБОР КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ДатаПлатежа, МЕСЯЦ)
		|	КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ЖелательнаяДатаПлатежа, МЕСЯЦ)
		|	ИНАЧЕ
		|		НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	КОНЕЦ КАК Период,
		|	
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоОрганизациям
		|			ТОГДА &Организация 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	КОНЕЦ КАК Организация,
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоПодразделениям
		|			ТОГДА &Подразделение 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	
		|	ВЫБОР
		|		КОГДА НЕ &СверхЛимита
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходВПределахЛимита,
		|	
		|	ВЫБОР
		|		КОГДА &СверхЛимита
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходСверхЛимита
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|	ПО
		|		ИСТИНА
		|
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		И ДокументОбъект.СписокФизЛиц Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаЛицевыеСчетаСотрудников.НомерСтроки КАК НомерСтрокиЗаявки,
		|	0 КАК НомерСтрокиВедомости,
		|	
		|	ВЫБОР КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ДатаПлатежа, МЕСЯЦ)
		|	КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ЖелательнаяДатаПлатежа, МЕСЯЦ)
		|	ИНАЧЕ
		|		НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	КОНЕЦ КАК Период,
		|	
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоОрганизациям
		|			ТОГДА &Организация 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	КОНЕЦ КАК Организация,
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоПодразделениям
		|			ТОГДА &Подразделение 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	
		|	ТаблицаЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	
		|	ВЫБОР
		|		КОГДА НЕ &СверхЛимита
		|			ТОГДА ТаблицаЛицевыеСчетаСотрудников.Сумма * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходВПределахЛимита,
		|	
		|	ВЫБОР
		|		КОГДА &СверхЛимита
		|			ТОГДА ТаблицаЛицевыеСчетаСотрудников.Сумма * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходСверхЛимита
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаЛицевыеСчетаСотрудников КАК ТаблицаЛицевыеСчетаСотрудников
		|		ПО ДанныеДокумента.Ссылка = ТаблицаЛицевыеСчетаСотрудников.Ссылка
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтрокиЗаявки,
		|	0 КАК НомерСтрокиВедомости,
		|	
		|	ВЫБОР КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ДатаПлатежа, МЕСЯЦ)
		|	КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ЖелательнаяДатаПлатежа, МЕСЯЦ)
		|	ИНАЧЕ
		|		НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	КОНЕЦ КАК Период,
		|	
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоОрганизациям
		|			ТОГДА &Организация 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	КОНЕЦ КАК Организация,
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоПодразделениям
		|			ТОГДА &Подразделение 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	
		|	&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	
		|	ВЫБОР
		|		КОГДА НЕ &СверхЛимита
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ДанныеДокумента.СуммаДокумента) * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходВПределахЛимита,
		|	
		|	ВЫБОР
		|		КОГДА &СверхЛимита
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ДанныеДокумента.СуммаДокумента) * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходСверхЛимита
		|	
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		ДанныеДокументаТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|	ПО
		|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	0 КАК НомерСтрокиЗаявки,
		|	0 КАК НомерСтрокиВедомости,
		|	
		|	ВЫБОР КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ДатаПлатежа, МЕСЯЦ)
		|	КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		НАЧАЛОПЕРИОДА(&ЖелательнаяДатаПлатежа, МЕСЯЦ)
		|	ИНАЧЕ
		|		НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	КОНЕЦ КАК Период,
		|	
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоОрганизациям
		|			ТОГДА &Организация 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	КОНЕЦ КАК Организация,
		|	ВЫБОР
		|		КОГДА &ИспользоватьЛимитыРасходаПоПодразделениям
		|			ТОГДА &Подразделение 
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,&СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
		|	
		|	ВЫБОР
		|		КОГДА НЕ &СверхЛимита 
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма,ДанныеДокумента.СуммаДокумента) * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходВПределахЛимита,
		|	
		|	ВЫБОР
		|		КОГДА &СверхЛимита 
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма,ДанныеДокумента.СуммаДокумента) * &КоэффициентПересчетаВВалютуУпр 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РасходСверхЛимита
		|	
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|	ПО
		|		&ИспользоватьНачислениеЗарплаты
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если МассивТекстовЗапроса.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРасчетыПоФинансовымИнструментам(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	
	ИмяРегистра = "РасчетыПоФинансовымИнструментам";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ (ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасшифровкаПлатежа", ТекстыЗапроса) Тогда
		ТекстЗапросаВременнаяТаблицаРасшифровкаПлатежа(Запрос, ТекстыЗапроса, ДокументОбъект);
	КонецЕсли;
	
	УстановитьПараметрЗапросаАналитикаУчетаПоПартнерам(Запрос, ДокументОбъект);
	
	Если Запрос.Параметры.Свойство("ИспользоватьНачислениеЗарплаты") Тогда
		ИспользоватьНачислениеЗарплаты = Запрос.Параметры.ИспользоватьНачислениеЗарплаты;
	Иначе
		ИспользоватьНачислениеЗарплаты = Константы.ИспользоватьНачислениеЗарплаты.Получить();
	КонецЕсли;
	
	МассивТекстовЗапросов = Новый Массив;
	
	Если (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов) Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаРасшифровкаПлатежа.НомерСтроки                       КАК НомерСтроки,
		|	&Период                                                     КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                      КАК ВидДвижения,
		
		|	ТаблицаРасшифровкаПлатежа.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита            КАК Договор,
		|	ВЫБОР
		|		КОГДА &ХозяйственнаяОперация В (
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
		|		ИНАЧЕ ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита
		|	КОНЕЦ КАК ТипСуммы,
		|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов              КАК Валюта,
		
		|	0 КАК Сумма,
		|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов               КАК Оплачивается,
		|	0 КАК СуммаУпр,
		|	0 КАК СуммаРегл,
		
		|	&ХозяйственнаяОперация                                      КАК ХозяйственнаяОперация,
		|	ВЫБОР
		|		КОГДА ДанныеДоговора.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыГрафиковФинансовыхИнструментов.Оплаты)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыГрафиковФинансовыхИнструментов.Транши)
		|	КОНЕЦ КАК ТипГрафика,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств     КАК СтатьяАналитики,
		|	&Ссылка                                                     КАК ЗаявкаНаРасходованиеДенежныхСредств
		|	
		|ИЗ
		|	ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
		|		ПО ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита = ДанныеДоговора.Ссылка";
		
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	//++ НЕ УТ
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаРасшифровкаПлатежа.НомерСтроки                       КАК НомерСтроки,
		|	&Период                                                     КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                      КАК ВидДвижения,
		
		|	ТаблицаРасшифровкаПлатежа.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	ТаблицаРасшифровкаПлатежа.ДоговорАренды                     КАК Договор,
		|	ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде                КАК ТипСуммы,
		|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов              КАК Валюта,
		
		|	0 КАК Сумма,
		|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов               КАК Оплачивается,
		|	0 КАК СуммаУпр,
		|	0 КАК СуммаРегл,
		
		|	&ХозяйственнаяОперация                                      КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыГрафиковФинансовыхИнструментов.Оплаты) КАК ТипГрафика,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств     КАК СтатьяАналитики,
		|	&Ссылка                                                     КАК ЗаявкаНаРасходованиеДенежныхСредств
		|	
		|ИЗ
		|	ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыАренды КАК ДанныеДоговора
		|		ПО ТаблицаРасшифровкаПлатежа.ДоговорАренды = ДанныеДоговора.Ссылка
		|";
		
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	//-- НЕ УТ
	
	Если МассивТекстовЗапросов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДенежныхСредств(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	
	ИмяРегистра = "ДвиженияДенежныхСредств";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасшифровкаПлатежа", ТекстыЗапроса) Тогда
		ТекстЗапросаВременнаяТаблицаРасшифровкаПлатежа(Запрос, ТекстыЗапроса, ДокументОбъект);
	КонецЕсли;
	
	Если НЕ (ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате) Тогда
		Возврат "";
	КонецЕсли;
	
	МассивТекстовЗапроса = Новый Массив;
	
	Если (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты)
		И НЕ ДокументОбъект.СписокФизЛиц Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		&ДатаПлатежа
		|	КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		&ЖелательнаяДатаПлатежа
		|	ИНАЧЕ
		|		НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ВЫБОР ДанныеДокумента.ФормаОплатыЗаявки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
		|			ДанныеДокумента.Касса
		|		ИНАЧЕ
		|			ДанныеДокумента.БанковскийСчет
		|	КОНЕЦ КАК ДенежныеСредства,
		|	ВЫБОР ДанныеДокумента.ФормаОплатыЗаявки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ВЫБОР
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) ТОГДА
		|			ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
		|		ИНАЧЕ &СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
		|	ВЫБОР
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) ТОГДА
		|			ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств
		|		ИНАЧЕ &СтатьяЦелевыхСредств
		|	КОНЕЦ КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
		|				ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты)
		|			ТОГДА ДанныеДокумента.БанковскийСчетПолучатель
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств)
		|			ТОГДА ДанныеДокумента.КассаПолучатель
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо
		|	КОНЕЦ КАК КорДенежныеСредства,
		|	ВЫБОР
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваВПути)
		|	КОНЕЦ КАК КорТипДенежныхСредств,
		|	ДанныеДокумента.Валюта КАК КорВалюта,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ВЫБОР
		|					КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|						ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ДанныеДокумента.СуммаДокумента)
		|					ИНАЧЕ ДанныеДокумента.СуммаДокумента
		|				КОНЕЦ
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ВЫБОР
		|					КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|						ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ДанныеДокумента.СуммаДокумента)
		|					ИНАЧЕ ДанныеДокумента.СуммаДокумента
		|				КОНЕЦ
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	ВЫБОР
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
		|				ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты)
		|			ТОГДА ДанныеДокумента.БанковскийСчетПолучатель
		|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств)
		|			ТОГДА ДанныеДокумента.КассаПолучатель
		|	КОНЕЦ КАК ИсточникКорГФУДенежныхСредств,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО (ИСТИНА)
		|";
	
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		И ДокументОбъект.СписокФизЛиц Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ВЫБОР ДанныеДокумента.ФормаОплатыЗаявки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ДанныеДокумента.Касса
		|		ИНАЧЕ ДанныеДокумента.БанковскийСчет
		|	КОНЕЦ КАК ДенежныеСредства,
		|	ВЫБОР ДанныеДокумента.ФормаОплатыЗаявки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ТаблицаЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	&СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	ДанныеДокумента.ПодотчетноеЛицо КАК КорДенежныеСредства,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК КорТипДенежныхСредств,
		|	ДанныеДокумента.Валюта КАК КорВалюта,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|				ТОГДА ТаблицаЛицевыеСчетаСотрудников.Сумма
		|		КОНЕЦ) КАК СуммаКВыплатеВРамкахЛимита,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|				ТОГДА ТаблицаЛицевыеСчетаСотрудников.Сумма
		|		КОНЕЦ) КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникКорГФУДенежныхСредств,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаЛицевыеСчетаСотрудников КАК ТаблицаЛицевыеСчетаСотрудников
		|		ПО ДанныеДокумента.Ссылка = ТаблицаЛицевыеСчетаСотрудников.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Подразделение,
		|	ВЫБОР ДанныеДокумента.ФормаОплатыЗаявки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ДанныеДокумента.Касса
		|		ИНАЧЕ ДанныеДокумента.БанковскийСчет
		|	КОНЕЦ,
		|	ВЫБОР ДанныеДокумента.ФормаОплатыЗаявки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ТаблицаЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств,
		|	ДанныеДокумента.Валюта,
		|	ДанныеДокумента.ПодотчетноеЛицо,
		|	ДанныеДокумента.БанковскийСчет,
		|	ДанныеДокумента.Валюта";
	
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		&ДатаПлатежа
		|	КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		&ЖелательнаяДатаПлатежа
		|	ИНАЧЕ
		|		НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК КорДенежныеСредства,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Депозиты) КАК КорТипДенежныхСредств,
		|	ДанныеДокумента.Валюта КАК КорВалюта,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК ИсточникКорГФУДенежныхСредств,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО (ИСТИНА)
		|";
	
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		&ДатаПлатежа
		|	КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1,1,1) ТОГДА
		|		&ЖелательнаяДатаПлатежа
		|	ИНАЧЕ
		|		НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
		|	&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	&СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	ДанныеДокумента.ДоговорЭквайринга КАК КорДенежныеСредства,
		|	Значение(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУЭквайера) КАК КорТипДенежныхСредств,
		|	ДанныеДокумента.Валюта КАК КорВалюта,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ДанныеДокумента.СуммаДокумента
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ДанныеДокумента.СуммаДокумента
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникКорГФУДенежныхСредств,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если МассивТекстовЗапроса.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	
	ИмяРегистра = "ДвиженияДенежныеСредстваДоходыРасходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ (ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасшифровкаПлатежа", ТекстыЗапроса) Тогда
		ТекстЗапросаВременнаяТаблицаРасшифровкаПлатежа(Запрос, ТекстыЗапроса, ДокументОбъект);
	КонецЕсли;
	
	Если Запрос.Параметры.Свойство("ИспользоватьНачислениеЗарплаты") Тогда
		ИспользоватьНачислениеЗарплаты = Запрос.Параметры.ИспользоватьНачислениеЗарплаты;
	Иначе
		ИспользоватьНачислениеЗарплаты = Константы.ИспользоватьНачислениеЗарплаты.Получить();
	КонецЕсли;
	
	МассивТекстовЗапроса = Новый Массив;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ТаблицаРасшифровкаПлатежа.Подразделение КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	ТаблицаРасшифровкаПлатежа.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
		|	ТаблицаРасшифровкаПлатежа.СтатьяРасходов КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	ТаблицаРасшифровкаПлатежа.АналитикаРасходов КАК АналитикаРасходов,
		|	ТаблицаРасшифровкаПлатежа.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяРасходов КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО (ИСТИНА)
		|";
	
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиСтатьи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги) КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	ДанныеДокумента.ТипНалога КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО (ИСТИНА)
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты
		И НЕ ИспользоватьНачислениеЗарплаты Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперацияПоЗарплате КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ДанныеДокумента.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиСтатьи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ОплатаТруда) КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	ДанныеДокумента.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ДанныеДокумента.СуммаДокумента
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ДанныеДокумента.СуммаДокумента
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|	
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту
		И ДокументОбъект.ОтражатьКомиссию И ДокументОбъект.СуммаКомиссии <> 0 Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КомиссияПоЭквайрингу) КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ДанныеДокумента.Подразделение КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
		|	ЕСТЬNULL(ДанныеДокумента.ДоговорЭквайринга.СтатьяДвиженияДенежныхСредствКомиссия, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику)) КАК СтатьяДвиженияДенежныхСредств,
		|	ДанныеДокумента.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	ДанныеДокумента.ДоговорЭквайрингаНаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
		|	ДанныеДокумента.СтатьяРасходов КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ДанныеДокумента.СуммаКомиссии
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ДанныеДокумента.СуммаКомиссии
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	ДанныеДокумента.СтатьяРасходов КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	//++ НЕ УТ
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты
		И ИспользоватьНачислениеЗарплаты Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперацияПоЗарплате КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиСтатьи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ОплатаТруда) КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	ДанныеДокумента.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО (ИСТИНА)
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику
		И ИспользоватьНачислениеЗарплаты Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиСтатьи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗаймыВыданные) КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	ТаблицаРасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|	ПО (ИСТИНА)
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику
		И НЕ ИспользоватьНачислениеЗарплаты Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ДанныеДокумента.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиСтатьи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗаймыВыданные) КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ДанныеДокумента.СуммаДокумента
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ДанныеДокумента.СуммаДокумента
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаПлатежа
		|		КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ТаблицаРасшифровкаПлатежа.Подразделение КАК ПодразделениеДоходовРасходов,
		|	ДанныеДокумента.БанковскийСчет КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|	ДанныеДокумента.Валюта КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиСтатьи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.УпрБалансЛизинг) КАК СтатьяДоходовРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	ТаблицаРасшифровкаПлатежа.ДоговорАренды КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Сумма
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДоходовРасходов,
		|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
		|
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО (ИСТИНА)
		|";
	
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	//-- НЕ УТ
	
	Если МассивТекстовЗапроса.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДенежныеСредстваКонтрагент(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	
	ИмяРегистра = "ДвиженияДенежныеСредстваКонтрагент";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ (ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасшифровкаПлатежа", ТекстыЗапроса) Тогда
		ТекстЗапросаВременнаяТаблицаРасшифровкаПлатежа(Запрос, ТекстыЗапроса, ДокументОбъект);
	КонецЕсли; 
	
	УстановитьПараметрЗапросаАналитикаУчетаПоПартнерам(Запрос, ДокументОбъект);
	
	МассивТекстовЗапросов = Новый Массив;
	
	Если (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне) Тогда
	
		ТекстПодзапроса = "ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ДатаПлатежа
		|			КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ЖелательнаяДатаПлатежа
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|		КОНЕЦ КАК Период,
		|		ДанныеДокумента.ФормаОплатыНаличная КАК ФормаОплатыНаличная,
		|		ДанныеДокумента.ФормаОплатыЗаявки КАК ФормаОплатыЗаявки,
		|		ДанныеДокумента.Статус КАК Статус,
		|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|		ДанныеДокумента.Организация КАК Организация,
		|		ДанныеДокумента.Подразделение КАК Подразделение,
		|		ДанныеДокумента.БанковскийСчетНаправлениеДеятельности КАК НаправлениеДеятельностиБанковскийСчет,
		|		ДанныеДокумента.КассаНаправлениеДеятельности КАК НаправлениеДеятельностиКасса,
		|		ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
		|		ДанныеДокумента.Касса КАК Касса,
		|		ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|		ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|		ДанныеДокумента.Валюта КАК ВалютаПлатежа,
		|		ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.НаправлениеДеятельности, ДанныеДокумента.НаправлениеДеятельности) КАК НаправлениеДеятельностиКонтрагента,
		|		ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.АналитикаУчетаПоПартнерам.Партнер, ТаблицаРасшифровкаПлатежа.Партнер) КАК Партнер,
		|		ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.АналитикаУчетаПоПартнерам.Контрагент, ДанныеДокумента.Контрагент) КАК Контрагент,
		|		ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.Договор, ДанныеДокумента.Договор) КАК Договор,
		|		ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
		|		ТаблицаРасшифровкаПлатежа.Сумма КАК СуммаКВыплате,
		|		ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|		ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК ИсточникГФУРасчетов,
		|		ДанныеДокумента.СверхЛимита КАК СверхЛимита
		|
		|	ИЗ
		|		ДанныеДокументаШапка КАК ДанныеДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|			ПО (ИСТИНА)
		|";
	
		МассивТекстовЗапросов.Добавить(ТекстПодзапроса);
		
	КонецЕсли;
	
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
	
		ТекстПодзапроса = "ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ДатаПлатежа
		|			КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ЖелательнаяДатаПлатежа
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|		КОНЕЦ КАК Период,
		|		ДанныеДокумента.ФормаОплатыНаличная КАК ФормаОплатыНаличная,
		|		ДанныеДокумента.ФормаОплатыЗаявки КАК ФормаОплатыЗаявки,
		|		ДанныеДокумента.Статус КАК Статус,
		|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|		ДанныеДокумента.Организация КАК Организация,
		|		ДанныеДокумента.Подразделение КАК Подразделение,
		|		ДанныеДокумента.БанковскийСчетНаправлениеДеятельности КАК НаправлениеДеятельностиБанковскийСчет,
		|		ДанныеДокумента.КассаНаправлениеДеятельности КАК НаправлениеДеятельностиКасса,
		|		ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
		|		ДанныеДокумента.Касса КАК Касса,
		|		&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|		&СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|		ДанныеДокумента.Валюта КАК ВалютаПлатежа,
		|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКонтрагента,
		|		НЕОПРЕДЕЛЕНО КАК Партнер,
		|		ДанныеДокумента.БанковскийСчетПолучатель.Владелец КАК Контрагент,
		|		НЕОПРЕДЕЛЕНО КАК Договор,
		|		НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
		|		ДанныеДокумента.СуммаДокумента КАК СуммаКВыплате,
		|		ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|		НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		|		ДанныеДокумента.СверхЛимита КАК СверхЛимита
		|	
		|	ИЗ
		|		ДанныеДокументаШапка КАК ДанныеДокумента
		|";
	
		МассивТекстовЗапросов.Добавить(ТекстПодзапроса);
		
	КонецЕсли;
	
	Если (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов) Тогда
	
		ТекстПодзапроса = "ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА &ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ДатаПлатежа
		|			КОГДА &ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ЖелательнаяДатаПлатежа
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|		КОНЕЦ КАК Период,
		|		ДанныеДокумента.ФормаОплатыНаличная КАК ФормаОплатыНаличная,
		|		ДанныеДокумента.ФормаОплатыЗаявки КАК ФормаОплатыЗаявки,
		|		ДанныеДокумента.Статус КАК Статус,
		|		ВЫБОР
		|			КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам)
		|					И (ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСОсновногоДолга = ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
		|						ИЛИ ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСПоступленияВыдачи = ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам)
		|			КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам)
		|					И (ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСПроцентов = ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
		|						ИЛИ ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.СтатьяДДСКомиссии = ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПроцентовПоКредитам)
		|			ИНАЧЕ &ХозяйственнаяОперация
		|		КОНЕЦ КАК ХозяйственнаяОперация,
		|		ДанныеДокумента.Организация КАК Организация,
		|		ДанныеДокумента.Подразделение КАК Подразделение,
		|		ДанныеДокумента.БанковскийСчетНаправлениеДеятельности КАК НаправлениеДеятельностиБанковскийСчет,
		|		ДанныеДокумента.КассаНаправлениеДеятельности КАК НаправлениеДеятельностиКасса,
		|		ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
		|		ДанныеДокумента.Касса КАК Касса,
		|		ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|		ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
		|		ДанныеДокумента.Валюта КАК ВалютаПлатежа,
		|		ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
		|		ТаблицаРасшифровкаПлатежа.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|		ТаблицаРасшифровкаПлатежа.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
		|		ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК Договор,
		|		НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
		|		ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ДанныеДокумента.СуммаДокумента) КАК СуммаКВыплате,
		|		ДанныеДокумента.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
		|		ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК ИсточникГФУРасчетов,
		|		ДанныеДокумента.СверхЛимита КАК СверхЛимита
		|
		|	ИЗ
		|		ДанныеДокументаШапка КАК ДанныеДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|			ПО (ИСТИНА)
		|";
	
		МассивТекстовЗапросов.Добавить(ТекстПодзапроса);
		
	КонецЕсли;
	
	Если МассивТекстовЗапросов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстПодзапроса = СтрСоединить(МассивТекстовЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Период КАК Период,
	|	ДанныеДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.ФормаОплатыНаличная
	|						ТОГДА ДанныеДокумента.НаправлениеДеятельностиКасса
	|					ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиБанковскийСчет
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДокумента.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|					ТОГДА ДанныеДокумента.НаправлениеДеятельностиКасса
	|				ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиБанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ КАК НаправлениеДеятельностиДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.ФормаОплатыНаличная
	|						ТОГДА ДанныеДокумента.Касса
	|					ИНАЧЕ ДанныеДокумента.БанковскийСчет
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДокумента.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|					ТОГДА ДанныеДокумента.Касса
	|				ИНАЧЕ ДанныеДокумента.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ КАК ДенежныеСредства,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.ФормаОплатыНаличная
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДокумента.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	ДанныеДокумента.ВалютаПлатежа КАК ВалютаПлатежа,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.НаправлениеДеятельностиКонтрагента.УчетРасчетовСПоставщиками, ЛОЖЬ) ТОГДА
	|			ДанныеДокумента.НаправлениеДеятельностиКонтрагента
	|	КОНЕЦ КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеДокумента.Партнер КАК Партнер,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СверхЛимита = ЛОЖЬ
	|			ТОГДА СУММА(ДанныеДокумента.СуммаКВыплате)
	|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СверхЛимита = ИСТИНА
	|			ТОГДА СУММА(ДанныеДокумента.СуммаКВыплате)
	|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
	|	ДанныеДокумента.ИсточникГФУДенежныхСредств КАК ИсточникГФУДенежныхСредств,
	|	ДанныеДокумента.ИсточникГФУРасчетов КАК ИсточникГФУРасчетов,
	|	&Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств
	|
	|ИЗ
	|	&ТаблицаПодзапроса КАК ДанныеДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Период,
	|	ДанныеДокумента.Статус,
	|	ДанныеДокумента.ХозяйственнаяОперация,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Подразделение,
	|	ДанныеДокумента.НаправлениеДеятельностиБанковскийСчет,
	|	ДанныеДокумента.НаправлениеДеятельностиКасса,
	|	ДанныеДокумента.БанковскийСчет,
	|	ДанныеДокумента.Касса,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.СтатьяЦелевыхСредств,
	|	ДанныеДокумента.ВалютаПлатежа,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.НаправлениеДеятельностиКонтрагента.УчетРасчетовСПоставщиками, ЛОЖЬ) ТОГДА
	|			ДанныеДокумента.НаправлениеДеятельностиКонтрагента
	|	КОНЕЦ,
	|	ДанныеДокумента.Партнер,
	|	ДанныеДокумента.Контрагент,
	|	ДанныеДокумента.Договор,
	|	ДанныеДокумента.ОбъектРасчетов,
	|	ДанныеДокумента.ИсточникГФУДенежныхСредств,
	|	ДанныеДокумента.ИсточникГФУРасчетов,
	|	ДанныеДокумента.СверхЛимита,
	|	ДанныеДокумента.ФормаОплатыНаличная,
	|	ДанныеДокумента.ФормаОплатыЗаявки
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаПодзапроса", "(" + ТекстПодзапроса +")");

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УстановитьПараметрыЗапросаКоэффициентыВалют(Запрос)
	
	Если Запрос.Параметры.Свойство("КоэффициентПересчетаВВалютуУПР") Тогда
		Возврат;
	КонецЕсли;
	
	КоэффициентПересчетаВВалютуУпр = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(
		Запрос.Параметры.Валюта, Константы.ВалютаУправленческогоУчета.Получить(), Запрос.Параметры.Период);
	
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуУпр", КоэффициентПересчетаВВалютуУпр);
	
КонецПроцедуры

Процедура УстановитьПараметрЗапросаАналитикаУчетаПоПартнерам(Запрос, ДокументОбъект)
	
	Если Запрос.Параметры.Свойство("АналитикаУчетаПоПартнерам") Тогда
		Возврат;
	КонецЕсли;
	
	Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	ИнициализироватьКлючиАналитикиУчетаПоПартнерам(Запрос.Параметры, Запрос.Параметры.Ссылка, Запрос.МенеджерВременныхТаблиц, ДокументОбъект);
	
	Если Запрос.Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику Тогда
		
		СтруктураАналитики = Новый Структура;
		СтруктураАналитики.Вставить("Организация", Запрос.Параметры.Организация);
		СтруктураАналитики.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		СтруктураАналитики.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
		СтруктураАналитики.Вставить("Договор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		СтруктураАналитики.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
		
		АналитикаУчетаПоПартнерам = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(СтруктураАналитики);
		
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерам);
	Иначе
		
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект = Неопределено)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	МассивТекстовЗапроса = Новый Массив; 
	
	Если ДокументОбъект = Неопределено 
		ИЛИ (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов
		//++ НЕ УТ
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю
		//-- НЕ УТ
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПустаяСсылка()) Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИдентификаторМетаданных                КАК ТипСсылки,
		|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
		|	&Организация                            КАК Организация,
		|	&ПартнерИзДокумента                     КАК Партнер,
		|	&БанковскийСчет                         КАК МестоХранения,
		|	&КонтрагентИзДокумента                  КАК Контрагент,
		|	&Подразделение                          КАК Подразделение,
		|	&Период                                 КАК ДатаДокументаИБ,
		|	&Ссылка                                 КАК Ссылка,
		
		|	&Номер                                  КАК НомерДокументаИБ,
		|	НЕОПРЕДЕЛЕНО                            КАК Статус,
		|	&КтоЗаявил                              КАК Ответственный,
		|	&Автор                                  КАК Автор,
		|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
		|	&НазначениеПлатежа                      КАК Дополнительно,
		|	&Комментарий                            КАК Комментарий,
		|	&Проведен                               КАК Проведен,
		|	&ПометкаУдаления                        КАК ПометкаУдаления,
		|	&Период                                 КАК ДатаПервичногоДокумента,
		|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
		|	&СуммаДокумента                         КАК Сумма,
		|	&Валюта                                 КАК Валюта,
		|	&Договор                                КАК Договор,
		|	&НаправлениеДеятельности                КАК НаправлениеДеятельности,
		|	ЛОЖЬ                                    КАК СторноИсправление,
		|	НЕОПРЕДЕЛЕНО                            КАК СторнируемыйДокумент,
		|	НЕОПРЕДЕЛЕНО                            КАК ИсправляемыйДокумент,
		|	&Период                                 КАК ДатаОтраженияВУчете,
		|	&ПриоритетОплаты                        КАК Приоритет
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка
		|	И &ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеТаможне),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов),
		//++ НЕ УТ
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю),
		//-- НЕ УТ
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|	)";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено 
		ИЛИ (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику) Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИдентификаторМетаданных                КАК ТипСсылки,
		|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
		|	&Организация                            КАК Организация,
		|	&Партнер                                КАК Партнер,
		|	&БанковскийСчет                         КАК МестоХранения,
		|	ВЫБОР
		|		КОГДА &ПеречислениеСотрудникуЧерезБанк
		|			ТОГДА &КонтрагентИзДокумента
		|		ИНАЧЕ &ПодотчетноеЛицо
		|	КОНЕЦ                                   КАК Контрагент,
		|	&Подразделение                          КАК Подразделение,
		|	&Период                                 КАК ДатаДокументаИБ,
		|	&Ссылка                                 КАК Ссылка,
		
		|	&Номер                                  КАК НомерДокументаИБ,
		|	НЕОПРЕДЕЛЕНО                            КАК Статус,
		|	&КтоЗаявил                              КАК Ответственный,
		|	&Автор                                  КАК Автор,
		|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
		|	&НазначениеПлатежа                      КАК Дополнительно,
		|	&Комментарий                            КАК Комментарий,
		|	&Проведен                               КАК Проведен,
		|	&ПометкаУдаления                        КАК ПометкаУдаления,
		|	&Период                                 КАК ДатаПервичногоДокумента,
		|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
		|	&СуммаДокумента                         КАК Сумма,
		|	&Валюта                                 КАК Валюта,
		|	&Договор                                КАК Договор,
		|	&НаправлениеДеятельности                КАК НаправлениеДеятельности,
		|	ЛОЖЬ                                    КАК СторноИсправление,
		|	НЕОПРЕДЕЛЕНО                            КАК СторнируемыйДокумент,
		|	НЕОПРЕДЕЛЕНО                            КАК ИсправляемыйДокумент,
		|	&Период                                 КАК ДатаОтраженияВУчете,
		|	&ПриоритетОплаты                        КАК Приоритет
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка
		|	И &ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
		|	)";

		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено 
		ИЛИ (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств) Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИдентификаторМетаданных                КАК ТипСсылки,
		|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
		|	&Организация                            КАК Организация,
		|	&Партнер                                КАК Партнер,
		|	&БанковскийСчет                         КАК МестоХранения,
		|	ДанныеДокумента.БанковскийСчетПолучатель.Владелец КАК Контрагент,
		|	&Подразделение                          КАК Подразделение,
		|	&Период                                 КАК ДатаДокументаИБ,
		|	&Ссылка                                 КАК Ссылка,
		
		|	&Номер                                  КАК НомерДокументаИБ,
		|	НЕОПРЕДЕЛЕНО                            КАК Статус,
		|	&КтоЗаявил                              КАК Ответственный,
		|	&Автор                                  КАК Автор,
		|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
		|	&НазначениеПлатежа                      КАК Дополнительно,
		|	&Комментарий                            КАК Комментарий,
		|	&Проведен                               КАК Проведен,
		|	&ПометкаУдаления                        КАК ПометкаУдаления,
		|	&Период                                 КАК ДатаПервичногоДокумента,
		|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
		|	&СуммаДокумента                         КАК Сумма,
		|	&Валюта                                 КАК Валюта,
		|	&Договор                                КАК Договор,
		|	&НаправлениеДеятельности                КАК НаправлениеДеятельности,
		|	ЛОЖЬ                                    КАК СторноИсправление,
		|	НЕОПРЕДЕЛЕНО                            КАК СторнируемыйДокумент,
		|	НЕОПРЕДЕЛЕНО                            КАК ИсправляемыйДокумент,
		|	&Период                                 КАК ДатаОтраженияВУчете,
		|	&ПриоритетОплаты                        КАК Приоритет
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка
		|	И &ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
		|	)";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено 
		ИЛИ (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет
		ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств) Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИдентификаторМетаданных                КАК ТипСсылки,
		|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
		|	&Организация                            КАК Организация,
		|	НЕОПРЕДЕЛЕНО                            КАК Партнер,
		|	&БанковскийСчет                         КАК МестоХранения,
		|	НЕОПРЕДЕЛЕНО                            КАК Контрагент,
		|	&Подразделение                          КАК Подразделение,
		|	&Период                                 КАК ДатаДокументаИБ,
		|	&Ссылка                                 КАК Ссылка,
		
		|	&Номер                                  КАК НомерДокументаИБ,
		|	НЕОПРЕДЕЛЕНО                            КАК Статус,
		|	&КтоЗаявил                              КАК Ответственный,
		|	&Автор                                  КАК Автор,
		|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
		|	&НазначениеПлатежа                      КАК Дополнительно,
		|	&Комментарий                            КАК Комментарий,
		|	&Проведен                               КАК Проведен,
		|	&ПометкаУдаления                        КАК ПометкаУдаления,
		|	&Период                                 КАК ДатаПервичногоДокумента,
		|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
		|	&СуммаДокумента                         КАК Сумма,
		|	&Валюта                                 КАК Валюта,
		|	НЕОПРЕДЕЛЕНО                            КАК Договор,
		|	&НаправлениеДеятельности                КАК НаправлениеДеятельности,
		|	ЛОЖЬ                                    КАК СторноИсправление,
		|	НЕОПРЕДЕЛЕНО                            КАК СторнируемыйДокумент,
		|	НЕОПРЕДЕЛЕНО                            КАК ИсправляемыйДокумент,
		|	&Период                                 КАК ДатаОтраженияВУчете,
		|	&ПриоритетОплаты                        КАК Приоритет
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка
		|	И &ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств)
		|	)";
	
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено 
		ИЛИ (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту) Тогда
	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИдентификаторМетаданных                КАК ТипСсылки,
		|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
		|	&Организация                            КАК Организация,
		|	&Партнер                                КАК Партнер,
		|	&БанковскийСчет                         КАК МестоХранения,
		|	&Контрагент                             КАК Контрагент,
		|	&Подразделение                          КАК Подразделение,
		|	&Период                                 КАК ДатаДокументаИБ,
		|	&Ссылка                                 КАК Ссылка,
		
		|	&Номер                                  КАК НомерДокументаИБ,
		|	НЕОПРЕДЕЛЕНО                            КАК Статус,
		|	&КтоЗаявил                              КАК Ответственный,
		|	&Автор                                  КАК Автор,
		|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
		|	&НазначениеПлатежа                      КАК Дополнительно,
		|	&Комментарий                            КАК Комментарий,
		|	&Проведен                               КАК Проведен,
		|	&ПометкаУдаления                        КАК ПометкаУдаления,
		|	&Период                                 КАК ДатаПервичногоДокумента,
		|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
		|	&СуммаДокумента                         КАК Сумма,
		|	&Валюта                                 КАК Валюта,
		|	ДанныеДокумента.ДоговорЭквайринга       КАК Договор,
		|	&НаправлениеДеятельности                КАК НаправлениеДеятельности,
		|	ЛОЖЬ                                    КАК СторноИсправление,
		|	НЕОПРЕДЕЛЕНО                            КАК СторнируемыйДокумент,
		|	НЕОПРЕДЕЛЕНО                            КАК ИсправляемыйДокумент,
		|	&Период                                 КАК ДатаОтраженияВУчете,
		|	&ПриоритетОплаты                        КАК Приоритет
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка
		|	И &ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|	)
		|";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено
		ИЛИ ДокументОбъект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
		ИЛИ ДокументОбъект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИдентификаторМетаданных                КАК ТипСсылки,
		|	&ХозяйственнаяОперацияПоЗарплате        КАК ХозяйственнаяОперация,
		|	&Организация                            КАК Организация,
		|	&ПартнерИзДокумента                     КАК Партнер,
		|	&БанковскийСчет                         КАК МестоХранения,
		|	ВЫБОР
		|		КОГДА &ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту)
		|			ТОГДА &КонтрагентИзДокумента
		|		КОГДА &ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета)
		|				И &ПеречислениеСотрудникуЧерезБанк
		|			ТОГДА &КонтрагентИзДокумента
		|		ИНАЧЕ &ПодотчетноеЛицо
		|	КОНЕЦ                                   КАК Контрагент,
		|	&Подразделение                          КАК Подразделение,
		|	&Период                                 КАК ДатаДокументаИБ,
		|	&Ссылка                                 КАК Ссылка,
		
		|	&Номер                                  КАК НомерДокументаИБ,
		|	НЕОПРЕДЕЛЕНО                            КАК Статус,
		|	&КтоЗаявил                              КАК Ответственный,
		|	&Автор                                  КАК Автор,
		|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
		|	&НазначениеПлатежа                      КАК Дополнительно,
		|	&Комментарий                            КАК Комментарий,
		|	&Проведен                               КАК Проведен,
		|	&ПометкаУдаления                        КАК ПометкаУдаления,
		|	&Период                                 КАК ДатаПервичногоДокумента,
		|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
		|	&СуммаДокумента                         КАК Сумма,
		|	&Валюта                                 КАК Валюта,
		|	&Договор                                КАК Договор,
		|	&НаправлениеДеятельности                КАК НаправлениеДеятельности,
		|	ЛОЖЬ                                    КАК СторноИсправление,
		|	НЕОПРЕДЕЛЕНО                            КАК СторнируемыйДокумент,
		|	НЕОПРЕДЕЛЕНО                            КАК ИсправляемыйДокумент,
		|	&Период                                 КАК ДатаОтраженияВУчете,
		|	&ПриоритетОплаты                        КАК Приоритет
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка
		|	И &ХозяйственнаяОперацияПоЗарплате В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета)
		|	)";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ДокументОбъект <> Неопределено И МассивТекстовЗапроса.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Если ДокументОбъект = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокументаШапка", "Документ.ЗаявкаНаРасходованиеДенежныхСредств");
	КонецЕсли;
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	
	#Область НаправленияДеятельности
	
	ИмяРегистра = "ВременнаяТаблицаНаправленияДеятельности";
	
	ТекстЗапросаНаправленияДеятельности = 
		"ВЫБРАТЬ
		|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК Таблица";
		
	ТекстЗапросаНаправленияДеятельности = ВзаиморасчетыСервер.ПолучитьТаблицуНаправленийДеятельности(ТекстЗапросаНаправленияДеятельности);

	ТекстыЗапроса.Добавить(ТекстЗапросаНаправленияДеятельности, ИмяРегистра);
	
	#КонецОбласти
	
	#Область РасчетыСКлиентами
	
	ТекстЗапросаКлиенты = "";
	
	Если (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию) 
		И (ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
			ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
			ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате) 
		И ДокументОбъект.КонтролироватьОплатуПоОбъектамРасчетов Тогда
		
		ТекстЗапросаКлиенты = "
			|ВЫБРАТЬ
			|	Таблица.Ссылка                                                КАК Ссылка,
			|	ВЫБОР КОГДА ДанныеДокументаШапка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
			|		КОГДА &ЕстьПодарочныйСертификат = ИСТИНА
			|			ТОГДА &Партнер
			|		ИНАЧЕ Таблица.Партнер
			|	КОНЕЦ КАК Партнер,
			|	Таблица.ОбъектРасчетов                                        КАК ОбъектРасчетов,
			|	Таблица.ВалютаВзаиморасчетов                                  КАК ВалютаВзаиморасчетов,
			|	Таблица.СуммаВзаиморасчетов                                   КАК Оплачивается,
			|	Таблица.СтатьяДвиженияДенежныхСредств                         КАК СтатьяДвиженияДенежныхСредств,
			|	
			|	ДанныеДокументаШапка.Номер                                    КАК НомерРегистратора,
			|	ДанныеДокументаШапка.Дата                                     КАК ДатаРегистратора,
			|	ДанныеДокументаШапка.ХозяйственнаяОперация                    КАК ХозяйственнаяОперация,
			|	ДанныеДокументаШапка.ФормаОплатыЗаявки                        КАК ФормаОплаты,
			|	ДанныеДокументаШапка.Валюта                                   КАК ВалютаДокумента
			|ИЗ
			|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК Таблица
			|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка
			|		ПО Таблица.Ссылка = ДанныеДокументаШапка.Ссылка
			|";
	КонецЕсли;
	
	ВзаиморасчетыСервер.ПроведениеЗаявкиНаВозвратОплатыКлиенту(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаКлиенты);
	
	#КонецОбласти
	
	#Область РасчетыСПоставщиками
	
	ТекстЗапросаПоставщики = "";
	
	Если (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне) 
		И (ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
			ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
			ИЛИ ДокументОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
		И ДокументОбъект.КонтролироватьОплатуПоОбъектамРасчетов Тогда
				
	ТекстЗапросаПоставщики = "
		|ВЫБРАТЬ
		|	Таблица.Ссылка                                                 КАК Ссылка,
		|	ВЫБОР КОГДА ДанныеДокументаШапка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|		КОГДА &ЕстьПодарочныйСертификат = ИСТИНА
		|			ТОГДА &Партнер
		|		ИНАЧЕ Таблица.Партнер
		|	КОНЕЦ КАК Партнер,
		|	
		|	Таблица.ВалютаВзаиморасчетов                                   КАК ВалютаВзаиморасчетов,
		|	Таблица.СуммаВзаиморасчетов                                    КАК УвеличениеОплачивается,
		|	Таблица.ОбъектРасчетов                                         КАК ОбъектРасчетов,
		|	Таблица.СтатьяДвиженияДенежныхСредств                          КАК СтатьяДвиженияДенежныхСредств,
		|	
		|	ДанныеДокументаШапка.Номер                                     КАК НомерРегистратора,
		|	ДанныеДокументаШапка.Дата                                      КАК ДатаРегистратора,
		|	ДанныеДокументаШапка.ХозяйственнаяОперация                     КАК ХозяйственнаяОперация,
		|	ДанныеДокументаШапка.ФормаОплатыЗаявки                         КАК ФормаОплаты,
		|	ДанныеДокументаШапка.Валюта                                    КАК ВалютаДокумента
		|	
		|ИЗ
		|	ДанныеДокументаТаблицаРасшифровкаПлатежа КАК Таблица
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка
		|		ПО Таблица.Ссылка = ДанныеДокументаШапка.Ссылка
		|ГДЕ
		|	Таблица.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
		|";
	КонецЕсли;
	
	ВзаиморасчетыСервер.ПроведениеЗаявкиНаОплатуПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаПоставщики);
	
	#КонецОбласти
	
КонецПроцедуры

Функция ЗапросЗакрытияДенежныеСредстваКВыплате()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)              КАК ВидДвижения,
	|	&Период                                             КАК Период,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ДанныеРегистра.БанковскийСчетКасса                  КАК БанковскийСчетКасса,
	|	ДанныеРегистра.Получатель                           КАК Получатель,
	|	ДанныеРегистра.Организация                          КАК Организация,
	|	-ДанныеРегистра.СуммаОстаток                        КАК Сумма,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(, ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)) КАК ДанныеРегистра
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗакрытияРасчетыСПоставщиками()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	&Период                                             КАК Период,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам            КАК АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов                       КАК ОбъектРасчетов,
	|	ДанныеРегистра.Валюта                               КАК Валюта,
	|	СУММА(ВЫБОР ДанныеРегистра.ВидДвижения
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-ДанныеРегистра.Оплачивается
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДанныеРегистра.Оплачивается
	|	КОНЕЦ) КАК Оплачивается,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|	
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР ДанныеРегистра.ВидДвижения
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-ДанныеРегистра.Оплачивается
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДанныеРегистра.Оплачивается
	|	КОНЕЦ) <> 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗакрытияРасчетыСКлиентами()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	&Период                                             КАК Период,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам            КАК АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов                       КАК ОбъектРасчетов,
	|	ДанныеРегистра.Валюта                               КАК Валюта,
	|	СУММА(ВЫБОР ДанныеРегистра.ВидДвижения
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-ДанныеРегистра.Оплачивается
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДанныеРегистра.Оплачивается
	|	КОНЕЦ) КАК Оплачивается,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|	
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР ДанныеРегистра.ВидДвижения
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-ДанныеРегистра.Оплачивается
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДанныеРегистра.Оплачивается
	|	КОНЕЦ) <> 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗакрытияРасчетыПоФинансовымИнструментам()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	&Период                                             КАК Период,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам            КАК АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.Договор                              КАК Договор,
	|	ДанныеРегистра.ТипСуммы                             КАК ТипСуммы,
	|	ДанныеРегистра.РасчетныйДокумент                    КАК РасчетныйДокумент,
	|	ДанныеРегистра.Валюта                               КАК Валюта,
	|	СУММА(ВЫБОР ДанныеРегистра.ВидДвижения
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-ДанныеРегистра.Оплачивается
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДанныеРегистра.Оплачивается
	|	КОНЕЦ) КАК Оплачивается,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.Договор,
	|	ДанныеРегистра.ТипСуммы,
	|	ДанныеРегистра.РасчетныйДокумент,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР ДанныеРегистра.ВидДвижения
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-ДанныеРегистра.Оплачивается
	|		КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДанныеРегистра.Оплачивается
	|	КОНЕЦ) <> 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗакрытияДвиженияДенежныхСредств()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	МИНИМУМ(ДанныеРегистра.Период)                      КАК ПериодИсходный,
	|	ДанныеРегистра.ХозяйственнаяОперация                КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация                          КАК Организация,
	|	ДанныеРегистра.Подразделение                        КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств        КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта                               КАК Валюта,
	|	ДанныеРегистра.КорДенежныеСредства                  КАК КорДенежныеСредства,
	|	ДанныеРегистра.КорТипДенежныхСредств                КАК КорТипДенежныхСредств,
	|	ДанныеРегистра.КорНаправлениеДеятельности           КАК КорНаправлениеДеятельности,
	|	СУММА(ДанныеРегистра.СуммаВВалюте)
	|	 - СУММА(ДанныеРегистра.СуммаКВыплатеВРамкахЛимита) КАК СуммаКВыплатеВРамкахЛимита,
	|	0                                                   КАК СуммаКВыплатеСверхЛимита,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.КорДенежныеСредства,
	|	ДанныеРегистра.КорТипДенежныхСредств,
	|	ДанныеРегистра.КорНаправлениеДеятельности,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.СуммаВВалюте) - СУММА(ДанныеРегистра.СуммаКВыплатеВРамкахЛимита) < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	МИНИМУМ(ДанныеРегистра.Период)                      КАК ПериодИсходный,
	|	ДанныеРегистра.ХозяйственнаяОперация                КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация                          КАК Организация,
	|	ДанныеРегистра.Подразделение                        КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств        КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта                               КАК Валюта,
	|	ДанныеРегистра.КорДенежныеСредства                  КАК КорДенежныеСредства,
	|	ДанныеРегистра.КорТипДенежныхСредств                КАК КорТипДенежныхСредств,
	|	ДанныеРегистра.КорНаправлениеДеятельности           КАК КорНаправлениеДеятельности,
	|	0                                                   КАК СуммаКВыплатеВРамкахЛимита,
	|	СУММА(ДанныеРегистра.СуммаВВалюте)
	|	 - СУММА(ДанныеРегистра.СуммаКВыплатеСверхЛимита)   КАК СуммаКВыплатеСверхЛимита,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.КорДенежныеСредства,
	|	ДанныеРегистра.КорТипДенежныхСредств,
	|	ДанныеРегистра.КорНаправлениеДеятельности,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.СуммаВВалюте) - СУММА(ДанныеРегистра.СуммаКВыплатеСверхЛимита) < 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗакрытияДвиженияДенежныеСредстваДоходыРасходы()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	МИНИМУМ(ДанныеРегистра.Период)                      КАК ПериодИсходный,
	|	ДанныеРегистра.ХозяйственнаяОперация                КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация                          КАК Организация,
	|	ДанныеРегистра.Подразделение                        КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС            КАК НаправлениеДеятельностиДС,
	|	ДанныеРегистра.ПодразделениеДоходовРасходов         КАК ПодразделениеДоходовРасходов,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств        КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта                               КАК Валюта,
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи        КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов                КАК СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов                     КАК АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов             КАК АналитикаАктивовПассивов,
	|	СУММА(ДанныеРегистра.СуммаВВалюте)
	|	 - СУММА(ДанныеРегистра.СуммаКВыплатеВРамкахЛимита) КАК СуммаКВыплатеВРамкахЛимита,
	|	0                                                   КАК СуммаКВыплатеСверхЛимита,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС,
	|	ДанныеРегистра.ПодразделениеДоходовРасходов,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.СуммаВВалюте) - СУММА(ДанныеРегистра.СуммаКВыплатеВРамкахЛимита) < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	МИНИМУМ(ДанныеРегистра.Период)                      КАК ПериодИсходный,
	|	ДанныеРегистра.ХозяйственнаяОперация                КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация                          КАК Организация,
	|	ДанныеРегистра.Подразделение                        КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС            КАК НаправлениеДеятельностиДС,
	|	ДанныеРегистра.ПодразделениеДоходовРасходов         КАК ПодразделениеДоходовРасходов,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств        КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта                               КАК Валюта,
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи        КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов                КАК СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов                     КАК АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов             КАК АналитикаАктивовПассивов,
	|	0                                                   КАК СуммаКВыплатеВРамкахЛимита,
	|	СУММА(ДанныеРегистра.СуммаВВалюте) - СУММА(ДанныеРегистра.СуммаКВыплатеСверхЛимита) КАК СуммаКВыплатеСверхЛимита,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС,
	|	ДанныеРегистра.ПодразделениеДоходовРасходов,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.СуммаВВалюте) - СУММА(ДанныеРегистра.СуммаКВыплатеСверхЛимита) < 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗакрытияДвиженияДенежныеСредстваКонтрагент()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	МИНИМУМ(ДанныеРегистра.Период)                      КАК ПериодИсходный,
	|	ДанныеРегистра.ХозяйственнаяОперация                КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация                          КАК Организация,
	|	ДанныеРегистра.Подразделение                        КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС            КАК НаправлениеДеятельностиДС,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств        КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.ВалютаПлатежа                        КАК ВалютаПлатежа,
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента   КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер                              КАК Партнер,
	|	ДанныеРегистра.Контрагент                           КАК Контрагент,
	|	ДанныеРегистра.Договор                              КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов                       КАК ОбъектРасчетов,
	|	СУММА(ДанныеРегистра.СуммаОплатыВВалютеПлатежа)
	|	 - СУММА(ДанныеРегистра.СуммаКВыплатеВРамкахЛимита) КАК СуммаКВыплатеВРамкахЛимита,
	|	0                                                   КАК СуммаКВыплатеСверхЛимита,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.ВалютаПлатежа,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств,
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер,
	|	ДанныеРегистра.Контрагент,
	|	ДанныеРегистра.Договор,
	|	ДанныеРегистра.ОбъектРасчетов
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.СуммаОплатыВВалютеПлатежа) - СУММА(ДанныеРегистра.СуммаКВыплатеВРамкахЛимита) < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	МИНИМУМ(ДанныеРегистра.Период)                      КАК ПериодИсходный,
	|	ДанныеРегистра.ХозяйственнаяОперация                КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация                          КАК Организация,
	|	ДанныеРегистра.Подразделение                        КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС            КАК НаправлениеДеятельностиДС,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств        КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.ВалютаПлатежа                        КАК ВалютаПлатежа,
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента   КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер                              КАК Партнер,
	|	ДанныеРегистра.Контрагент                           КАК Контрагент,
	|	ДанныеРегистра.Договор                              КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов                       КАК ОбъектРасчетов,
	|	0                                                   КАК СуммаКВыплатеВРамкахЛимита,
	|	СУММА(ДанныеРегистра.СуммаОплатыВВалютеПлатежа)
	|	 - СУММА(ДанныеРегистра.СуммаКВыплатеСверхЛимита)   КАК СуммаКВыплатеСверхЛимита,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств  КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                              КАК Сторно
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиДС,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.ВалютаПлатежа,
	|	ДанныеРегистра.ЗаявкаНаРасходованиеДенежныхСредств,
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер,
	|	ДанныеРегистра.Контрагент,
	|	ДанныеРегистра.Договор,
	|	ДанныеРегистра.ОбъектРасчетов
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.СуммаОплатыВВалютеПлатежа) - СУММА(ДанныеРегистра.СуммаКВыплатеСверхЛимита) < 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗакрытияЛимитыРасходаДенежныхСредств()
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СправочникВалюты.Ссылка КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Организация КАК Организация
	|ПОМЕСТИТЬ ТаблицаПериодов
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента,
	|	Справочник.Валюты КАК СправочникВалюты
	|ГДЕ
	|	ДанныеДокумента.Ссылка В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	СправочникВалюты.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	СправочникВалюты.Ссылка КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Организация КАК Организация
	|ИЗ
	|	Документ.ЗаявкаНаКомандировку КАК ДанныеДокумента,
	|	Справочник.Валюты КАК СправочникВалюты
	|ГДЕ
	|	ДанныеДокумента.Ссылка В (&Заявка)
	|СГРУППИРОВАТЬ ПО
	|	СправочникВалюты.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация
	|ИНДЕКСИРОВАТЬ ПО
	|	ВалютаВзаиморасчетов,
	|	Дата,
	|	Организация
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, "ТаблицаПериодов");
	
	ФинансовыеИнструменты.ТекстЗапросаВтКоэффициентыПересчетаВалют(ТекстыЗапроса, "ВтКоэффициентыПересчетаВалют", Истина);
	
	МассивТекстовЗапросов = Новый Массив;
	Для каждого ТекстЗапроса Из ТекстыЗапроса Цикл
		Если ЗначениеЗаполнено(ТекстЗапроса.Представление) Тогда
			МассивТекстовЗапросов.Добавить("// " + ТекстЗапроса.Представление);
		КонецЕсли; 
		МассивТекстовЗапросов.Добавить(ТекстЗапроса.Значение + ОбщегоНазначения.РазделительПакетаЗапросов());
	КонецЦикла;
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапросов, Символы.ПС);
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДанныеДвижений.ПериодИсходный, МЕСЯЦ) КАК Период,
	|	ДанныеДвижений.СтатьяДвиженияДенежныхСредств   КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА &ИспользоватьЛимитыРасходаПоОрганизациям
	|			ТОГДА ДанныеДвижений.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА &ИспользоватьЛимитыРасходаПоПодразделениям
	|			ТОГДА ДанныеДвижений.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ДанныеДвижений.СуммаКВыплатеВРамкахЛимита * КурсыПересчетаВВалютуУпрУчета.КоэффициентПересчетаУпр КАК РасходВПределахЛимита,
	|	ДанныеДвижений.СуммаКВыплатеСверхЛимита * КурсыПересчетаВВалютуУпрУчета.КоэффициентПересчетаУпр КАК РасходСверхЛимита,
	|	ДанныеДвижений.ЗаявкаНаРасходованиеДенежныхСредств      КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                                  КАК Сторно
	|ИЗ
	|	&ЗапросЗакрытияДвиженияДенежныхСредств КАК ДанныеДвижений
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтКоэффициентыПересчетаВалют КАК КурсыПересчетаВВалютуУпрУчета
	|	ПО
	|		КурсыПересчетаВВалютуУпрУчета.ВалютаВзаиморасчетов = ДанныеДвижений.Валюта
	|		И КурсыПересчетаВВалютуУпрУчета.Дата = ДанныеДвижений.ЗаявкаНаРасходованиеДенежныхСредств.Дата
	|		И КурсыПересчетаВВалютуУпрУчета.Организация = ДанныеДвижений.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДанныеДвижений.ПериодИсходный, МЕСЯЦ) КАК Период,
	|	ДанныеДвижений.СтатьяДвиженияДенежныхСредств   КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА &ИспользоватьЛимитыРасходаПоОрганизациям
	|			ТОГДА ДанныеДвижений.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА &ИспользоватьЛимитыРасходаПоПодразделениям
	|			ТОГДА ДанныеДвижений.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ДанныеДвижений.СуммаКВыплатеВРамкахЛимита * КурсыПересчетаВВалютуУпрУчета.КоэффициентПересчетаУпр КАК РасходВПределахЛимита,
	|	ДанныеДвижений.СуммаКВыплатеСверхЛимита * КурсыПересчетаВВалютуУпрУчета.КоэффициентПересчетаУпр КАК РасходСверхЛимита,
	|	ДанныеДвижений.ЗаявкаНаРасходованиеДенежныхСредств      КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                                  КАК Сторно
	|ИЗ
	|	&ЗапросЗакрытияДвиженияДенежныеСредстваДоходыРасходы КАК ДанныеДвижений
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтКоэффициентыПересчетаВалют КАК КурсыПересчетаВВалютуУпрУчета
	|	ПО
	|		КурсыПересчетаВВалютуУпрУчета.ВалютаВзаиморасчетов = ДанныеДвижений.Валюта
	|		И КурсыПересчетаВВалютуУпрУчета.Дата = ДанныеДвижений.ЗаявкаНаРасходованиеДенежныхСредств.Дата
	|		И КурсыПересчетаВВалютуУпрУчета.Организация = ДанныеДвижений.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДанныеДвижений.ПериодИсходный, МЕСЯЦ) КАК Период,
	|	ДанныеДвижений.СтатьяДвиженияДенежныхСредств   КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА &ИспользоватьЛимитыРасходаПоОрганизациям
	|			ТОГДА ДанныеДвижений.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА &ИспользоватьЛимитыРасходаПоПодразделениям
	|			ТОГДА ДанныеДвижений.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ДанныеДвижений.СуммаКВыплатеВРамкахЛимита * КурсыПересчетаВВалютуУпрУчета.КоэффициентПересчетаУпр КАК РасходВПределахЛимита,
	|	ДанныеДвижений.СуммаКВыплатеСверхЛимита * КурсыПересчетаВВалютуУпрУчета.КоэффициентПересчетаУпр КАК РасходСверхЛимита,
	|	ДанныеДвижений.ЗаявкаНаРасходованиеДенежныхСредств      КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	ИСТИНА                                                  КАК Сторно
	|ИЗ
	|	&ЗапросЗакрытияДвиженияДенежныеСредстваКонтрагент КАК ДанныеДвижений
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтКоэффициентыПересчетаВалют КАК КурсыПересчетаВВалютуУпрУчета
	|	ПО
	|		КурсыПересчетаВВалютуУпрУчета.ВалютаВзаиморасчетов = ДанныеДвижений.ВалютаПлатежа
	|		И КурсыПересчетаВВалютуУпрУчета.Дата = ДанныеДвижений.ЗаявкаНаРасходованиеДенежныхСредств.Дата
	|		И КурсыПересчетаВВалютуУпрУчета.Организация = ДанныеДвижений.Организация
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ЗапросЗакрытияДвиженияДенежныхСредств", "(" + ЗапросЗакрытияДвиженияДенежныхСредств() + ")");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ЗапросЗакрытияДвиженияДенежныеСредстваДоходыРасходы", "(" + ЗапросЗакрытияДвиженияДенежныеСредстваДоходыРасходы() + ")");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ЗапросЗакрытияДвиженияДенежныеСредстваКонтрагент", "(" + ЗапросЗакрытияДвиженияДенежныеСредстваКонтрагент() + ")");
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция СформироватьЗапросПроверкиПриСменеСтатуса(МассивДокументов, НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств[НовыйСтатус];
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументов.Ссылка) КАК Представление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументов.Статус) КАК ПредставлениеТекущегоСтатуса,
	|	ПРЕДСТАВЛЕНИЕ(&Статус) КАК ПредставлениеНовогоСтатуса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокументов.Статус = &Статус
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтатусСовпадает,
	|	ТаблицаДокументов.Проведен КАК Проведен,
	|	ТаблицаДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	ИСТИНА КАК ЗаписьПроведением
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.Ссылка В(&МассивДокументов)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Статус", ЗначениеНовогоСтатуса);
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Возврат Запрос;
	
КонецФункции

Функция ПроверкаПередСменойСтатуса(ВыборкаПроверки, НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	Возврат Истина; // Для документа "ЗаявкаНаРасходованиеДенежныхСредств" дополнительные проверки отсутствуют
	
КонецФункции

Функция СтатьяДвиженияДенежныхСредствДокумента(ДанныеДокумента)
	
	Если ЗначениеЗаполнено(ДанныеДокумента.СтатьяДвиженияДенежныхСредств) Тогда
		СтатьяДвиженияДенежныхСредств = ДанныеДокумента.СтатьяДвиженияДенежныхСредств;
	Иначе
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПредопределеннаяСтатьяДДС(
			ДанныеДокумента.ХозяйственнаяОперация, ДанныеДокумента.Валюта);
	КонецЕсли;
	
	Возврат СтатьяДвиженияДенежныхСредств;
	
КонецФункции

// Операции взаиморасчетов.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ХозяйственныеОперации - Операции взаиморасчетов
Функция ОперацииВзаиморасчетов() Экспорт
	ОперацииВзаиморасчетов = Новый Массив;
	ОперацииВзаиморасчетов.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	ОперацииВзаиморасчетов.Добавить(Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию);
	ОперацииВзаиморасчетов.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеТаможне);
	ОперацииВзаиморасчетов.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	ОперацииВзаиморасчетов.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию);
	
	Возврат ОперацииВзаиморасчетов;
КонецФункции

// Рассчитывает значение для заполнения реквизита "КонтролироватьОплатуПоОбъектамРасчетов". Значение зависит от значения 
// реквизита "ХозяйственнаяОперация" и заполнения реквизита "ОбъектРасчетов" в строках табличной части "РасшифровкаПлатежа". 
// 
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
//  ОбъектыРасчетов - Массив из СправочникСсылка.ОбъектыРасчетов - Массив объектов расчетов из табличной части "Расшифровка платежа". 
// 
// Возвращаемое значение:
//  Булево - Значение для заполнения реквизита "КонтролироватьОплатуПоОбъектамРасчетов".
//
Функция КонтролироватьОплатуПоОбъектамРасчетов(ХозяйственнаяОперация, ОбъектыРасчетов) Экспорт

	КонтролироватьОплатуПоОбъектамРасчетов = Ложь;
	ОперацииВзаиморасчетов = ОперацииВзаиморасчетов();

	Если ОперацииВзаиморасчетов.Найти(ХозяйственнаяОперация) = Неопределено Тогда
		Возврат КонтролироватьОплатуПоОбъектамРасчетов;
	КонецЕсли;

	КонтролироватьОплатуПоОбъектамРасчетов = Истина;

	Для Каждого ОбъектРасчетов Из ОбъектыРасчетов Цикл
		Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) Тогда
			КонтролироватьОплатуПоОбъектамРасчетов = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат КонтролироватьОплатуПоОбъектамРасчетов;

КонецФункции

#КонецОбласти

//++ НЕ УТ
#Область КонтрольЛимитовПоДаннымБюджетирования

// Возвращает текст запроса для формирования временной таблицы с источниками данных правил получения фактических данных по статьям бюджетов.
// Источники данных зависят от хозяйственной операции документа.
//
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаИсточникиДанныхПравилПолученияФакта() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НастройкиХозяйственныхОпераций.Ссылка КАК ИсточникДанных,
	|	НастройкиХозяйственныхОпераций.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НастройкиХозяйственныхОпераций.Приход КАК Приход,
	|	НастройкиХозяйственныхОпераций.Расход КАК Расход
	|ПОМЕСТИТЬ ИсточникиДанныхПравилПолученияФакта
	|ИЗ
	|	Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|				ТОГДА НастройкиХозяйственныхОпераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ДенежныеСредства)
	|			ИНАЧЕ НастройкиХозяйственныхОпераций.ХозяйственнаяОперация В (ВЫБОР
	|						КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиентуНаПлатежнуюКарту)
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КомиссияПоЭквайрингу)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам)
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПроцентовПоКредитам)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеРасходы)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
	|								И &ПоТаблицеКорреспонденций
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаУслугПоАренде)
	|						ИНАЧЕ &ХозяйственнаяОперация
	|					КОНЕЦ, ВЫБОР
	|						КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
	|								И &ПоТаблицеКорреспонденций
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаОбеспечительногоПлатежа)
	|						ИНАЧЕ &ХозяйственнаяОперация
	|					КОНЕЦ, ВЫБОР
	|						КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
	|								И &ПоТаблицеКорреспонденций
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаВыкупнойСтоимостиПредметовАренды)
	|						ИНАЧЕ &ХозяйственнаяОперация
	|					КОНЕЦ, ВЫБОР
	|						КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
	|								И &ПоТаблицеКорреспонденций
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаВыкупнойСтоимостиПредметовАрендыАванс)
	|						ИНАЧЕ &ХозяйственнаяОперация
	|					КОНЕЦ)
	|		КОНЕЦ
	|	И НастройкиХозяйственныхОпераций.ИспользоватьВБюджетировании";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса в качестве источника фактических данных по документу.
// Источник фактических данных зависит от типов данных учета хозяйственной операции правила получения фактических данных по статьям бюджетов.
//
// Параметры:
//  Расход - ПеречислениеСсылка.ТипыДанныхУчета - расход по хозяйственной операции
//  Приход - ПеречислениеСсылка.ТипыДанныхУчета - приход по хозяйственной операции
//  ИмяВременнойТаблицы - Строка - имя временной таблицы (если не задано, то временная таблица не формируется)
//
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаИсточникФактаПоТипамДанныхУчета(Расход, Приход, ИмяВременнойТаблицы = "") Экспорт
	
	ТекстЗапроса = "";
	
	Если Расход <> Перечисления.ТипыДанныхУчета.ДенежныеСредства Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	Если Приход = Перечисления.ТипыДанныхУчета.ДенежныеСредства Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ДатаПлатежа
		|		КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	ТаблицаДанных.Ссылка КАК Регистратор,
		|	ТаблицаДанных.ХозяйственнаяОперация КАК ИсточникДанных,
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ТаблицаДанных.Касса
		//++ Локализация
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежа.Ведомость КАК Документ.ВедомостьНаВыплатуЗарплатыВКассу).Касса, ТаблицаДанных.Касса)
		//-- Локализация
		|		ИНАЧЕ ТаблицаДанных.БанковскийСчет
		|	КОНЕЦ КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		//++ Локализация
		|			ИЛИ ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		//-- Локализация
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ВЫБОР
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|			ТОГДА ЕСТЬNULL(ТаблицаЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств, ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств)
		|		ИНАЧЕ ТаблицаДанных.СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
		//++ Локализация
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств, ТаблицаДанных.СтатьяЦелевыхСредств)
		|		ИНАЧЕ ТаблицаДанных.СтатьяЦелевыхСредств
		|	КОНЕЦ КАК СтатьяЦелевыхСредств,
		//-- Локализация
		|	ТаблицаДанных.Валюта КАК Валюта,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
		|				ИЛИ ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты)
		|			ТОГДА ТаблицаДанных.БанковскийСчетПолучатель
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств)
		|			ТОГДА ТаблицаДанных.КассаПолучатель
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|			ТОГДА ЕСТЬNULL(ТаблицаЛицевыеСчетаСотрудников.ФизическоеЛицо, ТаблицаДанных.ПодотчетноеЛицо)
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|			ТОГДА ТаблицаДанных.ДоговорЭквайринга
		|	КОНЕЦ КАК КорДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица)
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУЭквайера)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваВПути)
		|	КОНЕЦ КАК КорТипДенежныхСредств,
		|	ТаблицаДанных.Валюта КАК КорВалюта,
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаДанных.СверхЛимита
		|			ТОГДА ВЫБОР
		|				КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) И ТаблицаДанных.СписокФизЛиц
		|					ТОГДА ТаблицаЛицевыеСчетаСотрудников.Сумма
		|				ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.СверхЛимита
		|			ТОГДА ВЫБОР
		|				КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) И ТаблицаДанных.СписокФизЛиц
		|					ТОГДА ТаблицаЛицевыеСчетаСотрудников.Сумма
		|				ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) И ТаблицаДанных.СписокФизЛиц
		|			ТОГДА ТаблицаЛицевыеСчетаСотрудников.Сумма
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|	КОНЕЦ КАК СуммаКВыплате
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО ТаблицаДанных.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
		|		И (НЕ ТаблицаДанных.СписокФизЛиц)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.ЛицевыеСчетаСотрудников КАК ТаблицаЛицевыеСчетаСотрудников
		|		ПО ТаблицаДанных.Ссылка = ТаблицаЛицевыеСчетаСотрудников.Ссылка
		|		И (ТаблицаДанных.СписокФизЛиц)
		|ГДЕ
		|	НЕ ТаблицаДанных.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
		|	И ТаблицаДанных.Ссылка = &Документ
		|	И ВЫБОР
		|			КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ДатаПлатежа
		|			КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
		|			ГДЕ
		|				ТаблицаДанных.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
		|				И НастройкиХозяйственныхОпераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ДенежныеСредства)
		|				И НастройкиХозяйственныхОпераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ДенежныеСредства))";
		
	ИначеЕсли Приход = Перечисления.ТипыДанныхУчета.ДоходыРасходы Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ДатаПлатежа
		|		КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	ТаблицаДанных.Ссылка КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КомиссияПоЭквайрингу)
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеРасходы)
		|		ИНАЧЕ ТаблицаДанных.ХозяйственнаяОперация
		|	КОНЕЦ КАК ИсточникДанных,
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|			ТОГДА ТаблицаДанных.ДоговорЭквайринга.НаправлениеДеятельности
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НаправлениеДеятельностиДС,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ТаблицаДанных.Касса
		//++ Локализация
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежа.Ведомость КАК Документ.ВедомостьНаВыплатуЗарплатыВКассу).Касса, ТаблицаДанных.Касса)
		//-- Локализация
		|		ИНАЧЕ ТаблицаДанных.БанковскийСчет
		|	КОНЕЦ КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		//++ Локализация
		|			ИЛИ ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		//-- Локализация
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ВЫБОР
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|			ТОГДА ЕСТЬNULL(ТаблицаДанных.ДоговорЭквайринга.СтатьяДвиженияДенежныхСредствКомиссия, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику))
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств, ТаблицаДанных.СтатьяДвиженияДенежныхСредств)
		|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
		//++ Локализация
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств, ТаблицаДанных.СтатьяЦелевыхСредств) КАК СтатьяЦелевыхСредств,
		//-- Локализация
		|	ТаблицаДанных.Валюта КАК Валюта,
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Подразделение, ТаблицаДанных.Подразделение) КАК ПодразделениеДоходовРасходов,
		|	ТаблицаРасшифровкаПлатежа.НаправлениеДеятельности КАК НаправлениеДеятельностиДоходовРасходов,
		|	ТаблицаРасшифровкаПлатежа.СтатьяРасходов КАК СтатьяДоходовРасходов,
		|	ТаблицаРасшифровкаПлатежа.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаДанных.СверхЛимита
		|			ТОГДА ВЫБОР
		|				КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|					ТОГДА ТаблицаДанных.СуммаКомиссии
		|				ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.СверхЛимита
		|			ТОГДА ВЫБОР
		|				КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|					ТОГДА ТаблицаДанных.СуммаКомиссии
		|				ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|			ТОГДА ТаблицаДанных.СуммаКомиссии
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|	КОНЕЦ КАК СуммаКВыплате
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО ТаблицаДанных.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
		|ГДЕ
		|	НЕ ТаблицаДанных.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
		|	И ТаблицаДанных.Ссылка = &Документ
		|	И ВЫБОР
		|			КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ДатаПлатежа
		|			КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВЫБОР
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|				ТОГДА ТаблицаДанных.СуммаКомиссии <> 0
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
		|				ТОГДА ТаблицаРасшифровкаПлатежа.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
		|			ИНАЧЕ ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
		|					ГДЕ
		|						ТаблицаДанных.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
		|						И НастройкиХозяйственныхОпераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ДоходыРасходы)
		|						И НастройкиХозяйственныхОпераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ДенежныеСредства))
		|		КОНЕЦ";
		
	ИначеЕсли Приход = Перечисления.ТипыДанныхУчета.Контрагенты Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ДатаПлатежа
		|		КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	ТаблицаДанных.Ссылка КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде В (ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.УслугаПоАренде), ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.УслугаПоАрендеАванс))
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаУслугПоАренде)
		|					КОГДА ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде = ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаОбеспечительногоПлатежа)
		|					КОГДА ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде = ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ВыкупнаяСтоимость)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаВыкупнойСтоимостиПредметовАренды)
		|					КОГДА ТаблицаРасшифровкаПлатежа.ТипПлатежаПоАренде = ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ВыкупнаяСтоимостьАванс)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаВыкупнойСтоимостиПредметовАрендыАванс)
		|					ИНАЧЕ ТаблицаДанных.ХозяйственнаяОперация
		|				КОНЕЦ
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам)
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаРасшифровкаПлатежа.ТипСуммыКредитаДепозита = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПроцентовПоКредитам)
		|					ИНАЧЕ ТаблицаДанных.ХозяйственнаяОперация
		|				КОНЕЦ
		|		ИНАЧЕ ТаблицаДанных.ХозяйственнаяОперация
		|	КОНЕЦ КАК ИсточникДанных,
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ТаблицаДанных.Касса.НаправлениеДеятельности
		|		ИНАЧЕ ТаблицаДанных.БанковскийСчет.НаправлениеДеятельности
		|	КОНЕЦ КАК НаправлениеДеятельностиДС,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ТаблицаДанных.Касса
		//++ Локализация
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежа.Ведомость КАК Документ.ВедомостьНаВыплатуЗарплатыВКассу).Касса, ТаблицаДанных.Касса)
		//-- Локализация
		|		ИНАЧЕ ТаблицаДанных.БанковскийСчет
		|	КОНЕЦ КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		//++ Локализация
		|			ИЛИ ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		//-- Локализация
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ВЫБОР
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств, ТаблицаДанных.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
		//++ Локализация
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств, ТаблицаДанных.СтатьяЦелевыхСредств) КАК СтатьяЦелевыхСредств,
		//-- Локализация
		|	ТаблицаДанных.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита <> ЗНАЧЕНИЕ(Справочник.ДоговорыКредитовИДепозитов.ПустаяСсылка)
		|			ТОГДА ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита.НаправлениеДеятельности
		|		КОГДА ТаблицаРасшифровкаПлатежа.ДоговорАренды <> ЗНАЧЕНИЕ(Справочник.ДоговорыАренды.ПустаяСсылка)
		|			ТОГДА ТаблицаРасшифровкаПлатежа.ДоговорАренды.НаправлениеДеятельности
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.НаправлениеДеятельности, ТаблицаДанных.НаправлениеДеятельности)
		|	КОНЕЦ КАК НаправлениеДеятельностиКонтрагента,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.Партнер, ТаблицаДанных.Партнер)
		|	КОНЕЦ КАК Партнер,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию))
		|			ТОГДА ТаблицаДанных.ОрганизацияПолучатель
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
		|			ТОГДА ТаблицаДанных.БанковскийСчетПолучатель.Владелец
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.Контрагент, ТаблицаДанных.Контрагент)
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита <> ЗНАЧЕНИЕ(Справочник.ДоговорыКредитовИДепозитов.ПустаяСсылка)
		|			ТОГДА ТаблицаРасшифровкаПлатежа.ДоговорКредитаДепозита
		|		КОГДА ТаблицаРасшифровкаПлатежа.ДоговорАренды <> ЗНАЧЕНИЕ(Справочник.ДоговорыАренды.ПустаяСсылка)
		|			ТОГДА ТаблицаРасшифровкаПлатежа.ДоговорАренды
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.ОбъектРасчетов.Договор, ТаблицаДанных.Договор)
		|	КОНЕЦ КАК Договор,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаРасшифровкаПлатежа.ОбъектРасчетов
		|	КОНЕЦ КАК ОбъектРасчетов,
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаДанных.СверхЛимита
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.СверхЛимита
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента) КАК СуммаКВыплате
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО ТаблицаДанных.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
		|ГДЕ
		|	НЕ ТаблицаДанных.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
		|	И ТаблицаДанных.Ссылка = &Документ
		|	И ВЫБОР
		|			КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ДатаПлатежа
		|			КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВЫБОР
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
		|					ГДЕ
		|						ТаблицаДанных.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
		|						И НастройкиХозяйственныхОпераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Контрагенты)
		|						И НастройкиХозяйственныхОпераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ДенежныеСредства))
		|		КОНЕЦ";
	
	ИначеЕсли Приход = Перечисления.ТипыДанныхУчета.ПрочиеАктивыПассивы Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ДатаПлатежа
		|		КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	ТаблицаДанных.Ссылка КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|			ТОГДА ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате
		|		ИНАЧЕ ТаблицаДанных.ХозяйственнаяОперация
		|	КОНЕЦ КАК ИсточникДанных,
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиДС,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|			ТОГДА ТаблицаДанных.Касса
		//++ Локализация
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежа.Ведомость КАК Документ.ВедомостьНаВыплатуЗарплатыВКассу).Касса, ТаблицаДанных.Касса)
		//-- Локализация
		|		ИНАЧЕ ТаблицаДанных.БанковскийСчет
		|	КОНЕЦ КАК ДенежныеСредства,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		//++ Локализация
		|			ИЛИ ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу)
		//-- Локализация
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		КОГДА ТаблицаДанных.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ВЫБОР
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств, ТаблицаДанных.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
		//++ Локализация
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.СтатьяЦелевыхСредств, ТаблицаДанных.СтатьяЦелевыхСредств) КАК СтатьяЦелевыхСредств,
		//-- Локализация
		|	ТаблицаДанных.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
		|			ТОГДА ТаблицаРасшифровкаПлатежа.Подразделение
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ПодразделениеАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
		|			ТОГДА ТаблицаРасшифровкаПлатежа.НаправлениеДеятельности
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НаправлениеДеятельностиАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги)
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ОплатаТруда)
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗаймыВыданные)
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.УпрБалансЛизинг)
		|		ИНАЧЕ ТаблицаРасшифровкаПлатежа.СтатьяРасходов
		|	КОНЕЦ КАК СтатьяАктивовПассивов,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет)
		|			ТОГДА ТаблицаДанных.ТипНалога
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаАрендодателю)
		|			ТОГДА ТаблицаРасшифровкаПлатежа.ДоговорАренды
		|		КОГДА ТаблицаДанных.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты))
		|			ТОГДА ТаблицаРасшифровкаПлатежа.АналитикаАктивовПассивов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаАктивовПассивов,
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаДанных.СверхЛимита
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеВРамкахЛимита,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.СверхЛимита
		|			ТОГДА ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКВыплатеСверхЛимита,
		|	ЕСТЬNULL(ТаблицаРасшифровкаПлатежа.Сумма, ТаблицаДанных.СуммаДокумента) КАК СуммаКВыплате
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|		ПО ТаблицаДанных.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
		|ГДЕ
		|	НЕ ТаблицаДанных.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
		|	И ТаблицаДанных.Ссылка = &Документ
		|	И ВЫБОР
		|			КОГДА ТаблицаДанных.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ДатаПлатежа
		|			КОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ТаблицаДанных.ЖелательнаяДатаПлатежа
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТаблицаДанных.Дата, ДЕНЬ)
		|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВЫБОР
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
		|				ТОГДА НЕ ТаблицаРасшифровкаПлатежа.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
		|			КОГДА ТаблицаДанных.ХозяйственнаяОперацияПоЗарплате <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
		|					ГДЕ
		|						ТаблицаДанных.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
		|						И НастройкиХозяйственныхОпераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ПрочиеАктивыПассивы)
		|						И НастройкиХозяйственныхОпераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.ДенежныеСредства))
		|		КОНЕЦ";
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ИмяВременнойТаблицы", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДанных.Ссылка = &Документ", "ТаблицаДанных.Проведен");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#Область ТекущиеДела

// Заполняет список текущих дел пользователя.
// Параметры:
//    ТекущиеДела - ТаблицаЗначений - ТекущиеДелаСлужебный.НоваяТаблицаТекущихДел().
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	ИмяФормы = "Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаСпискаЗаявокКСогласованию";
	
	ОбщиеПараметрыЗапросов = ТекущиеДелаСлужебный.ОбщиеПараметрыЗапросов();
	
	// Определим доступны ли текущему пользователю показатели группы
	Доступность =
		(ОбщиеПараметрыЗапросов.ЭтоПолноправныйПользователь
			Или ПравоДоступа("Просмотр", Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств))
		И (ПравоДоступа("Изменение", Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств)
			ИЛИ ПраваПользователяПовтИсп.СогласованиеЗаявокНаРасходованиеДенежныхСредств())
		И ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	
	Если НЕ Доступность Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет показателей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА ЗаявкаНаРасходованиеДенежныхСредств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована)
	|				ТОГДА ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЗаявкиНаОплатуКСогласованию,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА ЗаявкаНаРасходованиеДенежныхСредств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована)
	|					И ЗаявкаНаРасходованиеДенежныхСредств.ДатаПлатежа < НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ)
	|				ТОГДА ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЗаявкиНаОплатуКСогласованиюПросрочено
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Проведен";
	
	Результат = ТекущиеДелаСлужебный.ЧисловыеПоказателиТекущихДел(Запрос, ОбщиеПараметрыЗапросов);
	
	// Заполнение дел.
	// ЗаявкиНаОплату
	ДелоРодитель = ТекущиеДела.Добавить();
	ДелоРодитель.Идентификатор  = "ЗаявкиНаОплату";
	ДелоРодитель.Представление  = НСтр("ru = 'Заявки на оплату';
										|en = 'Payment requests'");
	ДелоРодитель.Владелец       = Метаданные.Подсистемы.Закупки;
	
	// ЗаявкиНаОплатуКСогласованию
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	ПараметрыОтбора.Вставить("ДатаОплаты", ОбщиеПараметрыЗапросов.ПустаяДата);
	ПараметрыОтбора.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Приоритет", Справочники.Приоритеты.ПустаяСсылка());
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор  = "ЗаявкиНаОплатуКСогласованию";
	Дело.ЕстьДела       = Результат.ЗаявкиНаОплатуКСогласованию > 0;
	Дело.Представление  = НСтр("ru = 'Заявки к согласованию';
								|en = 'Requests for approval'");
	Дело.Количество     = Результат.ЗаявкиНаОплатуКСогласованию;
	Дело.Важное         = Ложь;
	Дело.Форма          = ИмяФормы;
	Дело.ПараметрыФормы = Новый Структура("СтруктураБыстрогоОтбора", ПараметрыОтбора);
	Дело.Владелец       = "ЗаявкиНаОплату";
	
	// ЗаявкиНаОплатуКСогласованиюПросрочено
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	ПараметрыОтбора.Вставить("ДатаОплаты", НачалоДня(ОбщиеПараметрыЗапросов.ТекущаяДата - 86400));
	ПараметрыОтбора.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Приоритет", Справочники.Приоритеты.ПустаяСсылка());
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор  = "ЗаявкиНаОплатуКСогласованиюПросрочено";
	Дело.ЕстьДела       = Результат.ЗаявкиНаОплатуКСогласованиюПросрочено > 0;
	Дело.Представление  = НСтр("ru = 'Согласование просрочено';
								|en = 'Approval overdue'");
	Дело.Количество     = Результат.ЗаявкиНаОплатуКСогласованиюПросрочено;
	Дело.Важное         = Истина;
	Дело.Форма          = ИмяФормы;
	Дело.ПараметрыФормы = Новый Структура("СтруктураБыстрогоОтбора", ПараметрыОтбора);
	Дело.Владелец       = "ЗаявкиНаОплату";
	
	Если Результат.ЗаявкиНаОплатуКСогласованию > 0
		Или Результат.ЗаявкиНаОплатуКСогласованиюПросрочено > 0 Тогда
		ДелоРодитель.ЕстьДела = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ЗаявкаНаРасходованиеДенежныхСредствЛокализация.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.ЗаявкаНаРасходованиеДенежныхСредств.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.20.26";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8e5bdd7c-01c7-4179-a14c-434aca67b68f");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.ЗаявкаНаРасходованиеДенежныхСредств.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Обновление документов ""Заявка на расходование денежных средств"":';
								|en = 'Update the ""Payment request"" documents:'"));
	СписокОписаний.Добавить(НСтр("ru = '- очистка заявок от ""Пустых"" объектов расчетов и перезаполнение флага ""Контролировать оплату по объектам расчетов"";';
								|en = '- Delete ""Empty"" AR/AP objects from requests and reselect the ""Control payment by AR/AP objects"" checkbox.'"));
	
	//++ Локализация
	СписокОписаний.Добавить(НСтр("ru = '- замена операции ""Оплата самозанятому"" на операцию ""Оплата поставщику"" с признаком ""Оплата самозанятому"";';
								|en = '- Replace the ""Payment to self-employed person"" transaction with the ""Payment to vendor"" transaction with the ""Payment to self-employed person"" flag.'"));
	//-- Локализация
	
	СписокОписаний.Добавить(НСтр("ru = '- заполнение реквизита ""налог"" по данным реквизита  ""Налог (не используется)"";';
								|en = '- Fill in the ""Tax"" attribute according to the ""Tax (not used)"" attribute data.'"));
	СписокОписаний.Добавить(НСтр("ru = '- замена аналитики с типом перечисление типы налогов на справочник виды налогов и взносов';
								|en = '- Replace the dimension value ""Tax types"" enumeration type with the ""Tax and contribution kinds"" catalog.'"));

	Обработчик.Комментарий = СтрСоединить(СписокОписаний, Символы.ПС);
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	Приоритет = Обработчик.ПриоритетыВыполнения.Добавить();
	Приоритет.Процедура = "Документы.ЗаявкаНаРасходованиеДенежныхСредств.ОбработатьДокументыДляПереходаНаНовуюВерсию";
	Приоритет.Порядок = "До";
	
	//++ Локализация
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.ЗаявкаНаРасходованиеДенежныхСредств.ОбработатьДокументыДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.22.173";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b40f5d5b-4a7d-40e6-af11-f02f48e85e13");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.ЗаявкаНаРасходованиеДенежныхСредств.ЗарегистрироватьДокументыКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	ТекстОбработчика = НСтр("ru = 'Заполнение реквизитов ""ИНН плательщика"", ""КПП плательщика"" и ""Текст плательщика"" в документе ""Заявка на расходование денежных средств""';
							|en = 'Заполнение реквизитов ""ИНН плательщика"", ""КПП плательщика"" и ""Текст плательщика"" в документе ""Заявка на расходование денежных средств""'");
	Обработчик.Комментарий = ТекстОбработчика;
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.Организации.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.РегистрацииВНалоговомОргане.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.БанковскиеСчетаОрганизаций.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	Приоритет = Обработчик.ПриоритетыВыполнения.Добавить();
	Приоритет.Процедура = "РегистрыСведений.РегистрацииВНалоговомОргане.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Приоритет.Порядок = "До";
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	Приоритет = Обработчик.ПриоритетыВыполнения.Добавить();
	Приоритет.Процедура = "РегистрыНакопления.РасчетыСКлиентами.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Приоритет.Порядок = "После";
	//-- Локализация

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|//Очистка от ""Пустых"" объектов расчетов.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРасшифровки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеРасшифровки
	|ГДЕ
	|	ДанныеРасшифровки.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|	И ДанныеРасшифровки.ОбъектРасчетов.Объект = Неопределено
	|
	//++ Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УдалитьОплатаСамозанятому)
	//-- Локализация
	|
	|
	|ОБЪЕДИНИТЬ
	|
	|//Заполнение реквизита ТипНалога
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	(ЗаявкаНаРасходованиеДенежныхСредств.УдалитьТипНалога <> ЗНАЧЕНИЕ(Перечисление.УдалитьТипыНалогов.ПустаяСсылка)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.ПустаяСсылка))
	|	ИЛИ (ЗаявкаНаРасходованиеДенежныхСредств.АналитикаАктивовПассивов ССЫЛКА Перечисление.УдалитьТипыНалогов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.АналитикаАктивовПассивов ССЫЛКА Перечисление.УдалитьТипыНалогов
	|
	|";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Не удалось обработать документы ""Заявка на расходование денежных средств"" по обработчику:';
								|en = 'Cannot process the ""Payment request"" documents by the handler:'"));
	СписокОписаний.Добавить(НСтр("ru = '- очистка заявок от ""Пустых"" объектов расчетов и перезаполнение флага ""Контролировать оплату по объектам расчетов"";';
								|en = '- Delete ""Empty"" AR/AP objects from requests and reselect the ""Control payment by AR/AP objects"" checkbox.'"));
	
	//++ Локализация
	СписокОписаний.Добавить(НСтр("ru = '- замена операции ""Оплата самозанятому"" на операцию ""Оплата поставщику"" с признаком ""Оплата самозанятому"";';
								|en = '- Replace the ""Payment to self-employed person"" transaction with the ""Payment to vendor"" transaction with the ""Payment to self-employed person"" flag.'"));
	//-- Локализация
	
	СписокОписаний.Добавить(НСтр("ru = '- заполнение реквизита ""Налог"" по данным реквизита  ""Налог (не используется)"";';
								|en = '- Fill in the ""Tax"" attribute according to the ""Tax (not used)"" attribute data.'"));
	СписокОписаний.Добавить(НСтр("ru = '- замена аналитики с типом перечисление типы налогов на справочник виды налогов и взносов';
								|en = '- Replace the dimension value ""Tax types"" enumeration type with the ""Tax and contribution kinds"" catalog.'"));

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляОбновления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаДокументов
		|ИЗ
		|	&ДанныеДляОбновления КАК ДанныеДляОбновления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокумента.ВерсияДанных КАК ВерсияДанных
		|ИЗ
		|	ТаблицаДокументов КАК ТаблицаДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
		|		ПО ТаблицаДокументов.Ссылка = ДанныеДокумента.Ссылка
		|";
	
	Запрос.УстановитьПараметр("ДанныеДляОбновления", ОбновляемыеДанные);
	
	Документ = Запрос.Выполнить().Выбрать();
	
	Пока Документ.Следующий() Цикл
		
		ПричинаИсключения = 0;
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = 1; // Блокировка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Документ.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ДокументОбъект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(
				Документ.Ссылка, Документ.ВерсияДанных, Параметры.Очередь); // ДокументОбъект
			
			ПричинаИсключения = 2; // ПлохиеДанные
			Рекомендация = НСтр("ru = 'Перепроведите документ вручную.';
								|en = 'Repost the document manually.'");
			
			ОбъектИзменен = Ложь;
			
			Если ДокументОбъект <> Неопределено Тогда

				Перечисления.УдалитьТипыНалогов.ЗаполнитьРеквизитТипНалога(ДокументОбъект, "УдалитьТипНалога", "ТипНалога");
				Перечисления.УдалитьТипыНалогов.ЗаполнитьРеквизитТипНалога(ДокументОбъект, "АналитикаАктивовПассивов");
				Перечисления.УдалитьТипыНалогов.ЗаполнитьРеквизитТипНалога(ДокументОбъект, "РасшифровкаПлатежа.АналитикаАктивовПассивов");
				
				Если ДокументОбъект.Модифицированность() Тогда
					ОбъектИзменен = Истина;
				КонецЕсли;
				
				//Очистка от "Пустых" объектов расчетов
				ОбъектыРасчетов = ДокументОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов");
				ОбъектыОбъектовРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ОбъектыРасчетов,"Объект");
				Для Каждого Стр Из ДокументОбъект.РасшифровкаПлатежа Цикл
					Если ЗначениеЗаполнено(Стр.ОбъектРасчетов) И НЕ ЗначениеЗаполнено(ОбъектыОбъектовРасчетов[Стр.ОбъектРасчетов]) Тогда
						Стр.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
						ДокументОбъект.КонтролироватьОплатуПоОбъектамРасчетов = Ложь;
						ОбъектИзменен = Истина;
					КонецЕсли;
				КонецЦикла;
				
				//++ Локализация
				Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдалитьОплатаСамозанятому Тогда
					
					ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
					ДокументОбъект.ОперацияССамозанятым = Истина; 
					#Область УХ_Казначейство
					ДокументОбъект.ВидОперацииУХ = Справочники.ВидыОперацийУХ.ОплатаПоставщику;
					НаборЗаписей = РегистрыСведений.РазмещениеЗаявок.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ЗаявкаНаОперацию.Установить(ДокументОбъект.Ссылка);
					НаборЗаписей.Прочитать();
					Для Каждого ТекЗапись Из НаборЗаписей Цикл
						ТекЗапись.ВидОперацииУХ = ДокументОбъект.ВидОперацииУХ;
					КонецЦикла;    
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
					#КонецОбласти
					ОбъектИзменен = Истина;
					
				КонецЕсли;
				//-- Локализация
					
			КонецЕсли;
			
			ПричинаИсключения = 3; // Запись
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Документ.Ссылка);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Документ.Ссылка);
			
			Если ПричинаИсключения = 2 Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					Документ.Ссылка, Рекомендация, ИнформацияОбОшибке());
				ИсключенияПриОбновлении.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения = 3 Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		
		СписокОписаний.Добавить(НСтр("ru = 'Всего пропущено: %1';
									|en = 'Total skipped: %1'"));
		ТекстСообщения = СтрШаблон(СтрСоединить(СписокОписаний, Символы.ПС), ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
		
	Иначе
		
		ШаблонСообщения = НСтр("ru = 'Обработана порция заявок на расходование ДС: %1';
								|en = 'A batch of payment requests is processed: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, , ,
			ТекстСообщения);
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
	
КонецПроцедуры

//++ Локализация

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДокументыКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Ссылка,
	|	ЗаявкаНаРасходованиеДенежныхСредств.ИННПлательщика КАК ИННПлательщика,
	|	ЗаявкаНаРасходованиеДенежныхСредств.КПППлательщика КАК КПППлательщика,
	|	ЗаявкаНаРасходованиеДенежныхСредств.ТекстПлательщика КАК ТекстПлательщика,
	|	ЗаявкаНаРасходованиеДенежныхСредств.ПеречислениеВБюджет КАК ПеречислениеВБюджет
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.ИННПлательщика = """"
	|	ИЛИ ЗаявкаНаРасходованиеДенежныхСредств.КПППлательщика = """"
	|	ИЛИ ВЫРАЗИТЬ(ЗаявкаНаРасходованиеДенежныхСредств.ТекстПлательщика КАК СТРОКА(1024)) = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаРасходованиеДенежныхСредств.Дата УБЫВ";
	
	ЗарегистрированныеДокументы = Запрос.Выполнить().Выгрузить();
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = ТекстЗапросаРеквизитовПлательщикаСГруппировкойПоДокументам();
	ЗапросДанных.УстановитьПараметр("ПроверяемыеДокументы", ЗарегистрированныеДокументы);
	ВыборкаДанныхПоДокументам = ЗапросДанных.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СписокДокументов = Новый Массив;
	
	Для Каждого ТекущийДокумент Из ЗарегистрированныеДокументы Цикл
		
		НайденныеРеквизитыПлательщика = РеквизитыПлательщикаПоДокументу(
			ВыборкаДанныхПоДокументам, ТекущийДокумент.Ссылка, ТекущийДокумент.ПеречислениеВБюджет);
		
		Если ПустаяСтрока(ТекущийДокумент.ИННПлательщика)
			И Не ПустаяСтрока(НайденныеРеквизитыПлательщика.ИННПлательщика) Тогда
			СписокДокументов.Добавить(ТекущийДокумент.Ссылка);
		ИначеЕсли ПустаяСтрока(ТекущийДокумент.КПППлательщика)
			И Не ПустаяСтрока(НайденныеРеквизитыПлательщика.КПППлательщика) Тогда
			СписокДокументов.Добавить(ТекущийДокумент.Ссылка);
		ИначеЕсли ПустаяСтрока(ТекущийДокумент.ТекстПлательщика)
			И Не ПустаяСтрока(НайденныеРеквизитыПлательщика.ТекстПлательщика) Тогда
			СписокДокументов.Добавить(ТекущийДокумент.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, СписокДокументов);
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДокументыДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Не удалось заполнить реквизиты документа ""Заявка на расходование денежных средств"" по обработчику';
								|en = 'Не удалось заполнить реквизиты документа ""Заявка на расходование денежных средств"" по обработчику'"));

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляОбновления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаДокументов
		|ИЗ
		|	&ДанныеДляОбновления КАК ДанныеДляОбновления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокумента.ВерсияДанных КАК ВерсияДанных
		|ИЗ
		|	ТаблицаДокументов КАК ТаблицаДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
		|		ПО ТаблицаДокументов.Ссылка = ДанныеДокумента.Ссылка
		|";
	
	Запрос.УстановитьПараметр("ДанныеДляОбновления", ОбновляемыеДанные);
	Документ = Запрос.Выполнить().Выбрать();
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = ТекстЗапросаРеквизитовПлательщикаСГруппировкойПоДокументам();
	ЗапросДанных.УстановитьПараметр("ПроверяемыеДокументы", ОбновляемыеДанные);
	ВыборкаПоДокументам = ЗапросДанных.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Документ.Следующий() Цикл
		
		ПричинаИсключения = "";
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Документ.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ДокументОбъект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(
				Документ.Ссылка, Документ.ВерсияДанных, Параметры.Очередь); // ДокументОбъект
			
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Перепроведите документ вручную.';
								|en = 'Перепроведите документ вручную.'");
			
			Если ДокументОбъект <> Неопределено Тогда

				РеквизитыПлательщика = РеквизитыПлательщикаПоДокументу(
					ВыборкаПоДокументам, Документ.Ссылка, ДокументОбъект.ПеречислениеВБюджет);
				
				Если ПустаяСтрока(ДокументОбъект.ИННПлательщика)
					И Не ПустаяСтрока(РеквизитыПлательщика.ИННПлательщика) Тогда
					ДокументОбъект.ИННПлательщика = РеквизитыПлательщика.ИННПлательщика;
				КонецЕсли;
					
				Если ПустаяСтрока(ДокументОбъект.КПППлательщика)
					И Не ПустаяСтрока(РеквизитыПлательщика.КПППлательщика) Тогда
					
					ДействуетПриказ58н = ПлатежиВБюджетКлиентСервер.ДействуетПриказ58н_202604(ДокументОбъект.Дата);
					
					Если ДействуетПриказ58н
						И ДокументОбъект.ТипНалога = Справочники.ВидыНалоговВзносов.ЕдиныйНалоговыйПлатеж Тогда
						РеквизитыПлательщика.КПППлательщика = "0";
					КонецЕсли;
					
					ДокументОбъект.КПППлательщика = РеквизитыПлательщика.КПППлательщика;
					
				КонецЕсли;
				
				Если ПустаяСтрока(ДокументОбъект.ТекстПлательщика)
					И Не ПустаяСтрока(РеквизитыПлательщика.ТекстПлательщика) Тогда
					ДокументОбъект.ТекстПлательщика = РеквизитыПлательщика.ТекстПлательщика;
				КонецЕсли;
				
				ПричинаИсключения = "Запись";
				
				Если ДокументОбъект.Модифицированность() Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Документ.Ссылка);
				КонецЕсли;
				
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Документ.Ссылка);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					Документ.Ссылка, Рекомендация, ИнформацияОбОшибке());
				ИсключенияПриОбновлении.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения = "Запись" Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		
		СписокОписаний.Добавить(НСтр("ru = 'Всего пропущено: %1';
									|en = 'Всего пропущено: %1'"));
		ТекстСообщения = СтрШаблон(СтрСоединить(СписокОписаний, Символы.ПС), ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
	
КонецПроцедуры

Функция ТекстЗапросаРеквизитовПлательщикаСГруппировкойПоДокументам()
	
	Возврат 
		"ВЫБРАТЬ
		|	ПроверяемыеДокументы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаДокументов
		|ИЗ
		|	&ПроверяемыеДокументы КАК ПроверяемыеДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
		|	ДанныеДокумента.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Организация КАК Организация
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	ТаблицаДокументов КАК ТаблицаДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
		|		ПО ТаблицаДокументов.Ссылка = ДанныеДокумента.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсходныеДанные.Организация КАК Организация,
		|	Организации.ИНН КАК ИНН,
		|	Организации.КПП КАК КПП,
		|	Организации.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное
		|ПОМЕСТИТЬ ТекущиеРеквизитыОрганизации
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ИсходныеДанные.Организация = Организации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ИсходныеДанные.ПеречислениеВБюджет
		|				И ЕСТЬNULL(БанковскиеСчетаОрганизаций.ТекстКорреспондентаБюджет, """") <> """"
		|			ТОГДА БанковскиеСчетаОрганизаций.ТекстКорреспондентаБюджет
		|		ИНАЧЕ ЕСТЬNULL(ОрганизацииИсторияНаименований.НаименованиеСокращенное, ТекущиеРеквизитыОрганизации.НаименованиеСокращенное)
		|	КОНЕЦ КАК ЗначениеРеквизита,
		|	ВЫБОР
		|		КОГДА ИсходныеДанные.ПеречислениеВБюджет
		|				И ЕСТЬNULL(БанковскиеСчетаОрганизаций.ТекстКорреспондентаБюджет, """") <> """"
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ ЕСТЬNULL(ОрганизацииИсторияНаименований.Период, ДАТАВРЕМЯ(1, 1, 1))
		|	КОНЕЦ КАК НачалоДействия,
		|	ИсходныеДанные.Ссылка КАК Документ,
		|	0 КАК Признак
		|ПОМЕСТИТЬ ИсторияЗначенийРеквизитов
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ИсторияНаименований КАК ОрганизацииИсторияНаименований
		|		ПО ИсходныеДанные.Организация = ОрганизацииИсторияНаименований.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеРеквизитыОрганизации КАК ТекущиеРеквизитыОрганизации
		|		ПО ИсходныеДанные.Организация = ТекущиеРеквизитыОрганизации.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|		ПО ИсходныеДанные.БанковскийСчет = БанковскиеСчетаОрганизаций.Ссылка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ИсходныеДанные.ПеречислениеВБюджет
		|					И ЕСТЬNULL(БанковскиеСчетаОрганизаций.ТекстКорреспондентаБюджет, """") <> """"
		|				ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|			ИНАЧЕ ЕСТЬNULL(ОрганизацииИсторияНаименований.Период, ДАТАВРЕМЯ(1, 1, 1))
		|		КОНЕЦ <= ИсходныеДанные.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Организации.РегистрацияВНалоговомОргане = """"
		|			ТОГДА Организации.КПП
		|		ИНАЧЕ ЕСТЬNULL(РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане.КПП, Организации.КПП)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Организации.РегистрацияВНалоговомОргане = """"
		|			ТОГДА ИсходныеДанные.Дата
		|		ИНАЧЕ ЕСТЬNULL(РегистрацииВНалоговомОргане.Период, ДАТАВРЕМЯ(1, 1, 1))
		|	КОНЕЦ,
		|	ИсходныеДанные.Ссылка,
		|	1
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ИсходныеДанные.Организация = РегистрацииВНалоговомОргане.Организация
		|			И (РегистрацииВНалоговомОргане.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеРеквизитыОрганизации КАК Организации
		|		ПО ИсходныеДанные.Организация = Организации.Организация
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Организации.РегистрацияВНалоговомОргане = """"
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЕСТЬNULL(РегистрацииВНалоговомОргане.Период, ДАТАВРЕМЯ(1, 1, 1)) <= ИсходныеДанные.Дата
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТекущиеРеквизитыОрганизации.ИНН,
		|	ИсходныеДанные.Дата,
		|	ИсходныеДанные.Ссылка,
		|	2
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеРеквизитыОрганизации КАК ТекущиеРеквизитыОрганизации
		|		ПО ИсходныеДанные.Организация = ТекущиеРеквизитыОрганизации.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияЗначенийРеквизитов.Документ КАК Документ,
		|	МАКСИМУМ(ИсторияЗначенийРеквизитов.НачалоДействия) КАК НачалоДействия,
		|	ИсторияЗначенийРеквизитов.Признак КАК Признак
		|ПОМЕСТИТЬ БлижайшиеЗаписи
		|ИЗ
		|	ИсторияЗначенийРеквизитов КАК ИсторияЗначенийРеквизитов
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияЗначенийРеквизитов.Документ,
		|	ИсторияЗначенийРеквизитов.Признак
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияЗначенийРеквизитов.Документ КАК Документ,
		|	ИсторияЗначенийРеквизитов.ЗначениеРеквизита КАК ЗначениеРеквизита,
		|	ИсторияЗначенийРеквизитов.Признак КАК Признак
		|ИЗ
		|	ИсторияЗначенийРеквизитов КАК ИсторияЗначенийРеквизитов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БлижайшиеЗаписи КАК БлижайшиеЗаписи
		|		ПО ИсторияЗначенийРеквизитов.Документ = БлижайшиеЗаписи.Документ
		|			И ИсторияЗначенийРеквизитов.НачалоДействия = БлижайшиеЗаписи.НачалоДействия
		|			И ИсторияЗначенийРеквизитов.Признак = БлижайшиеЗаписи.Признак
		|ИТОГИ ПО
		|	Документ";
	
КонецФункции

Функция РеквизитыПлательщикаПоДокументу(ВыборкаПоДокументам, Документ, ЭтоПеречислениеВБюджет)

	Отбор = Новый Структура("Документ", Документ);
	
	РеквизитыПлательщика = Новый Структура;
	РеквизитыПлательщика.Вставить("ИННПлательщика", "");
	РеквизитыПлательщика.Вставить("КПППлательщика", "");
	РеквизитыПлательщика.Вставить("ТекстПлательщика", "");
	ВыборкаПоДокументам.Сбросить();
	
	Если ВыборкаПоДокументам.НайтиСледующий(Отбор) Тогда
		
		ДанныеПлательщика = ВыборкаПоДокументам.Выбрать();
		
		Пока ДанныеПлательщика.Следующий() Цикл
			
			Если ДанныеПлательщика.Признак = 0 Тогда
				РеквизитыПлательщика.ТекстПлательщика = ДанныеПлательщика.ЗначениеРеквизита;
			ИначеЕсли ДанныеПлательщика.Признак = 1 Тогда
				РеквизитыПлательщика.КПППлательщика = ДанныеПлательщика.ЗначениеРеквизита;
				ОбработатьРеквизитПлательщика(РеквизитыПлательщика.КПППлательщика, ЭтоПеречислениеВБюджет);
			ИначеЕсли ДанныеПлательщика.Признак = 2 Тогда
				РеквизитыПлательщика.ИННПлательщика = ДанныеПлательщика.ЗначениеРеквизита;
				ОбработатьРеквизитПлательщика(РеквизитыПлательщика.ИННПлательщика, ЭтоПеречислениеВБюджет);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РеквизитыПлательщика;

КонецФункции

// Обрабатывает реквизит плательщика, удаляя лидирующие нули и подставляя значение "0" при пустой строке.
//
// Параметры:
//   ЗначениеРеквизита - Строка - обрабатываемое значение реквизита (ИНН или КПП)
//   ЭтоПеречислениеВБюджет - Булево - признак перечисления в бюджет
//
Процедура ОбработатьРеквизитПлательщика(ЗначениеРеквизита, ЭтоПеречислениеВБюджет)
	
	Результат = СокрЛП(ЗначениеРеквизита);
	
	Если Лев(Результат, 2) = "00" Тогда
		ЗначениеРеквизита = "0";
	КонецЕсли;
	
	Если ПустаяСтрока(Результат) Тогда
		
		Если ЭтоПеречислениеВБюджет Тогда
			ЗначениеРеквизита = "0";
		Иначе
			ЗначениеРеквизита = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

#КонецОбласти

#Область УХ_Встраивание

Процедура ПоляДанныхПредставления(СтруктураПолей) Экспорт
	
	СтруктураПолей.Сумма = "СуммаДокумента";
	СтруктураПолей.Валюта = "Валюта";
	СтруктураПолей.ДатаПланируемая = "ЖелательнаяДатаПлатежа";
	СтруктураПолей.ДатаНеПозднее = "КрайняяДата";
	
КонецПроцедуры

// Функция не отрабатывает операцию ВыдачаДенежныхСредствПодотчетнику
//  Если СписокФизлиц = Истина Тогда БезРасшифровки
//  Иначе СРасшифровкой
//
Функция ХозОперацииБезРасшифровки() Экспорт
	
	ХО = Перечисления.ХозяйственныеОперации;
	
	Массив = Новый Массив;
	
	Массив.Добавить(ХО.ВнутренняяПередачаДенежныхСредств); // между филиалами
	Массив.Добавить(ХО.КонвертацияВалюты); // между филиалами  
	#Область УХ_Встраивание
	Массив.Добавить(ХО.ВыдачаДенежныхСредствПодотчетнику); // между филиалами
	#КОнецОбласти
	
	Если Не Константы.ИспользоватьНачислениеЗарплаты.Получить() Тогда
		Массив.Добавить(ХО.ВыплатаЗарплаты);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ") Тогда
		Массив.Добавить(ХО.ВыдачаЗаймаСотруднику);
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

// Хоз. операции без расшифровки, со статьями ДДС списания и зачисления.
Функция ХозОперацииСписаниеЗачисление() Экспорт
	
	ХО = Перечисления.ХозяйственныеОперации;
	
	Массив = Новый Массив;
	Массив.Добавить(ХО.ВнутренняяПередачаДенежныхСредств); // между филиалами
	
	Возврат Массив;
	
КонецФункции

// УХСогласование
Функция ПроверитьВозможностьУстановкиСостояния(ОбъектСсылка, СостояниеОбъекта, ПротоколОшибок = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектСсылка) <> Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		ТекстОшибки = СтрШаблон( 
			НСтр("ru = 'Объект %1 не является заявкой на расходование денежных средств.'"),
			ОбъектСсылка);
		УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(
			ПротоколОшибок, ОбъектСсылка, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ПроверкаПройдена = Истина;
	
	Если СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена Тогда
		
		// Организация, контрагент, договор, счет контрагента, статьи ДДС, ЦФО, Период контроля
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаОперацию.Ссылка КАК Ссылка,
		|	ЗаявкаНаОперацию.Организация КАК Организация,
		|	ЗаявкаНаОперацию.Контрагент КАК Контрагент,
		|	ЗаявкаНаОперацию.ЦФО КАК ЦФО,
		|	ЗаявкаНаОперацию.БанковскийСчетКонтрагента КАК СчетКонтрагента,
		|	ЗаявкаНаОперацию.БанковскийСчетПолучатель КАК БанковскийСчетПолучатель,
		|	ЗаявкаНаОперацию.Договор КАК ДоговорКонтрагента,
		|	ЗаявкаНаОперацию.ДоговорАренды КАК ДоговорАренды,
		|	ЗаявкаНаОперацию.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
		|	ЗаявкаНаОперацию.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
		|	ЗаявкаНаОперацию.ФормаОплатыЗаявки КАК ФормаОплаты,
		|	ЗаявкаНаОперацию.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
		|	ЗаявкаНаОперацию.РасшифровкаПлатежа.(
		|		НомерСтроки КАК НомерСтроки,
		|		ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|		ОбъектРасчетов.Соглашение.ИспользуютсяДоговорыКонтрагентов КАК ИспользуютсяДоговорыКонтрагентов,
		|		Партнер КАК Партнер
		|	) КАК ДвиженияОперации,
		|	ЗаявкаНаОперацию.СуммаДокумента КАК СуммаДокумента,
		|	ЗаявкаНаОперацию.Валюта КАК ВалютаДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств) КАК ВидБюджета,
		|	ЗаявкаНаОперацию.ВидОперацииУХ КАК ВидОперацииУХ,
		|	ЗаявкаНаОперацию.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗаявкаНаОперацию.ХозяйственнаяОперацияПоЗарплате КАК ХозяйственнаяОперацияПоЗарплате,
		|	ЗаявкаНаОперацию.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ЗаявкаНаОперацию.СписокФизЛиц КАК СписокФизЛиц,
		|	ЗаявкаНаОперацию.ЛицевыеСчетаСотрудников.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизическоеЛицо КАК ФизическоеЛицо,
		|		ЛицевойСчет КАК ЛицевойСчет,
		|		Сумма КАК Сумма,
		|		СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
		|	) КАК ЛицевыеСчетаСотрудников,
		|	ЗаявкаНаОперацию.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
		|	ЗаявкаНаОперацию.Партнер КАК Партнер,
		|	ЗаявкаНаОперацию.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаОперацию
		|ГДЕ
		|	ЗаявкаНаОперацию.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
		ДанныеДокумента = Запрос.Выполнить().Выгрузить()[0];
		
		Если ДанныеДокумента.ДвиженияОперации.Количество() <> 0
			И ДанныеДокумента.ДвиженияОперации[0].ИспользуютсяДоговорыКонтрагентов = Ложь Тогда
		    ИспользуютсяДоговорыКонтрагентов = Ложь;
		Иначе
			ИспользуютсяДоговорыКонтрагентов = Истина;		
		КонецЕсли;
				
		// Определение местонахождения статьи движения денежных средств
		МассивВсехРеквизитов = Новый Массив; МассивРеквизитовОперации = Новый Массив;
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперацииУХ(
			ДанныеДокумента, МассивВсехРеквизитов, МассивРеквизитовОперации);
		
		//
		РеквизитыПроверяемыеНаЗаполнение = Новый СписокЗначений;
		РеквизитыПроверяемыеНаЗаполнение.Добавить("СуммаДокумента", НСтр("ru = 'Сумма документа'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("ВалютаДокумента", НСтр("ru = 'Валюта документа'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("ЦФО", НСтр("ru = 'ЦФО'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("Организация", НСтр("ru = 'Организация'")); 
		
		ПроверятьДвиженияОперацииДоговорКонтрагента = Ложь;
		
		Если НЕ (ВидыОперацийУХКлиентСерверПовтИсп.ЭтоРасчетыБезДоговора(ДанныеДокумента.ВидОперацииУХ)
			ИЛИ ДанныеДокумента.ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПриобретениеВалюты
			ИЛИ ДанныеДокумента.ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПродажаВалюты) Тогда
			
			Если ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты
				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов Тогда
				
				РеквизитыПроверяемыеНаЗаполнение.Добавить("ДоговорКредитаДепозита", НСтр("ru = 'Договор кредита/депозита'"));
				
			ИначеЕсли ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю Тогда
				РеквизитыПроверяемыеНаЗаполнение.Добавить("ДоговорАренды", НСтр("ru = 'Договор аренды'"));
			ИначеЕсли ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику Тогда
				Если  МассивРеквизитовОперации.Найти("ДоговорЗаймаСотруднику") <> неопределено Тогда
					РеквизитыПроверяемыеНаЗаполнение.Добавить("ДоговорЗаймаСотруднику", НСтр("ru = 'Договор займа сотруднику'"));
				КонецЕсли;
			ИначеЕсли ИспользуютсяДоговорыКонтрагентов Тогда
				// РеквизитыПроверяемыеНаЗаполнение.Добавить("ДвиженияОперации.ДоговорКонтрагента", НСтр("ru = 'Договор контрагента'"));
				ПроверятьДвиженияОперацииДоговорКонтрагента = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		// БанковскийСчетКонтрагента
		Если ДанныеДокумента.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная Тогда
			Если ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику 
				И ДанныеДокумента.СписокФизЛиц Тогда
			ИначеЕсли ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств
					ИЛИ ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
					ИЛИ ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
				РеквизитыПроверяемыеНаЗаполнение.Добавить("БанковскийСчетПолучатель", НСтр("ru = 'Банковский счет получатель'"));
			ИначеЕсли ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты
				И ДанныеДокумента.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета Тогда
			Иначе
				РеквизитыПроверяемыеНаЗаполнение.Добавить("СчетКонтрагента", НСтр("ru = 'Банковский счет контрагента'"));
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ПроверяемыйРеквизит из РеквизитыПроверяемыеНаЗаполнение Цикл
			Если Не ЗначениеЗаполнено(ДанныеДокумента[ПроверяемыйРеквизит.Значение]) Тогда
				
				ПроверкаПройдена = Ложь;
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле","Заполнение",ПроверяемыйРеквизит.Представление);
				УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект." + ПроверяемыйРеквизит.Значение);
				
			КонецЕсли;
		КонецЦикла;  
		
		Если ПроверятьДвиженияОперацииДоговорКонтрагента Тогда
			Для каждого СтрокаДвижения Из ДанныеДокумента.ДвиженияОперации Цикл
				Если Не ЗначениеЗаполнено(СтрокаДвижения.ДоговорКонтрагента) Тогда
					ПроверкаПройдена = Ложь;
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле","Заполнение",НСтр("ru = 'Договор контрагента'"));
					УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект.ДвиженияОперации.ДоговорКонтрагента");
				КонецЕсли;
			КонецЦикла;		
		
		КонецЕсли;
		
		// Выдача денежных средств списку подотчетников. Должен быть заполнен список ЛицевыеСчетаСотрудников
		Если ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
			Если ДанныеДокумента.СписокФизЛиц Тогда
				Если Не ДанныеДокумента.ЛицевыеСчетаСотрудников.Количество() Тогда
					ПроверкаПройдена = Ложь;
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список","Заполнение", ,,НСтр("ru = 'Лицевые счета сотрудников'"));
					УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект.ДвиженияОперации");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Проверяем заполненность статьи движения денежных средств
		Если МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств") <> Неопределено И НЕ ДанныеДокумента.СписокФизЛиц Тогда
			
			// Проверяеме заполненность ТЧ
			Если Не ДанныеДокумента.ДвиженияОперации.Количество() Тогда
				
				ПроверкаПройдена = Ложь;
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список","Заполнение", ,,НСтр("ru = 'Аналитики учета и планирования'"));
				УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект.ДвиженияОперации");
				
			КонецЕсли;
			
			// Проверяем заполненность статьи
			ПараметрыБюджета = ДвиженияБюджетированиеКлиентСерверУХ.ПараметрыБюджета(ДанныеДокумента.ВидБюджета);
			Для Каждого ТекСтрокаРасшифровки Из ДанныеДокумента.ДвиженияОперации Цикл
				// Проверка статьи бюджета.
				Если Не ЗначениеЗаполнено(ТекСтрокаРасшифровки[ПараметрыБюджета.КолонкаСтатья]) Тогда
					
					ПроверкаПройдена = Ложь;
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Колонка",
						"Заполнение", 
						ПараметрыБюджета.ЗаголовокКолонкиСтатья, 
						ТекСтрокаРасшифровки.НомерСтроки,
						НСтр("ru = 'Аналитики учета и планирования'"));
					ИмяПоля = СтрШаблон("Объект.ДвиженияОперации[%1].%2", ТекСтрокаРасшифровки.НомерСтроки - 1, ПараметрыБюджета.КолонкаСтатья);
					
					УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, ИмяПоля);
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли НЕ ДанныеДокумента.СписокФизЛиц Тогда
			// Статья в шапке
			Если НЕ ЗначениеЗаполнено(ДанныеДокумента.СтатьяДвиженияДенежныхСредств)
					И Не (ДанныеДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты
					            И Не Константы.ИспользоватьНачислениеЗарплаты.Получить() ) Тогда
				// Проверяем заполненность статьи
				ПроверкаПройдена = Ложь;   
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле",	"Заполнение", НСтр("ru = 'Статья движения денежных средств'"),,,);
				
				УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(
					ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект.СтатьяДвиженияДенежныхСредств");
			КонецЕсли;
			
		Иначе 
			Для Каждого ТекСтрокаРасшифровки Из ДанныеДокумента.ЛицевыеСчетаСотрудников Цикл
				// Проверка статьи бюджета.
				Если Не ЗначениеЗаполнено(ТекСтрокаРасшифровки.СтатьяДвиженияДенежныхСредств) Тогда
					
					ПроверкаПройдена = Ложь;
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Колонка",
						"Заполнение", 
						НСтр("ru = 'Статья движения денежных средств'"), 
						ТекСтрокаРасшифровки.НомерСтроки,
						НСтр("ru = 'Лицевые счета сотрудников'"));
					ИмяПоля = СтрШаблон("Объект.ЛицевыеСчетаСотрудников[%1].%2", ТекСтрокаРасшифровки.НомерСтроки - 1, "СтатьяДвиженияДенежныхСредств");
					
					УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, ИмяПоля);
					
				КонецЕсли;
				
			КонецЦикла;
			

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

Функция ПлатежЗапрещенДирективно(ЗаявкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаОперациюДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ЗаявкаНаОперациюДвиженияОперации.Ссылка.Организация,
	|	ЗаявкаНаОперациюДвиженияОперации.Ссылка.Контрагент,
	|	ЗаявкаНаОперациюДвиженияОперации.Ссылка.Договор КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(РазмещениеЗаявок.БанковскийСчетКасса, Неопределено) КАК СчетОрганизации
	|ПОМЕСТИТЬ ВТ_ДанныеПлатежа
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаОперациюДвиженияОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|		ПО ЗаявкаНаОперациюДвиженияОперации.Ссылка = РазмещениеЗаявок.ЗаявкаНаОперацию
	|			И РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|ГДЕ
	|	ЗаявкаНаОперациюДвиженияОперации.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РазрешенияИЗапретыПлатежей.Запрет
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ЕстьЗапрет,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РазрешенияИЗапретыПлатежей.Запрет
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ), 0) КАК ЕстьРазрешение
	|ИЗ
	|	ВТ_ДанныеПлатежа КАК ВТ_ДанныеПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазрешенияИЗапретыПлатежей КАК РазрешенияИЗапретыПлатежей
	|		ПО (ВТ_ДанныеПлатежа.СтатьяДвиженияДенежныхСредств = РазрешенияИЗапретыПлатежей.СтатьяДвиженияДенежныхСредств
	|				ИЛИ РазрешенияИЗапретыПлатежей.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка))
	|			И (ВТ_ДанныеПлатежа.Организация = РазрешенияИЗапретыПлатежей.Организация
	|				ИЛИ РазрешенияИЗапретыПлатежей.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (ВТ_ДанныеПлатежа.Контрагент = РазрешенияИЗапретыПлатежей.Контрагент
	|				ИЛИ РазрешенияИЗапретыПлатежей.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|			И (ВТ_ДанныеПлатежа.ДоговорКонтрагента = РазрешенияИЗапретыПлатежей.ДоговорКонтрагента
	|				ИЛИ РазрешенияИЗапретыПлатежей.ДоговорКонтрагента  В (&ПустыеДоговорыКонтрагентов))
	|			И (ВТ_ДанныеПлатежа.СчетОрганизации = РазрешенияИЗапретыПлатежей.СчетОрганизации
	|				ИЛИ РазрешенияИЗапретыПлатежей.СчетОрганизации = Неопределено)";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	ПустыеДоговорыКонтрагентов = Новый Массив;
	ПустыеДоговорыКонтрагентов.Добавить(Неопределено);
	ПустыеДоговорыКонтрагентов.Добавить(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	ПустыеДоговорыКонтрагентов.Добавить(Справочники.ДоговорыКредитовИДепозитов.ПустаяСсылка());
	ПустыеДоговорыКонтрагентов.Добавить(Справочники.ДоговорыАренды.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустыеДоговорыКонтрагентов", ПустыеДоговорыКонтрагентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат (Выборка.ЕстьЗапрет > 0 И Выборка.ЕстьРазрешение = 0);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаВыбора" Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыбиратьПозицию") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Обработки.РаботаСЗаявкамиНаОперации.Формы.ФормаПодбораЗаявок;
	КонецЕсли;

КонецПроцедуры

//
//Процедура ПолучитьМассивыРеквизитовУХ(ХозяйственнаяОперация, ПеречислениеВБюджет, СписокФизЛиц, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт	
Процедура ЗаполнитьИменаРеквизитовПоХозяйственнойОперацииУХ(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации);
	
	// Выдача денежных средств списку подотчетников. Должен быть заполнен список ЛицевыеСчетаСотрудников
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
			
		Если Объект.СписокФизЛиц Тогда
			// Нет статьи в расшифровке платежа. Удаляем ее из расшифровки
			МассивРеквизитовОперации.Удалить(МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств"));
			МассивРеквизитовОперации.Удалить(МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.Аналитика1"));
			МассивРеквизитовОперации.Удалить(МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.Аналитика2"));
			МассивРеквизитовОперации.Удалить(МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.Аналитика3"));
			МассивРеквизитовОперации.Удалить(МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.Аналитика4"));
			МассивРеквизитовОперации.Удалить(МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.Аналитика5"));
			МассивРеквизитовОперации.Удалить(МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.Аналитика6"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РеквизитыЗаявки(РеквизитыЗаявки) Экспорт
	
	ОМ = ЗаявкиНаОперации;
	
	//
	РеквизитыЗаявки.Параметры.Вставить("ПланируемаяДатаОперацииВФорме", Истина);
	
	// Элементы ДоговорКонтрагента
	ЭлементыДоговор = РеквизитыЗаявки.Параметры.Элементы["ДоговорКонтрагента"];
	Если ЭлементыДоговор <> неопределено И ТипЗнч(ЭлементыДоговор) = Тип("Массив") Тогда
		ЭлементыДоговор.Очистить();
		ЭлементыДоговор.Добавить("Договор");
	КонецЕсли;

	РеквизитыЗаявки.ВидБюджетаПВХ= ОМ.Новый_ЗначениеРеквизита("ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств");
	РеквизитыЗаявки.ВидБюджета = ОМ.Новый_ЗначениеРеквизита("Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств");
	
	РеквизитыЗаявки.БанковскийСчет = ОМ.Новый_Реквизит("БанковскийСчет");
	РеквизитыЗаявки.Касса = ОМ.Новый_Реквизит("Касса");
	РеквизитыЗаявки.ФормаОплаты = ОМ.Новый_Реквизит("ФормаОплатыЗаявки");
	РеквизитыЗаявки.ВалютаДокумента = ОМ.Новый_Реквизит("Валюта");
	РеквизитыЗаявки.ВалютаКонвертации = ОМ.Новый_Реквизит("ВалютаКонвертации");
	РеквизитыЗаявки.ВалютаОплаты = ОМ.Новый_Реквизит("ВалютаОплаты");
	РеквизитыЗаявки.ДоговорКонтрагента = ОМ.Новый_Реквизит("Договор");
	РеквизитыЗаявки.БанковскийСчетКонтрагента = ОМ.Новый_Реквизит("БанковскийСчетКонтрагента");
	РеквизитыЗаявки.ПриходРасход = ОМ.Новый_ЗначениеРеквизита("Перечисление.ВидыДвиженийПриходРасход.Расход");
	РеквизитыЗаявки.ПриходРасходСтатьяДвиженияДенежныхСредствЗачисление = ОМ.Новый_ЗначениеРеквизита("Перечисление.ВидыДвиженийПриходРасход.Приход");
	РеквизитыЗаявки.ПриходРасходСтатьяДвиженияДенежныхСредств 			= ОМ.Новый_ЗначениеРеквизита("Перечисление.ВидыДвиженийПриходРасход.Расход");
	РеквизитыЗаявки.Ответственный = ОМ.Новый_Реквизит("Автор");
	РеквизитыЗаявки.ПланируемаяДатаОперации = ОМ.Новый_Реквизит("ЖелательнаяДатаПлатежа");
	РеквизитыЗаявки.ДокументПланирования = ОМ.Новый_Реквизит("ДокументПланирования"); 
	РеквизитыЗаявки.ПодотчетноеЛицо = ОМ.Новый_Реквизит("ПодотчетноеЛицо");
	
	// ВГО
	РеквизитыЗаявки.КонтрагентОрганизации = ОМ.Новый_Реквизит("КонтрагентПлательщик");		// Контрагент, которому соответствуеторганизация
	РеквизитыЗаявки.ОрганизацияВстречная = ОМ.Новый_Реквизит("ОрганизацияПолучатель");		// Организация, соответствующая контрагенту
	РеквизитыЗаявки.БанковскийСчетОрганизацииВстречной = ОМ.Новый_Реквизит("БанковскийСчетПолучатель");	// Банковский счет, соответствующий счету контрагента
	РеквизитыЗаявки.БанковскийСчетПолучатель = ОМ.Новый_Реквизит("БанковскийСчетПолучатель"); // Банковский счет, на который произодится зачисление (купля/продажа валюты).
	РеквизитыЗаявки.КассаПолучатель = ОМ.Новый_Реквизит("КассаПолучатель");
	РеквизитыЗаявки.ДоговорВстречный = ОМ.Новый_Реквизит("ДоговорКонтрагентаПолучатель");	// Договор, соответствующий выбранному договору с контрагентом
	РеквизитыЗаявки.ЭтоВнутригрупповоеПеремещение = ОМ.Новый_Реквизит("ЭтоВнутригрупповоеПеремещение");
	РеквизитыЗаявки.КурсКонвертации = ОМ.Новый_Реквизит("КурсКонвертации");
	РеквизитыЗаявки.КратностьКонвертации = ОМ.Новый_Реквизит("КратностьКонвертации");
	
	// Аналитики
	ОМ.Изменить_Реквизит(РеквизитыЗаявки.СтатьяБюджета, "СтатьяДвиженияДенежныхСредств", "РасшифровкаПлатежа");
	ОМ.Изменить_Реквизит(РеквизитыЗаявки.СтатьяБюджетаСписания, "СтатьяДвиженияДенежныхСредств");
	ОМ.Изменить_Реквизит(РеквизитыЗаявки.СтатьяБюджетаЗачисления, "СтатьяДвиженияДенежныхСредствЗачисление"); 
	ОМ.Изменить_Реквизит(РеквизитыЗаявки.СтатьяБюджетаЛицевойСчет, "СтатьяДвиженияДенежныхСредств", "ЛицевыеСчетаСотрудников");
	
	Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
		ОМ.Изменить_Реквизит(РеквизитыЗаявки["Аналитика"			+Сч], "Аналитика"+Сч, "РасшифровкаПлатежа");
		ОМ.Изменить_Реквизит(РеквизитыЗаявки["АналитикаСписания"	+Сч], "АналитикаСписания"+Сч);
		ОМ.Изменить_Реквизит(РеквизитыЗаявки["АналитикаЗачисления"	+Сч], "АналитикаЗачисления"	+Сч);  
		ОМ.Изменить_Реквизит(РеквизитыЗаявки["Аналитика"			+Сч], "Аналитика"+Сч, "ЛицевыеСчетаСотрудников");
	КонецЦикла;
	
	// Регистрируем параметры размещения аналитик статей бюджетов
	ЗаявкиНаОперации.РазместитьВКолонкахТаблицы(
		РеквизитыЗаявки, "РасшифровкаПлатежа", 
		РеквизитыЗаявки.СтатьяБюджета, "РасшифровкаПлатежаСтатьяДвиженияДенежныхСредств",
		"Аналитика%1", "РасшифровкаПлатежаАналитика%1",
		ФормыУХ.РазместитьПередЭлементом("РасшифровкаПлатежаСумма", "РасшифровкаПлатежа")
	);
	
	ЗаявкиНаОперации.РазместитьВПоляхФормы(
		РеквизитыЗаявки, "РасшифровкаПлатежа",
		РеквизитыЗаявки.СтатьяБюджета, "РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств",
		"Аналитика%1", "РасшифровкаБезРазбиенияАналитика%1",
		ФормыУХ.РазместитьПередЭлементом("РасшифровкаБезРазбиенияПодразделение", "РасшифровкаБезРазбиения")
	);
	
	ЗаявкиНаОперации.РазместитьВПоляхФормы(
		РеквизитыЗаявки, ,
		РеквизитыЗаявки.СтатьяБюджетаСписания, "СтатьяДвиженияДенежныхСредств",
		"Аналитика%1", "АналитикаШапка%1",
		ФормыУХ.РазместитьВГруппеСтрокой("ГруппаАналитикиБюджетаЛевая")
	);
	
	ЗаявкиНаОперации.РазместитьВПоляхФормы(
		РеквизитыЗаявки, ,
		РеквизитыЗаявки.СтатьяБюджетаЗачисления, "СтатьяДвиженияДенежныхСредствЗачисление",
		"АналитикаЗачисления%1", "АналитикаЗачисления%1",
		ФормыУХ.РазместитьВГруппеСтрокой("ГруппаАналитикиБюджетаПравая")
	);

	ЗаявкиНаОперации.РазместитьВКолонкахТаблицы(
		РеквизитыЗаявки, "ЛицевыеСчетаСотрудников", 
		РеквизитыЗаявки.СтатьяБюджетаЛицевойСчет, "ЛицевыеСчетаСотрудниковСтатьяДвиженияДенежныхСредств",
		"Аналитика%1", "ЛицевыеСчетаСотрудниковАналитика%1",
		ФормыУХ.РазместитьПередЭлементом("ЛицевыеСчетаСотрудниковРастяжка", "ЛицевыеСчетаСотрудников")
	);  
	
КонецПроцедуры

// Функция возвращает таблицу операций заявки для формирования платежной позиции
Функция ПолучитьДвиженияОперацииДокументаДляПлатежнойПозиции(ЗаявкаСсылка) экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ЗаявкаСсылка); 
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", 				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаСсылка, "ХозяйственнаяОперация"));
    Запрос.УстановитьПараметр("ХозОперацииБезРасшифровки", 			ХозОперацииБезРасшифровки());
	Запрос.УстановитьПараметр("ХозОперацияЗарплата", 				Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты);
	Запрос.УстановитьПараметр("ХозОперацияВыплатаНаЛицевыеСчета", 	Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета);
	Запрос.УстановитьПараметр("ХозОперацияВыдачаДенежныхСредствПодотчетнику", 	Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику);
	Запрос.УстановитьПараметр("ИспользоватьНачислениеЗарплатыУТ", 	Константы.ИспользоватьНачислениеЗарплаты.Получить());
    Запрос.Текст = 
	"ВЫБРАТЬ 
	|	0 КАК НомерЗапроса,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.ПустаяСсылка) КАК ПриходРасход,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО КАК ЦФО,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект КАК Проект,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1 КАК Аналитика1,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2 КАК Аналитика2,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3 КАК Аналитика3,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4 КАК Аналитика4,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5 КАК Аналитика5,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6 КАК Аналитика6,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов КАК ЦеннаяБумага,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Партнер КАК Партнер,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта КАК ВалютаВзаиморасчетов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипСуммыКредитаДепозита КАК ТипСуммыКредитаДепозита,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипПлатежаПоАренде КАК ТипПлатежаПоАренде,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Подразделение КАК Подразделение,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость КАК Ведомость,
	|	СУММА(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	СУММА(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов КАК АналитикаРасходов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НастройкаСчетовУчета КАК НастройкаСчетовУчета,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЧислительВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	NULL КАК СчетКонтрагента,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДатаПогашения КАК ДатаПогашения
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|	И (НЕ ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация В (&ХозОперацииБезРасшифровки)
	|			ИЛИ ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозОперацияВыдачаДенежныхСредствПодотчетнику
	|				И НЕ ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.СписокФизЛиц)
	|	И НЕ(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозОперацияЗарплата
	|				И ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперацияПоЗарплате = &ХозОперацияВыплатаНаЛицевыеСчета
	|				И &ИспользоватьНачислениеЗарплатыУТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтавкаНДС,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Партнер,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорКредитаДепозита,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорАренды,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипПлатежаПоАренде,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Подразделение,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НаправлениеДеятельности,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяРасходов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаАктивовПассивов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НастройкаСчетовУчета,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЧислительВзаиморасчетов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ЭлементСтруктурыЗадолженности,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяЦелевыхСредств,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДатаПогашения,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Контрагент,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Сумма) <> 0
	|		ИЛИ СУММА(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СуммаНДС) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗаявкаНаРасходованиеДенежныхСредств.ЦФО,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Проект,
	|	ЗаявкаНаРасходованиеДенежныхСредств.СтатьяДвиженияДенежныхСредств,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Аналитика1,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Аналитика2,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Аналитика3,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Аналитика4,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Аналитика5,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Аналитика6,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС),
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредств.ВалютаОплаты,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Подразделение,
	|	ЗаявкаНаРасходованиеДенежныхСредств.НаправлениеДеятельности,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Контрагент,
	|	ЗаявкаНаРасходованиеДенежныхСредств.БанковскийСчетКонтрагента,
	|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг),
	|	ЗаявкаНаРасходованиеДенежныхСредств.СтатьяЦелевыхСредств,
	|	NULL
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &ДокументСсылка
	|	И НЕ &ХозяйственнаяОперация = &ХозОперацияВыдачаДенежныхСредствПодотчетнику
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация В(&ХозОперацииБезРасшифровки)
	|	И НЕ(ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = &ХозОперацияВыдачаДенежныхСредствПодотчетнику
	|				И НЕ ЗаявкаНаРасходованиеДенежныхСредств.СписокФизЛиц)
	|	И НЕ(ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = &ХозОперацияЗарплата
	|				И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперацияПоЗарплате = &ХозОперацияВыплатаНаЛицевыеСчета
	|				И НЕ &ИспользоватьНачислениеЗарплатыУТ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход),
	|	ЗаявкаНаРасходованиеДенежныхСредств.ЦФО,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Проект,
	|	ЗаявкаНаРасходованиеДенежныхСредств.СтатьяДвиженияДенежныхСредствЗачисление,
	|	ЗаявкаНаРасходованиеДенежныхСредств.АналитикаЗачисления1,
	|	ЗаявкаНаРасходованиеДенежныхСредств.АналитикаЗачисления2,
	|	ЗаявкаНаРасходованиеДенежныхСредств.АналитикаЗачисления3,
	|	ЗаявкаНаРасходованиеДенежныхСредств.АналитикаЗачисления4,
	|	ЗаявкаНаРасходованиеДенежныхСредств.АналитикаЗачисления5,
	|	ЗаявкаНаРасходованиеДенежныхСредств.АналитикаЗачисления6,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС),
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредств.ВалютаОплаты,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Подразделение,
	|	ЗаявкаНаРасходованиеДенежныхСредств.НаправлениеДеятельности,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг),
	|	ЗаявкаНаРасходованиеДенежныхСредств.СтатьяЦелевыхСредств,
	|	NULL
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &ДокументСсылка
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация В(&ХозОперацииБезРасшифровки)
	|	И НЕ(ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = &ХозОперацияВыдачаДенежныхСредствПодотчетнику
	|				И ЗаявкаНаРасходованиеДенежныхСредств.СписокФизЛиц)   
	|	И НЕ (&ХозяйственнаяОперация = &ХозОперацияЗарплата      
	|	И НЕ &ИспользоватьНачислениеЗарплатыУТ  
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперацияПоЗарплате = &ХозОперацияВыплатаНаЛицевыеСчета)
    |
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	3,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СУММА(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Сумма),
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	1,
	|	1,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.БанковскийСчетКонтрагента,
	|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг),
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.ЛицевыеСчетаСотрудников КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|	И &ХозяйственнаяОперация = &ХозОперацияВыдачаДенежныхСредствПодотчетнику
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
	|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.БанковскийСчетКонтрагента";

	
	Если Запрос.Параметры.ХозяйственнаяОперация = Запрос.Параметры.ХозОперацияЗарплата Тогда   
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ  
		|	4,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.ПустаяСсылка),
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтавкаНДС,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Партнер,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорАренды,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипПлатежаПоАренде,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Подразделение,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НаправлениеДеятельности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость,
		|	СУММА(ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.КВыплате),
		|	0,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаАктивовПассивов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НастройкаСчетовУчета,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЧислительВзаиморасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.БанковскийСчет,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ЭлементСтруктурыЗадолженности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяЦелевыхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДатаПогашения
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата КАК ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата
		|		ПО (ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость = ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка )
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
		|	И &ХозяйственнаяОперация = &ХозОперацияЗарплата
		|	И ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперацияПоЗарплате = &ХозОперацияВыплатаНаЛицевыеСчета
		|	И &ИспользоватьНачислениеЗарплатыУТ  
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтавкаНДС,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Партнер,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорАренды,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипПлатежаПоАренде,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Подразделение,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НаправлениеДеятельности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаАктивовПассивов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НастройкаСчетовУчета,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЧислительВзаиморасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.БанковскийСчет,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ЭлементСтруктурыЗадолженности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяЦелевыхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДатаПогашения
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.КВыплате) > 0
		| ОБЪЕДИНИТЬ ВСЕ
		|
		| ВЫБРАТЬ 
		|	5,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.ПустаяСсылка),
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтавкаНДС,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Партнер,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорАренды,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипПлатежаПоАренде,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Подразделение,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НаправлениеДеятельности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость,
		|	СУММА(ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.КВыплате),
		|	0,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаАктивовПассивов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НастройкаСчетовУчета,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЧислительВзаиморасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.БанковскийСчет,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ЭлементСтруктурыЗадолженности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяЦелевыхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДатаПогашения
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовПеречислением.Выплаты КАК ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата
		|		ПО (ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость = ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка )
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
		|	И &ХозяйственнаяОперация = &ХозОперацияЗарплата
		|	И ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперацияПоЗарплате = &ХозОперацияВыплатаНаЛицевыеСчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтавкаНДС,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Партнер,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипСуммыКредитаДепозита,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорАренды,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ТипПлатежаПоАренде,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДоговорЗаймаСотруднику,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Подразделение,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НаправлениеДеятельности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ведомость,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаРасходов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.АналитикаАктивовПассивов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.НастройкаСчетовУчета,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЧислительВзаиморасчетов,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.БанковскийСчет,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ЭлементСтруктурыЗадолженности,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяЦелевыхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ДатаПогашения
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.КВыплате) > 0
		|
		|	 ОБЪЕДИНИТЬ ВСЕ
		|
		| ВЫБРАТЬ 
		|	6,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ЦФО,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проект,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика1,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика2,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика3,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика4,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика5,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Аналитика6,
		|	NULL,
		|	NULL,
		|	Null,
		|	NULL,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Сумма,
		|	0,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	1,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ФизическоеЛицо,
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ЛицевойСчет,
		|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг),
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.ЛицевыеСчетаСотрудников КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
		|		
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
		|	И &ХозяйственнаяОперация = &ХозОперацияЗарплата      
		|	И НЕ &ИспользоватьНачислениеЗарплатыУТ  
		|	И ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперацияПоЗарплате = &ХозОперацияВыплатаНаЛицевыеСчета
		|";		
	КонецЕсли;

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает результат проверки актуальности курсов 
Функция АктуальностьКурсовНарушена(Заявка, МассивИдентификаторПозиции = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	РазмещениеЗаявок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РазмещениеЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РазмещениеЗаявок.ВалютаОплаты КАК ВалютаОплаты,
	|	РазмещениеЗаявок.КурсПлатежа КАК КурсПлатежа,
	|	РазмещениеЗаявок.КратностьПлатежа КАК КратностьПлатежа,
	|	РазмещениеЗаявок.ДатаИсполнения КАК ДатаКурса
	|ПОМЕСТИТЬ ВТ_ОперацииКПереоценке
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК РасшифровкаПлатежаЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|		ПО (РазмещениеЗаявок.ЗаявкаНаОперацию = РасшифровкаПлатежаЗаявки.Ссылка)
	|ГДЕ
	|	РасшифровкаПлатежаЗаявки.Ссылка = &Заявка
	|	И РазмещениеЗаявок.ВалютаВзаиморасчетов <> РазмещениеЗаявок.ВалютаОплаты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВалютаВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КурсыВалют.Период) КАК ДатаКурсаВзаиморасчеты,
	|	ВТ_ОперацииКПереоценке.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	ВТ_ОперацииКПереоценке.ВалютаОплаты КАК ВалютаОплаты,
	|	ВТ_ОперацииКПереоценке.КурсПлатежа КАК КурсПлатежа,
	|	ВТ_ОперацииКПереоценке.КратностьПлатежа КАК КратностьПлатежа,
	|	ВТ_ОперацииКПереоценке.ДатаКурса КАК ДатаКурса,
	|	ВТ_ОперацииКПереоценке.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ОперацииКПереоценке.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_ОперацииКПереоценке1
	|ИЗ
	|	ВТ_ОперацииКПереоценке КАК ВТ_ОперацииКПереоценке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ВТ_ОперацииКПереоценке.ВалютаВзаиморасчетов = КурсыВалют.Валюта
	|			И ВТ_ОперацииКПереоценке.ДатаКурса >= КурсыВалют.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОперацииКПереоценке.ИдентификаторПозиции,
	|	ВТ_ОперацииКПереоценке.СуммаВзаиморасчетов,
	|	ВТ_ОперацииКПереоценке.ВалютаВзаиморасчетов,
	|	ВТ_ОперацииКПереоценке.ВалютаОплаты,
	|	ВТ_ОперацииКПереоценке.КурсПлатежа,
	|	ВТ_ОперацииКПереоценке.ДатаКурса,
	|	ВТ_ОперацииКПереоценке.КратностьПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КурсыВалют.Период) КАК ДатаКурсаОплата,
	|	ВТ_ОперацииКПереоценке.ДатаКурсаВзаиморасчеты КАК ДатаКурсаВзаиморасчеты,
	|	ВТ_ОперацииКПереоценке.ДатаКурса КАК ДатаКурса,
	|	ВТ_ОперацииКПереоценке.КурсПлатежа КАК КурсПлатежа,
	|	ВТ_ОперацииКПереоценке.КратностьПлатежа КАК КратностьПлатежа,
	|	ВТ_ОперацииКПереоценке.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	ВТ_ОперацииКПереоценке.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ОперацииКПереоценке.ВалютаОплаты КАК ВалютаОплаты,
	|	ВТ_ОперацииКПереоценке.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_ОперацииСДатамиКурсов
	|ИЗ
	|	ВТ_ОперацииКПереоценке1 КАК ВТ_ОперацииКПереоценке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ВТ_ОперацииКПереоценке.ВалютаОплаты = КурсыВалют.Валюта
	|			И ВТ_ОперацииКПереоценке.ДатаКурса >= КурсыВалют.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОперацииКПереоценке.ДатаКурса,
	|	ВТ_ОперацииКПереоценке.КурсПлатежа,
	|	ВТ_ОперацииКПереоценке.КратностьПлатежа,
	|	ВТ_ОперацииКПереоценке.ДатаКурсаВзаиморасчеты,
	|	ВТ_ОперацииКПереоценке.ВалютаОплаты,
	|	ВТ_ОперацииКПереоценке.ИдентификаторПозиции,
	|	ВТ_ОперацииКПереоценке.СуммаВзаиморасчетов,
	|	ВТ_ОперацииКПереоценке.ВалютаВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КурсВалютыВзаиморасчетов.Курс * КурсВалютыОплаты.Кратность, 0) / (ЕСТЬNULL(КурсВалютыВзаиморасчетов.Кратность, 1) * ЕСТЬNULL(КурсВалютыОплаты.Курс, 1)) КАК ЧИСЛО(10, 4)) КАК КурсПлатежа,
	|	1 КАК КратностьПлатежа,
	|	ВТ_ОперацииСДатамиКурсов.ДатаКурсаОплата КАК ДатаКурсаОплата,
	|	ВТ_ОперацииСДатамиКурсов.ДатаКурсаВзаиморасчеты КАК ДатаКурсаВзаиморасчеты,
	|	ВТ_ОперацииСДатамиКурсов.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	ВТ_ОперацииСДатамиКурсов.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ОперацииСДатамиКурсов.КурсПлатежа КАК КурсПлатежаДокумент,
	|	ВТ_ОперацииСДатамиКурсов.КратностьПлатежа КАК КратностьПлатежаДокумент,
	|	ВТ_ОперацииСДатамиКурсов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	ВТ_ОперацииСДатамиКурсов КАК ВТ_ОперацииСДатамиКурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыВзаиморасчетов
	|		ПО ВТ_ОперацииСДатамиКурсов.ДатаКурсаВзаиморасчеты = КурсВалютыВзаиморасчетов.Период
	|			И ВТ_ОперацииСДатамиКурсов.ВалютаВзаиморасчетов = КурсВалютыВзаиморасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыОплаты
	|		ПО ВТ_ОперацииСДатамиКурсов.ДатаКурсаОплата = КурсВалютыОплаты.Период
	|			И ВТ_ОперацииСДатамиКурсов.ВалютаОплаты = КурсВалютыОплаты.Валюта
	|ГДЕ
	|	(ВЫРАЗИТЬ(ЕСТЬNULL(КурсВалютыВзаиморасчетов.Курс * КурсВалютыОплаты.Кратность, 0) / (ЕСТЬNULL(КурсВалютыВзаиморасчетов.Кратность, 1) * ЕСТЬNULL(КурсВалютыОплаты.Курс, 1)) КАК ЧИСЛО(10, 4))) <> ВТ_ОперацииСДатамиКурсов.КурсПлатежа / ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_ОперацииСДатамиКурсов.КратностьПлатежа, 0) = 0
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(ВТ_ОперацииСДатамиКурсов.КратностьПлатежа, 1)
	|		КОНЕЦ";
	
	Если МассивИдентификаторПозиции <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасшифровкаПлатежаЗаявки.Ссылка = &Заявка", "РазмещениеЗаявок.ИдентификаторПозиции В (&ИдентификаторПозиции)");
		Запрос.УстановитьПараметр("ИдентификаторПозиции", 	МассивИдентификаторПозиции);
	Иначе
		Запрос.УстановитьПараметр("Заявка", 				Заявка);
	КонецЕсли;
	Возврат  НЕ Запрос.Выполнить().Пустой();
		
КонецФункции

#Область ПланыДокумента_УХ

// Процедура возвращает таблицу планов документа
//
// Параметры:
//  Источник  - ДокументСсылка, ДокументОбъект, Форма.Объект - Документ планирования
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица планов документа
//
Функция ПланыДокумента(Источник, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	1 КАК НомерЗапроса,
	|	&Дата КАК ДатаРегистрации,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору = ЛОЖЬ
	|				ИЛИ &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ДвиженияОперации.ОбъектРасчетов
	|	КОНЕЦ КАК ОбъектРасчетов,
	|	&Валюта КАК Валюта,
	|	&Ссылка КАК ДокументПланирования,
	|	ВЫБОР
	|		КОГДА &ПолучитьИзДокументаОснования
	|				И &ЭтоРасчетыПоЗаказам
	|			ТОГДА &ДокументОснование
	|		КОГДА &ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.Резервирование)
	|			ТОГДА &ДоговорКонтрагента
	|		КОГДА &ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.ГрафикРасчетов)
	|			ТОГДА &ДоговорКонтрагента
	|		КОГДА &ДокументПланирования = ЗНАЧЕНИЕ(Документ.Резервирование.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ &ДокументПланирования
	|	КОНЕЦ КАК ДокументРезервирования,
	|	&ЖелательнаяДатаПлатежа КАК Период,
	|	&ЦФО КАК ЦФО,
	|	&Проект КАК Проект,
	|	ВЫБОР
	|		КОГДА &ЭтоКонвертацияВалюты ИЛИ &ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту
	|			ТОГДА &СтатьяДвиженияДенежныхСредств
	|		ИНАЧЕ ДвиженияОперации.СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяБюджета,     
	|	ВЫБОР
	|		КОГДА &ЭтоКонвертацияВалюты ИЛИ &ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту
	|			ТОГДА &Аналитика1
	|		ИНАЧЕ ДвиженияОперации.Аналитика1
	|	КОНЕЦ КАК Аналитика1,
    |	ВЫБОР
	|		КОГДА &ЭтоКонвертацияВалюты ИЛИ &ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту
	|			ТОГДА &Аналитика2
	|		ИНАЧЕ ДвиженияОперации.Аналитика2
	|	КОНЕЦ КАК Аналитика2,
	|	ВЫБОР
	|		КОГДА &ЭтоКонвертацияВалюты ИЛИ &ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту
	|			ТОГДА &Аналитика3
	|		ИНАЧЕ ДвиженияОперации.Аналитика3
	|	КОНЕЦ КАК Аналитика3,
	|	ВЫБОР
	|		КОГДА &ЭтоКонвертацияВалюты ИЛИ &ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту
	|			ТОГДА &Аналитика4
	|		ИНАЧЕ ДвиженияОперации.Аналитика4
	|	КОНЕЦ КАК Аналитика4,
	|	ВЫБОР
	|		КОГДА &ЭтоКонвертацияВалюты ИЛИ &ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту
	|			ТОГДА &Аналитика5
	|		ИНАЧЕ ДвиженияОперации.Аналитика5
	|	КОНЕЦ КАК Аналитика5,
	|	ВЫБОР
	|		КОГДА &ЭтоКонвертацияВалюты ИЛИ &ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту
	|			ТОГДА &Аналитика6
	|		ИНАЧЕ ДвиженияОперации.Аналитика6
	|	КОНЕЦ КАК Аналитика6,
	|	ДвиженияОперации.Сумма КАК Сумма,
	|	&НаправлениеДвижения КАК ПриходРасход,
	|	&ВидБюджета КАК ВидБюджета,
	|	&КурсПлатежа КАК КурсПланирования,
	|	&КратностьПлатежа КАК КратностьПланирования,
	|	&КурсЗаданВОперации КАК КурсЗаданВОперации
	|ПОМЕСТИТЬ ВТ_ПланыДокумента
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И &ОплатаПоДоговоруПоставки = ЛОЖЬ
	|	И ДвиженияОперации.Сумма > 0
	|	И (&СписокФизЛиц = ЛОЖЬ И &ЭтоВыплатаНаЛицевыеСчетаПоЗарплатномуПроекту = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1.1,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	&Валюта,
	|	&ДокументПланирования,
	|	НЕОПРЕДЕЛЕНО,
	|	&ЖелательнаяДатаПлатежа,
	|	&ЦФО,
	|	&Проект,
	|	ДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ДвиженияОперации.Аналитика1,
	|	ДвиженияОперации.Аналитика2,
	|	ДвиженияОперации.Аналитика3,
	|	ДвиженияОперации.Аналитика4,
	|	ДвиженияОперации.Аналитика5,
	|	ДвиженияОперации.Аналитика6,
	|	-ДвиженияОперации.Сумма,
	|	&НаправлениеДвижения,
	|	&ВидБюджета,
	|	&КурсПлатежа,
	|	&КратностьПлатежа,
	|	&КурсЗаданВОперации
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И &ОплатаПоДоговоруПоставки = ЛОЖЬ
	|	И ДвиженияОперации.Сумма > 0
	|	И &ДокументПланирования <> ЗНАЧЕНИЕ(Документ.Резервирование.ПустаяСсылка)
	|	И &ДокументПланирования <> НЕОПРЕДЕЛЕНО
	|	И (&ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.НеИспользовать) ИЛИ &ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.ПустаяСсылка))
	|	И НЕ &ПолучитьИзДокументаОснования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1.2,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору = ЛОЖЬ
	|				ИЛИ &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	&ВалютаКонвертации,
	|	&Ссылка,
	|	&ДокументПланирования,
	|	&ДатаЗачисления,
	|	&ЦФО,
	|	&Проект,
	|	&СтатьяДвиженияДенежныхСредствЗачисление,
	|	&АналитикаЗачисления1,
	|	&АналитикаЗачисления2,
	|	&АналитикаЗачисления3,
	|	&АналитикаЗачисления4,
	|	&АналитикаЗачисления5,
	|	&АналитикаЗачисления6,
	|	&Сумма,
	|	&НаправлениеДвиженияЗачисления,
	|	&ВидБюджета,
	|	0,
	|	0,
	|	ЛОЖЬ
	|ГДЕ
	|	&ЕстьАналитикиЗачисления = ИСТИНА
	|	И &ЗаявкаСРасшифровкойПлатежа = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1.3,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	&Валюта,
	|	&Ссылка,
	|	ВЫБОР
	|		КОГДА &ПолучитьИзДокументаОснования
	|			ТОГДА &ДокументОснование
	|		КОГДА &ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.Резервирование)
	|			ТОГДА &ДоговорКонтрагента
	|		КОГДА &ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.ГрафикРасчетов)
	|			ТОГДА &ДоговорКонтрагента
	|		КОГДА &ДокументПланирования = ЗНАЧЕНИЕ(Документ.Резервирование.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ &ДокументПланирования
	|	КОНЕЦ,
	|	&ЖелательнаяДатаПлатежа,
	|	&ЦФО,
	|	&Проект,
	|	ДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ДвиженияОперации.Аналитика1,
	|	ДвиженияОперации.Аналитика2,
	|	ДвиженияОперации.Аналитика3,
	|	ДвиженияОперации.Аналитика4,
	|	ДвиженияОперации.Аналитика5,
	|	ДвиженияОперации.Аналитика6,
	|	ДвиженияОперации.Сумма,
	|	&НаправлениеДвижения,
	|	&ВидБюджета,
	|	&КурсПлатежа,
	|	&КратностьПлатежа,
	|	&КурсЗаданВОперации
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.ЛицевыеСчетаСотрудников КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И (&СписокФизЛиц = ИСТИНА ИЛИ &ЭтоВыплатаНаЛицевыеСчетаПоЗарплатномуПроекту)
	|	И ДвиженияОперации.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору = ИСТИНА
	|				И &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	&Валюта,
	|	&ДокументПланирования,
	|	&ДокументПланирования,
	|	&ЖелательнаяДатаПлатежа,
	|	&ЦФО,
	|	&Проект,
	|	ДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ДвиженияОперации.Аналитика1,
	|	ДвиженияОперации.Аналитика2,
	|	ДвиженияОперации.Аналитика3,
	|	ДвиженияОперации.Аналитика4,
	|	ДвиженияОперации.Аналитика5,
	|	ДвиженияОперации.Аналитика6,
	|	-ДвиженияОперации.Сумма,
	|	&НаправлениеДвижения,
	|	&ВидБюджета,
	|	&КурсПлатежа,
	|	&КратностьПлатежа,
	|	&КурсЗаданВОперации
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И &ОплатаПоДоговоруПоставки = ЛОЖЬ
	|	И &ДокументПланирования <> ЗНАЧЕНИЕ(Документ.Резервирование.ПустаяСсылка)
	|	И НЕ &ПолучитьИзДокументаОснования
	|	И &ЗаявкаСРасшифровкойПлатежа = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору = ИСТИНА
	|				И &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	&Валюта,
	|	&ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО,
	|	&ЖелательнаяДатаПлатежа,
	|	&ЦФО,
	|	&Проект,
	|	ДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ДвиженияОперации.Аналитика1,
	|	ДвиженияОперации.Аналитика2,
	|	ДвиженияОперации.Аналитика3,
	|	ДвиженияОперации.Аналитика4,
	|	ДвиженияОперации.Аналитика5,
	|	ДвиженияОперации.Аналитика6,
	|	-ДвиженияОперации.Сумма,
	|	&НаправлениеДвижения,
	|	&ВидБюджета,
	|	&КурсПлатежа,
	|	&КратностьПлатежа,
	|	&КурсЗаданВОперации
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И &ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.Резервирование)
	|	И НЕ &ПолучитьИзДокументаОснования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору = ИСТИНА
	|				И &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	&Валюта,
	|	ВЫБОР
	|		КОГДА &ПолучитьИзДокументаОснования
	|				И &ЭтоРасчетыПоЗаказам
	|			ТОГДА &ДокументОснование
	|		ИНАЧЕ &ДоговорКонтрагента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ПолучитьИзДокументаОснования
	|				И &ЭтоРасчетыПоЗаказам
	|			ТОГДА &ДокументОснование
	|		ИНАЧЕ &ДоговорКонтрагента
	|	КОНЕЦ,
	|	&ЖелательнаяДатаПлатежа,
	|	&ЦФО,
	|	&Проект,
	|	ДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ДвиженияОперации.Аналитика1,
	|	ДвиженияОперации.Аналитика2,
	|	ДвиженияОперации.Аналитика3,
	|	ДвиженияОперации.Аналитика4,
	|	ДвиженияОперации.Аналитика5,
	|	ДвиженияОперации.Аналитика6,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) <= 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) < ДвиженияОперации.Сумма
	|			ТОГДА -ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0)
	|		ИНАЧЕ -ДвиженияОперации.Сумма
	|	КОНЕЦ,
	|	&НаправлениеДвижения,
	|	&ВидБюджета,
	|	&КурсПлатежа,
	|	&КратностьПлатежа,
	|	&КурсЗаданВОперации
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОперацииБюджетов.Обороты(, , Авто, ) КАК ОперацииБюджетовОбороты
	|		ПО ДвиженияОперации.СтатьяДвиженияДенежныхСредств = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.СтатьяБюджета
	|			И ДвиженияОперации.Аналитика1 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика1
	|			И ДвиженияОперации.Аналитика2 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика2
	|			И ДвиженияОперации.Аналитика3 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика3
	|			И ДвиженияОперации.Аналитика4 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика4
	|			И ДвиженияОперации.Аналитика5 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика5
	|			И ДвиженияОперации.Аналитика6 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика6
	|			И (ВЫБОР
	|				КОГДА &ПолучитьИзДокументаОснования
	|						И &ЭтоРасчетыПоЗаказам
	|					ТОГДА &ДокументОснование = ОперацииБюджетовОбороты.ОбъектПланирования.Объект
	|				ИНАЧЕ &ДоговорКонтрагента = ОперацииБюджетовОбороты.ОбъектПланирования.Объект
	|			КОНЕЦ)
	|			И (ОперацииБюджетовОбороты.ВидБюджета = &ВидБюджета)
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И &ОплатаПоДоговоруПоставки = ЛОЖЬ
	|	И (&ГрафикДоговора = ЗНАЧЕНИЕ(Перечисление.ГрафикиДоговора.ГрафикРасчетов)
	|				И &ДокументПланирования = ЗНАЧЕНИЕ(Документ.Резервирование.ПустаяСсылка)
	|			ИЛИ &ПолучитьИзДокументаОснования)
	|	И ОперацииБюджетовОбороты.Регистратор <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору = ЛОЖЬ
	|				ИЛИ &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ДвиженияОперации.ОбъектРасчетов
	|	КОНЕЦ,
	|	&Валюта,
	|	&Ссылка,
	|	ВЫБОР
	|		КОГДА &ПолучитьИзДокументаОснования И &ЭтоРасчетыПоЗаказам
	|			ТОГДА &ДокументОснование
	|		ИНАЧЕ ДвиженияОперации.ОбъектРасчетов.Объект
	|	КОНЕЦ,
	|	&ЖелательнаяДатаПлатежа,
	|	ДвиженияОперации.ЦФО,
	|	ДвиженияОперации.Проект,
	|	ДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ДвиженияОперации.Аналитика1,
	|	ДвиженияОперации.Аналитика2,
	|	ДвиженияОперации.Аналитика3,
	|	ДвиженияОперации.Аналитика4,
	|	ДвиженияОперации.Аналитика5,
	|	ДвиженияОперации.Аналитика6,
	|	ДвиженияОперации.Сумма,
	|	&НаправлениеДвижения,
	|	&ВидБюджета,
	|	&КурсПлатежа,
	|	&КратностьПлатежа,
	|	&КурсЗаданВОперации
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И &ОплатаПоДоговоруПоставки = ИСТИНА
	|	И ДвиженияОперации.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	&Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыСКонтрагентом
	|			ТОГДА &Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоРасчетыПоДоговору = ИСТИНА
	|				И &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|			ТОГДА &ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	&Валюта,
	|	ВЫБОР
	|		КОГДА &ПолучитьИзДокументаОснования И &ЭтоРасчетыПоЗаказам
	|			ТОГДА &ДокументОснование
	|		ИНАЧЕ &ДоговорКонтрагента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ПолучитьИзДокументаОснования И &ЭтоРасчетыПоЗаказам
	|			ТОГДА &ДокументОснование
	|		ИНАЧЕ &ДоговорКонтрагента
	|	КОНЕЦ,
	|	&ЖелательнаяДатаПлатежа,
	|	ДвиженияОперации.ЦФО,
	|	ДвиженияОперации.Проект,
	|	ДвиженияОперации.СтатьяДвиженияДенежныхСредств,
	|	ДвиженияОперации.Аналитика1,
	|	ДвиженияОперации.Аналитика2,
	|	ДвиженияОперации.Аналитика3,
	|	ДвиженияОперации.Аналитика4,
	|	ДвиженияОперации.Аналитика5,
	|	ДвиженияОперации.Аналитика6,
	|	-ДвиженияОперации.Сумма,
	|	&НаправлениеДвижения,
	|	&ВидБюджета,
	|	&КурсПлатежа,
	|	&КратностьПлатежа,
	|	&КурсЗаданВОперации
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияОперации
	|ГДЕ
	|	ДвиженияОперации.Ссылка = &Ссылка
	|	И &ОплатаПоДоговоруПоставки = ИСТИНА
	|	И ДвиженияОперации.Сумма > 0";
	
	Запрос.УстановитьПараметр("ВидБюджета",	ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств);
	Запрос.УстановитьПараметр("НаправлениеДвижения", Перечисления.ВидыДвиженийПриходРасход.Расход);
	Запрос.УстановитьПараметр("НаправлениеДвиженияЗачисления", Перечисления.ВидыДвиженийПриходРасход.Приход);
	
	КурсЗаданВОперации = (Не Источник.Валюта = Источник.ВалютаОплаты);
	Запрос.УстановитьПараметр("КурсЗаданВОперации",	КурсЗаданВОперации); 	

	ИменаРеквизитов = "Дата, ВидОперацииУХ, Организация, Контрагент, ДоговорКонтрагента, ОплатаПоДоговоруПоставки, ХозяйственнаяОперацияПоЗарплате,"
			+ "ЖелательнаяДатаПлатежа, ДатаЗачисления, Валюта, ВалютаОплаты, ВалютаКонвертации, СуммаКонвертации, СуммаДокумента,"
			+ "ЦФО, Проект, ДокументПланирования, СтатьяДвиженияДенежныхСредствЗачисление,СтатьяДвиженияДенежныхСредств,КурсПлатежа, КратностьПлатежа, ДокументОснование,СписокФизЛиц,"
			+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("АналитикаЗачисления%1")+","
			+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("Аналитика%1");
	
	Если ТипЗнч(Источник) = ТипЗнч(ПустаяСсылка()) Тогда
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, ИменаРеквизитов);
	Иначе
		РеквизитыДокумента = Источник;
		
		//Заполним ДоговорКонтрагента для новой заявки
		Если Источник.Ссылка.Пустая() Тогда
			ВидДоговора = ВстраиваниеУХЗаявкаНаРасходованиеДенежныхСредств.ИмяРеквизитаДоговора(Источник);
			Если ЗначениеЗаполнено(ВидДоговора) Тогда	
				РеквизитыДокумента.ДоговорКонтрагента = Источник[ВидДоговора];
			КонецЕсли;
		КонецЕсли;
		
		ИменаРеквизитовТЧ = "ОбъектРасчетов, ЦФО, Проект, Сумма,  СтатьяДвиженияДенежныхСредств," 
						+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("Аналитика%1");
		
		РасшифровкаПлатежа = Источник.РасшифровкаПлатежа.Выгрузить(,ИменаРеквизитовТЧ);
		ОписаниеТипаСсылки = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ПустаяСсылка())));
		РасшифровкаПлатежа.Колонки.Добавить("Ссылка", ОписаниеТипаСсылки);
		РасшифровкаПлатежа.ЗаполнитьЗначения(Источник.Ссылка, "Ссылка");
		
		Запрос.УстановитьПараметр("РасшифровкаПлатежа", РасшифровкаПлатежа);
		Запрос.Текст =
		"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа ИЗ &РасшифровкаПлатежа КАК Коллекция";
		Запрос.Выполнить();

		// лицевые счета
		ИменаРеквизитовТЧЛицевыеСчета = " Сумма,  СтатьяДвиженияДенежныхСредств, " 
						+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("Аналитика%1");
		ЛицевыеСчетаСотрудников = Источник.ЛицевыеСчетаСотрудников.Выгрузить(,ИменаРеквизитовТЧЛицевыеСчета);
		ОписаниеТипаСсылки = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ПустаяСсылка())));
		ЛицевыеСчетаСотрудников.Колонки.Добавить("Ссылка", ОписаниеТипаСсылки);
		ЛицевыеСчетаСотрудников.ЗаполнитьЗначения(Источник.Ссылка, "Ссылка");
		
		Запрос.УстановитьПараметр("ЛицевыеСчетаСотрудников", ЛицевыеСчетаСотрудников);
		Запрос.Текст =
		"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ЛицевыеСчетаСотрудников ИЗ &ЛицевыеСчетаСотрудников КАК Коллекция";
        	
		Запрос.Выполнить();
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаявкаНаРасходованиеДенежныхСредств.", "ВТ_");
		
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Новый Структура(ИменаРеквизитов) Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, РеквизитыДокумента[КлючЗначение.Ключ]);
	КонецЦикла;
	
	// Отдельно обработатаем реквизиты КратностьПлатежа и КурсПлатежа
	Если РеквизитыДокумента.КурсПлатежа = 0 И РеквизитыДокумента.КратностьПлатежа = 0 Тогда
		Если КурсЗаданВОперации Тогда
			ДатаКурса = ?(ЗначениеЗаполнено(Источник.ЖелательнаяДатаПлатежа), Источник.ЖелательнаяДатаПлатежа, Источник.Дата);
			ЗначенияКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Источник.Валюта, ДатаКурса);
			
			Запрос.УстановитьПараметр("КурсПлатежа", ЗначенияКурса.Курс);
			Запрос.УстановитьПараметр("КратностьПлатежа", ЗначенияКурса.Кратность);
		КонецЕсли;
	КонецЕсли;
	
	ПереопределитьКурсКратностьПлатежа(Запрос, РеквизитыДокумента);
	
	// Параметры из ВидОперацииУХ
	ЭтоРасчетыСКонтрагентом = ВидыОперацийУХВызовСервераПовтИсп.ЭтоРасчетыСКонтрагентом(РеквизитыДокумента.ВидОперацииУХ);
	ЭтоРасчетыПоДоговору = ЭтоРасчетыСКонтрагентом И НЕ ВидыОперацийУХВызовСервераПовтИсп.ЭтоРасчетыБезДоговора(РеквизитыДокумента.ВидОперацииУХ);
	ЗаявкаСРасшифровкойПлатежа 	= ВидыОперацийУХВызовСервераПовтИспПереопределяемый.РасшифровкаПлатежаВТабличнойЧасти(РеквизитыДокумента.ВидОперацииУХ);
	ЕстьАналитикиЗачисления = ВидыОперацийУХВызовСервераПовтИсп.ЭтоПеремещениеВнутриОрганизации(РеквизитыДокумента.ВидОперацииУХ);
	ЭтоКонвертацияВалюты = ВидыОперацийУХКлиентСерверПовтИсп.ЭтоКонвертацияВалюты(РеквизитыДокумента.ВидОперацииУХ);
	ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту = РеквизитыДокумента.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту;
	ЭтоВыплатаНаЛицевыеСчетаПоЗарплатномуПроекту = РеквизитыДокумента.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета;
	ЭтоЗаявкаПоПТУ = ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
	ИсточникЛимитовОснование = ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) 
								И (ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
	
	Запрос.УстановитьПараметр("ЭтоРасчетыСКонтрагентом", ЭтоРасчетыСКонтрагентом);
	Запрос.УстановитьПараметр("ЭтоРасчетыПоДоговору", ЭтоРасчетыПоДоговору);  
	Запрос.УстановитьПараметр("ЭтоКонвертацияВалюты", ЭтоКонвертацияВалюты);
	Запрос.УстановитьПараметр("ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту", ЭтоВыплатаПоВедомостиПоЗарплатномуПроекту);
	Запрос.УстановитьПараметр("ЭтоВыплатаНаЛицевыеСчетаПоЗарплатномуПроекту", ЭтоВыплатаНаЛицевыеСчетаПоЗарплатномуПроекту);
	Запрос.УстановитьПараметр("ЕстьАналитикиЗачисления", ЕстьАналитикиЗачисления);  
	Запрос.УстановитьПараметр("ПолучитьИзДокументаОснования", ИсточникЛимитовОснование);
	Запрос.УстановитьПараметр("ЗаявкаСРасшифровкойПлатежа",	ЗаявкаСРасшифровкойПлатежа);

	Если ЭтоЗаявкаПоПТУ Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.ДокументОснование, "ПоступлениеПоЗаказам") Тогда
			Запрос.УстановитьПараметр("ДокументОснование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.ДокументОснование, "ЗаказПоставщику"));
		Иначе
			Запрос.УстановитьПараметр("ДокументОснование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.ДокументОснование, "Договор"));
		КонецЕсли;
	КонецЕсли;
	
	// Параметры заявки
	Если ЭтоКонвертацияВалюты Тогда
		Запрос.УстановитьПараметр("Сумма",	РеквизитыДокумента.СуммаКонвертации);
		Запрос.УстановитьПараметр("ВалютаКонвертации",	РеквизитыДокумента.ВалютаКонвертации);
	Иначе
		Запрос.УстановитьПараметр("Сумма",	РеквизитыДокумента.СуммаДокумента);
		Запрос.УстановитьПараметр("ВалютаКонвертации", РеквизитыДокумента.Валюта);
	КонецЕсли;
	
	// Реквизиты договора
	ИменаРеквизитовДоговора = "ГрафикДоговора, ПорядокРасчетов";
	РеквизитыДоговора 					= Новый Структура(ИменаРеквизитовДоговора);
	РеквизитыДоговора.ПорядокРасчетов 	= Перечисления.ПорядокРасчетов.ПустаяСсылка();
	РеквизитыДоговора.ГрафикДоговора 	= Перечисления.ГрафикиДоговора.ПустаяСсылка();
	
	Если ЭтоРасчетыПоДоговору И РеквизитыДокумента.ДоговорКонтрагента <> Неопределено 
		И ТипЗнч(РеквизитыДокумента.ДоговорКонтрагента ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ДоговорКонтрагента, ИменаРеквизитовДоговора);
	КонецЕсли;

	Если ТипЗнч(РеквизитыДокумента.ДоговорКонтрагента ) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		РеквизитыДоговора.ПорядокРасчетов 	= Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
		РеквизитыДоговора.ГрафикДоговора 	= Перечисления.ГрафикиДоговора.ГрафикРасчетов;
	КонецЕсли;
	
	Если РеквизитыДоговора.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам ИЛИ РеквизитыДоговора.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда	
		ЭтоРасчетыПоЗаказам = Истина;
	Иначе
		ЭтоРасчетыПоЗаказам = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭтоРасчетыПоЗаказам", ЭтоРасчетыПоЗаказам);
	
	Для Каждого КлючЗначение Из РеквизитыДоговора Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();

	ОбщегоНазначенияОПК.ОчиститьВременныеТаблицы(Запрос, "ВТ_ПланыДокумента");
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции 

Процедура ПереопределитьКурсКратностьПлатежа(ЗапросИсточник, РеквизитыДокумента) 
	
	// Обработка ситуации при которой валюты взаиморасчетов, оплаты и лимитирования отличаются
	Если Не ЗапросИсточник.Параметры.КурсЗаданВОперации Тогда
		Возврат;
	КонецЕсли;       
	
	ВалютыДокумента = Новый Массив;
	ВалютыДокумента.Добавить(РеквизитыДокумента.Валюта);
	ВалютыДокумента.Добавить(РеквизитыДокумента.ВалютаОплаты);
	
	ТаблицаВалютЛимитирования = Новый ТаблицаЗначений;
	ТаблицаВалютЛимитирования.Колонки.Добавить("ДатаОперации", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаВалютЛимитирования.Колонки.Добавить("ВидБюджета", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("ПланВидовХарактеристикСсылка.ВидыБюджетов"));
	ТаблицаВалютЛимитирования.Колонки.Добавить("ЦФО", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Организации"));
	ТаблицаВалютЛимитирования.Колонки.Добавить("Валюта", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Валюты"));
	
	ДатаОперации = ?(ЗначениеЗаполнено(РеквизитыДокумента.ЖелательнаяДатаПлатежа), РеквизитыДокумента.ЖелательнаяДатаПлатежа, РеквизитыДокумента.Дата);
	
	НоваяТаблица = ТаблицаВалютЛимитирования.Добавить(); 
	НоваяТаблица.ДатаОперации = ДатаОперации; 
	НоваяТаблица.ВидБюджета = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств; 
	НоваяТаблица.ЦФО = РеквизитыДокумента.ЦФО;
	НоваяТаблица.Валюта = РеквизитыДокумента.Валюта;   
	
	Запрос = Новый Запрос;    
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;  	
	
	Запрос.Текст =
	"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Данные ИЗ &ТаблицаВалютЛимитирования КАК Коллекция";
	
	Запрос.УстановитьПараметр("ТаблицаВалютЛимитирования", ТаблицаВалютЛимитирования);
	Запрос.Выполнить();
	
	РезультатЗапроса = КонтрольЛимитовУХ.ОпределитьВалютуЛимитированияПоДокументу(Запрос);	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Если Не ВалютыДокумента.Найти(ВыборкаДетальныеЗаписи.ВалютаЛимитирования) = Неопределено
		И Не РеквизитыДокумента.Валюта = ВыборкаДетальныеЗаписи.ВалютаЛимитирования Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТекущегоКурса = КонтрольЛимитовУХ.ПолучитьКурсВалютыЛимитирования(РеквизитыДокумента.Валюта, ДатаОперации);
	ПараметрыНовогоКурса = КонтрольЛимитовУХ.ПолучитьКурсВалютыЛимитирования(ВыборкаДетальныеЗаписи.ВалютаЛимитирования, ДатаОперации);
	КроссКурс = РаботаСКурсамиВалютУХ.ПолучитьКроссКурсВалют(ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
	
	ЗапросИсточник.УстановитьПараметр("КурсПлатежа", КроссКурс.Курс);
    ЗапросИсточник.УстановитьПараметр("КратностьПлатежа", КроссКурс.Кратность);
	
КонецПроцедуры

Функция ДанныеОбъектаПоСсылке(Источник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаОплату.Ссылка КАК Ссылка,
	|	ЗаявкаНаОплату.Дата КАК Дата,
	|	ЗаявкаНаОплату.ВидОперацииУХ КАК ВидОперацииУХ,
	|	ЗаявкаНаОплату.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЗаявкаНаОплату.Валюта КАК Валюта,
	|	ЗаявкаНаОплату.ВалютаОплаты КАК ВалютаОплаты,
	|	ЗаявкаНаОплату.СуммаДокумента КАК СуммаДокумента,
	|	ЗаявкаНаОплату.ЖелательнаяДатаПлатежа КАК ЖелательнаяДатаПлатежа,
	|	ЗаявкаНаОплату.Организация КАК Организация,
	|	ЗаявкаНаОплату.Контрагент КАК Контрагент,
	|	ЗаявкаНаОплату.Договор КАК Договор,
	|	ЗаявкаНаОплату.СписокФизЛиц КАК СписокФизЛиц,
	|	ЗаявкаНаОплату.ЦФО КАК ЦФО,
	|	ЗаявкаНаОплату.Проект КАК Проект,
	|	ЗаявкаНаОплату.ДокументПланирования КАК ДокументПланирования,
	|	ЗаявкаНаОплату.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкаНаОплату.Аналитика1 КАК Аналитика1,
	|	ЗаявкаНаОплату.Аналитика2 КАК Аналитика2,
	|	ЗаявкаНаОплату.Аналитика3 КАК Аналитика3,
	|	ЗаявкаНаОплату.Аналитика4 КАК Аналитика4,
	|	ЗаявкаНаОплату.Аналитика5 КАК Аналитика5,
	|	ЗаявкаНаОплату.Аналитика6 КАК Аналитика6,
	|	ЗаявкаНаОплату.СтатьяДвиженияДенежныхСредствЗачисление КАК СтатьяДвиженияДенежныхСредствЗачисление,
	|	ЗаявкаНаОплату.АналитикаЗачисления1 КАК АналитикаЗачисления1,
	|	ЗаявкаНаОплату.АналитикаЗачисления2 КАК АналитикаЗачисления2,
	|	ЗаявкаНаОплату.АналитикаЗачисления3 КАК АналитикаЗачисления3,
	|	ЗаявкаНаОплату.АналитикаЗачисления4 КАК АналитикаЗачисления4,
	|	ЗаявкаНаОплату.АналитикаЗачисления5 КАК АналитикаЗачисления5,
	|	ЗаявкаНаОплату.АналитикаЗачисления6 КАК АналитикаЗачисления6,
	|	ЗаявкаНаОплату.РасшифровкаПлатежа.(
	|		СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		Аналитика1 КАК Аналитика1,
	|		Аналитика2 КАК Аналитика2,
	|		Аналитика3 КАК Аналитика3,
	|		Аналитика4 КАК Аналитика4,
	|		Аналитика5 КАК Аналитика5,
	|		Аналитика6 КАК Аналитика6,
	|		Сумма КАК Сумма
	|	) КАК РасшифровкаПлатежа
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаОплату
	|ГДЕ
	|	ЗаявкаНаОплату.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка,, "РасшифровкаПлатежа");
		Результат.РасшифровкаПлатежа = Выборка.РасшифровкаПлатежа.Выгрузить();
	КонецЕсли;
	
	Возврат Результат;  
	
КонецФункции

#КонецОбласти 

#Область ИсточникиДляКонтроляДокумента_УХ
	
Функция ИсточникиДокумента(Объект, ДопПараметры = Неопределено) Экспорт
	
	Источники = Новый Соответствие;
	
	// 1. Источник для контроля бюджетных лимитов и резервов
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХБюджетныеЛимиты, 
		Источник_БюджетныеЛимитыРезервы(Объект));
	
	// 2. Планы по взаиморасчетам с контрагентом
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХВзаиморасчетыПоКонтрагенту, 
		Источник_ВзаиморасчетыПоКонтрагенту(Объект));
	
	// 3. Планы по взаиморасчетам по договору
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХВзаиморасчетыПоДоговору,
		Источник_ВзаиморасчетыПоДоговору(Объект));
	
	// 4. Контроль суммы расходов по договору
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХРасходыПоДоговору,
		Источник_РасходыПоДоговору(Объект));
	
	Возврат Источники;
	
КонецФункции
	
Функция Источник_БюджетныеЛимитыРезервы(Объект)
	
	// Доп.параметры
	ДопПараметрыИсточника = Новый Структура;
	ДопПараметрыИсточника.Вставить("Дата", 				Объект.Дата);
	ДопПараметрыИсточника.Вставить("Ссылка", 			Объект.Ссылка);
	ДопПараметрыИсточника.Вставить("ЭтоНовый", 			Не ЗначениеЗаполнено(Объект.Ссылка));
	ДопПараметрыИсточника.Вставить("ДатаКонтроляЛимита", Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПланыДокумента(Объект);
	//Запрос.УстановитьПараметр("ИспользоватьРезервирование", КонтрольЛимитовУХПовтИсп.ПолучитьЗначениеИспользованияРезервирования());
	КонтрольЛимитовУХ.УстановитьТипыДокументовДляЗапроса(Запрос);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ПланыДокумента.ВидБюджета КАК ВидБюджета,
	|	ВТ_ПланыДокумента.Организация КАК Организация,
	|	ВТ_ПланыДокумента.Валюта КАК Валюта,
	|	ВТ_ПланыДокумента.КурсЗаданВОперации КАК КурсЗаданВОперации,
	|	ВТ_ПланыДокумента.КурсПланирования КАК КурсПланирования,
	|	ВТ_ПланыДокумента.КратностьПланирования КАК КратностьПланирования,
	|	ВТ_ПланыДокумента.ДокументПланирования КАК ДокументПланирования,
	|	ВЫБОР
	|		КОГДА ВТ_ПланыДокумента.ДокументРезервирования = ЗНАЧЕНИЕ(Документ.Резервирование.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ПланыДокумента.ДокументРезервирования
	|	КОНЕЦ КАК ДокументРезервирования,
	|	ВТ_ПланыДокумента.Период КАК ДатаОперации,
	|	ВТ_ПланыДокумента.ЦФО КАК ЦФО,
	|	ВТ_ПланыДокумента.Проект КАК Проект,
	|	ВТ_ПланыДокумента.ПриходРасход КАК ПриходРасход,
	|	ВТ_ПланыДокумента.СтатьяБюджета КАК СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика1 КАК Аналитика1,
	|	ВТ_ПланыДокумента.Аналитика2 КАК Аналитика2,
	|	ВТ_ПланыДокумента.Аналитика3 КАК Аналитика3,
	|	ВТ_ПланыДокумента.Аналитика4 КАК Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика5 КАК Аналитика5,
	|	ВТ_ПланыДокумента.Аналитика6 КАК Аналитика6,
	|	0 КАК Лимит,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПланыДокумента.ДокументРезервирования <> НЕОПРЕДЕЛЕНО
	|					И ВТ_ПланыДокумента.ДокументРезервирования <> ЗНАЧЕНИЕ(Документ.Резервирование.ПустаяСсылка)
	|				ТОГДА -ВТ_ПланыДокумента.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Зарезервировано,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПланыДокумента.ДокументПланирования) В (&ТипыЗаявокНаОперации)
	|				ТОГДА ВТ_ПланыДокумента.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Заявлено,
	|	0 КАК Исполнено
	|ПОМЕСТИТЬ ВТ_ТаблицаПлановССуммамиЛимитирования
	|ИЗ
	|	ВТ_ПланыДокумента КАК ВТ_ПланыДокумента
	|ГДЕ
	|	ВТ_ПланыДокумента.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПланыДокумента.Аналитика6,
	|	ВТ_ПланыДокумента.ДокументПланирования,
	|	ВТ_ПланыДокумента.ДокументРезервирования,
	|	ВТ_ПланыДокумента.Аналитика1,
	|	ВТ_ПланыДокумента.ВидБюджета,
	|	ВТ_ПланыДокумента.ЦФО,
	|	ВТ_ПланыДокумента.СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика3,
	|	ВТ_ПланыДокумента.Проект,
	|	ВТ_ПланыДокумента.Аналитика5,
	|	ВТ_ПланыДокумента.Организация,
	|	ВТ_ПланыДокумента.Период,
	|	ВТ_ПланыДокумента.Валюта,
	|	ВТ_ПланыДокумента.КурсЗаданВОперации,
	|	ВТ_ПланыДокумента.КурсПланирования,
	|	ВТ_ПланыДокумента.КратностьПланирования,
	|	ВТ_ПланыДокумента.ПриходРасход,
	|	ВТ_ПланыДокумента.Аналитика2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПланыДокумента";
	
	Запрос.Выполнить();
	
	Источник = Новый Структура;
	Источник.Вставить("Параметры", 		ДопПараметрыИсточника);
	Источник.Вставить("ПланыДокумента", Запрос.МенеджерВременныхТаблиц);
	
	Возврат Источник;
	
КонецФункции

Функция Источник_ВзаиморасчетыПоКонтрагенту(Объект)
	
	ОМ = ЗаявкиНаОперации;
	РеквизитыЗаявки = ОМ.РеквизитыДокументаЗаявка(ТипЗнч(Объект.Ссылка));
	
	// Если незаполнен контрагент, то контроль не выполняется
	Контрагент = ОМ.РеквизитЗаявки(Объект, РеквизитыЗаявки.Контрагент);
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат неопределено;
	КонецЕсли;
	
	// Если роль определить не удалось, то контроль не выполняется
	РольКонтрагента = ВидыОперацийУХКлиентСерверПовтИсп.РольКонтрагента(Объект.ВидОперацииУХ);
	Если РольКонтрагента = неопределено Тогда
		Возврат неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Заявка", Объект.Ссылка);
	Результат.Вставить("Контрагент", Контрагент);
	Результат.Вставить("СуммаПлатежа", Объект.СуммаДокумента);
	Результат.Вставить("Валюта", ОМ.РеквизитЗаявки(Объект, РеквизитыЗаявки.ВалютаДокумента));
	Результат.Вставить("РольКонтрагента", РольКонтрагента);
	
	Возврат Результат;
	
КонецФункции

Функция Источник_ВзаиморасчетыПоДоговору(Объект)
	
	ОМ = ЗаявкиНаОперации;
	РеквизитыЗаявки = ОМ.РеквизитыДокументаЗаявка(ТипЗнч(Объект.Ссылка));
	
	Договор = ОМ.РеквизитЗаявки(Объект, РеквизитыЗаявки.ДоговорКонтрагента);
	
	// Если контрагент не заполнен, то не проверяемся
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		// Контроль не выполняется
		Возврат неопределено;
	КонецЕсли;   
	
	ВидОперацииУХ = Объект.ВидОперацииУХ;
	
	РасшифровкаПлатежа = Объект.РасшифровкаПлатежа.Выгрузить(, "ОбъектРасчетов, ВалютаВзаиморасчетов, СуммаВзаиморасчетов");
	РасшифровкаПлатежа.Колонки.Добавить("Организация", Метаданные.ОпределяемыеТипы.Организации.Тип);
	РасшифровкаПлатежа.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	РасшифровкаПлатежа.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	РасшифровкаПлатежа.ЗаполнитьЗначения(Объект.Организация, "Организация");
	РасшифровкаПлатежа.ЗаполнитьЗначения(Объект.Контрагент, "Контрагент");
	
	Результат = Новый Структура;
	Результат.Вставить("Заявка", Объект.Ссылка);
	Результат.Вставить("Организация", Объект.Организация);
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
	Тогда
		Возврат неопределено;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда
		Возврат неопределено;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
			ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты
			ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов ТОГДА
		Возврат неопределено;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю ТОГДА
		Возврат неопределено;
		
	ИначеЕсли ВидыОперацийУХВызовСервераПовтИсп.ЭтоРасчетыСКонтрагентом(ВидОперацииУХ) <> Истина
			ИЛИ ВидыОперацийУХВызовСервераПовтИсп.ЭтоРасчетыБезДоговора(ВидОперацииУХ) <> ЛОЖЬ Тогда
		Возврат неопределено;
	ИначеЕсли ВидыОперацийУХВызовСервераПовтИсп.ЭтоПродажаВалюты(ВидОперацииУХ) = Истина
		ИЛИ ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПриобретениеВалюты Тогда
		Возврат неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Договор) Тогда 
		Возврат Неопределено;                             	
	Иначе	
		Результат.Вставить("Контрагент", Объект.Контрагент);
		Результат.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
		Результат.Вставить("Договор", Объект.Договор);
		Результат.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
		
		РасшифровкаПлатежа.ЗаполнитьЗначения(Объект.Договор, "Договор");
				
	КонецЕсли;
	
	Для Каждого Строка Из РасшифровкаПлатежа Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ВалютаВзаиморасчетов) Тогда
			Строка.ВалютаВзаиморасчетов = Объект.Валюта;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	Результат.Вставить("СуммаПлатежа", Объект.СуммаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция Источник_РасходыПоДоговору(Объект)
	
	ОМ = ЗаявкиНаОперации;
	РеквизитыЗаявки = ОМ.РеквизитыДокументаЗаявка(ТипЗнч(Объект.Ссылка));
	
	Договор = ОМ.РеквизитЗаявки(Объект, РеквизитыЗаявки.ДоговорКонтрагента);
	
	КонтрольОплаты = Истина;
	Результат = КонтрольУХРасходыПоДоговору.СтруктураИсточник(Объект.Ссылка, Объект.Организация, КонтрольОплаты);
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
	Тогда
		Результат.Контрагент = Объект.ОрганизацияПолучатель;
		Результат.Договор = Договор;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику 
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщикуПодотчетнымЛицом Тогда
		Результат.Контрагент = Объект.Контрагент;
		Результат.Договор = Договор;
		
	КонецЕсли;
	
	// Оплата
	Для Каждого СтрокаОперации Из Объект.РасшифровкаПлатежа Цикл
		Строка = Результат.ДанныеДляПроверки.Добавить();
		Строка.Организация = Объект.Организация;
		Строка.Контрагент = Результат.Контрагент;
		Строка.Договор = Результат.Договор;
		Строка.ОбъектРасчетов = СтрокаОперации.ОбъектРасчетов;
		Строка.Валюта = Объект.Валюта;
		Строка.ЭтоОплата = КонтрольОплаты;
		Строка.Сумма = СтрокаОперации.СуммаВзаиморасчетов;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаявкаСРасшифровкойПлатежа(Объект) Экспорт
	
	// Определение местонахождения статьи движения денежных средств
	МассивВсехРеквизитов = Новый Массив; МассивРеквизитовОперации = Новый Массив;
	ЗаполнитьИменаРеквизитовПоХозяйственнойОперацииУХ(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации);
		
	Возврат МассивРеквизитовОперации.Найти("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств") <> Неопределено;
		
КонецФункции

#КонецОбласти 

#Область КонтрольНаличияПериодов

#КонецОбласти 

#Область Согласование_УХ

Функция РеквизитыДляКонтрольнойСуммы() Экспорт
	
	РеквизитыДляПроверкиСогласования = Новый Массив;
	РеквизитыДляПроверкиСогласования.Добавить("ВидОперацииУХ");
	РеквизитыДляПроверкиСогласования.Добавить("Организация");
	РеквизитыДляПроверкиСогласования.Добавить("Контрагент");
	РеквизитыДляПроверкиСогласования.Добавить("ДоговорКонтрагента");
	РеквизитыДляПроверкиСогласования.Добавить("СуммаДокумента");
	РеквизитыДляПроверкиСогласования.Добавить("ВалютаОплаты");
	РеквизитыДляПроверкиСогласования.Добавить("КодВидаДохода");
	РеквизитыДляПроверкиСогласования.Добавить("КодВыплат");
	РеквизитыДляПроверкиСогласования.Добавить("ВалютаКонвертации");
	РеквизитыДляПроверкиСогласования.Добавить("НазначениеПлатежа");
	РеквизитыДляПроверкиСогласования.Добавить("Валюта");
	РеквизитыДляПроверкиСогласования.Добавить("ТипНалога");
	РеквизитыДляПроверкиСогласования.Добавить("ПодотчетноеЛицо");
	РеквизитыДляПроверкиСогласования.Добавить("БанковскийСчетПолучатель");
	
	ТабличныеЧастиДляПроверкиСогласования = Новый Массив;
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизиты",      РеквизитыДляПроверкиСогласования);
	Результат.Вставить("ТабличныеЧасти", ТабличныеЧастиДляПроверкиСогласования); 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти 

#КонецЕсли
