#Область СверкаВГО


// Обработка события выбора строки ТЧ "Записи" справочника
// ПротоколируемыеСобытия.
//
Процедура ПротоколируемыеСобытия_ЗаписиВыбор(Форма, ПротоколируемоеСобытие, СтрокаЗаписи) Экспорт
	Если ПротоколируемоеСобытие.Реструктуризация Тогда
		
		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("ИсточникДанныхДляРасчетов", 	СтрокаЗаписи.ОбъектДанных);
		СтруктураПараметров.Вставить("ПотребительРасчета", 			СтрокаЗаписи.ПоказательОтчета);
		СтруктураПараметров.Вставить("СпособИспользования", 		ПредопределенноеЗначение("Перечисление.СпособыИспользованияОперандов.ДляФормулРасчета"));
		
		ОткрытьФорму("ОбщаяФорма.ФормаНастройкиФормулРасчета", СтруктураПараметров, Форма);
		
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область ВызовыКомандВерсийРегламентов

Процедура СтруктураВладения(ПараметрыОткрытия) Экспорт
	ОткрытьФорму("Обработка.СтруктураВладения.Форма", ПараметрыОткрытия);
КонецПроцедуры

Процедура СетеваяДиаграммаШаблонаУниверсальногоПроцесса(ПараметрыОткрытия) Экспорт
	ОткрытьФорму("Отчет.СетеваяДиаграммаШаблонаУниверсальногоПроцесса.ФормаОбъекта", ПараметрыОткрытия);
КонецПроцедуры


#КонецОбласти


#Область ВызовыФормБизнесЛогикиУХ

Процедура ОткрытьФормаВыбораСтатьиБюджета(СтруктураПараметров,ВладелецФормы) Экспорт
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьиБюджета",СтруктураПараметров,ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // ОткрытьФормаВыбораСтатьиБюджета()

Процедура ОткрытьФормаСохраненияМакета(СтруктураПараметров,ВладелецФормы) Экспорт
	ОткрытьФорму("ОбщаяФорма.ФормаСохраненияМакета", СтруктураПараметров,ВладелецФормы)
КонецПроцедуры // ОткрытьФормаСохраненияМакета() 

Процедура ОткрытьОтображениеЭлементаWS_Управляемая(СтруктураПараметров) Экспорт
 	ОткрытьФорму("ОбщаяФорма.ОтображениеЭлементаWS_Управляемая", СтруктураПараметров);
КонецПроцедуры // ОткрытьОтображениеЭлементаWS_Управляемая()

Процедура ОткрытьФормаОбменНСИ(СтруктураПараметров) Экспорт
 	ОткрытьФорму("Обработка.ОбменНСИ.Форма.Форма", СтруктураПараметров);
КонецПроцедуры // ОткрытьФормаОбменНСИ()

Процедура ОткрытьОтчетПоПроизвольномуЗапросуВИБ(ДанныеРасшифровки) Экспорт
	ОткрытьФорму("Отчет.ОтчетПоПроизвольномуЗапросуВИБ.Форма.ФормаОтчета",ДанныеРасшифровки,,Новый УникальныйИдентификатор);
КонецПроцедуры // ОткрытьОтчетПоПроизвольномуЗапросуВИБ() 

Процедура ОткрытьФормаВыбораЛистаИПароля(СтруктураПараметровФормы, ЭтаФорма,ОписаниеОЗакрытии) Экспорт
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЛистаИПароля", СтруктураПараметровФормы, ЭтаФорма, , , , ОписаниеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // ОткрытьФормаВыбораЛистаИПароля()


Процедура ОткрытьЗаписьПоказателяСРасчетомЗависимых(СтруктураПараметров) Экспорт
	ОткрытьФорму("Обработка.ЗаписьПоказателяСРасчетомЗависимых.Форма.ФормаАнализРасчетов",СтруктураПараметров,,Новый УникальныйИдентификатор);
КонецПроцедуры // ОткрытьЗаписьПоказателяСРасчетомЗависимых()

Процедура ОткрытьРучныеКорректировки(СтруктураПараметров,Владелец) Экспорт
	
	Если НЕ СтруктураПараметров.Свойство("СпособВводаКорректировки") Тогда 
		
		СтруктураПараметров.Вставить("СпособВводаКорректировки",ПредопределенноеЗначение("Перечисление.СпособыВводаКорректировок.РучнойВвод"));
		
	КонецЕсли;
	
	ОткрытьФорму("Документ.КорректировкаЗначенийПоказателей.ФормаОбъекта",СтруктураПараметров,Владелец);

КонецПроцедуры //ОткрытьРучныеКорректировки()

Процедура ОткрытьОтчетОКорректировках(СтруктураПараметров,Владелец) Экспорт
	ОткрытьФорму("Отчет.ОтчетОКорректировках.Форма.ФормаОтчетаУправляемая", СтруктураПараметров,Владелец);
КонецПроцедуры // ОткрытьОтчетОКорректировках() 

Процедура ОткрытьКонс_СчетаУчетаЧА() Экспорт
	ОткрытьФорму("РегистрСведений.СчетаУчетаЧАдляАПСП.ФормаСписка");
КонецПроцедуры

Процедура Открыть_Претензии() Экспорт
	ОткрытьФорму("Справочник.ПретензииУХ.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область БизнесАнализ

Процедура ОткрытьФормыБизнесАнализСохраненныеНастройки(НастраиваемыйОбъектВход, СсылкаВход, Отказ) Экспорт
	Если ТипЗнч(НастраиваемыйОбъектВход) = Тип("СправочникСсылка.УдалитьПанелиОтчетов") Тогда
		Отказ = Истина;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ", НастраиваемыйОбъектВход);
		СтруктураПараметров.Вставить("СохраненнаяНастройка", СсылкаВход);
		ОткрытьФорму("Справочник.УдалитьПанелиОтчетов.Форма.ФормаЭлемента_Управляемая", СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти