
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика 
	СтатьяБюджета = Параметры.СтатьяБюджета;
	Аналитика1 = Параметры.Аналитика1;
	Аналитика2 = Параметры.Аналитика2;
	Аналитика3 = Параметры.Аналитика3;
	Аналитика4 = Параметры.Аналитика4;
	Аналитика5 = Параметры.Аналитика5;
	Аналитика6 = Параметры.Аналитика6;     
	Номенклатура = Параметры.Номенклатура;    
	Характеристика = Параметры.Характеристика;    
	Цена = Параметры.Цена;    
	ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;	
	Дата = Параметры.Дата;
	
	УстановитьНастройкиСтатейИАналитик();
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиСтатейИАналитик()

	МассивОписанийСтатей = Новый Массив;  
	// Статьи и их аналитики
	ПараметрыПоляВводаШапки = Новый Структура;
	ПараметрыПоляВводаШапки.Вставить("АвтоМаксимальнаяШирина",	Истина);
	ПараметрыПоляВводаШапки.Вставить("МаксимальнаяШирина",		0);
	
	АналитикиСтатейБюджетовУХ.СтатьяИАналитикиРеквизитовФормыВПолях(МассивОписанийСтатей,
		"СтатьяБюджета", "СтатьяБюджета",
		"Аналитика%1", "Аналитика%1",
	ФормыУХ.РазместитьВГруппеСтрокой(Элементы.ГруппаАналитика1));    
	АналитикиСтатейБюджетовУХ.СоздатьСтатьиБюджетовИАналитики(ЭтаФорма, МассивОписанийСтатей, ПараметрыПоляВводаШапки); //ПараметрыПоляВвода());
		
	
	// Добавление подчиненных элементов
	Декорации = Новый Массив;
	Декорации.Добавить("ДекорацияАналитика1");
	Декорации.Добавить("ДекорацияАналитика2");
	Декорации.Добавить("ДекорацияАналитика3");
	Декорации.Добавить("ДекорацияАналитика4");
	Декорации.Добавить("ДекорацияАналитика5");
	Декорации.Добавить("ДекорацияАналитика6");
	
	//Строка = ЭтаФорма.ЗависимостиПолей.Добавить();
	//Строка.ИмяРеквизита = "СтатьяБюджета";
	//Строка.ЗависимыеПоля = Новый ФиксированныйМассив(Декорации);
	//
	////
	//СтруктураПоиска = Новый Структура("ИмяРеквизита", "СтатьяБюджетаЕдиная");
	//Строки = ЭтаФорма.ЗависимостиПолей.НайтиСтроки(СтруктураПоиска);
	//Если Строки.Количество() = 0 Тогда
	//	Строка = ЭтаФорма.ЗависимостиПолей.Добавить();
	//	Строка.ИмяРеквизита = "СтатьяБюджетаЕдиная";
	//	Строка.ЗависимыеПоля = Новый ФиксированныйМассив(Декорации);
	//Иначе
	//	Строка = Строки[0];
	//	Для Каждого Декорация Из Декорации Цикл
	//		Строка.ЗависимыеПоля.Добавить(Декорация);
	//	КонецЦикла;
	//КонецЕсли;
	//
	////
	//Строка = ЭтаФорма.ЗависимостиПолей.Добавить();
	//Строка.ИмяРеквизита = "СтатьяБюджета";
	//Строка.ЗависимыеПоля = Новый ФиксированныйМассив(Декорации);
	//АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект);
	ВидСтатьи = ПланированиеПотребностей.ИспользуемыеВидыБюджетовЗакупок(Дата);
	Элементы.СтатьяБюджета.ОграничениеТипа = ВидСтатьи.ТипЗначения;
		
 КонецПроцедуры

&НаКлиенте
 Процедура СтатьяБюджетаПриИзменении(Элемент)
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
	НастроитьЗависимыеЭлементыФормы(Элемент.Имя);  
 КонецПроцедуры

 &НаКлиенте 
Процедура НастроитьЗависимыеЭлементыФормы(ИзмененныйРеквизит = "")
//	УправлениеЭлементамиФормыКлиентСервер.НастроитьЭлементыФормы(ЭтаФорма, ИзмененныйРеквизит, РеквизитыФормы(ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтатьюИАналитики(Команда)

	ПараметрыОповещения = Новый Структура; 
	ПараметрыОповещения.Вставить("СтатьяБюджета", СтатьяБюджета);
	ПараметрыОповещения.Вставить("Аналитика1", Аналитика1); 
	ПараметрыОповещения.Вставить("Аналитика2", Аналитика2); 
	ПараметрыОповещения.Вставить("Аналитика3", Аналитика3); 
	ПараметрыОповещения.Вставить("Аналитика4", Аналитика4); 
	ПараметрыОповещения.Вставить("Аналитика5", Аналитика5); 
	ПараметрыОповещения.Вставить("Аналитика6", Аналитика6);      
	Оповестить("ПеренестиДанныеСтатей", ПараметрыОповещения);
	Закрыть();
	
КонецПроцедуры

 