
// Луконин Е.А. 14.01.2020 Выполнение задач №000033749
Процедура ПередЗаписью(Отказ)

	// Борисенко И.Н. 23.07.2021 Выполнение задач №000035594: закомментировал
	НеобходимоЗаписатьВерсию = Ложь;
	//НеобходимоЗаписатьВерсию = ?(ЭтоНовый(), ЯвляетсяОбъектомЦБ, Ссылка.ЯвляетсяОбъектомЦБ И ВерсионированиеОбъектовСобытия.ПроверкаНаИзменениеЭлементаОбъекта(ЭтотОбъект)); 
    ЭтотОбъект.ДополнительныеСвойства.Вставить("НеобходимоЗаписатьВерсию", НеобходимоЗаписатьВерсию);
	
КонецПроцедуры // ПередЗаписью()
