#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	УстановитьОтображениеЗаголовкаИЭлементовУправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыборФайла", ЭтаФорма);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "(*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныеФайлы = Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура КнопкаНазад(Команда)
			
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОформлениеДокументов Тогда  
		ПереходНаШаг(Элементы.СтраницаСписаниеОстатков);    
	Иначе 		                
		ПереходНаШаг(Элементы.СтраницаНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее(Команда)
	
	ТекущаяСтраница = Элементы.ОсновнаяПанель.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		ПереходНаШаг(Элементы.СтраницаСписаниеОстатков);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСписаниеОстатков Тогда
		ПереходНаШаг(Элементы.СтраницаОформлениеДокументов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыСписанияОстатков(Команда)    
	
	ОчиститьСообщения(); 
	
	Если Не ЗначениеЗаполнено(ОрганизацияФилиал) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию-филиал!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСписанияОстатков) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить дату списания остатков!");
		Возврат;
	КонецЕсли; 
		
	Если Объект.ТаблицаДанных.Количество() = 0 Тогда  
		Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл загрузки!");
			Возврат;
		КонецЕсли;  
		Загрузить();  
	КонецЕсли;
	
	СформироватьДокументыСписанияОстатковНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыВводаНачальныхОстатков(Команда)  
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСписанияОстатков) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить дату списания остатков!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ТаблицаДанных.Количество() = 0 Тогда 
		Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл загрузки!");
			Возврат;
		КонецЕсли;  
		Загрузить();  
	КонецЕсли;
	
	СформироватьДокументыВводаНачальныхОстатковНаСервере();  
	
КонецПроцедуры 

&НаКлиенте
Процедура Загрузить()
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	ЗагрузитьДанные(АдресХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуОстатков(Команда) 
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл для выгрузки!");
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент; 
	ЗаполнитьТабличныйДокумент(ТабДок);  
	ТабДок.Записать(ПутькФайлу, ТипФайлаТабличногоДокумента.XLSX);   
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка данных успешно завершена!");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки(Команда)
	
	ОчиститьСообщения();          
	
	Если Не ЗначениеЗаполнено(ОрганизацияФилиал) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаПолученияОстатков) Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить дату получения остатков!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаткиНаСервере();   
	Элементы.ГруппаДанные.Показать(); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТабличныйДокумент(ТабДок) 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетВыгрузки");	 
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Для Каждого Строка Из Объект.ТаблицаДанных Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Строка);  
		
		ОбластьСтрока.Параметры.НоменклатураID          = ?(ЗначениеЗаполнено(Строка.Номенклатура),          Строка(Строка.Номенклатура.УникальныйИдентификатор()),           "");	
		ОбластьСтрока.Параметры.ПодразделениеID         = ?(ЗначениеЗаполнено(Строка.Подразделение),         Строка(Строка.Подразделение.УникальныйИдентификатор()),          "");
		ОбластьСтрока.Параметры.ФизическоеЛицоID        = ?(ЗначениеЗаполнено(Строка.ФизическоеЛицо),        Строка(Строка.ФизическоеЛицо.УникальныйИдентификатор()),         "");
		ОбластьСтрока.Параметры.ПартияID                = ?(ЗначениеЗаполнено(Строка.Партия),                Строка(Строка.Партия.УникальныйИдентификатор()),                 "");
		ОбластьСтрока.Параметры.НомерГТДID              = ?(ЗначениеЗаполнено(Строка.НомерГТД),              Строка(Строка.НомерГТД.УникальныйИдентификатор()),               "");
		ОбластьСтрока.Параметры.КатегорияЭксплуатацииID = ?(ЗначениеЗаполнено(Строка.КатегорияЭксплуатации), Строка(Строка.КатегорияЭксплуатации.УникальныйИдентификатор()),  "");		
		
		ТабДок.Вывести(ОбластьСтрока); 
		
	КонецЦикла;
		
	Возврат(ТабДок);
	
КонецФункции  

&НаСервере
Функция ПолучитьИмяПеречисления(ПеречислениеСсылка)
	
	ИмяПеречисления = ПеречислениеСсылка.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ПеречислениеСсылка);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя; 
	
	Возврат ИмяЗначенияПеречисления;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанные(АдресХранилища)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВремИмяФайла   = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВремИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВремИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(1,1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаДанных = Построитель.Результат.Выгрузить();
	УдалитьФайлы(ВремИмяФайла);     
	
	Если ОтсутствуютОбязательныеКолонкиВФайле(ТаблицаДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		
		НС = Объект.ТаблицаДанных.Добавить();	
		
		ЗаполнитьЗначенияСвойств(НС, Строка);
		                                                                                         
		НС.Подразделение         = ?(ЗначениеЗаполнено(Строка.ПодразделениеID),         ПреобразоватьЗначениеИзСтроки(Строка.ПодразделениеID,         "Справочник",  "СтруктураПредприятия"),   Неопределено);	
		НС.Номенклатура          = ?(ЗначениеЗаполнено(Строка.НоменклатураID),          ПреобразоватьЗначениеИзСтроки(Строка.НоменклатураID,          "Справочник",  "Номенклатура"),           Неопределено);
		НС.ФизическоеЛицо        = ?(ЗначениеЗаполнено(Строка.ФизическоеЛицоID),        ПреобразоватьЗначениеИзСтроки(Строка.ФизическоеЛицоID,        "Справочник",  "ФизическиеЛица"),         Неопределено);	
		НС.Партия                = ?(ЗначениеЗаполнено(Строка.ПартияID),                ПреобразоватьЗначениеИзСтроки(Строка.ПартияID,                "Справочник",  "ПартииТМЦВЭксплуатации"), Неопределено);
		НС.НомерГТД              = ?(ЗначениеЗаполнено(Строка.НомерГТДID),              ПреобразоватьЗначениеИзСтроки(Строка.НомерГТДID,              "Справочник",  "НомераГТД"),              Неопределено);	
		НС.КатегорияЭксплуатации = ?(ЗначениеЗаполнено(Строка.КатегорияЭксплуатацииID), ПреобразоватьЗначениеИзСтроки(Строка.КатегорияЭксплуатацииID, "Справочник",  "КатегорииЭксплуатации"),  Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПреобразоватьЗначениеИзСтроки(СтрЗначение, Тип = "Число", Вид = "")

	Если ПустаяСтрока(СтрЗначение) 
		И Не Тип = "Булево" Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Тип = "Дата" Тогда
		Результат = Дата(СтрЗначение);	
	ИначеЕсли Тип = "Число" Тогда
		Результат = Число(СтрЗаменить(СтрЗначение, " ", ""));
	ИначеЕсли Тип = "Булево" Тогда
		Результат = СтрЗначение = "Да" ИЛИ СтрЗначение = "Истина" ИЛИ СтрЗначение = "+" ИЛИ СтрЗначение = "1";
	ИначеЕсли Тип = "Перечисление" Тогда
		Результат = Перечисления[Вид][СтрЗначение];
	ИначеЕсли Тип = "Справочник" Тогда
		Результат = Справочники[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗначение));   
	ИначеЕсли Тип = "Документ" Тогда
		Результат = Документы[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗначение));      
	ИначеЕсли Тип = "ПланВидовХарактеристик" Тогда
		Результат = ПланыВидовХарактеристик[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗначение));
	Иначе
		Результат = СтрЗначение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтсутствуютОбязательныеКолонкиВФайле(Таблица)
		
	Колонки = Таблица.Колонки;
	
	МассивОбязательныхКолонок = Новый Массив; 
	МассивОбязательныхКолонок.Добавить("НоменклатураID"); 
	МассивОбязательныхКолонок.Добавить("ПартияID");
	МассивОбязательныхКолонок.Добавить("СтоимостьРеглОстаток");
	МассивОбязательныхКолонок.Добавить("КоличествоОстаток");	
	МассивОбязательныхКолонок.Добавить("ПодразделениеID");	 
	МассивОбязательныхКолонок.Добавить("ФизическоеЛицоID");	   
	МассивОбязательныхКолонок.Добавить("СтатьяРасходовID");	 
	МассивОбязательныхКолонок.Добавить("КатегорияЭксплуатацииID");	 
	МассивОбязательныхКолонок.Добавить("НомерГТДID");	
	МассивОбязательныхКолонок.Добавить("ДатаНачалаЭксплуатации");	
	МассивОбязательныхКолонок.Добавить("ИнвентарныйНомер");
	
	Для Каждого ОбязательнаяКолонка Из МассивОбязательныхКолонок Цикл
		
		Если КолонкаОтсутствует(Колонки, ОбязательнаяКолонка) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции 

&НаСервере
Функция КолонкаОтсутствует(Колонки, ИмяКолонки)
	
	Если Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В файле отсутствует колонка ""%1"". Исправьте или выгрузите файл заново.", ИмяКолонки));
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 
	
&НаСервере
Процедура УстановитьОтображениеЗаголовкаИЭлементовУправления()
	
	ТекущаяСтраница = Элементы.ОсновнаяПанель.ТекущаяСтраница;
	
	ЗаголовкиСтраниц = Новый Соответствие;
	ЗаголовкиСтраниц.Вставить(Элементы.СтраницаНастройки, "Шаг 1 из 3 «Получение остатков по организации-филиалу по счетам МЦ.04 и МЦ.02»");       
	ЗаголовкиСтраниц.Вставить(Элементы.СтраницаСписаниеОстатков, "Шаг 2 из 3 «Списание остатков с организации филиала»");
	ЗаголовкиСтраниц.Вставить(Элементы.СтраницаОформлениеДокументов, "Шаг 3 из 3 «Ввод остатков на головную организацию»");
	
	Элементы.ДекорацияЗаголовокСтраницы.Заголовок = ЗаголовкиСтраниц[ТекущаяСтраница];
	
	Элементы.КнопкиСлева.ТекущаяСтраница = ?(ТекущаяСтраница = Элементы.СтраницаНастройки,
																Элементы.ГруппаКнопокСлеваНет,
																Элементы.ГруппаКнопкиСлеваЕсть);

	Если ТекущаяСтраница = Элементы.СтраницаОформлениеДокументов Тогда
		Элементы.КнопкиСправа.ТекущаяСтраница   = Элементы.ГруппаКнопкиСправаНаПоследнейСтранице;
		Элементы.КнопкаГотово.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.КнопкиСправа.ТекущаяСтраница  = Элементы.ГруппаКнопкиСправаНаПервойСтранице;
		Элементы.КнопкаДалее.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПереходНаШаг(Страница)
	
	Элементы.ОсновнаяПанель.ТекущаяСтраница = Страница;
	УстановитьОтображениеЗаголовкаИЭлементовУправления();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыСписанияОстатковНаСервере()	
	
	ТаблицаПоВидам = Объект.ТаблицаДанных.Выгрузить(,"Подразделение"); 
	ТаблицаПоВидам.Свернуть("Подразделение");  
	
	ТаблицаПодготовленныхДанных = Объект.ТаблицаДанных.Выгрузить();	
	ТаблицаПроверки = ПолучитьТаблицуПроверки(ДатаСписанияОстатков, ОрганизацияФилиал,ТаблицаПодготовленныхДанных.Скопировать(,"Номенклатура, Подразделение, Партия, ФизическоеЛицо"));
	
	Для Каждого Строка Из ТаблицаПоВидам Цикл
		СформироватьДокументыСписанияОстатковПоВидам(ТаблицаПроверки, ТаблицаПодготовленныхДанных, Строка.Подразделение);
	КонецЦикла;
		
	ОбщегоНазначения.СообщитьПользователю("Загрузка завершена. Создано документов: " + ДокументыСписания.Количество());
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуПроверки(ДатаСписания, Организация, Таблица)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Подразделение КАК Подразделение,
	|	ТаблицаДанных.Партия КАК Партия
	|ПОМЕСТИТЬ ВТ_ТаблицаДанных
	|ИЗ
	|	&Таблица КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстатки.Субконто2 КАК Партия,
	|	ХозрасчетныйОстатки.Субконто3 КАК ФизическоеЛицо,
	|	ХозрасчетныйОстатки.Подразделение КАК Подразделение,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ХозрасчетныйОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ втХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&Счета), &Субконто, Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Подразделение,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто3,
	|	ХозрасчетныйОстатки.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДанных.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДанных.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаДанных.Партия КАК Партия
	|ИЗ
	|	ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ втХозрасчетный КАК втХозрасчетный
	|		ПО ВТ_ТаблицаДанных.Номенклатура = втХозрасчетный.Номенклатура
	|			И ВТ_ТаблицаДанных.Партия = втХозрасчетный.Партия
	|			И ВТ_ТаблицаДанных.Подразделение = втХозрасчетный.Подразделение
	|			И ВТ_ТаблицаДанных.ФизическоеЛицо = втХозрасчетный.ФизическоеЛицо
	|ГДЕ
	|	втХозрасчетный.Номенклатура ЕСТЬ NULL";
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.СпецодеждаВЭксплуатацииВспомогательный);  
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ИнвентарьИХозяйственныеПринадлежностиВЭксплуатации);
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);

	Запрос.УстановитьПараметр("Счета", Счета);
	Запрос.УстановитьПараметр("Субконто", МассивСубконто);	
	Запрос.УстановитьПараметр("Таблица", Таблица); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаСписания));     
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура СформироватьДокументыВводаНачальныхОстатковНаСервере()

	ТаблицаПоВидам = Объект.ТаблицаДанных.Выгрузить(,"Подразделение"); 
	ТаблицаПоВидам.Свернуть("Подразделение");      
	ТаблицаПодготовленныхДанных = Объект.ТаблицаДанных.Выгрузить();
	Для Каждого Строка Из ТаблицаПоВидам Цикл
		СформироватьДокументыВводаНачальныхОстатковНаСервереПоПодразделениям(ТаблицаПодготовленныхДанных, Строка.Подразделение);
	КонецЦикла;
		
	ОбщегоНазначения.СообщитьПользователю("Загрузка завершена. Создано документов: " + ДокументыВводаНачальныхОстатков.Количество());
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыВводаНачальныхОстатковНаСервереПоПодразделениям(ТаблицаПодготовленныхДанных, Подразделение)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Подразделение",  Подразделение); 
	
	НайденныеСтроки = ТаблицаПодготовленныхДанных.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда   
		Возврат;	
	КонецЕсли; 
	
	ДокументОбъект = Документы.ВводОстатковТМЦВЭксплуатации.СоздатьДокумент();
	
	ДокументОбъект.Дата			             = КонецДня(ДатаПолученияОстатков);
	ДокументОбъект.Ответственный	         = ТекущийПользователь;
	ДокументОбъект.ХозяйственнаяОперация	 = Перечисления.ХозяйственныеОперации.ВводОстатковТМЦВЭксплуатации;
	ДокументОбъект.Организация	             = Организация;
	ДокументОбъект.ОтражатьВБУиНУ	         = Истина;
	ДокументОбъект.ОтражатьВУУ   	         = Ложь;
	ДокументОбъект.ОтражатьВОперативномУчете = Истина;
	ДокументОбъект.Подразделение	         = Подразделение;
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ДокументОбъект.Комментарий               = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДата();
	ДокументОбъект.Комментарий               = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Для Каждого Стр Из НайденныеСтроки Цикл
		
		Если Стр.КоличествоОстаток = 0 
			И Стр.КоличествоПоРНПТОстаток = 0 
			И Стр.СтоимостьРеглОстаток = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаТоваров = ДокументОбъект.ТМЦВЭксплуатации.Добавить();  
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, Стр);
		СтрокаТоваров.Сумма = Стр.СтоимостьРеглОстаток;
		СтрокаТоваров.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		СтрокаТоваров.Количество = Стр.КоличествоОстаток;     
		СтрокаТоваров.КоличествоПоРНПТ = Стр.КоличествоПоРНПТОстаток;
		СтрокаТоваров.Сумма = Стр.СтоимостьРеглОстаток;
		СтрокаТоваров.ПервоначальнаяСумма = Стр.СтоимостьРеглОстаток;
		СтрокаТоваров.ПервоначальнаяСуммаУпр = Стр.СтоимостьРеглОстаток;
		
	КонецЦикла;
	
	Если ДокументОбъект.ТМЦВЭксплуатации.Количество() > 0 Тогда	
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументОбъект.УстановитьНовыйНомер();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначения.СообщитьПользователю("Ошибка проведения документа " + ДокументОбъект.Ссылка, ДокументОбъект.Ссылка);
		КонецПопытки;   
		
		НС = ДокументыВводаНачальныхОстатков.Добавить();
		НС.Документ = ДокументОбъект.Ссылка;   
		НС.Подразделение = Подразделение;   
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыСписанияОстатковПоВидам(ТаблицаПроверки, ТаблицаПодготовленныхДанных, Подразделение)
			
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Подразделение",  Подразделение); 
	
	НайденныеСтроки = ТаблицаПодготовленныхДанных.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда   
		Возврат;	
	КонецЕсли;
	
	ДокументОбъект = Документы.СписаниеИзЭксплуатации.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, НайденныеСтроки[0]);
			
	Для Каждого Строка Из НайденныеСтроки Цикл   
		
		НайденныеСтрокиСписания = ТаблицаПроверки.НайтиСтроки(Новый Структура("Номенклатура, Подразделение, Партия, ФизическоеЛицо", Строка.Номенклатура, Строка.Подразделение, Строка.Партия, Строка.ФизическоеЛицо));
		Если НайденныеСтрокиСписания.Количество() > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По номенклатуре %1 для физлица %2 уже списаны остатки МЦ партии %3 подразделению %4", Строка.Номенклатура, Строка.ФизическоеЛицо, Строка.Подразделение, Строка.Партия));   
			Продолжить;
		КонецЕсли;
		
		СтрокаТоваров = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, Строка);
		СтрокаТоваров.Номенклатура = Строка.Номенклатура; 
		СтрокаТоваров.Количество   = Строка.КоличествоОстаток;   
		СтрокаТоваров.КоличествоПоРНПТ = Строка.КоличествоПоРНПТОстаток;
	КонецЦикла; 
	
	Если ДокументОбъект.Товары.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ДокументОбъект.Организация    = ОрганизацияФилиал;      
	ДокументОбъект.Ответственный  = ТекущийПользователь;    
	ДокументОбъект.Дата           = КонецДня(ДатаСписанияОстатков);
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ДокументОбъект.Комментарий    = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДата();
	 ДокументОбъект.Комментарий    = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДатаСервера();
	 //КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение					
		ДокументОбъект.УстановитьНовыйНомер();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначения.СообщитьПользователю("Ошибка проведения документа " + ДокументОбъект.Ссылка, ДокументОбъект.Ссылка);
	КонецПопытки;
	
	НС = ДокументыСписания.Добавить();  
	НС.Документ      = ДокументОбъект.Ссылка;  
	НС.Подразделение = ДокументОбъект.Подразделение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстатки.Субконто2 КАК Партия,
	|	ХозрасчетныйОстатки.Субконто3 КАК ФизическоеЛицо,
	|	ХозрасчетныйОстатки.Подразделение КАК Подразделение,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ХозрасчетныйОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ втХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериодаГраница, Счет В (&Счета), &Субконто, 
	|       //УсловиеПодразделение
	|       Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Подразделение,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто3,
	|	ХозрасчетныйОстатки.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТМЦВЭксплуатации.Подразделение КАК Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо КАК ФизическоеЛицо,    
	|	ТМЦВЭксплуатации.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТМЦВЭксплуатации.Номенклатура КАК Номенклатура,
	|	ТМЦВЭксплуатации.Партия КАК Партия,
	|	СУММА(ТМЦВЭксплуатации.КоличествоПоРНПТОстаток) КАК КоличествоПоРНПТОстаток,
	|	СУММА(ТМЦВЭксплуатации.КоличествоОстаток) КАК КоличествоОстаток,
	|	ТМЦВЭксплуатации.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ втСтоимостьТМЦ
	|ИЗ
	|	РегистрНакопления.ТМЦВЭксплуатации.Остатки(&КонецПериодаГраница, 
	|	    //УсловиеПодразделение
	|	    Организация = &Организация) КАК ТМЦВЭксплуатации
	|
	|СГРУППИРОВАТЬ ПО
	|	ТМЦВЭксплуатации.Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо,
	|	ТМЦВЭксплуатации.Номенклатура,  
	|	ТМЦВЭксплуатации.ИнвентарныйНомер,
	|	ТМЦВЭксплуатации.Партия,
	|	ТМЦВЭксплуатации.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втХозрасчетный.Подразделение КАК Подразделение,
	|	втХозрасчетный.ФизическоеЛицо КАК ФизическоеЛицо,
	|	втХозрасчетный.Номенклатура КАК Номенклатура,
	|	втХозрасчетный.Партия КАК Партия,
	|	втХозрасчетный.КоличествоОстаток КАК КоличествоОстаток,
	|	втХозрасчетный.СуммаОстаток КАК СтоимостьРеглОстаток,
	|	втХозрасчетный.Партия.ДатаНачалаЭксплуатации КАК ДатаНачалаЭксплуатации,
	|	втХозрасчетный.Партия.КатегорияЭксплуатации КАК КатегорияЭксплуатации,
	|	втХозрасчетный.Партия.СтатьяРасходов КАК СтатьяРасходов, 
	|	ЕСТЬNULL(втСтоимостьТМЦ.ИнвентарныйНомер, """") КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(втСтоимостьТМЦ.КоличествоПоРНПТОстаток, 0) КАК КоличествоПоРНПТОстаток,
	|	ЕСТЬNULL(втСтоимостьТМЦ.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК НомерГТД
	|ИЗ
	|	втХозрасчетный КАК втХозрасчетный
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтоимостьТМЦ КАК втСтоимостьТМЦ
	|		ПО втХозрасчетный.Номенклатура = втСтоимостьТМЦ.Номенклатура
	|			И втХозрасчетный.Партия = втСтоимостьТМЦ.Партия   
	|			И втХозрасчетный.Подразделение = втСтоимостьТМЦ.Подразделение   
	|			И втХозрасчетный.ФизическоеЛицо = втСтоимостьТМЦ.ФизическоеЛицо";	
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.СпецодеждаВЭксплуатацииВспомогательный);  
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ИнвентарьИХозяйственныеПринадлежностиВЭксплуатации);
	ДатаНаКонецДня = КонецДня(ДатаПолученияОстатков);
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);

	Запрос.УстановитьПараметр("Счета", Счета);
	Запрос.УстановитьПараметр("Субконто", МассивСубконто);
	Запрос.УстановитьПараметр("Организация", ОрганизацияФилиал); 	
	Запрос.УстановитьПараметр("КонецПериода", ДатаНаКонецДня);   
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(ДатаНаКонецДня, ВидГраницы.Включая));  
	
	Если Подразделения.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("Подразделения", Подразделения.ВыгрузитьЗначения()); 	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеПодразделение", "Подразделение В (&Подразделения) И ");	
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ТаблицаДанных.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

#КонецОбласти