
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИменаСубконто

Функция ПолучитьИменаСубконто() Экспорт 

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаПрибылиСубконто1");
	Субконто.Вставить(2, "СчетУчетаПрибылиСубконто2");
	Субконто.Вставить(3, "СчетУчетаПрибылиСубконто3");
	
	Результат.Вставить("СчетУчетаПрибыли", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаУбыткаСубконто1");
	Субконто.Вставить(2, "СчетУчетаУбыткаСубконто2");
	Субконто.Вставить(3, "СчетУчетаУбыткаСубконто3");
	
	Результат.Вставить("СчетУчетаУбытка", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаПрибылиРКРСубконто1");
	Субконто.Вставить(2, "СчетУчетаПрибылиРКРСубконто2");
	Субконто.Вставить(3, "СчетУчетаПрибылиРКРСубконто3");
	
	Результат.Вставить("СчетУчетаПрибылиРКР", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаУбыткаРКРСубконто1");
	Субконто.Вставить(2, "СчетУчетаУбыткаРКРСубконто2");
	Субконто.Вставить(3, "СчетУчетаУбыткаРКРСубконто3");
	
	Результат.Вставить("СчетУчетаУбыткаРКР", Субконто);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
