
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособРасчетаФиксированныйРазмер             = Перечисления.СпособыРасчетаВыплатПоДоговорамОпеки.ФиксированныйРазмер;
	СпособРасчетаКоэффициентНаПрожиточныйМинимум = Перечисления.СпособыРасчетаВыплатПоДоговорамОпеки.КоэффициентНаПрожиточныйМинимум;
	СпособРасчетаКоэффициентНаМРОТ               = Перечисления.СпособыРасчетаВыплатПоДоговорамОпеки.КоэффициентНаМРОТ;
	
	Параметры.Свойство("СпособРасчета", СпособРасчета);
	Параметры.Свойство("ПрожиточныйМинимум", ПрожиточныйМинимум);
	Параметры.Свойство("Размер", Размер);
	Параметры.Свойство("Коэффициент", Коэффициент);
	ВозвращаемоеЗначениеУстановлено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ВозвращаемоеЗначениеУстановлено Тогда 
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("СпособРасчета", СпособРасчета);
		РезультатВыбора.Вставить("ПрожиточныйМинимум", ПрожиточныйМинимум);
		РезультатВыбора.Вставить("Размер", Размер);
		РезультатВыбора.Вставить("Коэффициент", Коэффициент);
		ОповеститьОВыборе(РезультатВыбора);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	ВозвращаемоеЗначениеУстановлено = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ВозвращаемоеЗначениеУстановлено = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Если СпособРасчета = СпособРасчетаФиксированныйРазмер Тогда
		Элементы.ПрожиточныйМинимум.Видимость = Ложь;
		Элементы.Размер.Видимость = Истина;
		Элементы.Коэффициент.Видимость = Ложь;
	ИначеЕсли СпособРасчета = СпособРасчетаКоэффициентНаПрожиточныйМинимум Тогда 
		Элементы.ПрожиточныйМинимум.Видимость = Истина;
		Элементы.Размер.Видимость = Ложь;
		Элементы.Коэффициент.Видимость = Истина;
	ИначеЕсли СпособРасчета = СпособРасчетаКоэффициентНаМРОТ Тогда 
		Элементы.ПрожиточныйМинимум.Видимость = Ложь;
		Элементы.Размер.Видимость = Ложь;
		Элементы.Коэффициент.Видимость = Истина;
	Иначе
		Элементы.ПрожиточныйМинимум.Видимость = Ложь;
		Элементы.Размер.Видимость = Ложь;
		Элементы.Коэффициент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

