
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГруппаЛогинПароль.Видимость = Запись.ЕстьАвторизация;
	Элементы.ГруппаПрокси.Видимость = Запись.ИспользоватьПрокси;
КонецПроцедуры

&НаКлиенте
Процедура ЕстьАвторизацияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	ЗаписьОбъект.Записать();
	
	Возврат ИнтеграцияЦУЗсЭТПСерверУХ.ПолучитьПараметрыПодключенияКЭТП(Запись.ЭТП, Запись.Сотрудник);
КонецФункции

&НаКлиенте
Процедура Записать(Команда)
	Если ПустаяСтрока(Запись.АдресВебСервиса) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не указан адрес веб-сервиса.'");
		Сообщение.Поле = "АдресВебСервиса";
		Сообщение.Сообщить();
	КонецЕсли;
	Если Запись.ЕстьАвторизация И ПустаяСтрока(Запись.Пользователь) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не указан пользователь.'");
		Сообщение.Поле = "Пользователь";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Закрыть(ЗаписатьНаСервере());
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаписьОбъект = РегистрыСведений.НастройкиОбменаСЭТП.СоздатьМенеджерЗаписи();
	ЗаписьОбъект.ЭТП = Параметры.ЭТП;
	ЗаписьОбъект.Сотрудник = Параметры.Сотрудник;
	ЗаписьОбъект.Прочитать();
	
	Если НЕ ЗаписьОбъект.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьОбъект, Параметры.ПараметрыПодключенияКЭТП);
		ЗаписьОбъект.Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ЗаписьОбъект, "Запись");
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
