&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораПФ();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПФ()
	
	Если Запись.ВидДокумента = "ПриобретениеТоваровУслуг" Тогда
		Элементы.ПечатнаяФорма.СписокВыбора.Очистить();
		СписокВыбора = Элементы.ПечатнаяФорма.СписокВыбора;
		СписокВыбора.Добавить("М4","Приходный ордер (М4)");
		СписокВыбора.Добавить("М4_ВыводитьОтветственного","Приходный ордер (М4) (Принял ""Ответственный"")");
	Иначе
		Элементы.ПечатнаяФорма.СписокВыбора.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент) 
	
	ЗаполнитьСписокВыбораПФ();  
	
КонецПроцедуры