#Область ПрограммныйИнтерфейс

#Область ВидыБюджетов

Функция ЭтоБДДС(ВидБюджета) Экспорт
	Возврат (ВидБюджета = ПредопределенноеЗначение("Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств")
			ИЛИ ВидБюджета = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств")
			ИЛИ ВидБюджета = "БюджетДвиженияДенежныхСредств"
			ИЛИ ВидБюджета = "БДДС");
КонецФункции

Функция ЭтоБДР(ВидБюджета) Экспорт
	Возврат (ВидБюджета = ПредопределенноеЗначение("Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов")
			ИЛИ ВидБюджета = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов")	
			ИЛИ ВидБюджета = "БюджетДоходовИРасходов"
			ИЛИ ВидБюджета = "БДР");
КонецФункции

Функция ПараметрыБюджета(ВидБюджета) Экспорт
	
	ПараметрыБюджета=Новый Структура;
	
	Если ЭтоБДР(ВидБюджета) Тогда
		
		ПараметрыБюджета.Вставить("КолонкаСтатья",	"СтатьяДоходовИРасходов");
		ПараметрыБюджета.Вставить("КодБюджета",		"БДР");
		ПараметрыБюджета.Вставить("ТаблицаБюджета",	"БюджетДоходовИРасходов");
		ПараметрыБюджета.Вставить("ВидБюджета",		ПредопределенноеЗначение("Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов"));
		ПараметрыБюджета.Вставить("СправочникСтатьи","СтатьиДоходовИРасходов");
		ПараметрыБюджета.Вставить("ЗаголовокКолонкиСтатья", НСтр("ru = 'Статья доходов и расходов'"));
		
	ИначеЕсли ЭтоБДДС(ВидБюджета) Тогда
				
		ПараметрыБюджета.Вставить("КолонкаСтатья",	"СтатьяДвиженияДенежныхСредств");
		ПараметрыБюджета.Вставить("КодБюджета",		"БДДС");
		ПараметрыБюджета.Вставить("ТаблицаБюджета",	"БюджетДвиженияДенежныхСредств");
		ПараметрыБюджета.Вставить("ВидБюджета",		ПредопределенноеЗначение("Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств"));
		ПараметрыБюджета.Вставить("СправочникСтатьи","СтатьиДвиженияДенежныхСредств");
		ПараметрыБюджета.Вставить("ЗаголовокКолонкиСтатья", НСтр("ru = 'Статья движения денежных средств'"));
		
	КонецЕсли;
	
	Возврат ПараметрыБюджета;
	
КонецФункции // ПолучитьПараметрыБюджета

Функция КодВидаБюджета(ВидБюджета) Экспорт
	ПараметрыБюджета = ПараметрыБюджета(ВидБюджета);
	Если ПараметрыБюджета.Свойство("КодБюджета") Тогда
		Возврат ПараметрыБюджета.КодБюджета;
	Иначе 
		Возврат "";		
	КонецЕсли;
	
КонецФункции

Функция ИмяКолонкиСтатья(ВидБюджета) Экспорт
	
	Возврат ПараметрыБюджета(ВидБюджета).КолонкаСтатья;
	
КонецФункции

Функция ИмяТаблицыБюджета(ВидБюджета) Экспорт	
	
	Возврат ПараметрыБюджета(ВидБюджета).ТаблицаБюджета;
	
КонецФункции

#КонецОбласти

#Область УсловныеЕдиницы

// Устарела. Следует использовать ПлатежныеПозицииКлиентСервер.СтруктураПараметровРасчетаКурса()
Функция СтруктураПараметровРасчетаКурса() Экспорт
	
	Возврат ПлатежныеПозицииКлиентСервер.СтруктураПараметровРасчетаКурса();
	
КонецФункции
	
#КонецОбласти

#Область ГруппыАналитик

#КонецОбласти

#КонецОбласти
