//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ФактическаяСебестоимостьПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииПредприятия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы фактические затраты по выпущенной продукции предприятия?';
									|en = 'Verify the actual costs for the released enterprise products.'");	
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииОрганизации");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы фактические затраты по выпущенной продукции организации?';
									|en = 'Verify the actual costs for the released company products.'");	
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекст");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекст");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекстОтчетДавальцу");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекстОтчетДавальцу");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
