#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Отбор.Свойство("ВидБюджета") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВидБюджета = Параметры.Отбор.ВидБюджета;
	
	ВозможностьРедактирования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияБлокирующиеСсылкиНажатие(Элемент)
	
	ТекстБлокируемыйОбъект = СтрШаблон(НСтр("ru = 'Структура опер.планирования по %1'"), ВидБюджета);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("БлокированныйОбъект", ТекстБлокируемыйОбъект);
	ДопПараметры.Вставить("БлокирующиеСсылки", ПолучитьСписокБлокирующихСсылок(ВидБюджета));
	
	ОткрытьФорму("ОбщаяФорма.СписокБлокирующихСсылок", ДопПараметры, ЭтотОбъект, ,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВозможностьРедактирования()
	
	КоличествоБлокирующихСсылок = РегистрыСведений.СтруктураОперативногоПланирования.КоличествоБлокирующихСсылок(ВидБюджета);
	
	ВозможноРедактирование = КоличествоБлокирующихСсылок = 0;
	
	Элементы.ГруппаТолькоПросмотр.Видимость = НЕ ВозможноРедактирование;
		
	Если ВозможноРедактирование Тогда
		Элементы.ДекорацияБлокирующиеСсылки.Заголовок = "";
	Иначе
		Шаблон = НСтр("ru = 'Существуют блокирующие редактирование ссылки (%1 шт).'");
		Элементы.ДекорацияБлокирующиеСсылки.Заголовок = СтрШаблон(Шаблон, КоличествоБлокирующихСсылок);
	КонецЕсли;
	
	//
	Элементы.Список.ИзменятьСоставСтрок = ВозможноРедактирование;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокБлокирующихСсылок(ВидБюджета)
	Возврат РегистрыСведений.СтруктураОперативногоПланирования.БлокирующиеСсылки(ВидБюджета);
КонецФункции
#КонецОбласти
