
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	Если Параметры.Ключ.Пустая() Тогда  	
		Если Параметры.Свойство("ДанныеЗаполнения") 
			И Параметры.ДанныеЗаполнения.Свойство("ВидБюджета") Тогда
			
			Объект.ВидБюджета = Параметры.ДанныеЗаполнения.ВидБюджета;
			
			ЗаполнитьПоДокументуПланированияНаСервере(); 
			
			Если Объект.Требуется.Количество() = 0 Тогда
				ВызватьИсключение НСтр("ru = 'Данные для корректировки планов и лимитов отсутствуют '");	
			КонецЕсли;  

		КонецЕсли;  

		ПриЧтенииСозданииНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
	СоздатьСтатьиБюджетовИАналитики();	

	#Область УХ_Согласование
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма, Элементы.ГруппаДатаНомер);
	#КонецОбласти
	
	УправлениеФормой();
	
	КонтрольУХ.ПодготовитьФормуНаСервере(ЭтотОбъект, Элементы.ГруппаСтраницы);
	МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(ЭтаФорма);
	
	УстановитьУсловноеОформление();
	
	ВидыОперацииОбеспечить.Добавить(Перечисления.ВидыОперацийКорректировкаЛимитов.Увеличение);
	ВидыОперацииОбеспечить.Добавить(Перечисления.ВидыОперацийКорректировкаЛимитов.Уменьшение);

	УстановитьОграничениеТипаДокументаОснования();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
	Если Параметры.Ключ.Пустая() Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Не Объект.Проведен Тогда
		ПриОжиданииВыполнитьКонтрольДокумента();   
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		УправлениеФормой();  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Объект.ОбеспечиватьПострочно Тогда   
		
		ПустойУникальныйИдентификатор = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
		Сч = 0;
		Пока Сч < ТекущийОбъект.ОбеспечитьЗаСчет.Количество() Цикл
			
			Если ТекущийОбъект.ОбеспечитьЗаСчет[Сч].ИдентификаторСтроки = ПустойУникальныйИдентификатор Тогда
				 ТекущийОбъект.ОбеспечитьЗаСчет.Удалить(Сч);	
			Иначе
				Сч = Сч + 1;	
			КонецЕсли;
			
		КонецЦикла;
		
		// Заполнить аналитики строк аналитиками строк требуется
		Для Каждого СтрокаОбеспечитьЗаСчет Из ТекущийОбъект.ОбеспечитьЗаСчет Цикл
			
			Если ВидыОперацииОбеспечить.НайтиПоЗначению(СтрокаОбеспечитьЗаСчет.ВидОперации) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("ИдентификаторСтроки", СтрокаОбеспечитьЗаСчет.ИдентификаторСтроки);
			
			СтрокиТребуется = ТекущийОбъект.Требуется.НайтиСтроки(СтруктураПоиска);
			Если СтрокиТребуется.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаОбеспечитьЗаСчет, СтрокиТребуется[0], , "Сумма, ИдентификаторСтроки");
			КонецЕсли;
	
		КонецЦикла;
	Иначе
		
		ВидОперацииПеренос = Перечисления.ВидыОперацийКорректировкаЛимитов.Перенос;
		Для Каждого СтрокаОбеспечитьЗаСчет Из ТекущийОбъект.ОбеспечитьЗаСчет Цикл
			СтрокаОбеспечитьЗаСчет.ВидОперации = ВидОперацииПеренос;	
		КонецЦикла;

	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект);
	УстановитьСостояниеДокумента();
	УправлениеФормой(); 
	КонтрольУХ.ИнициализироватьРезультатыКонтроля(ЭтотОбъект);
	ОбновитьПредставлениеПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
    	ОбновитьЭлементыДополнительныхРеквизитов();
	    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства	
	
	#Область УХ_Согласование
	Если ИмяСобытия = "ОбъектСогласован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		ОпределитьСостояниеОбъекта();
	КонецЕсли;
	#КонецОбласти   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопПараметры = Новый Структура;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ДопПараметры.Вставить("КорректируемыйДокумент", Объект.ДокументОснование);
	КонецЕсли;
	Оповестить("ЗаписанаКорректировкаПланов", ДопПараметры);   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборПлановЛимитов.Форма.Форма" Тогда
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ЗаполнитьПоДокументуПланированияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВысвобождатьРезервПриИзменении(Элемент)
	
	Элементы.ТребуетсяВысвободитьРезервы.Доступность = Не ТолькоПросмотр И Объект.ВысвобождатьРезервы;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидБюджетаПриИзменении(Элемент)
	
	Если Объект.Требуется.Количество() > 0 
		Или Объект.ОбеспечитьЗаСчет.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВидБюджетаПриИзмененииЗавершение", ЭтотОбъект);   
		
		ТекстВопроса = НСтр("ru = 'При изменении вида бюджета будут очищены таблицы документа. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВидБюджетаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидБюджетаПриИзмененииЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		ВидБюджета = Объект.ВидБюджета;
		Возврат;
	КонецЕсли;
	
	ВидБюджетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_СтатьяБюджета_ПриИзменении(Элемент)
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтатьиБюджета_ПриИзменении(Элемент)
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииАналитикиСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства	
КонецПроцедуры

#Область ОбработчикиСобытийЕдиныеПараметры

&НаКлиенте
Процедура ЕдиныйПериодПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПериод, "НачалоПериода");
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПериод, "Периодичность");
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПериод, "ПредставлениеПериода");
	
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПериод");
	ОбновитьПредставлениеПериодов(); 
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура("НачалоПериода", НачалоПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиДатуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводДаты(ОписаниеОповещения, НачалоПериода, "Введите дату");
	
КонецПроцедуры  

&НаКлиенте
Процедура ВвестиДатуЗавершение(Дата, ДополнительныеПараметры) Экспорт
	
	НачалоПериода = ?(Дата = Неопределено, ДополнительныеПараметры.НачалоПериода, Дата);
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериодаПриИзменении();
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура НачалоПериодаПриИзменении()
	
	Модифицированность = Истина;
		
	Периодичность = ПолучитьПериодичностьПланирования(ВидБюджета, НачалоПериода);
	
	ПредставлениеПериода = ОбщегоНазначенияОПККлиентСервер.ПредставлениеПериодаПоПериодичности(
		НачалоПериода, Периодичность);
		
	НачалоПериода = КэшируемыеПроцедурыУХ.ДатаНачалаПериода(НачалоПериода, Периодичность);
	
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйПериод", "НачалоПериода");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПериод");

КонецПроцедуры

&НаКлиенте
Процедура ЕдиныйЦФОПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйЦФО, "ЦФО");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйЦФО");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйЦФО", "ЦФО");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйЦФО");

КонецПроцедуры

&НаКлиенте
Процедура ЕдиныйПроектПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПроект, "Проект");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПроект");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйПроект", "Проект");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПроект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдинаяВалютаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдинаяВалюта, "Валюта");
	ПриИзмененииЕдиногоРеквизита("ЕдинаяВалюта");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);

КонецПроцедуры 

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдинаяВалюта", "Валюта");
	ПриИзмененииЕдиногоРеквизита("ЕдинаяВалюта");
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиныйПриходРасходПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПриходРасход, "ПриходРасход");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПриходРасход");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ПриходРасходПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйПриходРасход", "ПриходРасход");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПриходРасход");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТребуется

&НаКлиенте
Процедура ТребуетсяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВыполнитьРасчетСуммОбеспеченияСтрокиТребуется(ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;  
	
	УстановитьОтборСтрок();
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяСтатьяБюджетаПриИзменении(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
	СтрокаТабличнойЧасти = Элементы.Требуется.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПередНачаломИзменения(Элемент, Отказ)
	АналитикиСтатейБюджетовУХКлиент.ПередНачаломИзмененияСтрокиТаблицыФормы(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.ТребуетсяУвеличить.МинимальноеЗначение = 0;
	Элементы.ТребуетсяУвеличить.МаксимальноеЗначение = Элемент.ТекущиеДанные.Сумма;
	
	Если НоваяСтрока Тогда
		Реквизиты = Новый Массив;
		
		Если ЕдиныйПериод Тогда
			Реквизиты.Добавить("НачалоПериода"); 
			Реквизиты.Добавить("Периодичность");
		КонецЕсли;
		
		Если ЕдиныйЦФО Тогда
			Реквизиты.Добавить("ЦФО");
		КонецЕсли;  
		
		Если ЕдиныйПроект Тогда
			Реквизиты.Добавить("Проект");
		КонецЕсли;
		
		Если ЕдинаяВалюта Тогда
			Реквизиты.Добавить("Валюта");
		КонецЕсли;
		
		Если ЕдиныйПриходРасход Тогда
			Реквизиты.Добавить("ПриходРасход");
		КонецЕсли;
				
		ИменаРеквизитов = СтрСоединить(Реквизиты, ",");
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, ЭтотОбъект, ИменаРеквизитов);
	КонецЕсли;
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Требуется.ТекущиеДанные;  
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Сумма) Тогда
		ТекущиеДанные.СуммаРезерв = 0;
		ТекущиеДанные.ДокументРезерва = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Отказ = Истина;	     
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПередУдалением(Элемент, Отказ) 
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Отказ = Истина;	     
	Иначе     	
		// Удалить связанные строки
		ВыделенныеСтроки = Элементы.Требуется.ВыделенныеСтроки;
		
		Для Каждого ЭлементКоллекции Из ВыделенныеСтроки Цикл
			
			ТекущиеДанные = Объект.Требуется.НайтиПоИдентификатору(ЭлементКоллекции);
			
			Если ТекущиеДанные = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
			
			СтрокиКУдалению = Объект.ОбеспечитьЗаСчет.НайтиСтроки(СтруктураПоиска);
			Для Каждого Строка Из СтрокиКУдалению Цикл
				Объект.ОбеспечитьЗаСчет.Удалить(Строка);
			КонецЦикла;  	

		КонецЦикла;
		
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяТребуетсяРезервПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Требуется.ТекущиеДанные;  
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СуммаРезерв) Тогда
		ТекущиеДанные.Сумма = 0;	
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ТребуетсяНачалоПериодаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Требуется.ТекущиеДанные;
	ОбновитьПредставлениеПериодаСтроки(ТекущиеДанные, Объект.ВидБюджета);
	
	ТекущиеДанные.НачалоПериода = КэшируемыеПроцедурыУХ.ДатаНачалаПериода(
						ТекущиеДанные.НачалоПериода, ТекущиеДанные.Периодичность);
	
	СтрокаТабличнойЧасти = Элементы.Требуется.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок()  
	
	ТекущаяСтрока = Элементы.Требуется.ТекущиеДанные;  
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки);
	Элементы.ОбеспечитьЗаСчетПострочно.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяЦФОПриИзменении(Элемент)   
	
	СтрокаТабличнойЧасти = Элементы.Требуется.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПроектПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Требуется.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);  
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяВалютаПриИзменении(Элемент) 
	
	СтрокаТабличнойЧасти = Элементы.Требуется.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбеспечитьЗаСчетПострочно

&НаКлиенте
Процедура ОбеспечитьЗаСчетПострочноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Требуется.ТекущиеДанные;           
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьРасчетСуммОбеспеченияСтрокиТребуется(ТекущиеДанные.ИдентификаторСтроки);
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечитьЗаСчетПострочноПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Требуется.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечитьЗаСчетПострочноПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТребуется = Элементы.Требуется.ТекущиеДанные;
	
	Если НоваяСтрока Или Копирование Тогда   
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		ТекущиеДанные.ИдентификаторСтроки = СтрокаТребуется.ИдентификаторСтроки; 
		ТекущиеДанные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаЛимитов.Перенос");  
		ТекущиеДанные.Валюта = СтрокаТребуется.Валюта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечитьЗаСчетПострочноПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОбеспечитьЗаСчет_ЗапрещеноОкончаниеРедактирования(Элемент.ТекущиеДанные, НоваяСтрока, ОтменаРедактирования) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбеспечитьЗаСчетПострочноНачалоПериодаПриИзменении(Элемент)
	
	Строка = Элементы.ОбеспечитьЗаСчетПострочно.ТекущиеДанные;
	ОбновитьПредставлениеПериодаСтроки(Строка, Объект.ВидБюджета);
	
	Строка.НачалоПериода = КэшируемыеПроцедурыУХ.ДатаНачалаПериода(Строка.НачалоПериода, Строка.Периодичность);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбеспечитьЗаСчетПострочноСтатьяБюджетаПриИзменении(Элемент)
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииАналитикиСтатьиБюджета(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииАналитикиСтатьиБюджета(ЭтотОбъект, Элемент.Имя);  
	
	СтрокаТабличнойЧасти = Элементы.Требуется.ТекущиеДанные; 
	
	Если Не СтрокаТабличнойЧасти = Неопределено 
		И Элемент.Родитель.Имя = "ТребуетсяГруппаАналитикиСтатьи" Тогда
		ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбеспечиватьПострочноПриИзменении(Элемент)
	ИзменитьВидКорректировки();
КонецПроцедуры                                                      

&НаКлиенте
Процедура ОбеспечитьЗаСчетПострочноПередНачаломИзменения(Элемент, Отказ)
	
	АналитикиСтатейБюджетовУХКлиент.ПередНачаломИзмененияСтрокиТаблицыФормы(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбеспечитьЗаСчет

&НаКлиенте
Процедура ОбеспечитьЗаСчетПриИзменении(Элемент)  
	ПриОжиданииВыполнитьКонтрольДокумента();    	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечитьЗаСчетПередНачаломИзменения(Элемент, Отказ)
	АналитикиСтатейБюджетовУХКлиент.ПередНачаломИзмененияСтрокиТаблицыФормы(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры  

&НаКлиенте
Процедура ОбеспечитьЗаСчетНачалоПериодаПриИзменении(Элемент)
	
	Строка = Элементы.ОбеспечитьЗаСчет.ТекущиеДанные;
	ОбновитьПредставлениеПериодаСтроки(Строка, Объект.ВидБюджета);
	
	Строка.НачалоПериода = КэшируемыеПроцедурыУХ.ДатаНачалаПериода(Строка.НачалоПериода, Строка.Периодичность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечитьЗаСчетСтатьяБюджетаПриИзменении(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
	
	ТД = Элементы.ОбеспечитьЗаСчет.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТД.СтатьяБюджета) И НЕ ЗначениеЗаполнено(ТД.Приходрасход) Тогда
		ТД.ПриходРасход = ПолучитьНаправлениеИзСтатьиБюджета(ТД.СтатьяБюджета);
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, 
						НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура УвеличитьПланПоВыбраннойСтроке(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаЛимитов.Увеличение");
	ИзменитьЛимитПоТекущейСтрокеПотребностей(ВидОперации);   
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	 
КонецПроцедуры   

&НаКлиенте
Процедура УвеличитьПланПоВсемСтрокам(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаЛимитов.Увеличение");	
	Для Каждого ТекущаяСтрока Из Объект.Требуется Цикл
		ИзменитьЛимитПоТекущейСтрокеПотребностей(ВидОперации, ТекущаяСтрока);	
	КонецЦикла;  
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры   

&НаКлиенте
Процедура УменьшитьПланПоВыбраннойСтроке(Команда)

	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаЛимитов.Уменьшение");
	ИзменитьЛимитПоТекущейСтрокеПотребностей(ВидОперации);   
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПланПоВсемСтрокам(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаЛимитов.Уменьшение");
	Для Каждого ТекущаяСтрока Из Объект.Требуется Цикл
		ИзменитьЛимитПоТекущейСтрокеПотребностей(ВидОперации, ТекущаяСтрока);	
	КонецЦикла;  
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)  
	
	Если Объект.Проведен Тогда      	
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru = 'Операция в проведенном документе запрещена. Отменить проведение?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  		
	Иначе     	
		ЗаполнитьПоДокументуПланированияНаСервере();		
	КонецЕсли;	
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПоДокументуПланированияНаСервере();

КонецПроцедуры   

&НаКлиенте
Процедура ПодборОбеспеченияПоСтроке(Команда)

	Оповещение = Новый ОписаниеОповещения("ПодборОбеспеченияПоСтрокеЗавершение", ЭтотОбъект);
	
	Если Объект.Проведен Тогда 
		ТекстВопроса = НСтр("ru = 'Операция в проведенном документе запрещена. Отменить проведение?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
	ИначеЕсли Объект.Ссылка.Пустая() ИЛИ Модифицированность = Истина Тогда
		ТекстВопроса = НСтр("ru = 'Для подбора обеспечения по строке документ должен быть записан. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	Иначе     	
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);  	
	КонецЕсли;

КонецПроцедуры  
	
&НаКлиенте
Процедура ПодборОбеспеченияПоСтрокеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;  
	
	СтрокаТребуется = Элементы.Требуется.ТекущиеДанные;
	Если СтрокаТребуется = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РежимЗаписи = ?(Объект.Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись);
	Записать(Новый Структура("РежимЗаписи", РежимЗаписи));
	
	Модифицированность = Истина;  
	
	Элементы.Требуется.ТекущаяСтрока = СтрокаТребуется.ПолучитьИдентификатор();  	
	СуммаТребуется = ?(ЗначениеЗаполнено(СтрокаТребуется.Сумма), СтрокаТребуется.Сумма, СтрокаТребуется.СуммаРезерв); 
		      
	ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТребуется.ИдентификаторСтроки);
	НайденныСтроки = Объект.ОбеспечитьЗаСчет.НайтиСтроки(ПараметрыОтбора);
	
	ВидОперацииПеренос = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаЛимитов.Перенос");
	
	Сумма = 0;
	Для Каждого ЭлементКоллекции Из НайденныСтроки Цикл
		Если Не ЭлементКоллекции.ВидОперации = ВидОперацииПеренос Тогда
			Сумма = Сумма + ЭлементКоллекции.Сумма;
		КонецЕсли;  		
	КонецЦикла;
	
	СуммаТребуется = Макс(СуммаТребуется - Сумма, 0);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИспользуетсяИдентификаторСтроки",			Истина);
	ПараметрыФормы.Вставить("ИдентификаторСтроки",						СтрокаТребуется.ИдентификаторСтроки); 
	ПараметрыФормы.Вставить("ВидБюджета",								Объект.ВидБюджета);
	ПараметрыФормы.Вставить("ПриходРасход",								СтрокаТребуется.ПриходРасход);
	ПараметрыФормы.Вставить("ВидИсточника",								?(ЗначениеЗаполнено(СтрокаТребуется.ДокументРезерва), "Резервы", "Лимиты"));
	ПараметрыФормы.Вставить("Валюта",									СтрокаТребуется.Валюта); 
	ПараметрыФормы.Вставить("СуммаТребуется",							СуммаТребуется); 
	ПараметрыФормы.Вставить("Заголовок",								НСтр("ru = 'Подбор планов для переноса'"));
	ПараметрыФормы.Вставить("Дата",										Объект.Дата);	
	ПараметрыФормы.Вставить("Документ",									Объект.Ссылка); 
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",		Истина);
	ПараметрыФормы.Вставить("Корзина", 									Объект.ОбеспечитьЗаСчет);
	
	ОткрытьФорму("Обработка.ПодборПлановЛимитов.Форма", ПараметрыФормы, ЭтотОбъект, 
				УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры   

&НаКлиенте
Процедура ПодборОбеспечения(Команда)

	Оповещение = Новый ОписаниеОповещения("ПодборОбеспеченияЗавершение", ЭтотОбъект);
	
	Если Объект.Проведен Тогда 
		ТекстВопроса = НСтр("ru = 'Операция в проведенном документе запрещена. Отменить проведение?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  		
	Иначе     	
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);  	
	КонецЕсли;	
	
КонецПроцедуры    

&НаКлиенте
Процедура ПодборОбеспеченияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;  
	
	Если Объект.Проведен Тогда 
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения)); 
		Модифицированность = Истина;
	КонецЕсли;
	
	Требуется = Объект.Требуется.Итог("Сумма") + Объект.Требуется.Итог("СуммаРезерв");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИспользуетсяИдентификаторСтроки",			Ложь);   
	ПараметрыФормы.Вставить("ВидБюджета",								Объект.ВидБюджета);
	ПараметрыФормы.Вставить("СуммаТребуется",							Требуется);  
	ПараметрыФормы.Вставить("Заголовок",								НСтр("ru = 'Подбор планов для переноса'"));
	ПараметрыФормы.Вставить("Дата",										Объект.Дата);	
	ПараметрыФормы.Вставить("Документ",									Объект.Ссылка); 
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",		Истина);
	ПараметрыФормы.Вставить("Корзина", 									Объект.ОбеспечитьЗаСчет);
	
	ОткрытьФорму("Обработка.ПодборПлановЛимитов.Форма", ПараметрыФормы, ЭтотОбъект, 
				УникальныйИдентификатор , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ПереносСвободныхЛимитов(Команда) 
	
	РежимЗаписи = ?(Объект.Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись); 
	Записать(Новый Структура("РежимЗаписи", РежимЗаписи));   
	
	Модифицированность = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РежимЗаполнения", 1);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПереносСвободныхЛимитовЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;   		
	ПараметрыФормы.Вставить("ВидБюджета", 	 	Объект.ВидБюджета);
    ПараметрыФормы.Вставить("Документ",	  	 	Объект.Ссылка); 
	ПараметрыФормы.Вставить("ДатаДокумента", 	Объект.Дата);   
	                                              
	ОткрытьФорму("Документ.КорректировкаПланов.Форма.ПереносСвободныхЛимитов", 
				 ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор , , ,
				 ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодборПотребностей(Команда)
			
	РежимЗаписи = ?(Объект.Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись); 
	Записать(Новый Структура("РежимЗаписи", РежимЗаписи));   
	
	Модифицированность = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РежимЗаполнения", 2);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПереносСвободныхЛимитовЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;   		
	ПараметрыФормы.Вставить("ВидБюджета", 	 	Объект.ВидБюджета);
    ПараметрыФормы.Вставить("Документ",	  	 	Объект.Ссылка); 
	ПараметрыФормы.Вставить("ДатаДокумента", 	Объект.Дата);
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ПараметрыФормы.Вставить("НачалоПериода", 	НачалоПериода);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЦФО) Тогда
		ПараметрыФормы.Вставить("ЦФО", 	ЦФО);
	КонецЕсли;
	Если ЗначениеЗаполнено(Проект) Тогда
		ПараметрыФормы.Вставить("Проект", 	Проект);
	КонецЕсли;
	Если ЗначениеЗаполнено(Валюта) Тогда
		ПараметрыФормы.Вставить("Валюта", 	Валюта); 
	КонецЕсли;   
		
	ОткрытьФорму("Документ.КорректировкаПланов.Форма.ПодборПотребностей", 
				 ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,,ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				 
КонецПроцедуры  
			 
&НаКлиенте
Процедура ВысвободитьРезервы(Команда) 
	
	Если Объект.Требуется.Количество() > 0 Тогда		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьТабличныеЧастиПродолжение", ЭтотОбъект);
	
		ТекстВопроса = НСтр("ru = 'Табличные части будут очищены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);  
	Иначе
		ОткрытьФормуВысвобождениеРезервов();	
	КонецЕсли;  	
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ВидБюджета = Объект.ВидБюджета;
	
	УстановитьСостояниеДокумента(); 
	
	// Управление элементами формы 
	УправлениеЭлементамиФормы.ПриЧтенииСозданииНаСервере(ЭтотОбъект);
	
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйПериод", "НачалоПериода, ТребуетсяНачалоПериода");
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйЦФО", "ЦФО, ТребуетсяЦФО");  
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйПроект", "Проект, ТребуетсяПроект");
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдинаяВалюта", "Валюта, ТребуетсяВалюта"); 
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйПриходРасход", "ПриходРасход, ТребуетсяПриходРасход");
		
	КонтрольЛимитовФормы.ОпределитьЕдиныеРеквизитыФормыКорректировкиЛимитов(ЭтаФорма, "Требуется"); 
	
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма);
	
	ОбновитьПредставлениеПериодов();
	
	СоздатьСтатьиБюджетовИАналитики();

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()  
	
	ВидимостьЗапретРедактирования = Ложь;
	Если Объект.Проведен Тогда
		Если ЗначениеЗаполнено(Объект.ДокументОснование) 
			И Объект.ДокументОснование.Проведен 
			И Не Объект.ВысвобождатьРезервы Тогда
			ТолькоПросмотр = Истина;	 
			ВидимостьЗапретРедактирования = Истина;
		КонецЕсли;
	КонецЕсли; 
	Элементы.ДекорацияЗапретРедактирования.Видимость = ВидимостьЗапретРедактирования;
	
	УказаноОснование = ЗначениеЗаполнено(Объект.ДокументОснование);  
	Элементы.Требуется.КоманднаяПанель.ПодчиненныеЭлементы.ТребуетсяДобавить.Видимость  	= Не УказаноОснование;   
	Элементы.Требуется.КоманднаяПанель.ПодчиненныеЭлементы.ТребуетсяСкопировать.Видимость  	= Не УказаноОснование;   
	Элементы.Требуется.КоманднаяПанель.ПодчиненныеЭлементы.ТребуетсяУдалить.Видимость  		= Не УказаноОснование;   
	
	ТребуетсяКонтекстноеМеню = Элементы.Требуется.КонтекстноеМеню.ПодчиненныеЭлементы;
	ТребуетсяКонтекстноеМеню.ТребуетсяКонтекстноеМенюДобавить.Видимость    = Не УказаноОснование;   
	ТребуетсяКонтекстноеМеню.ТребуетсяКонтекстноеМенюСкопировать.Видимость = Не УказаноОснование;   
	ТребуетсяКонтекстноеМеню.ТребуетсяКонтекстноеМенюУдалить.Видимость     = Не УказаноОснование;   
	
	Элементы.ТребуетсяСумма.ТолькоПросмотр = УказаноОснование;
	Элементы.ТребуетсяРезерв.ТолькоПросмотр = УказаноОснование;
    Элементы.ТребуетсяДокументРезерва.ТолькоПросмотр = УказаноОснование; 
	Элементы.ТребуетсяСтатьяБюджета.ТолькоПросмотр = УказаноОснование;
	
	Элементы.ВидБюджета.Доступность = Не ТолькоПросмотр;
	Элементы.ОбеспечитьЗаСчетПодборОбеспечения.Доступность = Не ТолькоПросмотр;
	Элементы.ТребуетсяУвеличитьПланПоВсемСтрокам.Доступность = Не ТолькоПросмотр; 
	Элементы.ТребуетсяУвеличитьПланПоВыбраннойСтроке.Доступность = Не ТолькоПросмотр; 
	Элементы.ТребуетсяПодборОбеспеченияПоСтроке.Доступность = Не ТолькоПросмотр;
	Элементы.ОбеспечитьЗаСчетПодборОбеспечения.Доступность = Не ТолькоПросмотр;
	Элементы.ТребуетсяПодборПотребностей.Доступность = Не ТолькоПросмотр;
	
	Элементы.ВысвобождатьРезервы.Доступность = УказаноОснование;
	Элементы.ТребуетсяВысвободитьРезервы.Видимость = КонтрольЛимитовУХПовтИсп.ПолучитьЗначениеИспользованияРезервирования();
	Элементы.ТребуетсяВысвободитьРезервы.Доступность = Не ТолькоПросмотр И Объект.ВысвобождатьРезервы;

	ЭтоОперацияОбеспечиватьПострочно = Объект.ОбеспечиватьПострочно;	  
	
	Элементы.ТребуетсяПодборОбеспеченияПоСтроке.Видимость = ЭтоОперацияОбеспечиватьПострочно;   
	Элементы.ТребуетсяУвеличитьПланПоВыбраннойСтроке.Видимость = ЭтоОперацияОбеспечиватьПострочно;     
	Элементы.ТребуетсяУвеличитьПланПоВсемСтрокам.Видимость = ЭтоОперацияОбеспечиватьПострочно; 
	Элементы.СтраницаИсточник.Видимость = Не ЭтоОперацияОбеспечиватьПострочно;  
	Элементы.ГруппаОбеспечениеПоИдентификаторамСтрок.Видимость = ЭтоОперацияОбеспечиватьПострочно;
   	Элементы.ТребуетсяУвеличить.ТолькоПросмотр = ЭтоОперацияОбеспечиватьПострочно;
	Элементы.ТребуетсяПеренесено.Видимость = ЭтоОперацияОбеспечиватьПострочно; 
	
	Элементы.ТребуетсяГруппаУменьшить.Видимость = ЭтоОперацияОбеспечиватьПострочно;  
	
	Элементы.ГруппаЗаполнениеТаблицы.ТолькоПросмотр = УказаноОснование; 

КонецПроцедуры             

&НаКлиенте
Процедура ИзменитьЛимитПоТекущейСтрокеПотребностей(ВидОперации, ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.Требуется.ТекущиеДанные;
	КонецЕсли;  
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРезерв = (ЗначениеЗаполнено(ТекущаяСтрока.СуммаРезерв) И ЗначениеЗаполнено(ТекущаяСтрока.ДокументРезерва)); 
		
	СуммаУвеличить = ?(ЗначениеЗаполнено(ТекущаяСтрока.Сумма), ТекущаяСтрока.Сумма, ТекущаяСтрока.СуммаРезерв);
	СуммаУвеличить = СуммаУвеличить - Мин(ТекущаяСтрока.Перенесено, СуммаУвеличить);
	
	Если СуммаУвеличить > 0 Тогда
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтроки, ВидОперации", 
						ТекущаяСтрока.ИдентификаторСтроки, ВидОперации);
		Строки = Объект.ОбеспечитьЗаСчет.НайтиСтроки(СтруктураПоиска);
		
		Если Строки.Количество() = 0 Тогда
			
			Строка = Объект.ОбеспечитьЗаСчет.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, ТекущаяСтрока, , "ДокументРезерва");
			Строка.ИдентификаторСтроки = СтруктураПоиска.ИдентификаторСтроки;
			Строка.ВидОперации = ВидОперации;       

		Иначе
			Строка = Строки[0];
		КонецЕсли;
		
		Строка.Сумма = СуммаУвеличить;
		ТекущаяСтрока.Увеличить = СуммаУвеличить;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидБюджетаПриИзмененииНаСервере()
	
	Объект.ВидБюджета = ВидБюджета;
	
	Объект.Требуется.Очистить();
	Объект.ОбеспечитьЗаСчет.Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область ВызовыОбщихПроцедурИФункцийСогласованияОбъектов

&НаСервере
Процедура ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход = Ложь)
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма, ОбновитьОтветственныхВход);
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаПриИзменении_Подключаемый()
	НовоеЗначениеСтатуса = РеквизитСтатусОбъекта(ЭтаФорма);
	ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатуса);	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСтатусОбъекта(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
КонецПроцедуры

// Проверяет сохранение текущего объекта и изменяет его статус
// НовоеЗначениеСтатусаВход.
&НаКлиенте
Процедура ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатусаВход)

	Если (Объект.Ссылка.Пустая()) ИЛИ (ЭтаФорма.Модифицированность) Тогда
		
		СтруктураПараметров = Новый Структура("ВыбранноеЗначение", НовоеЗначениеСтатусаВход);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", 
																ЭтотОбъект, СтруктураПараметров);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Изменение состояния возможно только после записи данных.
		|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;  
		
	КонецЕсли;    
	
	ИзменитьСостояниеЗаявкиКлиент(НовоеЗначениеСтатусаВход);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтаФорма);
КонецФункции

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОрганизации_Подключаемый(Элемент) Экспорт
	ОпределитьСостояниеОбъекта(Истина);		
	ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент);
КонецПроцедуры		// ПриИзмененииЭлементаОрганизации_Подключаемый()

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции

// Выполняет обработчик ПриИзменении, сопоставленный по умолчанию для элемента Элемент
&НаКлиенте
Процедура ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент)

	#Если НЕ ВебКлиент Тогда
		ИмяЭлемента = Элемент.Имя;
		Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
			Для Каждого ТекОбработчикиИзмененияОрганизации Из ЭтаФорма["ОбработчикиИзмененияОрганизации"] Цикл
				Если СокрЛП(ТекОбработчикиИзмененияОрганизации.ИмяРеквизита) = СокрЛП(ИмяЭлемента) Тогда
					СтрокаВыполнения = ТекОбработчикиИзмененияОрганизации.ИмяОбработчика + "(Элемент);";
					Выполнить СтрокаВыполнения;
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли;
	#КонецЕсли  

КонецПроцедуры // ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации()	

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли; 
	
	Модифицированность = Истина;
	
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение); 
	ПриОжиданииВыполнитьКонтрольДокумента(); 
	
	ТекущиеДанные = Элементы.Требуется.ТекущиеДанные; 
	ИдентификаторСтроки = Неопределено;
	Если Не ТекущиеДанные = Неопределено Тогда
		ИдентификаторСтроки = Элементы.Требуется.ТекущиеДанные.ПолучитьИдентификатор();  
	КонецЕсли;
	
	СоздатьСтатьиБюджетовИАналитики();  
	
	Если Не ИдентификаторСтроки = Неопределено Тогда
		Элементы.Требуется.ТекущаяСтрока = ИдентификаторСтроки;  	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(Результат)
	
	ИспользуетсяИдентификаторСтроки = Результат.ИспользуетсяИдентификаторСтроки;
	ИдентификаторСтроки = Результат.ИдентификаторСтроки;
	
	ТаблицаПланов = ПолучитьИзВременногоХранилища(Результат.АдресВХранилище);
	
	Если ИспользуетсяИдентификаторСтроки Тогда
		ОбработкаВыбораПодборПлановПоИдентификаторуСтроки(ИдентификаторСтроки, ТаблицаПланов);
	Иначе
		ИменаРеквизитов = "СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, 
						  |ПриходРасход, Организация, ЦФО, Проект, НачалоПериода, Валюта, ДокументРезерва";
		
		Объект.ОбеспечитьЗаСчет.Очистить();    
		
		Требуется = Объект.Требуется.Итог("Сумма") + Объект.Требуется.Итог("СуммаРезерв");
		
		КолонкиИсточника = Объект.ОбеспечитьЗаСчет.Выгрузить().Колонки;
		Для Каждого СтрокаПлана Из ТаблицаПланов Цикл 
			
			Отбор =  Новый Структура;
			
			Для Каждого Колонки  Из КолонкиИсточника Цикл
				Если Колонки.Имя <> "НомерСтроки" И Колонки.Имя <> "Сумма" И Колонки.Имя <> "ИсходныйНомерСтроки" 
					 И ТаблицаПланов.Колонки.Найти(Колонки.Имя) <> Неопределено Тогда 
					Отбор.Вставить(Колонки.Имя, СтрокаПлана[Колонки.Имя]);
				КонецЕсли;
			КонецЦикла;
			
			Строка = Объект.ОбеспечитьЗаСчет.НайтиСтроки(Отбор);
			Если Строка = Неопределено ИЛИ Строка.Количество() = 0 Тогда
				ТекущаяСтрока = Объект.ОбеспечитьЗаСчет.Добавить();
			Иначе 
				ТекущаяСтрока = Объект.ОбеспечитьЗаСчет.Получить(Строка[0].НомерСтроки - 1);
			КонецЕсли;	
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаПлана, ИменаРеквизитов);  
			
			Если Требуется = 0 Тогда
				ТекущаяСтрока.Сумма = 0;
			ИначеЕсли СтрокаПлана.Сумма > Требуется Тогда
				ТекущаяСтрока.Сумма = Требуется;
				Требуется = 0;
			Иначе
				ТекущаяСтрока.Сумма = СтрокаПлана.Сумма;
				ТребуетсяЛимит = Требуется - ТекущаяСтрока.Сумма;
			КонецЕсли;
			
			ОбновитьПредставлениеПериодаСтроки(ТекущаяСтрока, Объект.ВидБюджета);

		КонецЦикла;
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ТелеграмВложенныеФайлы(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ПереопределяемыеСобытияЭлементовДляКонтроляДокумента

&НаКлиенте
Процедура ПриОжиданииВыполнитьКонтрольДокумента()
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьКонтрольДокумента", 0.5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКонтрольДокумента()
	КонтрольУХКлиентСервер.ВыполнитьИнтерактивныйКонтроль(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаКонтроляДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД =  Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КонтрольУХКлиент.ПоказатьРасшифровкуКонтроля(Объект, ТД);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаКонтроляДокументаПриАктивизацииЯчейки(Элемент)
	Элемент.ТекущаяСтрока = Неопределено;
КонецПроцедуры

#КонецОбласти
 
&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаправлениеИзСтатьиБюджета(СтатьяБюджета)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяБюджета, "ПриходРасход");
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДокументуПланированияНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	Модифицированность = Истина;

	Документы.КорректировкаПланов.ЗаполнитьПоДокументуПланирования(Объект, Объект.ДокументОснование, Объект);
	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.ВысвобождатьРезервы = Ложь;	
	КонецЕсли;
	
	ОбновитьПредставлениеПериодов();   
	УправлениеФормой(); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборПлановПоИдентификаторуСтроки(ИдентификаторСтроки, ТаблицаПланов)
	
	ИменаРеквизитов = "ОбъектКонтроля, СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6, 
					  |ПриходРасход, Организация, ЦФО, Проект, НачалоПериода, Периодичность, Валюта, Сумма, ДокументРезерва";    
	
	ОбеспечитьЗаСчетУдалитьСтрокиПоИдентификаторуСтроки(ИдентификаторСтроки);
	
	ВидОперацииПеренос = Перечисления.ВидыОперацийКорректировкаЛимитов.Перенос;
	Для Каждого СтрокаПлана Из ТаблицаПланов Цикл 
		ТекущаяСтрока = Объект.ОбеспечитьЗаСчет.Добавить();
		ТекущаяСтрока.ВидОперации = ВидОперацииПеренос;
		
		ТекущаяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаПлана, ИменаРеквизитов);  
		ОбновитьПредставлениеПериодаСтроки(ТекущаяСтрока, Объект.ВидБюджета);
	КонецЦикла;
	
	ВыполнитьРасчетСуммОбеспеченияСтрокиТребуется(ИдентификаторСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ОбеспечитьЗаСчетУдалитьСтрокиПоИдентификаторуСтроки(ИдентификаторСтроки)
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки, ВидОперации", 
									  ИдентификаторСтроки, Перечисления.ВидыОперацийКорректировкаЛимитов.Перенос);

	СтрокиСИдентификатором = Объект.ОбеспечитьЗаСчет.НайтиСтроки(СтруктураПоиска);
	                    
	Для Каждого Строка Из СтрокиСИдентификатором Цикл
		Объект.ОбеспечитьЗаСчет.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетСуммОбеспеченияСтрокиТребуется(ИдентификаторСтроки)
	
	Если Не Объект.ОбеспечиватьПострочно Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	Обеспечено = Объект.ОбеспечитьЗаСчет.Выгрузить(СтруктураПоиска, "ИдентификаторСтроки, ВидОперации, Сумма");
	Обеспечено.Свернуть("ИдентификаторСтроки, ВидОперации", "Сумма");

	Для Каждого Строка Из Объект.Требуется.НайтиСтроки(СтруктураПоиска) Цикл
		
		СтруктураПоиска.ИдентификаторСтроки = Строка.ИдентификаторСтроки;
	
		СтрокиОбеспечено = Обеспечено.НайтиСтроки(СтруктураПоиска);
		
		Строка.Перенесено = 0;
		Строка.Увеличить  = 0;      
		
		Для Каждого СтрокаОбеспечено Из СтрокиОбеспечено Цикл
			
			Если ВидыОперацииОбеспечить.НайтиПоЗначению(СтрокаОбеспечено.ВидОперации) = Неопределено Тогда
				Строка.Перенесено = СтрокаОбеспечено.Сумма;	
			Иначе
				Строка.Увеличить = СтрокаОбеспечено.Сумма;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры      

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеПериодаСтроки(Строка, ВидБюджета)
	
	Строка.Периодичность = ПолучитьПериодичностьПланирования(ВидБюджета, Строка.НачалоПериода);  
	
	Строка.ПредставлениеПериода = ОбщегоНазначенияОПККлиентСервер.ПредставлениеПериодаПоПериодичности(
		Строка.НачалоПериода, Строка.Периодичность);    
		
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ПолучитьПериодичностьПланирования(ВидБюджета, НачалоПериода)
	
	ПараметрыПланирования = ОперативноеПланированиеПовтИспУХ.ПолучитьПараметрыОперПланирования(ВидБюджета, НачалоПериода);
	
	Возврат ПараметрыПланирования.ПериодичностьЛимитирования;   
	
КонецФункции

&НаСервере
Процедура ОбновитьПредставлениеПериодов()
	
	ОбновитьПредставлениеПериодаСтроки(ЭтотОбъект, Объект.ВидБюджета);   
	
	Для Каждого Строка Из Объект.Требуется Цикл
		ОбновитьПредставлениеПериодаСтроки(Строка, Объект.ВидБюджета);
	КонецЦикла;

	Для Каждого Строка Из Объект.ОбеспечитьЗаСчет Цикл
		ОбновитьПредставлениеПериодаСтроки(Строка, Объект.ВидБюджета);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидКорректировки()
	
	Если Объект.ОбеспечиватьПострочно Тогда
		ПреобразоватьКОбеспечиватьПострочно();
	Иначе
		ПреобразоватьКОбеспечиватьВместе();
	КонецЕсли;
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьКОбеспечиватьПострочно()
	                      
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИдентификаторСтроки", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	СтрокиОбеспечить = Объект.ОбеспечитьЗаСчет.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаОбеспечения Из СтрокиОбеспечить Цикл
		Объект.ОбеспечитьЗаСчет.Удалить(СтрокаОбеспечения);
	КонецЦикла;    
	
	ВидОперацииУвеличение = Перечисления.ВидыОперацийКорректировкаЛимитов.Увеличение;
	// Добавить строки Добавить
	Для Каждого СтрокаТребуется Из Объект.Требуется Цикл
		
		Если СтрокаТребуется.Увеличить = 0  Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОбеспечить = Объект.ОбеспечитьЗаСчет.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОбеспечить, СтрокаТребуется);
		
		СтрокаОбеспечить.ВидОперации = ВидОперацииУвеличение;
		СтрокаОбеспечить.Сумма = СтрокаТребуется.Увеличить; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьКОбеспечиватьВместе()
	
	Сч = 0;
	Пока Сч < Объект.ОбеспечитьЗаСчет.Количество() Цикл
		
		ТекущаяСтрока = Объект.ОбеспечитьЗаСчет[Сч];
		
		Если ВидыОперацииОбеспечить.НайтиПоЗначению(ТекущаяСтрока.ВидОперации) = Неопределено Тогда
			Сч = Сч + 1;	
		Иначе
			Объект.ОбеспечитьЗаСчет.Удалить(Сч);	
		КонецЕсли; 
		
	КонецЦикла;  
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Требуется Цикл
		СтрокаТабличнойЧасти.Перенесено = 0;
		СтрокаТабличнойЧасти.Увеличить = 0;
	КонецЦикла;     
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	#Область ПериодыПланирования
		
    // Требуется 
	ЭлементУО = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ТребуетсяНачалоПериода.Имя);

	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Требуется.НачалоПериода");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", 
		Новый ПолеКомпоновкиДанных("Объект.Требуется.ПредставлениеПериода"));

    // ОбеспечитьЗаСчет
	ЭлементУО = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОбеспечитьЗаСчетПострочноНачалоПериода.Имя);
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОбеспечитьЗаСчетНачалоПериода.Имя);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбеспечитьЗаСчет.НачалоПериода");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", 
		Новый ПолеКомпоновкиДанных("Объект.ОбеспечитьЗаСчет.ПредставлениеПериода"));
	
	#КонецОбласти
	
	#Область ПодменаДляОперацииУвеличение

	ИмяТаблицыФормы = "ОбеспечитьЗаСчетПострочно";

	// Аналитики статей бюджета
	ПоляУвеличения = Новый Структура(АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("Аналитика%1"));
	Для НомерАналитики = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
		
		ИмяЭлемента = СтрШаблон("Аналитика%1", НомерАналитики);
		ИмяРеквизита = СтрШаблон("Аналитика%1", НомерАналитики);
		ИмяРеквизитаВидАналитики = СтрШаблон("ВидАналитики%1", НомерАналитики);
		
		// Аналитика заполнена
		ЭлементУО = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
		ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяТаблицыФормы + ИмяЭлемента);
		УстановитьОтборИОформлениеДляПолейУвеличения(ЭлементУО);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", 
						Новый ПолеКомпоновкиДанных("Объект.Требуется." + ИмяРеквизита));
		
		// Аналитика не используется
		ЭлементУО = АналитикиСтатейБюджетовУХ.ЭлементУсловногоОформления_АналитикаСтатьиНеИспользуется(
			ЭтотОбъект.УсловноеОформление.Элементы,
			ИмяТаблицыФормы + ИмяЭлемента,
			"Объект.Требуется." + ИмяРеквизитаВидАналитики
		);
		УстановитьОтборИОформлениеДляПолейУвеличения(ЭлементУО);
		
		// Аналитика не заполнена
		ЭлементУО = АналитикиСтатейБюджетовУХ.ЭлементУсловногоОформления_АналитикаСтатьиНеЗаполнена(
			ЭтотОбъект.УсловноеОформление.Элементы,
			ИмяТаблицыФормы + ИмяЭлемента,
			"Объект.Требуется." + ИмяРеквизита,
			"Объект.Требуется." + ИмяРеквизитаВидАналитики
		);
		УстановитьОтборИОформлениеДляПолейУвеличения(ЭлементУО);
		
	КонецЦикла;  
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборИОформлениеДляПолейУвеличения(ЭлементУО)
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбеспечитьЗаСчет.ВидОперации");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыОперацийКорректировкаЛимитов.Перенос;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",			Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",				ЦветаСтиля.ГиперссылкаЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",	Ложь);     

КонецПроцедуры

&НаКлиенте
Функция ОбеспечитьЗаСчет_ЗапрещеноОкончаниеРедактирования(ТекущиеДанные, НоваяСтрока, ОтменаРедактирования)
	
	Результат = Ложь;
	
	Если ОтменаРедактирования Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не Объект.ОбеспечиватьПострочно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Перенос = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаЛимитов.Перенос");
	Если ТекущиеДанные.ВидОперации = Перенос Тогда
		Возврат Результат;
	КонецЕсли;

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	СтрокиОбеспечитьЗаСчет = Объект.ОбеспечитьЗаСчет.НайтиСтроки(СтруктураПоиска);
	
	КоличествоСтрок = 0;
	Для Каждого СтрокаОбеспечитьЗаСчет Из СтрокиОбеспечитьЗаСчет Цикл		         
		Если Не ВидыОперацииОбеспечить.НайтиПоЗначению(СтрокаОбеспечитьЗаСчет.ВидОперации) = Неопределено Тогда
			КоличествоСтрок = КоличествоСтрок + 1;	
		КонецЕсли;
	КонецЦикла; 
	
	Если КоличествоСтрок > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Несколько строк увеличения/уменьшения недопустимо'");   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);   
		Результат = Истина;
	КонецЕсли;   
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьСтатьиБюджетовИАналитики()
	
	// Данные для создания полей Аналитика* для элементов Статьи бюджетов
	АСБ = АналитикиСтатейБюджетовУХ;
	
	МассивОписанийСтатей = Новый Массив;
	АналитикиСтатейБюджетовУХ.СтатьяИАналитикиТабличнойЧастиВТаблицеФормы(МассивОписанийСтатей, 
		"Требуется",  "Требуется",
		"СтатьяБюджета", "ТребуетсяСтатьяБюджета",
		"Аналитика%1", "ТребуетсяАналитика%1",
		ФормыУХ.РазместитьВГруппе("ТребуетсяГруппаАналитикаСтатьяБюджета"));
	АналитикиСтатейБюджетовУХ.СтатьяИАналитикиТабличнойЧастиВТаблицеФормы(МассивОписанийСтатей, 
		"ОбеспечитьЗаСчет",  "ОбеспечитьЗаСчет",
		"СтатьяБюджета", "ОбеспечитьЗаСчетСтатьяБюджета",
		"Аналитика%1", "ОбеспечитьЗаСчетАналитика%1",
		ФормыУХ.РазместитьВГруппе("ОбеспечитьЗаСчетГруппаСтатьяБюджета"));

	АналитикиСтатейБюджетовУХ.СтатьяИАналитикиТабличнойЧастиВТаблицеФормы(МассивОписанийСтатей, 
		"ОбеспечитьЗаСчет",  "ОбеспечитьЗаСчетПострочно",
		"СтатьяБюджета", "ОбеспечитьЗаСчетПострочноСтатьяБюджета",
		"Аналитика%1", "ОбеспечитьЗаСчетПострочноАналитика%1",
		ФормыУХ.РазместитьВГруппе("ОбеспечитьЗаСчетПострочноГруппаСтатьяИАналитики"));
	
	// Создать элементы формы для статей бюджетов и их аналитик
	АналитикиСтатейБюджетовУХ.СоздатьСтатьиБюджетовИАналитики(ЭтотОбъект, МассивОписанийСтатей);    

КонецПроцедуры

&НаКлиенте
Процедура ПереносСвободныхЛимитовЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если Не ЭтоАдресВременногоХранилища(Результат.АдресВХранилище) Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьСвободныеЛимиты(Результат, ДопПараметры);
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры   

&НаСервере   
Процедура ЗаполнитьСвободныеЛимиты(Результат, ДопПараметры)

	ТаблицаСвободныеЛимиты = ПолучитьИзВременногоХранилища(Результат.АдресВХранилище); 
	
	ВидОперацииПеренос = Перечисления.ВидыОперацийКорректировкаЛимитов.Перенос;

	Для Каждого СтрокаТаблицы Из ТаблицаСвободныеЛимиты Цикл
		
		ИдентификаторСтроки = Новый УникальныйИдентификатор;	
		
		НоваяСтрока = Объект.Требуется.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);   
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяСтрока.Требуется = СтрокаТаблицы.Свободно;
		НоваяСтрока.Сумма = СтрокаТаблицы.Свободно;
		
		Если ДопПараметры.Свойство("РежимЗаполнения") И ДопПараметры.РежимЗаполнения = 1 Тогда
			НоваяСтрока.НачалоПериода = Результат.ДатаПереноса;
		КонецЕсли;

		ОбновитьПредставлениеПериодаСтроки(НоваяСтрока, Объект.ВидБюджета);

		Если ДопПараметры.Свойство("РежимЗаполнения") И ДопПараметры.РежимЗаполнения = 1 Тогда 
			НоваяСтрока = Объект.ОбеспечитьЗаСчет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.ВидОперации = ВидОперацииПеренос;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			НоваяСтрока.Сумма = СтрокаТаблицы.Свободно;
			
			ОбновитьПредставлениеПериодаСтроки(НоваяСтрока, Объект.ВидБюджета);  
		КонецЕсли;	

	КонецЦикла; 
	
	Модифицированность = Истина;   
	
	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипаДокументаОснования()	 	
	
	Элементы.ДокументОснование.ОграничениеТипа	= КонтрольЛимитовУХ.ТипыДокументаОснованияКорректировкиЛимитов();  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти)   
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода", СтрокаТабличнойЧасти.НачалоПериода);
	СтруктураПараметров.Вставить("Периодичность", СтрокаТабличнойЧасти.Периодичность);
	СтруктураПараметров.Вставить("ЦФО", СтрокаТабличнойЧасти.ЦФО);
	СтруктураПараметров.Вставить("Проект", СтрокаТабличнойЧасти.Проект);
	СтруктураПараметров.Вставить("СтатьяБюджета", СтрокаТабличнойЧасти.СтатьяБюджета);
	СтруктураПараметров.Вставить("Аналитика1", СтрокаТабличнойЧасти.Аналитика1);  
	СтруктураПараметров.Вставить("Аналитика2", СтрокаТабличнойЧасти.Аналитика2);
	СтруктураПараметров.Вставить("Аналитика3", СтрокаТабличнойЧасти.Аналитика3);
	СтруктураПараметров.Вставить("Аналитика4", СтрокаТабличнойЧасти.Аналитика4);
	СтруктураПараметров.Вставить("Аналитика5", СтрокаТабличнойЧасти.Аналитика5);
	СтруктураПараметров.Вставить("Аналитика6", СтрокаТабличнойЧасти.Аналитика6);
	СтруктураПараметров.Вставить("Валюта", СтрокаТабличнойЧасти.Валюта);
	СтруктураПараметров.Вставить("ВидБюджета", ВидБюджета);
	
	СтрокаТабличнойЧасти.Свободно = КонтрольЛимитовФормыВызовСервера.ЗаполнитьОстаткиСвободногоЛимитаПоСтрокеКорректировкаЛимитов(СтруктураПараметров);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьТабличныеЧастиПродолжение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда  	
		Объект.Требуется.Очистить();  
		Объект.ОбеспечитьЗаСчет.Очистить();  
		
		ОткрытьФормуВысвобождениеРезервов();
	КонецЕсли;        
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВысвобождениеРезервов() 
	
	Модифицированность = Истина;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВысвободитьРезервыЗавершение", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;   		
	ПараметрыФормы.Вставить("ВидБюджета", Объект.ВидБюджета);
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка); 
	ПараметрыФормы.Вставить("ДатаДокумента",Объект.Дата);  
	ПараметрыФормы.Вставить("ДокументРезерва", Объект.ДокументОснование);
		
	ОткрытьФорму("Документ.КорректировкаПланов.Форма.ВысвобождениеРезервов", 
				 ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , ,
				 ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  

КонецПроцедуры  

&НаКлиенте
Процедура ВысвободитьРезервыЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если Не ЭтоАдресВременногоХранилища(Результат.АдресВХранилище) Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьВысвобождениеРезервов(Результат);
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры 

&НаСервере   
Процедура ЗаполнитьВысвобождениеРезервов(Результат)
	
	ТаблицаРезервы = ПолучитьИзВременногоХранилища(Результат.АдресВХранилище); 
	
	ВидОперацииПеренос = Перечисления.ВидыОперацийКорректировкаЛимитов.Перенос;

	Для Каждого СтрокаТаблицы Из ТаблицаРезервы Цикл
		
		ИдентификаторСтроки = Новый УникальныйИдентификатор;	
		
		НоваяСтрока = Объект.Требуется.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "ДокументРезерва");   
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяСтрока.Требуется = СтрокаТаблицы.Свободно;
		НоваяСтрока.Сумма = СтрокаТаблицы.Свободно;

		ОбновитьПредставлениеПериодаСтроки(НоваяСтрока, Объект.ВидБюджета);

		НоваяСтрока = Объект.ОбеспечитьЗаСчет.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.ВидОперации = ВидОперацииПеренос;
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяСтрока.Сумма = СтрокаТаблицы.Свободно;
		
		ОбновитьПредставлениеПериодаСтроки(НоваяСтрока, Объект.ВидБюджета);  

	КонецЦикла; 
	
	Модифицированность = Истина;   
	
	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект);
	
КонецПроцедуры   

#Область ЕдиныеРеквизиты 

&НаКлиенте
Процедура ПриИзмененииЕдиногоРеквизита(ИмяЕдиногоРеквизита)
		
	КонтрольЛимитовФормыКлиент.ПриИзмененииЕдиногоРеквизита(ЭтаФорма, ИмяЕдиногоРеквизита, "Требуется");
	
	Для Каждого Строка Из Объект.Требуется Цикл
		ОбновитьСвободныйОстаток(Строка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти  