#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.Обеспечение = Перечисления.ВариантыВключенияПозицийПотребностей.Договор Тогда
		ВключитьВДоговор = Запись.ВключитьВ;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДоговор;
	ИначеЕсли Запись.Обеспечение = Перечисления.ВариантыВключенияПозицийПотребностей.СПЗ Тогда
		ВключитьВСПЗ = РегистрыСведений.ПроектыСПЗ.ПолучитьСПЗПоИдентификатору(Запись.ВключитьВ);
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСПЗ;
	ИначеЕсли Запись.Обеспечение = Перечисления.ВариантыВключенияПозицийПотребностей.ПроектСПЗ Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроектСПЗ;
	КонецЕсли;
	
	Элементы.ВключитьВ.Заголовок = Строка(Запись.Обеспечение);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ПозицииПроекта,	  
		"ИД",	Запись.ИД, ВидСравненияКомпоновкиДанных.Равно, , 
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если Запись.Обеспечение = Перечисления.ВариантыВключенияПозицийПотребностей.ПроектСПЗ Тогда
		Элементы.СтраницаПроектСПЗ.Видимость = Истина;
		Элементы.СтраницаСПЗ.Видимость = Ложь;
		Элементы.СтраницаДоговор.Видимость = Ложь;
		Элементы.СтраницаНоменклатура.Видимость = Истина;    
		Элементы.ПараметрыЗакупки.ТолькоПросмотр = Истина;
		СформироватьОтчет_СПЗСУчетомКорректировки(ОтчетСПЗСУчетомКорректировки);
	ИначеЕсли Запись.Обеспечение = Перечисления.ВариантыВключенияПозицийПотребностей.Лот Тогда
		Элементы.СтраницаПроектСПЗ.Видимость = Истина;
		Элементы.СтраницаСПЗ.Видимость = Ложь;
		Элементы.СтраницаДоговор.Видимость = Ложь;
		Элементы.СтраницаНоменклатура.Видимость = Истина;
		СформироватьОтчет_СПЗСУчетомКорректировки(ОтчетСПЗСУчетомКорректировки);  
		ЭтотОбъект.Заголовок = НСтр("ru = 'Черновик Лота'");
		Элементы.ПараметрыЗакупки.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.Обеспечение = Перечисления.ВариантыВключенияПозицийПотребностей.СПЗ Тогда
		Элементы.СтраницаПроектСПЗ.Видимость = Ложь;
		Элементы.СтраницаСПЗ.Видимость = Истина;
		Элементы.СтраницаДоговор.Видимость = Ложь;
		Элементы.СтраницаНоменклатура.Видимость = Истина;
		СформироватьОтчет_СПЗСУчетомКорректировки(ОтчетСПЗСУчетомКорректировки);
	ИначеЕсли Запись.Обеспечение = Перечисления.ВариантыВключенияПозицийПотребностей.Договор Тогда
		Элементы.СтраницаПроектСПЗ.Видимость = Ложь;
		Элементы.СтраницаСПЗ.Видимость = Ложь;
		Элементы.СтраницаДоговор.Видимость = Истина;
		Элементы.СтраницаНоменклатура.Видимость = Ложь;
	Иначе
		Элементы.ОтчетСПЗСУчетомКорректировки.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьПараметрыЗакупки();
	
	//
	// Установить ОрганизациюЗаказчки
	ЭлементОргЗаказчик = Элементы.Организация;
	ЭлементОргЗаказчик.СписокВыбора.Очистить();
	СписокОрганизацийЗаказчиков = РегистрыСведений.ПроектыСПЗ.СписокОрганизацийЗаказчиков(Запись.Автор, Запись.ПериодЗакупки, Запись.ИД);
	Если ЗначениеЗаполнено(Запись.ОрганизацияЗаказчик) И СписокОрганизацийЗаказчиков.Найти(Запись.ОрганизацияЗаказчик) = неопределено Тогда
		СписокОрганизацийЗаказчиков.Добавить(Запись.ОрганизацияЗаказчик);
	КонецЕсли;
	Колво = СписокОрганизацийЗаказчиков.Количество();
	Если Колво = 0 Тогда
		//Запись.ОрганизацияЗаказчик = Справочники.Организации.ПустаяСсылка();
	Иначе
		//Запись.ОрганизацияЗаказчик = СписокОрганизацийЗаказчиков[0];
		ЭлементОргЗаказчик.СписокВыбора.ЗагрузитьЗначения(СписокОрганизацийЗаказчиков);
	КонецЕсли;
	
	//
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВключитьВНажатие(Элемент, СтандартнаяОбработка)
	
	Если Запись.Обеспечение = ПредопределенноеЗначение("Перечисление.ВариантыВключенияПозицийПотребностей.СПЗ") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Документ.СтрокаПланаЗакупок.ФормаОбъекта", Новый Структура("Ключ", ВключитьВСПЗ));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСПЗСУчетомКорректировкиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка=Ложь;
	
	СтрокаРасшифровки = ПолучитьДанныеРасшифровки(ДанныеРасшифровкиАдрес, Расшифровка);
	Если СтрокаРасшифровки.Поля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаРасшифровки.Поля[0].Поле = "Динамика" Тогда
	
		Поля = Новый Структура;
		Для Каждого Поле Из СтрокаРасшифровки.Поля Цикл
			Поля.Вставить(Поле.Поле, Поле.Значение);
		КонецЦикла;
		
		ШаблонСообщения = НСтр("ru = '%1 (было: %3 %2; изм: %4 %2)         '");
		
		Если НЕ Поля.Свойство("ЕдиницаИзмерения") Тогда
			ЕИ = "";
		Иначе
			ЕИ = Строка(Поля.ЕдиницаИзмерения);
		КонецЕсли;
		
		ДополнительныеДействия = Новый СписокЗначений;
		ДополнительныеДействия.Добавить("Колво", СтрШаблон(ШаблонСообщения, НСтр("ru = 'Кол-во'"), ЕИ, Строка(Поля.Количество), Строка(Поля.К_Колво)));
		ДополнительныеДействия.Добавить("Сумма", СтрШаблон(ШаблонСообщения, НСтр("ru = 'Сумма'"), "", Строка(Поля.Сумма), Строка(Поля.К_Сумма)));
		
		ЗавершениеВыбора = Новый ОписаниеОповещения("ЗаврешениеВыбораДействияРасшифровки", ЭтаФорма);
		
		ПоказатьВыборИзСписка(ЗавершениеВыбора, ДополнительныеДействия);
		
		Возврат;
		
	КонецЕсли;
	
	ДоступныеДействия = Новый Массив;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(
		ДанныеРасшифровкиАдрес, 
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	//
	ВыполненноеДействие = неопределено;
	ПараметрыВыбранногоДействия = неопределено;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДополнительныеПараметры = Новый Структура("Расшифровка", Расшифровка);
	ДополнительныеПараметры.Вставить("СтрокаРасшифровки",СтрокаРасшифровки);
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатОбработкаДополнительнойРасшифровкиПродолжение", ЭтаФорма, ДополнительныеПараметры);
	ОбработкаРасшифровки.ПоказатьВыборДействия(ОписаниеОповещения,Расшифровка, ДоступныеДействия,ДополнительныеДействия);

	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровкиПродолжение(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт
	
	Если ВыполненноеДействие = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		Значение = ПараметрВыполненногоДействия;
		ПараметрыФормы = Новый Структура("Ключ", Значение);
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.Организации") Тогда
			ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.МестаПоставки") Тогда
			ОткрытьФорму("Справочник.МестаПоставки.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.ПриоритетыПотребностей") Тогда
			ОткрытьФорму("Справочник.ПриоритетыПотребностей.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Проекты") Тогда
			ОткрытьФорму("Справочник.Проекты.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
			ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСПЗСУчетомКорректировкиОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыЗакупки

&НаКлиенте
Процедура ПараметрыЗакупкиПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПараметрыЗакупкиОткрытьПравило.Доступность = Элемент.ТекущиеДанные.ДетальнаяЗапись;
	
	Если Элемент.ТекущиеДанные.ДетальнаяЗапись Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент.ТекущиеДанные.Значение) = Тип("Булево") Тогда
		// для булево не отрабатывает событие АвтоПодбор, поэтому принудительно чистим список выбора
		Элементы.ПараметрыЗакупкиЗначение.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗакупкиЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТД = Элементы.ПараметрыЗакупки.ТекущиеДанные;
	
	Если ТипЗнч(ТД.Значение) = Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбораДляСвойства = ПараметрыЗакупки_СпискиВыбора[ТД.Свойство];
	
	СписокВыбора = Элемент.СписокВыбора;
	
	Если СписокВыбора.Количество()> 0 Тогда
		СписокВыбора.Очистить();
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СписокВыбораДляСвойства Цикл
		
		СписокВыбора.Добавить(КлючЗначение.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗакупкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Возврат;
	
	ТД = Элемент.ТекущиеДанные;
	Если ТД = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТД.ПоложениеОЗакупках) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Ключ, УИДУсловия", ТД.ПоложениеОЗакупках, ТД.УИДУсловия);
	ОткрытьФорму("Справочник.ПоложениеОЗакупках.Форма.ФормаЭлемента", ДопПараметры, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьСПЗ(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Черновик СПЗ редактируется. Сохраните черновик и повторите операцию.'"));
		Возврат;
		
	КонецЕсли;
	Закрыть();
	СформироватьСПЗНаОснованииПроектаНаСервере(Запись.Автор, Запись.ОрганизацияЗаказчик, Запись.ПериодЗакупки, Запись.ИД);
	
	Оповестить("ОбработанЧерновикСПЗИзФормы");
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВыключитьВозможностьИзмененияТоварныхПозиций(Команда)
	
	Кнопка = Элементы.ФормаВключитьВыключитьВозможностьИзмененияТоварныхПозиций;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	ПоказатьСпрятатьСтраницуИзменений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПравило(Команда)
	
	ТД = Элементы.ПараметрыЗакупки.ТекущиеДанные;
	Если ТД = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТД.ПоложениеОЗакупках) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Ключ, УИДУсловия", ТД.ПоложениеОЗакупках, ТД.УИДУсловия);
	ОткрытьФорму("Справочник.ПоложениеОЗакупках.Форма.ФормаЭлемента", ДопПараметры, Элементы.ПараметрыЗакупки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	ПотребностиУХ.УстановитьУсловноеОформлениеДереваПараметровЗакупки(ЭтаФорма, "ПараметрыЗакупки");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет_СПЗСУчетомКорректировки(ТабДок)
	
	//Получаем схему из макета
	СКДОтчета = РегистрыСведений.ПроектыСПЗ.ПолучитьМакет("СКД_СПЗСУчетомКорректировки");
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СхемаКомпоновкиДанных) Тогда
		ЭтаФорма.СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКДОтчета, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	МакетОформления = ПолучитьОбщийМакет("ОформлениеОтчетовЗеленый");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СКДОтчета.НастройкиПоУмолчанию;
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Автор"));
	Параметр.Значение = Запись.Автор;
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодЗакупки"));
	Параметр.Значение = Запись.ПериодЗакупки;
	
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИД"));
	Параметр.Значение = Запись.ИД;
	//Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОрганизацияЗаказчик"));
	//Параметр.Значение = Запись.ОрганизацияЗаказчик;
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКДОтчета, Настройки, ДанныеРасшифровки, МакетОформления);
	
	//Очищаем поле табличного документа
	ТабДок.Очистить();
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДанныеРасшифровкиАдрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ЭтаФорма.УникальныйИдентификатор);
	
//	ТабДок.ПоказатьУровеньГруппировокСтрок(1);
//	ТабДок.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьСПЗНаОснованииПроектаНаСервере(Автор, ОрганизацияЗаказчик, ПериодЗакупки, ИД)
	
	РегистрыСведений.ПроектыСПЗ.ОбработатьПроектСПЗ(Автор, ОрганизацияЗаказчик, ПериодЗакупки, ИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаврешениеВыбораДействияРасшифровки(П1, П2) экспорт
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРасшифровки(ДанныеРасшифровкиАдрес, Расшифровка)
	
	ДанныеРасшифровкиКомпоновки = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиАдрес);
	СтрокаДляРасшифровки = ДанныеРасшифровкиКомпоновки.Элементы[Расшифровка];
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", СтрокаДляРасшифровки.Идентификатор);
	Результат.Вставить("ОсновноеДействие", СтрокаДляРасшифровки.ОсновноеДействие);
	Результат.Вставить("Родители", Новый Массив);
	Результат.Вставить("Поля", Новый Массив);
	
	//
	Для Каждого Родитель Из СтрокаДляРасшифровки.ПолучитьРодителей() Цикл
		Инфо = Новый Структура("Идентификатор, ОсновноеДействие");
		ЗаполнитьЗначенияСвойств(Инфо, Родитель);
		Результат.Родители.Добавить(Инфо);
	КонецЦикла;
	
	//
	Для Каждого Поле Из СтрокаДляРасшифровки.ПолучитьПоля() Цикл
		Инфо = Новый Структура("Поле, Значение, Иерархия");
		ЗаполнитьЗначенияСвойств(Инфо, Поле);
		Результат.Поля.Добавить(Инфо);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСпрятатьСтраницуИзменений()
	
	Элементы.СтраницаКорректировкаТоварныхПозиций.Видимость = Элементы.ФормаВключитьВыключитьВозможностьИзмененияТоварныхПозиций.Пометка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЗакупки(ИДПроекта, ПериодЗакупки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИД", ИДПроекта);
	Запрос.УстановитьПараметр("ПериодЗакупки", ПериодЗакупки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыЗакупки.Ссылка КАК Свойство,
	|	ПараметрыЗакупки.НомерПараметра КАК НомерПараметра,
	|	ВЫБОР
	|		КОГДА ПараметрыЗакупки.Предопределенный
	|			ТОГДА ПараметрыЗакупки.ИмяПредопределенныхДанных
	|		ИНАЧЕ ПараметрыЗакупки.Имя
	|	КОНЕЦ КАК Имя
	|ПОМЕСТИТЬ ВТ_ПараметрыЗакупок
	|ИЗ
	|	ПланВидовХарактеристик.ПараметрыЗакупки КАК ПараметрыЗакупки
	|ГДЕ
	|	ПараметрыЗакупки.ЭтоГруппа = ЛОЖЬ
	|	И ПараметрыЗакупки.Ссылка В(&ПараметрыОтбор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыЗакупкиПотребностей1.Автор КАК Автор,
	|	ПараметрыЗакупкиПотребностей1.ПериодЗакупки КАК ПериодЗакупки,
	|	ПараметрыЗакупкиПотребностей1.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
	|	ПараметрыЗакупкиПотребностей1.АналитикаПотребностей КАК АналитикаПотребностей,
	|	ПараметрыЗакупкиПотребностей1.АналитикаСтруктуры КАК АналитикаСтруктуры,
	|	ПараметрыЗакупкиПотребностей1.КлючПараметровЗакупки КАК КлючПараметровЗакупки,
	|	ПараметрыЗакупкиПотребностей1.ПоложениеОЗакупках КАК ПоложениеОЗакупках,
	|	ПараметрыЗакупкиПотребностей1.УИДУсловия КАК УИДУсловия
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ПараметрыЗакупкиПотребностей1 КАК ПараметрыЗакупкиПотребностей1
	|ГДЕ
	|	(ПараметрыЗакупкиПотребностей1.АналитикаНоменклатуры, ПараметрыЗакупкиПотребностей1.АналитикаПотребностей, ПараметрыЗакупкиПотребностей1.АналитикаСтруктуры) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ПроектыСПЗПозиции.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
	|				ПроектыСПЗПозиции.АналитикаПотребностей КАК АналитикаПотребностей,
	|				ПроектыСПЗПозиции.АналитикаСтруктуры КАК АналитикаСтруктуры
	|			ИЗ
	|				РегистрСведений.ПроектыСПЗПозиции КАК ПроектыСПЗПозиции
	|			ГДЕ
	|				ПроектыСПЗПозиции.ИД = &ИД
	|				И НЕ(ПроектыСПЗПозиции.Количество = 0
	|						И ПроектыСПЗПозиции.Сумма = 0))
	|	И ПараметрыЗакупкиПотребностей1.ПериодЗакупки = &ПериодЗакупки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПараметрыЗакупок.Свойство КАК Свойство,
	|	ВТ_ПараметрыЗакупок.Имя КАК Имя,
	|	ВТ_Данные.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
	|	ВТ_Данные.АналитикаПотребностей КАК АналитикаПотребностей,
	|	ВТ_Данные.АналитикаСтруктуры КАК АналитикаСтруктуры,
	|	&УсловиеЗначение КАК Значение,
	|	&УсловиеЗапретИзменения КАК ЗапретИзменения,
	|	ВТ_Данные.ПоложениеОЗакупках КАК ПоложениеОЗакупках,
	|	ВТ_Данные.УИДУсловия КАК УИДУсловия,
	|	ВТ_Данные.КлючПараметровЗакупки КАК КлючПараметровЗакупки
	|ПОМЕСТИТЬ ВТ_ПараметрыЗакупкиДетальные
	|ИЗ
	|	ВТ_ПараметрыЗакупок КАК ВТ_ПараметрыЗакупок,
	|	ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Запрос.Свойство КАК Свойство,
	|	Запрос.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
	|	Запрос.АналитикаПотребностей КАК АналитикаПотребностей,
	|	Запрос.АналитикаСтруктуры КАК АналитикаСтруктуры,
	|	Запрос.Значение КАК Значение,
	|	Запрос.ЗапретИзменения КАК ЗапретИзменения,
	|	Запрос.ПоложениеОЗакупках КАК ПоложениеОЗакупках,
	|	Запрос.УИДУсловия КАК УИДУсловия,
	|	0 КАК ИндексКартинки,
	|	Запрос.ДетальнаяЗапись КАК ДетальнаяЗапись,
	|	Запрос.Свойство.НомерПараметра КАК НомерПараметра
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроектыСПЗПараметры.Свойство КАК Свойство,
	|		ПроектыСПЗПараметры.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
	|		ПроектыСПЗПараметры.АналитикаПотребностей КАК АналитикаПотребностей,
	|		ПроектыСПЗПараметры.АналитикаСтруктуры КАК АналитикаСтруктуры,
	|		ПроектыСПЗПараметры.Значение КАК Значение,
	|		ПроектыСПЗПараметры.ЗапретИзменения КАК ЗапретИзменения,
	|		ПроектыСПЗПараметры.ПоложениеОЗакупках КАК ПоложениеОЗакупках,
	|		ПроектыСПЗПараметры.УИДУсловия КАК УИДУсловия,
	|		ЛОЖЬ КАК ДетальнаяЗапись
	|	ИЗ
	|		РегистрСведений.ПроектыСПЗПараметры КАК ПроектыСПЗПараметры
	|	ГДЕ
	|		ПроектыСПЗПараметры.ИД = &ИД
	|		И (ПроектыСПЗПараметры.АналитикаНоменклатуры, ПроектыСПЗПараметры.АналитикаПотребностей, ПроектыСПЗПараметры.АналитикаСтруктуры) В
	|				(ВЫБРАТЬ
	|					ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияНоменклатуры.ПустаяСсылка),
	|					ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияПотребностей.ПустаяСсылка),
	|					ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияСтруктуры.ПустаяСсылка))
	|		И ПроектыСПЗПараметры.Свойство В(&ПараметрыОтбор)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ПараметрыЗакупкиДетальные.Свойство,
	|		ВТ_ПараметрыЗакупкиДетальные.АналитикаНоменклатуры,
	|		ВТ_ПараметрыЗакупкиДетальные.АналитикаПотребностей,
	|		ВТ_ПараметрыЗакупкиДетальные.АналитикаСтруктуры,
	|		ВТ_ПараметрыЗакупкиДетальные.Значение,
	|		ВТ_ПараметрыЗакупкиДетальные.ЗапретИзменения,
	|		ВТ_ПараметрыЗакупкиДетальные.ПоложениеОЗакупках,
	|		ВТ_ПараметрыЗакупкиДетальные.УИДУсловия,
	|		ИСТИНА
	|	ИЗ
	|		ВТ_ПараметрыЗакупкиДетальные КАК ВТ_ПараметрыЗакупкиДетальные) КАК Запрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Свойство КАК Свойство,
	|	ВТ_Результат.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
	|	ВТ_Результат.АналитикаПотребностей КАК АналитикаПотребностей,
	|	ВТ_Результат.АналитикаСтруктуры КАК АналитикаСтруктуры,
	|	ВТ_Результат.Значение КАК Значение,
	|	ВТ_Результат.ЗапретИзменения КАК ЗапретИзменения,
	|	ВТ_Результат.ПоложениеОЗакупках КАК ПоложениеОЗакупках,
	|	ВТ_Результат.УИДУсловия КАК УИДУсловия,
	|	ВТ_Результат.ИндексКартинки КАК ИндексКартинки,
	|	ВТ_Результат.ДетальнаяЗапись КАК ДетальнаяЗапись,
	|	ВТ_Результат.НомерПараметра КАК НомерПараметра
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат 
	|
	|ГДЕ
	|	ВТ_Результат.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыЗакупки.ГрафикОплаты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Результат.Свойство,
	|	ВТ_Результат.АналитикаНоменклатуры,
	|	ВТ_Результат.АналитикаПотребностей,
	|	ВТ_Результат.АналитикаСтруктуры,
	|	ПоложениеОЗакупкахПараметрыЗакупки.Значение,
	|	ПоложениеОЗакупкахПараметрыЗакупки.ЗапретИзменения,
	|	ВТ_Результат.ПоложениеОЗакупках,
	|	ВТ_Результат.УИДУсловия,
	|	ВТ_Результат.ИндексКартинки,
	|	ВТ_Результат.ДетальнаяЗапись,
	|	ВТ_Результат.НомерПараметра
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоложениеОЗакупках.ПараметрыЗакупки КАК ПоложениеОЗакупкахПараметрыЗакупки
	|		ПО ВТ_Результат.ПоложениеОЗакупках = ПоложениеОЗакупкахПараметрыЗакупки.Ссылка
	|			И ВТ_Результат.УИДУсловия = ПоложениеОЗакупкахПараметрыЗакупки.ИД
	|			И (ПоложениеОЗакупкахПараметрыЗакупки.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыЗакупки.ГрафикОплаты)) 
	|ГДЕ
	|	ВТ_Результат.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыЗакупки.ГрафикОплаты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПараметра,
	|	ДетальнаяЗапись,
	|	АналитикаНоменклатуры,
	|	АналитикаПотребностей,
	|	АналитикаСтруктуры
	|ИТОГИ ПО
	|	Свойство
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	МодифицироватьТекстЗапроса(Запрос);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПараметрыЗакупки(Результат)
	
	// Заполнить реквизит формы ПараметрыЗакупки
	Дерево = РеквизитФормыВЗначение("ПараметрыЗакупки");
	Дерево.Строки.Очистить();
	
	//
	ВыборкаСвойство = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСвойство.Следующий() Цикл
		
		СтрокаДерево = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерево, ВыборкаСвойство);
		
		ВыборкаДетали = ВыборкаСвойство.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			Если ВыборкаДетали.ДетальнаяЗапись Тогда
				
				СтрокаДетали = СтрокаДерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДетали, ВыборкаДетали);  
				
				Если ВыборкаДетали.Свойство = ПланыВидовХарактеристик.ПараметрыЗакупки.ГрафикОплаты Тогда 
					СтрокаДетали.ИндексКартинки = ?(СтрокаДетали.ЗапретИзменения, 0, 1);
				КонецЕсли;
				
			Иначе
				
				//
				СтрокаДерево.Значение = ВыборкаДетали.Значение;
				СтрокаДерево.ЗапретИзменения = ВыборкаДетали.ЗапретИзменения;
				СтрокаДерево.ИндексКартинки = ВыборкаДетали.ИндексКартинки;
				
			КонецЕсли;   
			
			Если СтрокаДерево.Свойство = ПланыВидовХарактеристик.ПараметрыЗакупки.ГрафикОплаты Тогда 
				ПараметрыОплаты = Справочники.ПоложениеОЗакупках.ПолучитьПараметрыОплаты(Запись.ПоложениеОплаты, Запись.УИДУсловияОплаты);   
				СтрокаДерево.Значение = ПараметрыОплаты.ГрафикОплаты;    
				СтрокаДерево.ЗапретИзменения = ПараметрыОплаты.ЗапретИзменения_ГрафикОплаты;   
				СтрокаДерево.ИндексКартинки = ?(СтрокаДерево.ЗапретИзменения, 0, 1);
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ПараметрыЗакупки");
	
	// Рассчитать списки выбора
	РассчитатьСпискиВыбораДляСвойствНовогоПроектаСПЗ(Дерево);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыЗакупки()
	
	// Получить данные запросом
	Результат = ПолучитьПараметрыЗакупки(Запись.ИД, Запись.ПериодЗакупки);
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнить дерево параметров выбора
	ЗаполнитьДеревоПараметрыЗакупки(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МодифицироватьТекстЗапроса(Запрос)
	
	// Параметры закупки
	ПараметрыЗакупки = ПланыВидовХарактеристик.ПараметрыЗакупки.ПолучитьТаблицуНастроекПараметровЗакупки();  
	
	//Уберём скрытые          
	МодифицироватьТекстЗапросаУдалитьПараметр(ПланыВидовХарактеристик.ПараметрыЗакупки.УсловияОплаты, 	ПараметрыЗакупки);
	МодифицироватьТекстЗапросаУдалитьПараметр(ПланыВидовХарактеристик.ПараметрыЗакупки.КалендарьГрафика,ПараметрыЗакупки);
	
	// 
	Значение = "ВЫБОР";
	ЗапретИзменения = "ВЫБОР";
	
	ПараметрыОтбор = Новый Массив;
	
	// Условия получения полей
	Для Каждого Параметр Из ПараметрыЗакупки Цикл
		
		Если Параметр.ЭтоПараметрПозиции Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПараметраСвойство = "Свойство" + Параметр.ПараметрНомер;
		
		Значение = Значение + СтрШаблон("
			|		КОГДА ВТ_ПараметрыЗакупок.Свойство = &%1
			|			ТОГДА ВТ_Данные.КлючПараметровЗакупки.%2", ИмяПараметраСвойство, Параметр.ПараметрИмя);
		
		ЗапретИзменения = ЗапретИзменения + СтрШаблон("
			|		КОГДА ВТ_ПараметрыЗакупок.Свойство = &%1
			|			ТОГДА ВТ_Данные.КлючПараметровЗакупки.%2", ИмяПараметраСвойство, Параметр.ЗапретИзменения);
		
		Запрос.УстановитьПараметр(ИмяПараметраСвойство, Параметр.Параметр);
		
		ПараметрыОтбор.Добавить(Параметр.Параметр);
		
	КонецЦикла;
	
	Значение = Значение + "
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ";
	
	ЗапретИзменения = ЗапретИзменения + "
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗначение", Значение);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗапретИзменения", ЗапретИзменения);
	
	Запрос.УстановитьПараметр("ПараметрыОтбор", ПараметрыОтбор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МодифицироватьТекстЗапросаУдалитьПараметр(Знач Параметр, Знач ПараметрыЗакупки)
	
	Перем Строка, Строки;
	
	Строки = ПараметрыЗакупки.НайтиСтроки(Новый Структура("Параметр", Параметр));
	Если Строки.Количество() Тогда
		Для Каждого Строка Из Строки Цикл
			ПараметрыЗакупки.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РассчитатьСпискиВыбораДляСвойствНовогоПроектаСПЗ(Дерево)
	
	Соответствие = Новый Соответствие;
	
	Для Каждого Строка1 Из Дерево.Строки Цикл
		Соответствие.Вставить(Строка1.Свойство, ПолучитьСписокВыбора(Строка1));
	КонецЦикла;
	
	ПараметрыЗакупки_СпискиВыбора = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбора(СтрокаДерева)
	
	Результат = Новый СписокЗначений;
	
	Для Каждого Строка Из СтрокаДерева.Строки Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Значение) 
			И ТипЗнч(Строка.Значение) <> Тип("Булево") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Результат.НайтиПоЗначению(Строка.Значение) = неопределено Тогда
			Результат.Добавить(Строка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти