
#Область ОбработкаОсновныхСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ПользователиСлужебныйПовтИсп.ЭтоСеансВнешнегоПользователя() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	АккредитацияПоставщиковУХ.УстановитьРеквизитыФормыСпискаДляПоставщика(ЭтаФорма);
	Список.Параметры.УстановитьЗначениеПараметра("АнкетаПоставщика", АнкетаПоставщика);
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;  
	Если ЗначениеЗаполнено(АнкетаПоставщика) Тогда  
		ТаблицаОрганизаций = АккредитацияПоставщиковУХ.ПолучитьСостоянияАккредитацииПоставщика(АнкетаПоставщика,  ТекущаяДата());
		СписокОрганизаций = Новый СписокЗначений();
		Для Каждого Строка ИЗ ТаблицаОрганизаций Цикл
			СписокОрганизаций.Добавить(Строка.Организация);	
		КонецЦикла;         
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(ТИП("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
		ЭлементОтбора.ПравоеЗначение = СписокОрганизаций;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработкаСобытийЭлементовФормы


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Элементы.Список.РежимВыбора; 
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокДокументации(Лот)
	
	Если ТипЗнч(Лот) = Тип("ДокументСсылка.Лот") Тогда
		СписокДокументации.Параметры.УстановитьЗначениеПараметра("ЗакупочнаяПроцедура",Лот.ЗакупочнаяПроцедура);
	Иначе	                                                                                                   
		СписокДокументации.Параметры.УстановитьЗначениеПараметра("ЗакупочнаяПроцедура",Неопределено);
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.СписокДокументации.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Ключ", ТекДанные.ЗакупочнаяДокументация);
	ОткрытьФорму("Документ.ВерсияДокументацииЗакупочныхПроцедур.Форма.ФормаДокумента",ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьСписокДокументации(ТекДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	 ТекДанные = Элементы.Список.ТекущиеДанные;
	 Если ТекДанные<>Неопределено Тогда   
		 СтандартнаяОбработка = Ложь;
		 Значение = ТекДанные.Ссылка;
		 ОповеститьОВыборе(Значение); 
	 КонецЕсли;	 
	
КонецПроцедуры


#КонецОбласти
