#Область ОбработчикиСобытий   

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда  		
		
		Запрос = Новый Запрос;
        Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тн_ПравилаИнтеграционнойСхемы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.тн_ПравилаИнтеграционнойСхемы КАК тн_ПравилаИнтеграционнойСхемы
		|ГДЕ
		|	тн_ПравилаИнтеграционнойСхемы.ИмяОбъектовМетаданных = &ИмяОбъектовМетаданных
		|	И НЕ тн_ПравилаИнтеграционнойСхемы.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ИмяОбъектовМетаданных", ИмяОбъектовМетаданных);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда  
			ОбщегоНазначенияУХ.СообщитьОбОшибке("Запрещено задавать несколько правил на один объект метаданных!", Отказ);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти


