
Функция GetPropertiesOfMetadataObject(InitialData)
	
	ШаблонОписания = InitialData.Получить();
	ШаблонОписания.Вставить("ТекущаяИБ", Ложь);
	
	ТекСоединениеВИБ = ПолучитьКоннекторИБ(ШаблонОписания);
	
	Результат = РаботаСОбъектамиМетаданныхВнешнийУХ.GetPropertiesOfMetadataObject(ТекСоединениеВИБ,ШаблонОписания);			
	Возврат Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
		
КонецФункции

Функция GetArrayOfMetadataObjectsName(InitialData)
	
	СтруктураПараметров=InitialData.Получить();
	
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураПараметров);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.GetArrayOfMetadataObjectsName(ТекСоединениеВИБ,СтруктураПараметров),Новый СжатиеДанных(9));
		
КонецФункции

Функция GetDescriptionOfCustomQuery(InitialData)
	
	ДанныеЗапроса=InitialData.Получить();
	
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеЗапроса);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.GetDescriptionOfCustomQuery(ТекСоединениеВИБ,ДанныеЗапроса),Новый СжатиеДанных(9));
		
КонецФункции

Функция GetTableOfObjectsID(InitialData)
	
	ДанныеОбъектаМД=InitialData.Получить();
	
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеОбъектаМД);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.GetTableOfObjectsID(ТекСоединениеВИБ,ДанныеОбъектаМД),Новый СжатиеДанных(9));
	
КонецФункции

Функция ПолучитьКоннекторИБ(СтруктураПараметров)
	
	Перем ПараметрыПодключения;
	
	СтруктураПараметров.Свойство("ПараметрыПодключения",ПараметрыПодключения);
	
	Если ПараметрыПодключения=Неопределено Тогда 
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.КонтекстМетаданных();
		
	Иначе // Вызываем получение коннектора к ВИБ
		
		
			
	КонецЕсли;
		
КонецФункции // ПолучитьКоннекторИБ()

Функция GetWorkingDataTable(InitialData)
	
	ДанныеДляЗапроса=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеДляЗапроса);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.GetWorkingDataTable(ТекСоединениеВИБ,ДанныеДляЗапроса),Новый СжатиеДанных(9));

КонецФункции

Функция GetDataForReportRegister(InitialData,ConnectionParameters)
	
	ДанныеДляЗапроса=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеДляЗапроса);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.GetDataForReportRegister(ТекСоединениеВИБ,ДанныеДляЗапроса),Новый СжатиеДанных(9));
	
КонецФункции

Функция GetObjectRepresentation(InitialData,ConnectionParameters)
	
	ДанныеДляЗапроса=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеДляЗапроса);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.GetObjectRepresentation(ТекСоединениеВИБ,ДанныеДляЗапроса),Новый СжатиеДанных(9));
	
КонецФункции

Функция FillValueTreeForCatalog(InitialData)
	
	ДанныеЗапроса=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеЗапроса);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.FillValueTreeForCatalog(ТекСоединениеВИБ,ДанныеЗапроса),Новый СжатиеДанных(9));

КонецФункции

Функция FillValueTreeForEnum(InitialData)
	
	ДанныеЗапроса=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеЗапроса);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.FillValueTreeForEnum(ТекСоединениеВИБ,ДанныеЗапроса),Новый СжатиеДанных(9));
		
КонецФункции	

Функция GetObjectsMetadata(InitialData)
	
	МассивЗапросов = InitialData.Получить();
	
	ТекСоединениеВИБ = ПолучитьКоннекторИБ(Новый Структура);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.GetObjectsMetadata(ТекСоединениеВИБ,МассивЗапросов);
	
	Возврат Новый ХранилищеЗначения(РезультатФункции, Новый СжатиеДанных(9));
		
КонецФункции

Функция FillDataOfMDMApplication(InitialData)
	
	Параметрыфункции=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(Параметрыфункции);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.FillDataOfMDMApplication(ТекСоединениеВИБ,Параметрыфункции);
	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
		
КонецФункции  

Функция GetMDMApplication(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.GetMDMApplication(ТекСоединениеВИБ,СтруктураДанных);
	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
		
КонецФункции  

Функция PutMDMApplicationStatus(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.PutMDMApplicationStatus(ТекСоединениеВИБ,СтруктураДанных);
	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
		
КонецФункции 

Функция SetUpControlParameters(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.SetUpControlParameters(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
		
КонецФункции 

Функция GetMDMApplicationHistory(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.GetMDMApplicationHistory(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
		
КонецФункции  

Функция CreateRefreshMDMItems(InitialData)
	
	ВремяНачалаРаботы=ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Параметрыфункции=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(Параметрыфункции);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.CreateRefreshMDMItems(ТекСоединениеВИБ,Параметрыфункции);
	
	ВремяОкончанияРаботы=ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
	
КонецФункции

Функция FillRelatedTableData(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.FillRelatedTableData(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));

КонецФункции

Функция GetRelatedTableData(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.GetRelatedTableData(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));

КонецФункции

Функция GetArrayOfSyncErrors(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.GetArrayOfSyncErrors(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));

КонецФункции

Функция CreateFillObjects(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.CreateFillObjects(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
		
КонецФункции

Функция GetAccountCodes(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных); 
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.GetAccountCodes(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));

КонецФункции

Функция GetAccountUUID(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных); 
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.GetAccountUUID(ТекСоединениеВИБ,СтруктураДанных);	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
	
КонецФункции

Функция QueryProcessing(InitialData)
	// Вставить содержимое обработчика.
КонецФункции

Функция GetReportRepresentation(StringPresentation)
	// Вставить содержимое обработчика.
КонецФункции

Функция FillInAnalyticsByRules(InitialData)
	// Вставить содержимое обработчика.
КонецФункции

Функция FillInMissingItems(InitialData)
	// Вставить содержимое обработчика.
КонецФункции

Функция FillInAssociatedTables(InitialData)
	// Вставить содержимое обработчика.
КонецФункции

Функция SetMDMApplicationErrorText(InitialData)
	
	СтруктураДанных=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(СтруктураДанных);
	
	РезультатФункции=РаботаСОбъектамиМетаданныхВнешнийУХ.SetMDMApplicationErrorText(ТекСоединениеВИБ,СтруктураДанных);
	
	Возврат Новый ХранилищеЗначения(РезультатФункции,Новый СжатиеДанных(9));
	
КонецФункции

Функция GetTranslationData(InitialData)

	ДанныеДляЗапроса=InitialData.Получить();
	ТекСоединениеВИБ=ПолучитьКоннекторИБ(ДанныеДляЗапроса);
	
	Возврат Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.GetTranslationData(ТекСоединениеВИБ,ДанныеДляЗапроса),Новый СжатиеДанных(9));
	
КонецФункции
