
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
	
Функция ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	ДопРеквизиты = "ПериодОтчета, РежимКорректировки, ДатаНачала, ДатаОкончания";
	Реквизиты = МСФОУХ.РеквизитыДокумента(Запрос, ДопРеквизиты, "ПериодОтчета", Отказ);
	Реквизиты.Вставить("КэшГраницыПериода", 	Новый Структура("ДатаНачала,ДатаОкончания", Реквизиты.ДатаНачала, Реквизиты.ДатаОкончания) );//используем период документа
	Реквизиты.Вставить("ВидОперации",			Справочники.ВидыОпераций.КорректировкиПоВНА);
	Реквизиты.Вставить("ИсточникКорректировки",	"РасчетныеДанныеВНА");
	
	ДополнительныеСвойства.ДляПроведения.Вставить("Реквизиты", Реквизиты);
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	Возврат ДополнительныеСвойства;

КонецФункции

#КонецЕсли