#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Заголовок.Заголовок = Параметры.Заголовок;
	Элементы.Текст.Заголовок = Параметры.Текст;
	
	Кнопки = Параметры.Кнопки;
	КнопкаПоУмолчанию = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "КнопкаПоУмолчанию");
	
	Идентификатор = Параметры.Идентификатор;
	ГруппаНастроек = Параметры.ГруппаНастроек;
	Элементы.БольшеНеПоказывать.Видимость = ЗначениеЗаполнено(Идентификатор);
	
	СоздатьКнопки();
	
	ИТК_Форма.ОбработчикПриСозданииНаСервереПосле(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если БольшеНеПоказывать Тогда
		
		Если ЗначениеЗаполнено(ГруппаНастроек) Тогда
			ИТК_Настройки.ЗаписатьЗначение(ГруппаНастроек, Идентификатор, Ложь);
		Иначе
			
			ИмяНастройки = ИТК_ОбщийКлиентСервер.ИдентификаторНастройкиБольшеНеПоказыватьВопрос(Идентификатор);
			СохранитьНастройкуБольшеНеПоказыватьУстаревщее(ИмяНастройки);
			
		КонецЕсли;
			
		ИмяСобытия = ИТК_НастройкиКлиентСервер.ИмяСобытияНастройкиИзменены();
		Оповестить(ИмяСобытия);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключаемаяКомандаКнопки(Команда)

	ИндексКнопки = ИТК_Строки.ИндексИдентификатора(Команда.Имя);
	Результат = Кнопки[ИндексКнопки].Значение;
	
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКнопки()
	
	ИндексКнопки = 0;
	Для Каждого ЭлементКнопка Из Кнопки Цикл 
		
		ИмяКоманды = СтрШаблон("Команда%1", ИндексКнопки);
		
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Заголовок = ЭлементКнопка.Представление;
		НоваяКоманда.Действие = "ПодключаемаяКомандаКнопки";
		
		НоваяКнопка = Элементы.Добавить("Кнопка" + ИндексКнопки, Тип("КнопкаФормы"), Элементы.ГруппаКнопки);
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
		ИТК_ФормаКлиентСервер.УстановитьКнопкуПоУмолчанию(НоваяКнопка, (КнопкаПоУмолчанию = ЭлементКнопка.Значение));
		
		Если НоваяКнопка.КнопкаПоУмолчанию Тогда
			НоваяКнопка.АктивизироватьПоУмолчанию = Истина;
		КонецЕсли;
		
		ИндексКнопки = ИндексКнопки + 1;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуБольшеНеПоказыватьУстаревщее(Имя)
	
	ВидИнструмента = ИТК_Перечисления.ИнструментКонсольРазработчика();
	
	Настройки = ИТК_Настройки.Загрузить(ВидИнструмента);
	Настройки[Имя] = Истина;
	ИТК_Настройки.Сохранить(Настройки, ВидИнструмента);
	
КонецПроцедуры

#КонецОбласти