
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	УправлениеЭлементами()
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСправочникВидыДоходовНДФЛ(Команда)
	ОткрытьФорму("Справочник.ВидыДоходовНДФЛ.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыВычетовНДФЛ(Команда)
	ОткрытьФорму("Справочник.ВидыВычетовНДФЛ.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыДоходовПоСтраховымВзносам(Команда)
	ОткрытьФорму("Справочник.ВидыДоходовПоСтраховымВзносам.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыТарифовСтраховыхВзносов(Команда)
	ОткрытьФорму("Справочник.ВидыТарифовСтраховыхВзносов.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникГрафикиРаботыСотрудников(Команда)
	ОткрытьФорму("Справочник.ГрафикиРаботыСотрудников.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыИспользованияРабочегоВремени(Команда)
	ОткрытьФорму("Справочник.ВидыИспользованияРабочегоВремени.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыРаботСотрудников(Команда)
	ОткрытьФорму("Справочник.ВидыРаботСотрудников.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения(Команда)
	ОткрытьФорму("Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПланВидовРасчетаНачисления(Команда)
	ОткрытьФорму("ПланВидовРасчета.Начисления.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПланВидовРасчетаУдержания(Команда)
	ОткрытьФорму("ПланВидовРасчета.Удержания.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПоказателиРасчетаЗарплаты(Команда)
	ОткрытьФорму("Справочник.ПоказателиРасчетаЗарплаты.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПодразделенияОрганизаций(Команда)
	ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникДолжности(Команда)
	ОткрытьФорму("Справочник.Должности.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыДокументовВводДанныхДляРасчетаЗарплаты(Команда)
	ОткрытьФорму("Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСпособыОтраженияЗарплатыВБухУчете(Команда)
	ОткрытьФорму("Справочник.СпособыОтраженияЗарплатыВБухУчете.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникРезервы(Команда)
	
	ПараметрыОткрытия = Новый Структура("КлючНазначенияИспользования", "РезервыПоОплатеТруда");
	ОткрытьФорму("Справочник.Резервы.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНастройкиРасчетаРезервовПоОплатеТруда(Команда)
	ОткрытьФорму("Справочник.НастройкиРасчетаРезервовПоОплатеТруда.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникЗарплатныеПроекты(Команда)
	ОткрытьФорму("Справочник.ЗарплатныеПроекты.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникМестаРаботы(Команда)
	ОткрытьФорму("Справочник.МестаРаботы.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникТерриторииВыполненияРабот(Команда)
	ОткрытьФорму("Справочник.ТерриторииВыполненияРабот.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуЗаконодательныеЗначения(Команда)
	ОткрытьФорму("Обработка.РедактированиеЗаконодательныхЗначений.Форма.Форма", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникОсобыеУсловияТрудаПФР(Команда)
	ОткрытьФорму("Справочник.ОсобыеУсловияТрудаПФР.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникТерриториальныеУсловияПФР(Команда)
	ОткрытьФорму("Справочник.ТерриториальныеУсловияПФР.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПараметрыИсчисляемогоСтраховогоСтажа(Команда)
	ОткрытьФорму("Справочник.ПараметрыИсчисляемогоСтраховогоСтажа.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникОснованияДосрочногоНазначенияПенсии(Команда)
	ОткрытьФорму("Справочник.ОснованияДосрочногоНазначенияПенсии.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОснованияДосрочногоНазначенияПенсииДляСЗВК(Команда)
	ОткрытьФорму("Справочник.ОснованияДосрочногоНазначенияПенсииДляСЗВК.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникОснованияИсчисляемогоСтраховогоСтажа(Команда)
	ОткрытьФорму("Справочник.ОснованияИсчисляемогоСтраховогоСтажа.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыОбщественноПолезнойДеятельностиСЗВК(Команда)
	ОткрытьФорму("Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникТарифныеСетки(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВидТарифнойСетки", ПредопределенноеЗначение("Перечисление.ВидыТарифныхСеток.Тариф"));
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Справочник.ТарифныеСетки.ФормаСписка", 
		ПараметрыОткрытия, 
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникРазрядыКатегорииДолжностей(Команда)
	ОткрытьФорму("Справочник.РазрядыКатегорииДолжностей.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыПрочихДоходовФизическихЛиц(Команда)
	ОткрытьФорму("Справочник.ВидыПрочихДоходовФизическихЛиц.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыВыплатБывшимСотрудникам(Команда)
	ОткрытьФорму("Справочник.ВидыВыплатБывшимСотрудникам.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСпособыВыплатыЗарплаты(Команда)
	ОткрытьФорму("Справочник.СпособыВыплатыЗарплаты.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСпособыОкругления(Команда)
	ОткрытьФорму("Справочник.СпособыОкругленияПриРасчетеЗарплаты.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТарифыПлатежныхАгентов(Команда)
	ОткрытьФорму("Справочник.ТарифыПлатежныхАгентов.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	Элементы.ОткрытьВидыНачислений.Видимость = ПравоДоступа("Просмотр", Метаданные.ПланыВидовРасчета.Начисления);
	Элементы.ОткрытьВидыУдержаний.Видимость  = ПравоДоступа("Просмотр", Метаданные.ПланыВидовРасчета.Удержания);
	
	Элементы.ОткрытьПоказателиРасчетаЗарплаты.Видимость  = ПравоДоступа("Просмотр", Метаданные.Справочники.ПоказателиРасчетаЗарплаты);
	Элементы.ОткрытьШаблоныВводаИсходныхДанных.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты);
	
	Элементы.ОткрытьКвалификационныеРазряды.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.РазрядыКатегорииДолжностей)
		И (ПолучитьФункциональнуюОпцию("ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании")
			ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьТарифныеСеткиПриРасчетеЗарплаты"));
	
	Элементы.ОткрытьТарифныеСетки.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ТарифныеСетки)
		И ПолучитьФункциональнуюОпцию("ИспользоватьТарифныеСеткиПриРасчетеЗарплаты");
	
	Элементы.ОткрытьПодразделенияОрганизаций.Видимость  = ПравоДоступа("Просмотр", Метаданные.Справочники.ПодразделенияОрганизаций);
	Элементы.ОткрытьТерриторииВыполненияРабот.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ТерриторииВыполненияРабот)
		И ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеТерритории");
	
	Элементы.ОткрытьДолжности.Видимость   = ПравоДоступа("Просмотр", Метаданные.Справочники.Должности);
	Элементы.ОткрытьМестаРаботы.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.МестаРаботы)
		И ПолучитьФункциональнуюОпцию("ИспользоватьКраткосрочныеИзмененияОплатыТрудаВЗависимостиОтВыполняемойРаботы");
	
	Элементы.ОткрытьВидыРаботСотрудников.Видимость     = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыРаботСотрудников);
	Элементы.ОткрытьСпособыОтраженияЗарплаты.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.СпособыОтраженияЗарплатыВБухУчете);
	
	Элементы.ОткрытьРезервыНаОплатуТруда.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.Резервы);
	Элементы.ОткрытьНастройкиРасчетаРезервовПоОплатеТруда.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.НастройкиРасчетаРезервовПоОплатеТруда)
		И ПолучитьФункциональнуюОпцию("ИспользоватьРезервыПоОплатеТруда");
	
	Элементы.ОткрытьВидыПрочихДоходовФизическихЛиц.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыПрочихДоходовФизическихЛиц)
		И ПолучитьФункциональнуюОпцию("ИспользоватьРегистрациюПрочихДоходов");
	
	Элементы.ОткрытьГрафикиРаботыСотрудников.Видимость         = ПравоДоступа("Просмотр", Метаданные.Справочники.ГрафикиРаботыСотрудников);
	Элементы.ОткрытьВидыИспользованияРабочегоВремени.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыИспользованияРабочегоВремени);
	
	Элементы.ОткрытьЗарплатныеПроекты.Видимость           = ПравоДоступа("Просмотр", Метаданные.Справочники.ЗарплатныеПроекты);
	Элементы.ОткрытьВидыВыплатБывшимСотрудникам.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыВыплатБывшимСотрудникам)
		И ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыБывшимСотрудникам");
	
	Элементы.ОткрытьСпособыВыплатыЗарплаты.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.СпособыВыплатыЗарплаты);
	Элементы.ОткрытьСпособыОкругления.Видимость      = ПравоДоступа("Просмотр", Метаданные.Справочники.СпособыОкругленияПриРасчетеЗарплаты);
	
	Элементы.ОткрытьТарифыПлатежныхАгентов.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ТарифыПлатежныхАгентов)
		И ПолучитьФункциональнуюОпцию("ИспользоватьИсполнительныеЛисты");
	
	Элементы.ОткрытьЗаконодательныеЗначения.Видимость = ПравоДоступа("Просмотр", Метаданные.Обработки.РедактированиеЗаконодательныхЗначений);
	
	Элементы.ОткрытьВидыДоходовНДФЛ.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыДоходовНДФЛ);
	Элементы.ОткрытьВидыВычетовНДФЛ.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыВычетовНДФЛ);
	
	Элементы.ОткрытьВидыДоходовПоСтраховымВзносам.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыДоходовПоСтраховымВзносам);
	Элементы.ОткрытьВидыТарифовСтраховыхВзносов.Видимость   = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыТарифовСтраховыхВзносов);
	
	Элементы.ОткрытьОсобыеУсловияТрудаСФР.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ОсобыеУсловияТрудаПФР)
		И ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией");
	Элементы.ОткрытьТерриториальныеУсловия.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ТерриториальныеУсловияПФР);
	
	Элементы.ОткрытьОснованияИсчисляемогоСтраховогоСтажа.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ОснованияДосрочногоНазначенияПенсии);
	Элементы.ОткрытьПараметрыИсчисляемогоСтраховогоСтажа.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ПараметрыИсчисляемогоСтраховогоСтажа);
	
	Элементы.ОткрытьСпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения.Видимость =
		ПравоДоступа("Просмотр", Метаданные.Справочники.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения)
		И ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией");
	Элементы.ОткрытьОснованияДосрочногоНазначенияПенсии.Видимость =
		ПравоДоступа("Просмотр", Метаданные.Справочники.ОснованияДосрочногоНазначенияПенсии)
		И ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией");
	
	Элементы.ОткрытьВидыОбщественноПолезнойДеятельностиСЗВК.Видимость =
		ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК);
	Элементы.ОткрытьОснованияДосрочногоНазначенияПенсииДляСЗВК.Видимость =
		ПравоДоступа("Просмотр", Метаданные.Справочники.ОснованияДосрочногоНазначенияПенсииДляСЗВК)
		И ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией");
	
КонецПроцедуры

#КонецОбласти
 