
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СтрокаРасшифровки") ИЛИ НЕ Параметры.СтрокаРасшифровки.Свойство("Поля") Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Поля = Параметры.СтрокаРасшифровки.Поля;
	
	ТекущийАналог = Поля.АналогНоменклатура;
	ТекущийАналогЕдиницаИзмерения = Поля.АналогЕдиницаИзмерения;
	Если Поля.Свойство("АналогХарактеристика") Тогда
		ТекущийАналогХарактеристика = Параметры.СтрокаРасшифровки.Поля.АналогХарактеристика;
	КонецЕсли;
	
	//
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Номенклатура", Поля.Номенклатура);
	
	Если Поля.Свойство("Характеристика") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "Характеристика", Поля.Характеристика);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ЕдиницаИзмерения", Поля.ЕдиницаИзмерения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
