
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
		
	РегистрМатрицыПолномочий = РегистрыСведений.РегистрМатрицыПолномочий.СоздатьНаборЗаписей();
    РегистрМатрицыПолномочий.Отбор.ШаблонДокументаБД.Установить(Объект.Ссылка);
	РегистрМатрицыПолномочий.Отбор.ДокументБД.Установить(Справочники.ДокументыБД.НайтиПоНаименованию("РакурсДанных",,,Справочники.ТипыБазДанных.ТекущаяИБ));
	
	мРегистрМатрицыПолномочий = РегистрМатрицыПолномочий.Добавить();
	мРегистрМатрицыПолномочий.ШаблонДокументаБД = Объект.Ссылка;
	мРегистрМатрицыПолномочий.ДокументБД = Справочники.ДокументыБД.НайтиПоНаименованию("РакурсДанных",,,Справочники.ТипыБазДанных.ТекущаяИБ);
	
	мРегистрМатрицыПолномочий.Исполняющий = Объект.Ответственный;
	мРегистрМатрицыПолномочий.Согласование = Объект.Согласование;
	
	РегистрМатрицыПолномочий.Записать(Истина);


КонецПроцедуры
