&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Ответ", КодВозвратаДиалога.ОК);
	СтруктураОтвета.Вставить("ПроцентнаяСтавка", Объект.ПроцентнаяСтавка);
	Результат = СтруктураОтвета;
	Закрыть(Результат);
		
КонецПроцедуры   

&НаКлиенте
Процедура Отмена(Команда)
	
	ОчиститьСообщения();
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Ответ", КодВозвратаДиалога.Отмена);
	Результат = СтруктураОтвета;
	Закрыть(Результат);
		
КонецПроцедуры