
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АбсолютноеПредставление = ?(Параметры.АбсолютноеПредставление, 0, 1);
	
	Если НЕ Параметры.Цвет_Корректно=Новый Цвет(0, 0, 0) Тогда
		Цвет_Корректно          = Параметры.Цвет_Корректно;
	Иначе
		Цвет_Корректно          = Новый Цвет(192, 220, 192);
	КонецЕсли;
	
	Если НЕ Параметры.Цвет_Превышение=Новый Цвет(0, 0, 0) Тогда
		Цвет_Превышение          = Параметры.Цвет_Превышение;
	Иначе
		Цвет_Превышение          = Новый Цвет(255, 228, 225);
	КонецЕсли;
	
	Если НЕ Параметры.Цвет_НеполныеДанные=Новый Цвет(0, 0, 0) Тогда
		Цвет_НеполныеДанные          = Параметры.Цвет_НеполныеДанные;
	Иначе
		Цвет_НеполныеДанные          = Новый Цвет(255, 255, 225);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Оповестить("НовыеПараметры", Новый Структура("АбсолютноеПредставление, Цвет_Корректно, Цвет_Превышение, Цвет_НеполныеДанные"
												, АбсолютноеПредставление = 0
												, Цвет_Корректно
												, Цвет_Превышение
												, Цвет_НеполныеДанные));
												
	Закрыть();
	
КонецПроцедуры
