
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийВнешнийПользователь) Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Получатель");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;        
		ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийВнешнийПользователь;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;	

КонецПроцедуры



#конецОбласти