#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
	КонецЕсли;
	
	УстановитьОтображениеПодсказкиКодаДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТолькоПросмотр = Объект.Предопределенный;
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументСвязанныйСРаботойПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КодКадровогоДокументаПриИзменении(Элемент)
	
	УстановитьОтображениеПодсказкиКодаДокумента();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормы(УправляемаяФорма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"КодКадровогоДокумента",
		"Доступность",
		УправляемаяФорма.Объект.ДокументСвязанныйСРаботой);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеПодсказкиКодаДокумента()
	
	НаименованиеКода = "";
	Если Объект.ДокументСвязанныйСРаботой Тогда
		СвойстваКода = ЭДОБЗКПовтИсп.СвойстваКодаКадровогоДокумента(
			Объект.КодКадровогоДокумента);
		Если СвойстваКода <> Неопределено Тогда
			НаименованиеКода = СвойстваКода.НаименованиеПолное;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КодКадровогоДокумента",
		"Подсказка",
		НаименованиеКода);
	
КонецПроцедуры

#КонецОбласти
