#Область ПрограммныйИнтерфейс
Процедура УстановитьПараметрыВыбораФормаЗаписи(Запись, ПараметрыВыбораДоговора) Экспорт

	Если Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.Страхование Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Справочники.ВидыДоговоровКонтрагентовУХ.Страхование));
	ИначеЕсли Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.Спецификация Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.БазовыйДоговор", Запись.БазовыйДоговор));
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидСоглашения", Перечисления.ВидыСоглашений.Спецификация));
	ИначеЕсли Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.ОбеспечениеВыданное Тогда
		ВидыДоговоров = Новый Массив;
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ЗалогиИПоручительстваИсходящие);
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.АккредитивВыданный);
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ГарантияВыданная);
		
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Новый ФиксированныйМассив(ВидыДоговоров)));

	ИначеЕсли Запись.ВидСвязи = Справочники.ВидыСвязейОбъектов.ОбеспечениеПолученное Тогда
		ВидыДоговоров = Новый Массив;
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ЗалогиИПоручительстваВходящие);
		ВидыДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ГарантияПолученная);
		
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Новый ФиксированныйМассив(ВидыДоговоров)));

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
