
#Область ПрограммныйИнтерфейс

#Область ФормыНастроекРасчетаПоказателей

// Заполняет элементы обработки показателей отчетов
//
// Параметры:
//  Форма		 - ФормаКлиентскогоПриложения - Форма для которой происходит заполнение элементов
//  Параметры	 - Структура - Структура с параметрами заполнения
//
Процедура ЗаполнитьЭлементыОбработкиПоказателейОтчетов(Форма, Параметры) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Очистить();
	ЭлементыФормы.ПравилоОбработки.СписокВыбора.Очистить();
	ЭлементыФормы.ПравилоПроверки.СписокВыбора.Очистить();
	ЭлементыФормы.БланкДляИмпорта.СписокВыбора.Очистить();
	ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Параметры.ВидОтчета)
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.УправлениеПериодом) Тогда
		Возврат;
	КонецЕсли;

	// Варианты заполнения отчетов
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОтчета", Параметры.ВидОтчета);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("УправлениеПериодом", Параметры.УправлениеПериодом);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УправлениеПериодомСценария.ВерсияОрганизационнойСтруктуры КАК ВерсияОрганизационнойСтруктуры,
		|	УправлениеПериодомСценария.ТекущаяПериодичность КАК Периодичность,
		|	УправлениеПериодомСценария.ТекущаяПериодичность.Порядок КАК ТекущаяПериодичностьПорядок
		|ПОМЕСТИТЬ втРегламенты
		|ИЗ
		|	Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|ГДЕ
		|	УправлениеПериодомСценария.Ссылка В (&УправлениеПериодом)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(втРегламенты.ТекущаяПериодичностьПорядок) КАК МаксимальнаяПериодичностьПорядок
		|ПОМЕСТИТЬ втМаксимальнаяПериодичность
		|ИЗ
		|	втРегламенты КАК втРегламенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаОбработки.Ссылка КАК ПравилоОбработки
		|ИЗ
		|	Справочник.ПравилаОбработки КАК ПравилаОбработки
		|ГДЕ
		|	ПравилаОбработки.Владелец = &ВидОтчета
		|	И НЕ ПравилаОбработки.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаПроверки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПравилаПроверки КАК ПравилаПроверки
		|ГДЕ
		|	ПравилаПроверки.Владелец = &ВидОтчета
		|	И НЕ ПравилаПроверки.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БланкиОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БланкиОтчетов КАК БланкиОтчетов
		|ГДЕ
		|	БланкиОтчетов.Владелец = &ВидОтчета
		|	И БланкиОтчетов.РежимБланка = 2
		|	И НЕ БланкиОтчетов.БланкДляОтображения
		|	И НЕ БланкиОтчетов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.ОрганизационнаяЕдиницаРодитель) КАК ЕстьКонсолидирующиеОрганизации,
		|	ЕСТЬNULL(МАКСИМУМ(ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.Ссылка.ИспользоватьРасширенныеНастройкиПериметра), ЛОЖЬ) КАК ИспользоватьРасширенныеНастройкиПериметра
		|ИЗ
		|	Справочник.ВерсииРегламентовПодготовкиОтчетности.СтруктураГруппы КАК ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегламенты КАК Регламенты
		|		ПО ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.Ссылка = Регламенты.ВерсияОрганизационнойСтруктуры
		|ГДЕ
		|	ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.ОрганизационнаяЕдиницаРодитель В (&Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(Организации.ЭлиминирующаяОрганизация), ЛОЖЬ) КАК ЭлиминирующаяОрганизация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка В (&Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыОтчетов.ВидАналитики1 КАК ВидАналитики1
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	ВидыОтчетов.Ссылка = &ВидОтчета
		|	И ВидыОтчетов.ВидАналитики1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Периодичность.Ссылка КАК МаксимальнаяПериодичность
		|ИЗ
		|	Перечисление.Периодичность КАК Периодичность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимальнаяПериодичность КАК втМаксимальнаяПериодичность
		|		ПО Периодичность.Порядок = втМаксимальнаяПериодичность.МаксимальнаяПериодичностьПорядок
		|ГДЕ
		|	Периодичность.Ссылка <> ЗНАЧЕНИЕ(Перечисление.Периодичность.День)";
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	// По правилу обработки
	РезультатЗапроса = ПакетРезультатовЗапроса.Получить(2);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.ПоПравилуОбработки);
		
		// Загрузим правила обработки
		ЭлементыФормы.ПравилоОбработки.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));
		Если НЕ ЗначениеЗаполнено(Форма.ПравилоОбработки)
			ИЛИ ЭлементыФормы.ПравилоОбработки.СписокВыбора.НайтиПоЗначению(Форма.ПравилоОбработки) = Неопределено Тогда
			Форма.ПравилоОбработки = ЭлементыФормы.ПравилоОбработки.СписокВыбора.Получить(0).Значение;
		КонецЕсли;
		ЗаполнитьЭлементВнешняяИнформационнаяБаза(Форма);
		
		// Загрузим правила проверки
		РезультатЗапроса = ПакетРезультатовЗапроса.Получить(3);
		Если Не РезультатЗапроса.Пустой() Тогда
			ЭлементыФормы.ПравилоПроверки.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));
			Если НЕ ЗначениеЗаполнено(Форма.ПравилоПроверки)
				ИЛИ ЭлементыФормы.ПравилоПроверки.СписокВыбора.НайтиПоЗначению(Форма.ПравилоПроверки) = Неопределено Тогда
				Форма.ПравилоПроверки = ЭлементыФормы.ПравилоПроверки.СписокВыбора.Получить(0).Значение;
			КонецЕсли;
		Иначе
			ЭлементыФормы.ПравилоПроверки.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Импорт
	РезультатЗапроса = ПакетРезультатовЗапроса.Получить(4);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Импорт);
		
		ЭлементыФормы.БланкДляИмпорта.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));
		Если НЕ ЗначениеЗаполнено(Форма.БланкДляИмпорта)
			ИЛИ ЭлементыФормы.БланкДляИмпорта.СписокВыбора.НайтиПоЗначению(Форма.БланкДляИмпорта) = Неопределено Тогда
			Форма.БланкДляИмпорта = ЭлементыФормы.БланкДляИмпорта.СписокВыбора.Получить(0).Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	// Консолидация
	РезультатЗапроса = ПакетРезультатовЗапроса.Получить(5);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.ЕстьКонсолидирующиеОрганизации Тогда
			ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Консолидация);
		КонецЕсли;
		
	КонецЕсли;
	
	// Элиминация
	РезультатЗапроса = ПакетРезультатовЗапроса.Получить(6);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ЭлиминирующаяОрганизация Тогда
			ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Элиминация);
		КонецЕсли;
		
	КонецЕсли;
	
	// Свернув по аналитикам
	РезультатЗапроса = ПакетРезультатовЗапроса.Получить(7);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.СвернувПоАналитикам);
	КонецЕсли;
	
	// Свернув по периоду
	РезультатЗапроса = ПакетРезультатовЗапроса.Получить(8);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.СвернувПоПериоду);
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Периодичность = Выборка.МаксимальнаяПериодичность;
		
		ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Добавить(Перечисления.Периодичность.День);
		Если Периодичность <> Перечисления.Периодичность.Неделя Тогда
			ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Добавить(Перечисления.Периодичность.Неделя);
			Если Периодичность <> Перечисления.Периодичность.Декада Тогда
				ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Добавить(Перечисления.Периодичность.Декада);
				Если Периодичность <> Перечисления.Периодичность.Месяц Тогда
					ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Добавить(Перечисления.Периодичность.Месяц);
					Если Периодичность <> Перечисления.Периодичность.Квартал Тогда
						ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Добавить(Перечисления.Периодичность.Квартал);
						Если Периодичность <> Перечисления.Периодичность.Полугодие Тогда
							ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Добавить(Перечисления.Периодичность.Полугодие);
							Если Периодичность <> Перечисления.Периодичность.ДевятьМесяцев Тогда
								ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Добавить(Перечисления.Периодичность.ДевятьМесяцев);    
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Форма.ПериодичностьСвертывания)
			ИЛИ ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.НайтиПоЗначению(Форма.ПериодичностьСвертывания) = Неопределено Тогда
			Форма.ПериодичностьСвертывания = ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Получить(ЭлементыФормы.ПериодичностьСвертывания.СписокВыбора.Количество()-1).Значение;
		КонецЕсли;
		
	Иначе
		
		ЭлементыФормы.ПериодичностьСвертывания.Видимость = Ложь;
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Форма.СпособФормированияОтчета)
		ИЛИ ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.НайтиПоЗначению(Форма.СпособФормированияОтчета) = Неопределено Тогда
		Если ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Количество() > 0 Тогда
			Форма.СпособФормированияОтчета = ЭлементыФормы.СпособФормированияОтчета.СписокВыбора.Получить(0).Значение;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьЭлементыНастройкиВидовОтчетов(Форма);
	
КонецПроцедуры

// Заполняет элемент используемая ИБ
//
// Параметры:
//  Форма		 - ФормаКлиентскогоПриложения - Форма для которой происходит заполнение элементов
//
Процедура ЗаполнитьЭлементВнешняяИнформационнаяБаза(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Форма.ПравилоОбработки) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВнешниеИнформационныеБазы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаОбработки КАК ПравилаОбработки
			|		ПО ВнешниеИнформационныеБазы.ТипБД = ПравилаОбработки.ТипБД
			|ГДЕ
			|	ПравилаОбработки.Ссылка = &ПравилоОбработки";
		
		Запрос.УстановитьПараметр("ПравилоОбработки", Форма.ПравилоОбработки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
		
			ЭлементыФормы.ВнешняяИнформационнаяБаза.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));
			Если НЕ ЗначениеЗаполнено(Форма.ВнешняяИнформационнаяБаза)
				ИЛИ ЭлементыФормы.ВнешняяИнформационнаяБаза.СписокВыбора.НайтиПоЗначению(Форма.ВнешняяИнформационнаяБаза) = Неопределено Тогда
				Форма.ВнешняяИнформационнаяБаза = ЭлементыФормы.ВнешняяИнформационнаяБаза.СписокВыбора.Получить(0).Значение;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Форма.ВнешняяИнформационнаяБаза = Неопределено;
		
	КонецЕсли;
	
	ЭлементыФормы.ВнешняяИнформационнаяБаза.Видимость = ЗначениеЗаполнено(Форма.ВнешняяИнформационнаяБаза);
	
КонецПроцедуры

// Настраивает элементы формы в зависимости от способа формирования отчета
//
// Параметры:
//  Форма		 - ФормаКлиентскогоПриложения - Форма для которой происходит заполнение элементов
//
Процедура НастроитьЭлементыНастройкиВидовОтчетов(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ВнешняяИнформационнаяБаза.Видимость = Ложь;
	ЭлементыФормы.БланкДляИмпорта.Видимость = Ложь;
	ЭлементыФормы.ПериодичностьСвертывания.Видимость = Ложь;
	
	Если Форма.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.ПоПравилуОбработки Тогда
		ЭлементыФормы.ВнешняяИнформационнаяБаза.РежимВыбораИзСписка = Истина;
		ЗаполнитьЭлементВнешняяИнформационнаяБаза(Форма);
	ИначеЕсли Форма.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Импорт Тогда
		ЭлементыФормы.БланкДляИмпорта.Видимость = Истина;
		ЗаполнитьЭлементВнешняяИнформационнаяБаза(Форма);
		ЭлементыФормы.ВнешняяИнформационнаяБаза.Видимость = Истина;
	ИначеЕсли Форма.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.СвернувПоПериоду Тогда
		ЭлементыФормы.ПериодичностьСвертывания.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Ограничивает список выбора организаций по регламенту
//
// Параметры:
//  Регламент			 - СправочникСсылка.ВерсииРегламентовПодготовкиОтчетности - Регламент подготовки отчетности
//  РеквизитОрганизация	 - РеквизитФормы - Реквизит формы "Организация"
//  ЭлементОрганизация	 - ПолеФормы - Элемент формы "Организация"
//
Процедура ОграничитьОрганизацииПоРегламенту(Регламент, РеквизитОрганизация, ЭлементОрганизация) Экспорт
	
	Если ЗначениеЗаполнено(Регламент) Тогда
		
		СписокДоступныхОрганизаций = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВерсииРегламентовПодготовкиОтчетностиОрганизационныеЕдиницы.ОрганизационнаяЕдиница КАК ОрганизационнаяЕдиница
			|ИЗ
			|	Справочник.ВерсииРегламентовПодготовкиОтчетности.ОрганизационныеЕдиницы КАК ВерсииРегламентовПодготовкиОтчетностиОрганизационныеЕдиницы
			|ГДЕ
			|	ВерсииРегламентовПодготовкиОтчетностиОрганизационныеЕдиницы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Регламент);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокДоступныхОрганизаций.Добавить(Выборка.ОрганизационнаяЕдиница);
		КонецЦикла;
		
		УстановитьПараметрыВыбора(ЭлементОрганизация, "Отбор.Ссылка", Новый ФиксированныйМассив(СписокДоступныхОрганизаций));
		
		Если СписокДоступныхОрганизаций.Найти(РеквизитОрганизация) = Неопределено Тогда
			РеквизитОрганизация = Неопределено;
		КонецЕсли;
		
		ЭлементОрганизация.Доступность = Истина;
		
	Иначе
		РеквизитОрганизация = Неопределено;
		ЭлементОрганизация.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Установить параметры выбора
//
// Параметры:
//  Элемент	 - ПолеФормы - Элемент формы для которого устанавливаются параметры выбора
//  Отбор	 - Строка - Отбор для установки параметров выбора
//  Значение - Произвольный - Значение для установки параметров выбора
//
Процедура УстановитьПараметрыВыбора(Элемент, Отбор, Значение) Экспорт
	
	НовыйПараметр = Новый ПараметрВыбора(Отбор, Значение);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметрыВыбора;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти



