
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		
		НастраиваемыйОбъект = ТекДанные.НастраиваемыйОбъект;
		
		ЭтоПроизвольныйОтчет	 =  "СправочникСсылка.ПроизвольныеОтчеты";
		ЭтоПанельОтчетов		 =  "СправочникСсылка.УдалитьПанелиОтчетов";
		Если ТипЗнч(НастраиваемыйОбъект) = Тип(ЭтоПроизвольныйОтчет) ИЛИ ТипЗнч(НастраиваемыйОбъект) = Тип(ЭтоПанельОтчетов) Тогда
			
			СтандартнаяОбработка = Ложь;
			ПодменюВыбора = Новый СписокЗначений;
			ПодменюВыбора.Добавить(1, НСтр("ru = 'Открыть элемент с выбранной настройкой'"));
			ПодменюВыбора.Добавить(2, НСтр("ru = 'Открыть форму настройки'"));
			РезультатВыбора = Неопределено;
			
			Оповещение = Новый ОписаниеОповещения("СписокВыборЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока));
			ПоказатьВыборИзМеню(Оповещение, ПодменюВыбора, Элемент);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
        
    РезультатВыбора = ВыбранныйЭлемент;
    Если РезультатВыбора <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Ключ, РежимРедактирования", ТекущаяСтрока, РезультатВыбора.Значение = 2);
		ОткрытьФорму("Справочник.СохраненныеНастройки.ФормаОбъекта", ПараметрыФормы);
    КонецЕсли;
    
КонецПроцедуры

