#Область СлужебныеПроцедурыИФункции

// Производит настройку свойств элементов формы
// 
// Параметры:
//     Форма - ФормаКлиентскогоПриложения - Форма
//     ИзмененныйРеквизит - Строка - Реквизит, значение которого изменилось
//
Процедура НастроитьЗависимыеЭлементыФормы(Форма, ИзмененныйРеквизит = "") Экспорт         

	УправлениеЭлементамиФормыКлиентСервер.НастроитьЭлементыФормы(Форма, ИзмененныйРеквизит, ИспользованиеЕдиныхРеквизитовФормы(Форма));
  
КонецПроцедуры

// Возвращает структуру со значениями флагов использования единых реквизитов формы 
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
// Возвращаемое значение:
// РеквизитыФормы - Структура - значения флагов использования единых реквизитов
//	
Функция ИспользованиеЕдиныхРеквизитовФормы(Форма) Экспорт
	
	ДокументСсылка = Форма.Объект.Ссылка;

	РеквизитыФормы = Новый Структура;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаПланов") ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаявкаНаКорректировкуПланов") Тогда 	
		
		РеквизитыФормы = ИспользованиеЕдиныхРеквизитовФормыКорректировкаЛимитов();
			
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(РеквизитыФормы, Форма);
	
	Возврат РеквизитыФормы;
	
КонецФункции

// Возвращает структуру флагов использования единых реквизитов формы для документов 
//"Корректировка планов" и "Заявка на корректировку планов"
//
// Возвращаемое значение:
// РеквизитыФормы - Структура - ключи флагов использования единых реквизитов
//	
Функция ИспользованиеЕдиныхРеквизитовФормыКорректировкаЛимитов() Экспорт
	
	РеквизитыФормы = Новый Структура;
	РеквизитыФормы.Вставить("ЕдиныйПериод");
	РеквизитыФормы.Вставить("ЕдиныйЦФО"); 
	РеквизитыФормы.Вставить("ЕдиныйПроект");
	РеквизитыФормы.Вставить("ЕдинаяВалюта"); 
	РеквизитыФормы.Вставить("ЕдиныйПриходРасход");  
	
	Возврат РеквизитыФормы;
			
КонецФункции 

#КонецОбласти