#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	УстановитьОтображениеЗаголовкаИЭлементовУправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыборФайла", ЭтаФорма);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "(*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныеФайлы = Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура КнопкаНазад(Команда)
			
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОформлениеДокументов Тогда  
		ПереходНаШаг(Элементы.СтраницаСписаниеОстатков);    
	Иначе 		                
		ПереходНаШаг(Элементы.СтраницаНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее(Команда)
	
	ТекущаяСтраница = Элементы.ОсновнаяПанель.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		ПереходНаШаг(Элементы.СтраницаСписаниеОстатков);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСписаниеОстатков Тогда
		ПереходНаШаг(Элементы.СтраницаОформлениеДокументов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыСписанияОстатков(Команда)    
	
	ОчиститьСообщения(); 
	
	Если Не ЗначениеЗаполнено(ОрганизацияФилиал) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию-филиал!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтатьяРасходов) Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить статью расходов!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСписанияОстатков) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить дату списания остатков!");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(СчетСписания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить счет списания!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ТаблицаДанных.Количество() = 0 Тогда  
		Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл загрузки!");
			Возврат;
		КонецЕсли;  
		Загрузить();  
	КонецЕсли;
	
	СформироватьДокументыСписанияОстатковНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыВводаНачальныхОстатков(Команда)  
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСписанияОстатков) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить дату списания остатков!");
		Возврат;
	КонецЕсли;

	
	Если Объект.ТаблицаДанных.Количество() = 0 Тогда 
		Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл загрузки!");
			Возврат;
		КонецЕсли;  
		Загрузить();  
	КонецЕсли;
	
	СформироватьДокументыВводаНачальныхОстатковНаСервере();  
	
КонецПроцедуры 

&НаКлиенте
Процедура Загрузить()
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	ЗагрузитьДанные(АдресХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуОстатков(Команда) 
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл для выгрузки!");
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент; 
	ЗаполнитьТабличныйДокумент(ТабДок);  
	ТабДок.Записать(ПутькФайлу, ТипФайлаТабличногоДокумента.XLSX);   
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка данных успешно завершена!");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки(Команда)
	
	ОчиститьСообщения();          
	
	Если Не ЗначениеЗаполнено(ОрганизацияФилиал) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаПолученияОстатков) Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить дату получения остатков!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаткиНаСервере();   
	Элементы.ГруппаДанные.Показать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДублиДоговоров(Команда)    
		
	Если Не ЗначениеЗаполнено(ОрганизацияФилиал) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить организацию!");
		Возврат;
	КонецЕсли;      
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить головную организацию!");
		Возврат;
	КонецЕсли;
	
	СоздатьДублиДоговоровНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДублиДоговоров(Команда)
	
	ОткрытьФорму("РегистрСведений.тн_ДублиДоговоровФилиала.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТабличныйДокумент(ТабДок) 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетВыгрузки");	 
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Для Каждого Строка Из Объект.ТаблицаДанных Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Строка);  
		
		ОбластьСтрока.Параметры.КонтрагентID     = ?(ЗначениеЗаполнено(Строка.Контрагент), Строка(Строка.Контрагент.УникальныйИдентификатор()), "");	
		ОбластьСтрока.Параметры.ДоговорID        = ?(ЗначениеЗаполнено(Строка.Договор), Строка(Строка.Договор.УникальныйИдентификатор()), "");
		ОбластьСтрока.Параметры.ОбъектРасчетовID = ?(ЗначениеЗаполнено(Строка.ОбъектРасчетов),  Строка(Строка.ОбъектРасчетов.УникальныйИдентификатор()), "");
		ОбластьСтрока.Параметры.ДокументID       = ?(ЗначениеЗаполнено(Строка.Документ), Строка(Строка.Документ.УникальныйИдентификатор()), "");
		ОбластьСтрока.Параметры.ВалютаID         = ?(ЗначениеЗаполнено(Строка.Валюта), Строка(Строка.Валюта.УникальныйИдентификатор()), "");
		ОбластьСтрока.Параметры.ВидДоговораID    = ?(ЗначениеЗаполнено(Строка.ВидДоговора),  Строка(Строка.ВидДоговора.УникальныйИдентификатор()), "");		
		ОбластьСтрока.Параметры.ТипРасчетов      = ?(ЗначениеЗаполнено(Строка.ТипРасчетов),  Строка(ПолучитьИмяПеречисления(Строка.ТипРасчетов)), "");
		ОбластьСтрока.Параметры.ТипЗадолженности = ?(ЗначениеЗаполнено(Строка.ТипЗадолженности),  Строка(ПолучитьИмяПеречисления(Строка.ТипЗадолженности)), "");
		ОбластьСтрока.Параметры.ВидДокумента     = ?(ЗначениеЗаполнено(Строка.Документ), Строка(Строка.Документ.Метаданные().Имя), "");
		ОбластьСтрока.Параметры.ПодразделениеID  = ?(ЗначениеЗаполнено(Строка.Подразделение), Строка(Строка.Подразделение.УникальныйИдентификатор()), "");
		ТабДок.Вывести(ОбластьСтрока); 
		
	КонецЦикла;
		
	Возврат(ТабДок);
	
КонецФункции  

&НаСервере
Функция ПолучитьИмяПеречисления(ПеречислениеСсылка)
	
	ИмяПеречисления = ПеречислениеСсылка.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ПеречислениеСсылка);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя; 
	
	Возврат ИмяЗначенияПеречисления;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанные(АдресХранилища)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВремИмяФайла   = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВремИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВремИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(1,1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаДанных = Построитель.Результат.Выгрузить();
	УдалитьФайлы(ВремИмяФайла);     
	
	Если ОтсутствуютОбязательныеКолонкиВФайле(ТаблицаДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		
		НС = Объект.ТаблицаДанных.Добавить();	
		
		ЗаполнитьЗначенияСвойств(НС, Строка);
		
		НС.Контрагент = ПреобразоватьЗначениеИзСтроки(Строка.КонтрагентID, "Справочник", "Контрагенты");	
		НС.Договор = ПреобразоватьЗначениеИзСтроки(Строка.ДоговорID, "Справочник", "ДоговорыКонтрагентов");
		НС.ОбъектРасчетов = ПреобразоватьЗначениеИзСтроки(Строка.ОбъектРасчетовID, "Справочник", "ОбъектыРасчетов");    
		НС.Документ = ПреобразоватьЗначениеИзСтроки(Строка.ДокументID, "Документ", Строка.ВидДокумента);
		НС.Валюта = ПреобразоватьЗначениеИзСтроки(Строка.ВалютаID, "Справочник", "Валюты");
		НС.ВидДоговора = ПреобразоватьЗначениеИзСтроки(Строка.ВидДоговораID, "Справочник", "ВидыДоговоровКонтрагентовУХ");
		НС.ТипРасчетов = ПреобразоватьЗначениеИзСтроки(Строка.ТипРасчетов, "Перечисление", "ТипыРасчетовСПартнерами");
		НС.ТипЗадолженности = ПреобразоватьЗначениеИзСтроки(Строка.ТипЗадолженности, "Перечисление", "ТипыЗадолженности");
		НС.Подразделение = ПреобразоватьЗначениеИзСтроки(Строка.ПодразделениеID, "Справочник", "СтруктураПредприятия");

	КонецЦикла;
	
	ДополнитьТаблицуДанныхДоговорамиГоловнойОрганизации();	
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуДанныхДоговорамиГоловнойОрганизации()
	
	ТаблицаДоговоров = Объект.ТаблицаДанных.Выгрузить(,"Договор, ДоговорГоловнойОрганизации");
	ЕстьНезаполненныеЗначения = ТаблицаДоговоров.Найти(Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),"ДоговорГоловнойОрганизации") <> Неопределено; 
	
	Если ЕстьНезаполненныеЗначения Тогда 
		МассивДоговоров = Объект.ТаблицаДанных.Выгрузить(,"Договор").ВыгрузитьКолонку("Договор");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	тн_ДублиДоговоровФилиала.ДоговорФилиала КАК ДоговорФилиала,
		|	тн_ДублиДоговоровФилиала.ДоговорГоловнойОрганизации КАК ДоговорГоловнойОрганизации
		|ИЗ
		|	РегистрСведений.тн_ДублиДоговоровФилиала КАК тн_ДублиДоговоровФилиала
		|ГДЕ
		|	тн_ДублиДоговоровФилиала.ДоговорФилиала В(&МассивДоговоров)";
		
		Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НайденныеСтроки = Объект.ТаблицаДанных.НайтиСтроки(Новый Структура("Договор", Выборка.ДоговорФилиала));	
			Для Каждого Строка Из НайденныеСтроки Цикл   
				Если Не ЗначениеЗаполнено(Строка.ДоговорГоловнойОрганизации) Тогда
					Строка.ДоговорГоловнойОрганизации = Выборка.ДоговорГоловнойОрганизации;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПреобразоватьЗначениеИзСтроки(СтрЗначение, Тип = "Число", Вид = "")

	Если ПустаяСтрока(СтрЗначение) 
		И Не Тип = "Булево" Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Тип = "Дата" Тогда
		Результат = Дата(СтрЗначение);	
	ИначеЕсли Тип = "Число" Тогда
		Результат = Число(СтрЗаменить(СтрЗначение, " ", ""));
	ИначеЕсли Тип = "Булево" Тогда
		Результат = СтрЗначение = "Да" ИЛИ СтрЗначение = "Истина" ИЛИ СтрЗначение = "+" ИЛИ СтрЗначение = "1";
	ИначеЕсли Тип = "Перечисление" Тогда
		Результат = Перечисления[Вид][СтрЗначение];
	ИначеЕсли Тип = "Справочник" Тогда
		Результат = Справочники[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗначение));   
	ИначеЕсли Тип = "Документ" Тогда
		Результат = Документы[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗначение));      
	ИначеЕсли Тип = "ПланВидовХарактеристик" Тогда
		Результат = ПланыВидовХарактеристик[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗначение));
	Иначе
		Результат = СтрЗначение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтсутствуютОбязательныеКолонкиВФайле(Таблица)
		
	Колонки = Таблица.Колонки;
	
	МассивОбязательныхКолонок = Новый Массив; 
	МассивОбязательныхКолонок.Добавить("ТипРасчетов"); 
	МассивОбязательныхКолонок.Добавить("ТипЗадолженности");
	МассивОбязательныхКолонок.Добавить("ВалютаID");
	МассивОбязательныхКолонок.Добавить("КонтрагентID");	
	МассивОбязательныхКолонок.Добавить("ДоговорID");     
	МассивОбязательныхКолонок.Добавить("ПодразделениеID");     
	МассивОбязательныхКолонок.Добавить("ОбъектРасчетовID");	 
	МассивОбязательныхКолонок.Добавить("ВидДоговораID");	
	МассивОбязательныхКолонок.Добавить("ДокументID");	
	
	Для Каждого ОбязательнаяКолонка Из МассивОбязательныхКолонок Цикл
		
		Если КолонкаОтсутствует(Колонки, ОбязательнаяКолонка) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции 

&НаСервере
Функция КолонкаОтсутствует(Колонки, ИмяКолонки)
	
	Если Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В файле отсутствует колонка ""%1"". Исправьте или выгрузите файл заново.", ИмяКолонки));
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 
	
&НаСервере
Процедура УстановитьОтображениеЗаголовкаИЭлементовУправления()
	
	ТекущаяСтраница = Элементы.ОсновнаяПанель.ТекущаяСтраница;
	
	ЗаголовкиСтраниц = Новый Соответствие;
	ЗаголовкиСтраниц.Вставить(Элементы.СтраницаНастройки, "Шаг 1 из 3 «Получение остатков взаиморасчетов филиала»");       
	ЗаголовкиСтраниц.Вставить(Элементы.СтраницаСписаниеОстатков, "Шаг 2 из 3 «Списание остатков с организации филиала»");
	ЗаголовкиСтраниц.Вставить(Элементы.СтраницаОформлениеДокументов, "Шаг 3 из 3 «Ввод остатков на головную организацию»");
	
	Элементы.ДекорацияЗаголовокСтраницы.Заголовок = ЗаголовкиСтраниц[ТекущаяСтраница];
	
	Элементы.КнопкиСлева.ТекущаяСтраница = ?(ТекущаяСтраница = Элементы.СтраницаНастройки,
																Элементы.ГруппаКнопокСлеваНет,
																Элементы.ГруппаКнопкиСлеваЕсть);

	Если ТекущаяСтраница = Элементы.СтраницаОформлениеДокументов Тогда
		Элементы.КнопкиСправа.ТекущаяСтраница   = Элементы.ГруппаКнопкиСправаНаПоследнейСтранице;
		Элементы.КнопкаГотово.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.КнопкиСправа.ТекущаяСтраница  = Элементы.ГруппаКнопкиСправаНаПервойСтранице;
		Элементы.КнопкаДалее.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПереходНаШаг(Страница)
	
	Элементы.ОсновнаяПанель.ТекущаяСтраница = Страница;
	УстановитьОтображениеЗаголовкаИЭлементовУправления();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыСписанияОстатковНаСервере()	
	
	ТаблицаВидовЗадолженностиПоКонтрагентам = Объект.ТаблицаДанных.Выгрузить(,"ТипЗадолженности, Контрагент, Подразделение"); 
    ТаблицаВидовЗадолженностиПоКонтрагентам.Свернуть("ТипЗадолженности, Контрагент, Подразделение");
	ТаблицаПроверки = Объект.ТаблицаДанных.Выгрузить();	
	Для Каждого Строка Из ТаблицаВидовЗадолженностиПоКонтрагентам Цикл
		СформироватьДокументыСписанияОстатковПоВидамЗадолженности(ТаблицаПроверки, Строка.ТипЗадолженности, Строка.Контрагент, Строка.Подразделение);
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Загрузка завершена. Создано документов: " + ДокументыСписания.Количество());
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыСписанияОстатковПоВидамЗадолженности(ТаблицаПроверки, ТипЗадолженности, Контрагент, Подразделение)
	
	ТаблицаПроверки = ПолучитьТаблицуПроверки(ДатаСписанияОстатков, ОрганизацияФилиал, Объект.ТаблицаДанных.Выгрузить(,"Договор, ТипРасчетов"), Ложь);
	
	ТаблицаПодготовленныхДанных = Объект.ТаблицаДанных.Выгрузить();
	ТаблицаПодготовленныхДанных.Свернуть("ТипРасчетов, ТипЗадолженности, Контрагент, Договор, ОбъектРасчетов, Валюта, Подразделение","ДолгОстаток, ПредоплатаОстаток, ВалютныйДолгОстаток, ВалютнаяПредоплатаОстаток");
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ТипЗадолженности", ТипЗадолженности);
	СтруктураПоиска.Вставить("Контрагент", Контрагент);    
	СтруктураПоиска.Вставить("Подразделение", Подразделение); 
	
	НайденныеСтроки = ТаблицаПодготовленныхДанных.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда   
		Возврат;	
	КонецЕсли;
	
	ДокументОбъект = Документы.КорректировкаЗадолженности.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, НайденныеСтроки[0]);
	ДокументОбъект.Контрагент = Контрагент;
	ДокументОбъект.тн_Подразделение = Подразделение;
	
	Ссылка = Документы.КорректировкаЗадолженности.ПолучитьСсылку(Новый УникальныйИдентификатор);
	ДокументОбъект.УстановитьСсылкуНового(Ссылка);
	
	Для Каждого Строка Из НайденныеСтроки Цикл   
		
		НайденныеСтрокиСписания = ТаблицаПроверки.НайтиСтроки(Новый Структура("Договор, ТипРасчетов", Строка.Договор, Строка.ТипРасчетов));
		Если НайденныеСтрокиСписания.Количество() > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По договору %1 контрагента %2 уже списаны остатки взаиморасчетов", Строка.Договор, Строка.Контрагент));   
			Продолжить;
		КонецЕсли;
		
		СтрокаЗадолженность = ДокументОбъект.Задолженность.Добавить();
		СтрокаЗадолженность.ТипРасчетов = Строка.ТипРасчетов; 
		СтрокаЗадолженность.Партнер = Справочники.Партнеры.НайтиПоРеквизиту("тн_Контрагент", Контрагент); 
		СтрокаЗадолженность.ВалютаВзаиморасчетов = Строка.Валюта; 
		СтрокаЗадолженность.Сумма = ?(ЗначениеЗаполнено(Строка.ВалютныйДолгОстаток), Строка.ВалютныйДолгОстаток, Строка.ВалютнаяПредоплатаОстаток); 
		СтрокаЗадолженность.ОбъектРасчетов = Строка.ОбъектРасчетов; 
		
		Если ДокументОбъект.ДоходыРасходыАктивыПассивы.Количество() = 0 Тогда
			
			СтрокаДоходыРасходыАктивыПассивы = ДокументОбъект.ДоходыРасходыАктивыПассивы.Добавить();
			СтрокаДоходыРасходыАктивыПассивы.Подразделение = Подразделение; 
			СтрокаДоходыРасходыАктивыПассивы.НастройкаСчетовУчета = Справочники.НастройкиСчетовУчетаПрочихОпераций.ВернутьНастройкаСчетовУчета(Ссылка, СчетСписания, Организация); 
			СтрокаДоходыРасходыАктивыПассивы.Валюта = Строка.Валюта; 
			СтрокаДоходыРасходыАктивыПассивы.Статья = СтатьяРасходов; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ДокументОбъект.Задолженность.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ДокументОбъект.ДоходыРасходыАктивыПассивы.Количество() = 0 Тогда
		ДокументОбъект.ДоходыРасходыАктивыПассивы[0].Сумма = ДокументОбъект.Задолженность.Итог("Сумма");			
	КонецЕсли;
	
	ДокументОбъект.Организация           = ОрганизацияФилиал;      
	ДокументОбъект.Автор                 = Пользователи.ТекущийПользователь();    
	ДокументОбъект.Дата                  = КонецДня(ДатаСписанияОстатков);
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ДокументОбъект.Комментарий           = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДата();
	ДокументОбъект.Комментарий           = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Если ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда  
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;
	Иначе      
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности;
	КонецЕсли;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение					
		ДокументОбъект.УстановитьНовыйНомер();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначения.СообщитьПользователю("Ошибка проведения документа " + ДокументОбъект.Ссылка, ДокументОбъект.Ссылка);
	КонецПопытки;
	
	НС = ДокументыСписания.Добавить();  
	НС.Документ = ДокументОбъект.Ссылка;
	НС.Контрагент = Контрагент;	 
	НС.Подразделение = Подразделение;	
	НС.ХозяйственнаяОперация = ДокументОбъект.ХозяйственнаяОперация;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуПроверки(ДатаСписания, Организация, Таблица, ЭтоСписание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаДанных.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ТаблицаДанных
	|ИЗ
	|	&Таблица КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТ_АналитикаУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
	|		ПО (РегистрАналитикаУчетаПоПартнерам.Организация = &Организация)
	|			И РегистрАналитикаУчетаПоПартнерам.Договор = ВТ_ТаблицаДанных.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Договор КАК АналитикаУчетаПоПартнерамДоговор
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&Граница,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам
	|				ИЗ
	|					ВТ_АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам)) КАК РасчетыСКлиентамиОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком),
	|	РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам.Договор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			&Граница,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам
	|				ИЗ
	|					ВТ_АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам)) КАК РасчетыСПоставщикамиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДанных.ТипРасчетов КАК ТипРасчетов,
	|	ВТ_ТаблицаДанных.Договор КАК Договор
	|ИЗ
	|	ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Остатки КАК вт_Остатки
	|		ПО ВТ_ТаблицаДанных.Договор = вт_Остатки.АналитикаУчетаПоПартнерамДоговор
	|			И ВТ_ТаблицаДанных.ТипРасчетов = вт_Остатки.ТипРасчетов
	|ГДЕ
	|	вт_Остатки.ТипРасчетов ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Таблица", Таблица); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Граница", Новый Граница(КонецДня(ДатаСписания), ВидГраницы.Включая));   
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧ(Документ, Контрагент, Партнер, Договор, Валюта, СуммаВал, СуммаРег = 0, НомерПерв = "", ДатаПерв = "", ДокументПерв = Неопределено, Подразделение = Неопределено)
	
	Строка = Документ.РасчетыСПартнерами.Добавить();
	Строка.Контрагент	= Контрагент;
	Строка.Партнер		= Партнер;
	Строка.ДатаПлатежа  = КонецДня(ДатаСписанияОстатков);
	Строка.Договор		= Договор;
	Если Валюта = ВалютаРеглУчета Тогда
		Строка.Сумма		= СуммаРег;	
	Иначе	
		Строка.Сумма		= СуммаВал;	
	КонецЕсли;
	Строка.СуммаРегл	    = СуммаРег;
	Строка.СуммаУпр	     	= СуммаРег;
	Строка.ОбъектРасчетов	= Договор;
	Строка.ДокументРасчетов = СоздатьПервичныйДокумент(Документ, Контрагент, Договор, Строка.ВалютаВзаиморасчетов, НомерПерв, ДатаПерв, ДокументПерв, СуммаВал, СуммаРег, Подразделение);
	Строка.ВалютаВзаиморасчетов = Договор.ВалютаВзаиморасчетов;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПервичныйДокумент(Документ, СсылкаКонтрагент, СсылкаДоговор, Валюта, НомерПерв, ДатаПерв, ДокументПерв, СуммаВал, СуммаРег, Подразделение)
	
	ПервичныйДокумент = Документы.ПервичныйДокумент.СоздатьДокумент();
	ПервичныйДокумент.Дата			            = Документ.Дата; 
	ПервичныйДокумент.Организация	            = Документ.Организация; 
	ПервичныйДокумент.Контрагент 	            = СсылкаКонтрагент; 
	ПервичныйДокумент.Договор 		            = СсылкаДоговор; 
	ПервичныйДокумент.Партнер		            = СсылкаКонтрагент.Партнер; 
	ПервичныйДокумент.Валюта 		            = Валюта; 
	ПервичныйДокумент.ВалютаВзаиморасчетов      = Валюта; 
	ПервичныйДокумент.СуммаДокумента            = СуммаВал; 
	ПервичныйДокумент.СуммаРегл                 = СуммаРег; 
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ПервичныйДокумент.Комментарий	            = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДата();
	ПервичныйДокумент.Комментарий	            = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	ПервичныйДокумент.ПорядокРасчетов           = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	ПервичныйДокумент.НомерВходящегоДокумента	= НомерПерв; 
	ПервичныйДокумент.ДатаВходящегоДокумента	= ДатаПерв;
	ПервичныйДокумент.Подразделение             = Подразделение;
	
	ТипДокумента = ТипЗнч(ДокументПерв);     
	
	Если ТипДокумента = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.АвансовыйОтчет")
		Или ТипДокумента = Тип("ДокументСсылка.Бронирование")Тогда 
		ПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ПриобретениеУПоставщика;  
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		ПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ОплатаПоставщику;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.РеализацияКлиенту;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств")
		Или ТипДокумента = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ОплатаОтКлиента;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПервичныйДокумент") Тогда
		ПервичныйДокумент.ТипПервичногоДокумента = 	ДокументПерв.ТипПервичногоДокумента; 
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		ПервичныйДокумент.ТипПервичногоДокумента = 	Перечисления.ТипыПервичныхДокументов.КорректировкаПриобретения;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ПервичныйДокумент.ТипПервичногоДокумента = 	Перечисления.ТипыПервичныхДокументов.КорректировкаРеализации;
	КонецЕсли;
	
	ПервичныйДокумент.Записать(); 
	
	Возврат ПервичныйДокумент.Ссылка;   
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШапку(Документ, Организация)
	
	Документ.Дата			            = КонецДня(ДатаСписанияОстатков);
	Документ.Ответственный	            = Пользователи.ТекущийПользователь();;
	Документ.Организация	            = Организация;
	Документ.ОтражатьВБУиНУ				= Истина;
	Документ.ОтражатьВУУ				= Истина;
	Документ.ОтражатьВОперативномУчете	= Истина;
	Документ.Комментарий	            = "Создан обработкой переноса остатков с филиала на головную организацию " + ТекущаяДата();	

КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыВводаНачальныхОстатковНаСервере()
			
	ДокументВводОстатковЗадолженностиКлиентов     = Документы.ВводОстатков.СоздатьДокумент(); // ОстаткиЗадолженностиКлиентов
	ДокументВводОстатковЗадолженностиПоставщикам  = Документы.ВводОстатков.СоздатьДокумент(); // ОстаткиЗадолженностиПередПоставщиками
	ДокументВводОстатковАвансовКлиентов           = Документы.ВводОстатков.СоздатьДокумент(); // ОстаткиПоАвансамКлиентов
	ДокументВводОстатковАвансовПоставщикам        = Документы.ВводОстатков.СоздатьДокумент(); // ОстаткиПоАвансамПоставщикам

	ДокументВводОстатковЗадолженностиКлиентов.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиКлиентов;
	ЗаполнитьШапку(ДокументВводОстатковЗадолженностиКлиентов, Организация);
	
	ДокументВводОстатковЗадолженностиПоставщикам.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиПоставщикам;
	ЗаполнитьШапку(ДокументВводОстатковЗадолженностиПоставщикам, Организация);
	
	ДокументВводОстатковАвансовКлиентов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовКлиентов;
	ЗаполнитьШапку(ДокументВводОстатковАвансовКлиентов, Организация);
	
	ДокументВводОстатковАвансовПоставщикам.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовПоставщикам;
	ЗаполнитьШапку(ДокументВводОстатковАвансовПоставщикам, Организация);
			
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("ДокументОбъект");
		
	Для Каждого Стр Из Объект.ТаблицаДанных Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Контрагент) 
			Или Не ЗначениеЗаполнено(Стр.ДоговорГоловнойОрганизации)
			Или Не ЗначениеЗаполнено(Стр.ВидДоговора) Тогда    
			Продолжить;
		КонецЕсли;
		
		Если Стр.ДолгОстаток = 0 
			И Стр.ПредоплатаОстаток = 0 
			И Стр.ВалютныйДолгОстаток = 0
			И Стр.ВалютнаяПредоплатаОстаток = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Партнер = Справочники.Партнеры.НайтиПоРеквизиту("тн_Контрагент", Стр.Контрагент);
		
		Если Стр.ВидДоговора = Справочники.ВидыДоговоровКонтрагентовУХ.СПокупателем Тогда
			
			Если Стр.ДолгОстаток > 0 
				Или Стр.ВалютныйДолгОстаток > 0 Тогда   
				ЗаполнитьТЧ(ДокументВводОстатковЗадолженностиКлиентов, Стр.Контрагент, Партнер, Стр.ДоговорГоловнойОрганизации, Стр.Валюта, Стр.ВалютныйДолгОстаток, Стр.ДолгОстаток, Стр.ДокументНомер, Стр.ДокументДата, Стр.Документ, Стр.Подразделение);
			КонецЕсли; 
			
			Если Стр.ПредоплатаОстаток > 0 
				Или Стр.ВалютнаяПредоплатаОстаток > 0 Тогда  
				ЗаполнитьТЧ(ДокументВводОстатковАвансовКлиентов, Стр.Контрагент, Партнер, Стр.ДоговорГоловнойОрганизации, Стр.Валюта, Стр.ВалютнаяПредоплатаОстаток, Стр.ПредоплатаОстаток, Стр.ДокументНомер, Стр.ДокументДата, Стр.Документ, Стр.Подразделение);
			КонецЕсли; 
			
		ИначеЕсли Стр.ВидДоговора = Справочники.ВидыДоговоровКонтрагентовУХ.СПоставщиком Тогда
			
			Если Стр.ДолгОстаток > 0 
				Или Стр.ВалютныйДолгОстаток > 0 Тогда      
				ЗаполнитьТЧ(ДокументВводОстатковЗадолженностиПоставщикам, Стр.Контрагент, Партнер, Стр.ДоговорГоловнойОрганизации, Стр.Валюта, Стр.ВалютныйДолгОстаток, Стр.ДолгОстаток, Стр.ДокументНомер, Стр.ДокументДата, Стр.Документ, Стр.Подразделение);
			КонецЕсли; 
			
			Если Стр.ПредоплатаОстаток > 0 
				Или Стр.ВалютнаяПредоплатаОстаток > 0 Тогда 
				ЗаполнитьТЧ(ДокументВводОстатковАвансовПоставщикам, Стр.Контрагент, Партнер, Стр.ДоговорГоловнойОрганизации, Стр.Валюта, Стр.ВалютнаяПредоплатаОстаток, Стр.ПредоплатаОстаток, Стр.ДокументНомер, Стр.ДокументДата, Стр.Документ, Стр.Подразделение);
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументВводОстатковЗадолженностиКлиентов.РасчетыСПартнерами.Количество() > 0 Тогда	
		
		НС = ТаблицаДокументов.Добавить();
		НС.ДокументОбъект = ДокументВводОстатковЗадолженностиКлиентов;
		
	КонецЕсли;    
	
	Если ДокументВводОстатковЗадолженностиПоставщикам.РасчетыСПартнерами.Количество() > 0 Тогда	
		
		НС = ТаблицаДокументов.Добавить();
		НС.ДокументОбъект = ДокументВводОстатковЗадолженностиПоставщикам;
		
	КонецЕсли;
	
	Если ДокументВводОстатковАвансовКлиентов.РасчетыСПартнерами.Количество() > 0 Тогда	
		
		НС = ТаблицаДокументов.Добавить();
		НС.ДокументОбъект = ДокументВводОстатковАвансовКлиентов;
		
	КонецЕсли;
	
	Если ДокументВводОстатковАвансовПоставщикам.РасчетыСПартнерами.Количество() > 0 Тогда	
		
		НС = ТаблицаДокументов.Добавить();
		НС.ДокументОбъект = ДокументВводОстатковАвансовПоставщикам;
		
	КонецЕсли;
	
	Для Каждого ТекДокСтр Из ТаблицаДокументов Цикл 
		
		ДокументОбъект = ТекДокСтр.ДокументОбъект;   
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументОбъект.УстановитьНовыйНомер();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначения.СообщитьПользователю("Ошибка проведения документа " + ДокументОбъект.Ссылка, ДокументОбъект.Ссылка);
		КонецПопытки;   
		
		НС = ДокументыВводаНачальныхОстатков.Добавить();
		НС.Документ = ДокументОбъект.Ссылка;   
		
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Загрузка завершена. Создано документов: " + ДокументыВводаНачальныхОстатков.Количество());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиОстатки.ДолгОстаток > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|	КОНЕЦ КАК ТипЗадолженности,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Организация КАК Организация,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Дата КАК Дата,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Номер КАК Номер,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиОстатки.ДолгРеглОстаток < 0
	|				ТОГДА -РасчетыСКлиентамиОстатки.ДолгРеглОстаток
	|			ИНАЧЕ РасчетыСКлиентамиОстатки.ДолгРеглОстаток
	|		КОНЕЦ) КАК ДолгОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиОстатки.ПредоплатаРеглОстаток < 0
	|				ТОГДА -РасчетыСКлиентамиОстатки.ПредоплатаРеглОстаток
	|			ИНАЧЕ РасчетыСКлиентамиОстатки.ПредоплатаРеглОстаток
	|		КОНЕЦ) КАК ПредоплатаОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиОстатки.ДолгОстаток < 0
	|				ТОГДА -РасчетыСКлиентамиОстатки.ДолгОстаток
	|			ИНАЧЕ РасчетыСКлиентамиОстатки.ДолгОстаток
	|		КОНЕЦ) КАК ВалютныйДолгОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиОстатки.ПредоплатаОстаток < 0
	|				ТОГДА -РасчетыСКлиентамиОстатки.ПредоплатаОстаток
	|			ИНАЧЕ РасчетыСКлиентамиОстатки.ПредоплатаОстаток
	|		КОНЕЦ) КАК ВалютнаяПредоплатаОстаток,
	|	РасчетыСКлиентамиОстатки.Валюта КАК Валюта,
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиОстатки.РасчетныйДокумент КАК Документ
	|ПОМЕСТИТЬ втПредварительныеДанные
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&Граница,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам
	|				ИЗ
	|					РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|				ГДЕ
	|					РегистрАналитикаУчетаПоПартнерам.Организация = &Организация)) КАК РасчетыСКлиентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов,
	|	РасчетыСКлиентамиОстатки.РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиОстатки.ДолгОстаток > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|	КОНЕЦ,
	|	РасчетыСКлиентамиОстатки.Валюта,
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Номер,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Организация,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком),
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.ПредоплатаОстаток > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|	КОНЕЦ,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Организация,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Дата,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Номер,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ДолгРеглОстаток < 0
	|				ТОГДА -РасчетыСПоставщикамиОстатки.ДолгРеглОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.ДолгРеглОстаток
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ПредоплатаРеглОстаток < 0
	|				ТОГДА -РасчетыСПоставщикамиОстатки.ПредоплатаРеглОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.ПредоплатаРеглОстаток
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ДолгОстаток < 0
	|				ТОГДА -РасчетыСПоставщикамиОстатки.ДолгОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.ДолгОстаток
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ПредоплатаОстаток < 0
	|				ТОГДА -РасчетыСПоставщикамиОстатки.ПредоплатаОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.ПредоплатаОстаток
	|		КОНЕЦ),
	|	РасчетыСПоставщикамиОстатки.Валюта,
	|	РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиОстатки.РасчетныйДокумент
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			&Граница,
	|			АналитикаУчетаПоПартнерам В
	|					(ВЫБРАТЬ
	|						РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам
	|					ИЗ
	|						РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|					ГДЕ
	|						РегистрАналитикаУчетаПоПартнерам.Организация = &Организация)
	|				И НЕ(ТИПЗНАЧЕНИЯ(ОбъектРасчетов.Объект) = ТИП(Документ.Бронирование)
	|						И ТИПЗНАЧЕНИЯ(РасчетныйДокумент) = ТИП(Документ.Бронирование))) КАК РасчетыСПоставщикамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Валюта,
	|	РасчетыСПоставщикамиОстатки.РасчетныйДокумент,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.ПредоплатаОстаток > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|	КОНЕЦ,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Организация,
	|	РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Дата,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредварительныеДанные.Документ КАК Документ,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ втДанныеСФ
	|ИЗ
	|	втПредварительныеДанные КАК втПредварительныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|		ПО втПредварительныеДанные.Документ = НДСЗаписиКнигиПродаж.СчетФактура
	|
	|СГРУППИРОВАТЬ ПО
	|	втПредварительныеДанные.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(тн_ДублиДоговоровФилиала.ДоговорГоловнойОрганизации, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорГоловнойОрганизации,
	|	втПредварительныеДанные.ТипРасчетов КАК ТипРасчетов,
	|	втПредварительныеДанные.ОбъектРасчетов КАК ОбъектРасчетов,
	|	втПредварительныеДанные.ТипЗадолженности КАК ТипЗадолженности,
	|	втПредварительныеДанные.Организация КАК Организация,
	|	втПредварительныеДанные.Дата КАК Дата,
	|	втПредварительныеДанные.Номер КАК Номер,
	|	втПредварительныеДанные.ДолгОстаток КАК ДолгОстаток,
	|	втПредварительныеДанные.ПредоплатаОстаток КАК ПредоплатаОстаток,
	|	втПредварительныеДанные.ВалютныйДолгОстаток КАК ВалютныйДолгОстаток,
	|	втПредварительныеДанные.ВалютнаяПредоплатаОстаток КАК ВалютнаяПредоплатаОстаток,
	|	втПредварительныеДанные.Валюта КАК Валюта,
	|	ЕСТЬNULL(РегистрАналитикаУчетаПоПартнерам.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(РегистрАналитикаУчетаПоПартнерам.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	|	ЕСТЬNULL(РегистрАналитикаУчетаПоПартнерам.Договор.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(РегистрАналитикаУчетаПоПартнерам.Договор.ВидДоговораУХ, ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.ПустаяСсылка)) КАК ВидДоговора,
	|	ЕСТЬNULL(НДСЗаписиКнигиПродаж.Регистратор, втПредварительныеДанные.Документ) КАК Документ,
	|	ЕСТЬNULL(НДСЗаписиКнигиПродаж.Регистратор.Номер, втПредварительныеДанные.Документ.Номер) КАК ДокументНомер,
	|	ЕСТЬNULL(НДСЗаписиКнигиПродаж.Регистратор.Дата, втПредварительныеДанные.Документ.Дата) КАК ДокументДата,
	|	НДСЗаписиКнигиПродаж.Регистратор КАК Регистратор
	|ИЗ
	|	втПредварительныеДанные КАК втПредварительныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.тн_ДублиДоговоровФилиала КАК тн_ДублиДоговоровФилиала
	|		ПО втПредварительныеДанные.АналитикаУчетаПоПартнерам.Договор = тн_ДублиДоговоровФилиала.ДоговорФилиала
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО втПредварительныеДанные.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеСФ КАК НДСЗаписиКнигиПродаж
	|		ПО втПредварительныеДанные.Документ = НДСЗаписиКнигиПродаж.Документ
	|			И (втПредварительныеДанные.ПредоплатаОстаток > 0)";
		
	Запрос.УстановитьПараметр("Организация", ОрганизацияФилиал);
	ДатаНаКонецДня = КонецДня(ДатаПолученияОстатков);
	Запрос.УстановитьПараметр("Граница", Новый Граница(ДатаНаКонецДня, ВидГраницы.Включая));   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.ТаблицаДанных.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДублиДоговоровНаСервере()
	
	Если Объект.ТаблицаДанных.Количество() = 0 Тогда 
		Если Не ЗначениеЗаполнено(ДатаПолученияОстатков) Тогда  
			ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить дату получения остатков!");
			Возврат;
		КонецЕсли;
		ЗаполнитьОстаткиНаСервере();   
	КонецЕсли;
	
	МассивДоговоров = Объект.ТаблицаДанных.Выгрузить(,"Договор").ВыгрузитьКолонку("Договор");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	тн_ДублиДоговоровФилиала.ДоговорФилиала ЕСТЬ NULL КАК СоздатьДоговор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.тн_ДублиДоговоровФилиала КАК тн_ДублиДоговоровФилиала
	|		ПО ДоговорыКонтрагентов.Ссылка = тн_ДублиДоговоровФилиала.ДоговорФилиала
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка В(&МассивДоговоров)";
	
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДоговорФилиала = Выборка.Ссылка;	 
		
		Если Выборка.СоздатьДоговор Тогда
			
			ДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();    
			ЗаполнитьЗначенияСвойств(ДоговорОбъект, ДоговорФилиала, ,"Родитель, Владелец, Ссылка, ВерсияСоглашения");
			ДоговорОбъект.Организация = Организация;        
			СсылкаНового = ДоговорОбъект.ПолучитьСсылкуНового();
			ДоговорОбъект.УстановитьСсылкуНового(СсылкаНового);
			ДоговорОбъект.Наименование = ДоговорОбъект.Наименование; 
			РаботаСДоговорамиКонтрагентовУХ.СоздатьВерсиюСоглашенияПоДоговору(ДоговорОбъект); 
			
			Набор = РегистрыСведений.тн_ДублиДоговоровФилиала.СоздатьМенеджерЗаписи();
			Набор.ДоговорФилиала = ДоговорФилиала;              
			
			Попытка     
				НачатьТранзакцию();
				ДоговорОбъект.Записать();
				Набор.ДоговорГоловнойОрганизации = ДоговорОбъект.Ссылка;
				Набор.Записать();
				ЗафиксироватьТранзакцию();
			Исключение   
				ОтменитьТранзакцию();
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось создать новый договор""%1"", по причине: ""%2""", ДоговорФилиала, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())), ДоговорФилиала);
			КонецПопытки;  
			
		Иначе 
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Договор головной организации к договору ""%1"" уже создан!", ДоговорФилиала), ДоговорФилиала);
			
		КонецЕсли;
		
	КонецЦикла;	    
	
	ДополнитьТаблицуДанныхДоговорамиГоловнойОрганизации();
	
КонецПроцедуры

#КонецОбласти