#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует список доступных дополнительных алгоритмов граф.
// 
// Параметры:
//  ФормаОтчета - ПеречислениеСсылка.ФормыБухгалтерскойОтчетности.
// 
// Возвращаемое значение:
//  Соответствие - Дополнительные алгоритмы граф
Функция ДополнительныеАлгоритмыГраф(ФормаОтчета) Экспорт 

	ДополнительныеАлгоритмы = Новый Соответствие;
	ДополнительныеАлгоритмы.Вставить("-", НСтр("ru = 'Заполнение значения со знаком минус (-)';
												|en = 'Fill in values with negative sign (-)'"));
	Если ФормаОтчета = Перечисления.ФормыБухгалтерскойОтчетности.ОИК Тогда
		ДополнительныеАлгоритмы.Вставить(">0", НСтр("ru = 'Выводить только положительный результат';
													|en = 'Display only positive result'"));
		ДополнительныеАлгоритмы.Вставить("<0", НСтр("ru = 'Выводить только отрицательный результат';
													|en = 'Display only negative result'"));
	КонецЕсли;

	Возврат ДополнительныеАлгоритмы;
	
КонецФункции

#КонецОбласти

#КонецЕсли