#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Качикина 04.03.2026 Выполнение задач №000056633
Функция ДоговорУпрЗаймаПоПроизводственномуПодразделению(ПроизводственноеПодразделение) Экспорт
	
	ДоговорУпрЗайма = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	тн_СоответствиеППДоговорамУпрЗайма.ДоговорУпрЗайма КАК ДоговорУпрЗайма
	              |ИЗ
	              |	РегистрСведений.тн_СоответствиеППДоговорамУпрЗайма КАК тн_СоответствиеППДоговорамУпрЗайма
	              |ГДЕ
	              |	тн_СоответствиеППДоговорамУпрЗайма.ПроизводственноеПодразделение = &ПроизводственноеПодразделение";
	Запрос.УстановитьПараметр("ПроизводственноеПодразделение", ПроизводственноеПодразделение);
	
	Результат=  Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ДоговорУпрЗайма = Результат.ДоговорУпрЗайма;	
	КонецЕсли;
	
	Возврат ДоговорУпрЗайма;
	
КонецФункции

#КонецЕсли
