
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьСледующийПериодПродолжение", ЭтотОбъект, ПараметрКоманды);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Действительно открыть следующий период?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
	
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьСледующийПериодПродолжение(Результат, ПараметрКоманды) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСледующийПериодСервер(ПараметрКоманды);
	Оповестить("ОбновитьСписок");
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьСледующийПериодСервер(ИсходныйДокумент)
	
	ДокументОбъект = ИсходныйДокумент.ПолучитьОбъект();
	ДокументОбъект.ОткрытьСледующийПериод();
	
КонецПроцедуры

#КонецОбласти
