/////////////////////////////////////////////////////////////////////////
// Модуль "СостоянияДокументовКлиентСервер" содержит процедуры и функции
// для работы с механизмом состояния документов.
//
/////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает видимость элементов формы состояния заказа.
// 
// Параметры:
//  Элементы - ЭлементыФормы - 
//  ИмяЭлементаСостояние - Строка -
//  ИмяГруппыСостояниеРассчитывается - Строка -
//  ЕстьЗаданияКОтражениюСостоянияЗаказов - Булево - 
//
Процедура УстановитьВидимостьЭлементов(
			Элементы,
			ИмяЭлементаСостояние = "Состояние",
			ИмяГруппыСостояниеРассчитывается = "ГруппаСостояниеРассчитывается",
			ЕстьЗаданияКОтражениюСостоянияЗаказов = Ложь) Экспорт
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИмяЭлементаСостояние,
		"Видимость",
		Не ЕстьЗаданияКОтражениюСостоянияЗаказов);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИмяГруппыСостояниеРассчитывается,
		"Видимость",
		ЕстьЗаданияКОтражениюСостоянияЗаказов);
	
КонецПроцедуры

#КонецОбласти