
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.АдресХранилищаПеременныхДляРасчета) Тогда
		ВызватьИсключение НСтр("ru = 'Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
		
	ОбъектРасчета=ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаПеременныхДляРасчета);
	
	ОбъектРасчета.Вставить("ЗначениеЯчейки", 0);
	Если  Параметры.Свойство("ЗначениеЯчейки") Тогда
		ЗаполнитьЗначенияСвойств(ОбъектРасчета, Параметры, "ЗначениеЯчейки");
	КонецЕсли;
		
	ОбъектРасчета.Свойство("ПериодОтчета",ПериодРасшифровки);
	
	ПолучитьРеквизитыДополнительногоКонтроля(ОбъектРасчета);
	
	Если Параметры.Свойство("ВыделенныеПоказатели") Тогда
		ОбъектРасчета.Вставить("ВыделенныеПоказатели", Параметры.ВыделенныеПоказатели);
	КонецЕсли;
	
	Если ТипЗнч(Параметры.СтруктураОтбора)=Тип("Структура") Тогда		
		СтруктураОтбора=Новый ФиксированнаяСтруктура(Параметры.СтруктураОтбора);		
	КонецЕсли;
	
	Если Параметры.Свойство("ДополнительныеОтборыЯчейкиБланка") Тогда
		ОтборыТеущейЯчейкиБланкаСтрока = Параметры.ДополнительныеОтборыЯчейкиБланка;
	КонецЕсли;	
	
	
	Если ОбъектРасчета.Свойство("ИмяОбъекта") Тогда		
		ЗаполнитьТаблицуДокументовРасшифровки(ОбъектРасчета);		
	Иначе		
		ВывестиТабличныйДокументРасшифровки(ОбъектРасчета,Отказ);		
	КонецЕсли;
				
	АдресХранилищаПеременныхДляРасчета=ПоместитьВоВременноеХранилище(ОбъектРасчета,ЭтаФорма.УникальныйИдентификатор);
	
	Если Не Отказ 
		И ПолеТабличногоДокумента.Рисунки.Количество()>0 Тогда		
		//Параметры вывода частей фомулы в виде текстовых рисунков
		УстановитьНачальныеПараметрыРисункаФормулы();		
		НарисоватьФормулуРасчета();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	Если ДокументыРасшифровки.Количество()>0 Тогда
		
		ОткрытьДокументыРасшифровки(Ложь);
		Закрыть();
		
	ИначеЕсли МассивРасшифровок.Количество()=1 И (НЕ Параметры.ВсегдаПоказыватьБланкРасшифровки) Тогда
		
		Если ТипЗнч(МассивРасшифровок[0]) = Тип("Структура") Тогда	
			
			ОбработатьДанныеРасшифровки(МассивРасшифровок[0]);
			
		КонецЕсли;
		
		Закрыть();
	
	КонецЕсли;
	
	ОбновитьФормулуРасчета();

	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеФормулыРисунком

&НаСервере
Процедура НарисоватьФормулуРасчета();
	
	Если ОтображатьНаименования = 0 Тогда
		КолонкаПоиска = "КодУпрощеннойФормулы";
	Иначе
		КолонкаПоиска = "Наименование";
	КонецЕсли;
	
	
	ЧастиФормулыМассив = ПолучитьЧастиФормулы(КолонкаПоиска);
	
	Для Каждого Часть Из ЧастиФормулыМассив  Цикл		
		Нстр 				= ЧастиФормулы.Добавить();
		Нстр.ТекстРисунка   = Часть;
		Нстр.ЭтоОперанд     = КодыНаименованияОперандов.НайтиСтроки(Новый Структура(КолонкаПоиска,Часть)).Количество()>0
	КонецЦикла;	
	
	НачальныйX 			= НачальныйXЭталон;
	НачальныйY 			= НачальныйYЭталон;
		
	Для Каждого Стр Из ЧастиФормулы Цикл
		 ДобавитьТекстЧастиФормулы(Стр,Неопределено);
	КонецЦикла;	
	
	ОбластьФормулы 			= ПолеТабличногоДокумента.Область("ТекстПроцедуры");
	ТекстФормулыИсходный    = ОбластьФормулы.Текст;	
	ОбластьФормулы.Текст = "";

		
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьФормулуРасчета();
	
	Если  ПолеТабличногоДокумента.Области.Найти("ТекстПроцедуры") = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НачальныйX = НачальныйXЭталон;
	НачальныйY = НачальныйYЭталон;
	СчетчикСтрок  = 1;
	
	ПроектВыводаФормулы.Очистить();
	
	
	Для Каждого Стр ИЗ ЧастиФормулы Цикл
		
		РисунокСтрока   = ПроектВыводаФормулы.Добавить();
		Рисунок 		= ПолеТабличногоДокумента.Рисунки[Стр.ИмяРисунка];
			
		Если НачальныйX+(СтрДлина(Рисунок.Текст)*Множитель)>=ПраваяГраницаФормулы Тогда  //Переносим все
			НачальныйX = НачальныйXЭталон;
			НачальныйY = НачальныйY+ВысотаРисункаВПикселях;
			СчетчикСтрок = СчетчикСтрок+1;
		КонецЕсли;
					
		РисунокСтрока.ИмяРисунка  = Стр.ИмяРисунка;
		РисунокСтрока.Ширина 		= СтрДлина(Рисунок.Текст)*Множитель;
		РисунокСтрока.Лево   		= НачальныйX;
		РисунокСтрока.Верх   		= НачальныйY;
		РисунокСтрока.Высота 		= ВысотаРисункаВПикселях;	
		РисунокСтрока.Текст         = Рисунок.Текст;
		
		НачальныйX = НачальныйX+РисунокСтрока.Ширина;
				
	КонецЦикла;

    //Расширим высоту области процедуры на расчетное значение
	ОбластьФормулы = ПолеТабличногоДокумента.Область("ТекстПроцедуры");
	ПолеТабличногоДокумента.Область(ОбластьФормулы.Верх,0,ОбластьФормулы.Верх,0).ВысотаСтроки = ВысотаСтрокиВПикселях*СчетчикСтрок;
		
	Для Каждого Стр ИЗ ПроектВыводаФормулы Цикл
		
		Рисунок = ПолеТабличногоДокумента.Рисунки[Стр.ИмяРисунка];
		ЗаполнитьЗначенияСвойств(Рисунок,Стр);
		
	КонецЦикла;
     	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьЧастиФормулы(КолонкаПоиска) 
	
	ОбластьФормулы = ПолеТабличногоДокумента.Область("ТекстПроцедуры");
	ТекстФормулы = ОбластьФормулы.Текст;
	
	ФормулыИФорматы = Новый Структура;
	Для Каждого Строка ИЗ КодыНаименованияОперандов Цикл
		
		ИндексСтроки = КодыНаименованияОперандов.Индекс(Строка);
		
		ТекстФормулы = СтрЗаменить(ТекстФормулы, Строка[КолонкаПоиска], "&А" + ИндексСтроки + "&");
		ТекстФрагмента = Строка[КолонкаПоиска];
		
		ФормулыИФорматы.Вставить("А" + ИндексСтроки, ТекстФрагмента);
		
	КонецЦикла;
	
	ЧастиФормул = СтрРазделить(ТекстФормулы, "&", Ложь);
	
	Для Индекс = 0 По ЧастиФормул.ВГраница() Цикл
		Формула = ЧастиФормул[Индекс];
		Если СтрНайти(Формула, "А") Тогда
			ЧастиФормул[Индекс] = ФормулыИФорматы[Формула];				
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ЧастиФормул;
	
КонецФункции	

&НаСервере
Процедура ДобавитьТекстЧастиФормулы(тСтрока,Расшифровка)
		
	Если НачальныйX+СтрДлина(тСтрока.ТекстРисунка)*Множитель>=ПраваяГраницаФормулы Тогда  //Переносим все
		НачальныйX = НачальныйXЭталон;
		НачальныйY = НачальныйY+ВысотаРисункаВПикселях;
	КонецЕсли;
		
	Рисунок = ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Рисунок.Лево   = НачальныйX;
	Рисунок.Верх   = НачальныйY;
	Рисунок.Ширина = СтрДлина(тСтрока.ТекстРисунка)*Множитель;
	Рисунок.Высота = ВысотаРисункаВПикселях;	
	Если тСтрока.ЭтоОперанд Тогда
		Рисунок.Расшифровка = тСтрока.ТекстРисунка;
		Рисунок.Текст 		= тСтрока.ТекстРисунка;
	Иначе	
		Рисунок.Текст 		= (СтрЗаменить(тСтрока.ТекстРисунка,Символы.ПС,""));
	КонецЕсли;
	
	Рисунок.ГраницаСверху = Ложь;
	Рисунок.ГраницаСлева = Ложь;
	Рисунок.ГраницаСнизу = Ложь;
	Рисунок.ГраницаСправа = Ложь;
	Рисунок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	Рисунок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
	
	//Рисунок.Шрифт   = Новый Шрифт(Рисунок.Шрифт,,10);
     
	//Рисунок.АвтоРазмер  = Истина;
	
	тСтрока.ИмяРисунка  = Рисунок.Имя;
	
	
	НачальныйX = НачальныйX+Рисунок.Ширина;
		
КонецПроцедуры
	
#КонецОбласти


#Область ВыделениеОбластейФормулы

&НаКлиенте
Процедура ПолеТабличногоДокументаПриАктивизации(Элемент)
	
	ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.1);
	ПодключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	
	
	СнятьВыделениеВсехОбластей();
	
	ИндексЦвета = 0;
	
	ТекущийТекст = Элемент.ТекущаяОбласть.Текст;
				
	Если ПолеТабличногоДокумента.Области.Найти("ТекстПроцедуры") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент.ТекущаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		
		Для Каждого ВыдОбластьКартинка Из ПолеТабличногоДокумента.ВыделенныеОбласти Цикл
			Если ТипЗнч(ВыдОбластьКартинка) = Тип("РисунокТабличногоДокумента") Тогда
				ВыделитьОперанд(ВыдОбластьКартинка,,,ИндексЦвета);
				ИндексЦвета = ИндексЦвета+1;
			КонецЕсли;	
		КонецЦикла;
		
	ИначеЕсли НЕ ПолеТабличногоДокумента.Области.Найти("ТаблицаАналитики") = Неопределено
		И ПолеТабличногоДокумента.Область("ТаблицаАналитики").Верх<=Элемент.ТекущаяОбласть.Верх  
		И ПолеТабличногоДокумента.Область("ТаблицаАналитики").Низ>=Элемент.ТекущаяОбласть.Низ
		И Элемент.ТекущаяОбласть.Лево>0
		И Элемент.ТекущаяОбласть.Право<ПолеТабличногоДокумента.ШиринаТаблицы Тогда
		
		ОбластьРасшифровки = ПолеТабличногоДокумента.Область(
		ПолеТабличногоДокумента.Область("ТаблицаАналитики").Верх
		,Элемент.ТекущаяОбласть.Лево
		,ПолеТабличногоДокумента.Область("ТаблицаАналитики").Верх
		,Элемент.ТекущаяОбласть.Лево);
		
		ВыделитьОперанд(,,ОбластьРасшифровки);

		
	ИначеЕсли НЕ ПолеТабличногоДокумента.Области.Найти("ТаблицаОперандов") = Неопределено
		И ПолеТабличногоДокумента.Область("ТаблицаОперандов").Верх<=Элемент.ТекущаяОбласть.Верх  
		И ПолеТабличногоДокумента.Область("ТаблицаОперандов").Низ>=Элемент.ТекущаяОбласть.Низ
		И Элемент.ТекущаяОбласть.Лево>0
		И Элемент.ТекущаяОбласть.Право<ПолеТабличногоДокумента.ШиринаТаблицы Тогда	
				
		
		ОбластьРасшифровки = ПолеТабличногоДокумента.Область(Элемент.ТекущаяОбласть.Верх,4,Элемент.ТекущаяОбласть.Верх,4);
		Расшифровка 	   = ОбластьРасшифровки.Расшифровка;
		
		ВыделитьОперанд(,ОбластьРасшифровки);
					
	КонецЕсли;
	
			
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииОбластиПодключаемый()
	
	тМакет = ПолеТабличногоДокумента;
	
	КоличествоВыделенныхЯчеек = 0;
	СуммаВыделенныхЯчеек      = 0;
		
	Если ТипЗнч(тМакет.ВыделенныеОбласти[0]) = Тип("РисунокТабличногоДокумента") Тогда
					
		Для Каждого ВыдОбластьКартинка Из ПолеТабличногоДокумента.ВыделенныеОбласти Цикл
			Если ТипЗнч(ВыдОбластьКартинка) = Тип("РисунокТабличногоДокумента") Тогда
				
				ОбластьОбщиеДанные 	=  ПолеТабличногоДокумента.Область("ОбщиеДанные");
				ОбластьПодвал 		=  ПолеТабличногоДокумента.Область("Подвал");
				
				ОбластьПоиска = ПолеТабличногоДокумента.Область(ОбластьОбщиеДанные.Низ,2,ОбластьПодвал.Верх,2);	
				ТекОбласть = ПолеТабличногоДокумента.НайтиТекст(ВыдОбластьКартинка.Текст,, ОбластьПоиска,, Истина);
				Если Не ТекОбласть = Неопределено Тогда
					
					ОбластьДляВыделения = ПолеТабличногоДокумента.Область(ТекОбласть.Верх,4,ТекОбласть.Низ,4); 
					СуммаВыделенныхЯчеек = СуммаВыделенныхЯчеек+ОбластьДляВыделения.Значение;
					
				КонецЕсли;	
				
				КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек+1;
				
			КонецЕсли;	
		КонецЦикла;
		
	ИначеЕсли   ТипЗнч(тМакет.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда 
		
		ДанныеРасчета = ОбщегоНазначенияКлиентСерверУХ.РасчетныеПоказателиЯчеек(тМакет, тМакет.ВыделенныеОбласти);                         
		СуммаВыделенныхЯчеек 		= ДанныеРасчета.Сумма;                        
		КоличествоВыделенныхЯчеек 	= ДанныеРасчета.Количество;
	
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьОперанд(Рисунок = Неопределено,текОбластьРасшифровкиОперанды = Неопределено,текОбластьРасшифровкиАналитика = Неопределено,ИндексЦвета=0)
	
	ЦветаФормул 			= ЦветаФормул();
	Рисунок_ЦветФона        = ЦветаФормул[?(ИндексЦвета>6,0,ИндексЦвета)];
	
	
	Если НЕ Рисунок = Неопределено Тогда
		
		Рисунок.ЦветФона = Рисунок_ЦветФона;
			
		//Определяем область операндов по тексту рисунка
		ОбластьОбщиеДанные 	=  ПолеТабличногоДокумента.Область("ОбщиеДанные");
		ОбластьПодвал 		=  ПолеТабличногоДокумента.Область("Подвал");
		
		ОбластьПоиска = ПолеТабличногоДокумента.Область(ОбластьОбщиеДанные.Низ,2,ОбластьПодвал.Верх,2);	
		ТекОбласть = ПолеТабличногоДокумента.НайтиТекст(Рисунок.Текст,, ОбластьПоиска,, Истина);
		Если Не ТекОбласть = Неопределено Тогда
			
			ОбластьДляВыделения = ПолеТабличногоДокумента.Область(ТекОбласть.Верх,2,ТекОбласть.Низ,6); 
			ОбластьДляВыделения.ЦветФона = Рисунок_ЦветФона;
			
		КонецЕсли;	
		
		//Определяем область аналитики по тексту рисунка
		Если НЕ ПолеТабличногоДокумента.Области.Найти("ТаблицаАналитики") = Неопределено Тогда		
			
			ОбластьПоиска = ПолеТабличногоДокумента.Область("ТаблицаАналитики");	
			ОбластьДляВыделения = ПолеТабличногоДокумента.НайтиТекст(Рисунок.Текст,, ОбластьПоиска,, Истина);
			Если Не ТекОбласть = Неопределено Тогда
				
				ВыделитьОперандПоТаблицеАналитики(ОбластьДляВыделения,Рисунок_ЦветФона);
				
			КонецЕсли;	
			
		КонецЕсли;
		
	ИначеЕсли НЕ текОбластьРасшифровкиАналитика = Неопределено Тогда	
			
		Если ТипЗнч(текОбластьРасшифровкиАналитика.Расшифровка) = Тип("Структура") 
			И текОбластьРасшифровкиАналитика.Расшифровка.Свойство("КодУпрощеннойФормулы") Тогда
			
			//Формула
			НужныеОперанды = ЧастиФормулы.НайтиСтроки(Новый Структура("ТекстРисунка",текОбластьРасшифровкиАналитика.Расшифровка.КодУпрощеннойФормулы));
			Для Каждого НужныйОперанд Из НужныеОперанды Цикл
				ПолеТабличногоДокумента.Рисунки[НужныйОперанд.ИмяРисунка].ЦветФона = Рисунок_ЦветФона;
			КонецЦикла;	
			
			//Операнды
			ОбластьОбщиеДанные 	=  ПолеТабличногоДокумента.Область("ОбщиеДанные");
			ОбластьПодвал 		=  ПолеТабличногоДокумента.Область("Подвал");
			
			ОбластьПоиска = ПолеТабличногоДокумента.Область(ОбластьОбщиеДанные.Низ,2,ОбластьПодвал.Верх,2);	
			ТекОбласть = ПолеТабличногоДокумента.НайтиТекст(ПолеТабличногоДокумента.Рисунки[НужныйОперанд.ИмяРисунка].Текст,, ОбластьПоиска,, Истина);
			Если Не ТекОбласть = Неопределено Тогда
				
				ОбластьДляВыделения = ПолеТабличногоДокумента.Область(ТекОбласть.Верх,2,ТекОбласть.Низ,6); 
				ОбластьДляВыделения.ЦветФона = Рисунок_ЦветФона;
				
			КонецЕсли;	
		
			//Аналитика
			ВыделитьОперандПоТаблицеАналитики(текОбластьРасшифровкиАналитика,Рисунок_ЦветФона);
			
			
		КонецЕсли;
		
	ИначеЕсли НЕ текОбластьРасшифровкиОперанды = Неопределено  Тогда	
		
		Если ТипЗнч(текОбластьРасшифровкиОперанды.Расшифровка) = Тип("Структура") 
			И текОбластьРасшифровкиОперанды.Расшифровка.Свойство("КодУпрощеннойФормулы") Тогда
			
			
			//Формула
			НужныеОперанды = ЧастиФормулы.НайтиСтроки(Новый Структура("ТекстРисунка",текОбластьРасшифровкиОперанды.Расшифровка.КодУпрощеннойФормулы));
			Для Каждого НужныйОперанд Из НужныеОперанды Цикл
				ПолеТабличногоДокумента.Рисунки[НужныйОперанд.ИмяРисунка].ЦветФона = Рисунок_ЦветФона;
			КонецЦикла;	
			
			//Строка с операндом
			ОбластьДляВыделения = ПолеТабличногоДокумента.Область(текОбластьРасшифровкиОперанды.Верх,2,текОбластьРасшифровкиОперанды.Верх,6); 
			ОбластьДляВыделения.ЦветФона = Рисунок_ЦветФона;
			
			//Определяем область аналитики по тексту рисунка
			Если НЕ ПолеТабличногоДокумента.Области.Найти("ТаблицаАналитики") = Неопределено Тогда		
				
				ОбластьПоиска = ПолеТабличногоДокумента.Область("ТаблицаАналитики");	
				ОбластьДляВыделения = ПолеТабличногоДокумента.НайтиТекст(ПолеТабличногоДокумента.Рисунки[НужныйОперанд.ИмяРисунка].Текст,, ОбластьПоиска,, Истина);
				Если Не ОбластьДляВыделения = Неопределено Тогда
					
					ВыделитьОперандПоТаблицеАналитики(ОбластьДляВыделения,Рисунок_ЦветФона);
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьОперандПоТаблицеАналитики(ОбластьРасшифровки,Рисунок_ЦветФона)
	
	ОбластьДляВыделения = ПолеТабличногоДокумента.Область(ОбластьРасшифровки.Верх
	,ОбластьРасшифровки.Лево
	,ПолеТабличногоДокумента.ВысотаТаблицы
	,ОбластьРасшифровки.Лево); 
	
	ОбластьДляВыделения.ЦветФона = Рисунок_ЦветФона;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсехОбластей()

	 ПолеТабличногоДокумента.Область(1,1,ПолеТабличногоДокумента.ВысотаТаблицы,ПолеТабличногоДокумента.ШиринаТаблицы).ЦветФона =  Новый Цвет(255, 255, 255);
	 Для Каждого Рис Из ПолеТабличногоДокумента.Рисунки Цикл
		 Рис.ЦветФона = Новый Цвет(255, 255, 255);
	 КонецЦикла;	 
	 	 
КонецПроцедуры	

&НаКлиенте
Функция ЦветаФормул()
	
	ЦветаФормул = Новый Массив;
	ЦветаФормул.Добавить(Новый Цвет(204,255,204));
	ЦветаФормул.Добавить(Новый Цвет(204,255,255));
	ЦветаФормул.Добавить(Новый Цвет(255,255,153));
	ЦветаФормул.Добавить(Новый Цвет(255,204,153));
	ЦветаФормул.Добавить(Новый Цвет(255,153,204));
	ЦветаФормул.Добавить(Новый Цвет(153,204,255));
	ЦветаФормул.Добавить(Новый Цвет(192,192,0));
	
	Возврат ЦветаФормул;
	
КонецФункции

#КонецОбласти


#Область РасчетИВыводРасшифровки

&НаСервере
Функция ОбработатьРасшифровкуАналитикПоказателяПоПравилуОбработки(ОбъектРасчета, Знач Пок, Знач СтруктураОтбора) Экспорт
	
	Если НЕ ОбъектРасчета.Свойство("ЗаполнениеВыполнено") Тогда
		ОбъектРасчета.Вставить("ЗаполнениеВыполнено", Ложь);
	КонецЕсли;
	
	ПараметрыРасчета = ПолучитьПараметрыРасчета(ОбъектРасчета, Пок, СтруктураОтбора);
	ОбъектРасчета.МаксАналитикПоказателя = ОбъектРасчета.МаксАналитикОтчета + ПараметрыРасчета.ЧислоАналитикПоказателя;
	
	ОбъектРасчета.Вставить("ПериодШапка", ОбъектРасчета.ПериодОтчета);
	Если ОбъектРасчета.Свойство("ПериодС") Тогда
		ОбъектРасчета.ПериодОтчета = ОбъектРасчета.ПериодС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.ПравилоОбработки) Тогда
		ОбъектРасчета.Вставить("ПравилоОбработки", ПараметрыРасчета.ПравилоОбработки);
		ОбъектРасчета.Вставить("ИспользуемаяИБ", ПараметрыРасчета.ИспользуемаяИБ);
	Иначе
		ПараметрыРасчета.ПравилоОбработки = ОбъектРасчета.ПравилоОбработки;
	КонецЕсли;
	
	ОбъектРасчета.Вставить("ПересчетВДопВалюты", (ОбъектРасчета.ОсновнаяВалюта <> ОбъектРасчета.ВалютаОтображения));
	ОбъектРасчета.Вставить("РассчитываетсяПослеКонвертации",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пок, "РассчитываетсяПослеКонвертации"));
	
	Если ЭтоРасшифровкаКонсолидации(ПараметрыРасчета.СпособФормированияОтчета) Тогда
		Возврат ПолучитьДанныеДляРасшифровкиКонсолидация(ОбъектРасчета,
			ПараметрыРасчета.СпособФормированияОтчета, Пок, СтруктураОтбора);
	КонецЕсли;
	
	ТаблицаФормулы = УправлениеОтчетамиУХ.ПолучитьФормулыРасчета(ОбъектРасчета.ПравилоОбработки, ПараметрыРасчета.Потребитель);
	ПараметрыРасчета.ТаблицаФормулы = ТаблицаФормулы;
	Если ЗначениеЗаполнено(ТаблицаФормулы) Тогда
		ПараметрыРасчета.ДанныеФормулы = ТаблицаФормулы[0];
		ПараметрыРасчета.ТекстПроцедуры = ТаблицаФормулы[0].Процедура;
	КонецЕсли;
	
	Если НЕ ВозможнаРасшифровка(ОбъектРасчета.ПравилоОбработки, ПараметрыРасчета) Тогда
		Возврат Новый Структура("ТекстОшибки, ТабДокумент", ПараметрыРасчета.ТекстОшибки, Новый ТабличныйДокумент);
	КонецЕсли;
	
	// Расчет
	РеквизитыОперандов = ПолучитьРеквизитыОперандов(ОбъектРасчета.ПравилоОбработки, ПараметрыРасчета);
	РасчетРасшифровки(ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета);
	
	// Вывод в макет
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ОбъектРасчета.Вставить("МассивРасшифровок", Новый Массив);
	ЗаполнитьТабДокСРасшифровками(ТабличныйДокумент, ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета);
	
	тКодыНаименованияОперандов = НовыеКодыНаименованияОперандов(РеквизитыОперандов, ПараметрыРасчета.ТекстПроцедуры);
	Результат = НовыйРезультатРасшифровки(ТабличныйДокумент, ОбъектРасчета.МассивРасшифровок, тКодыНаименованияОперандов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыРасчета(ОбъектРасчета, Пок, СтруктураОтбора)
	
	ПараметрыРасчета = Новый Структура("СпособФормированияОтчета, ПравилоОбработки, ИспользуемаяИБ");
	
	Если ОбъектРасчета.ЗаполнениеВыполнено ИЛИ НЕ ОбъектРасчета.мТабПоказателиЗапросы = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРасчета, ОбъектРасчета);
	Иначе
		ПараметрыРасчета = УправлениеОтчетамиУХ.ПолучитьПараметрыРасчетаПоказателя(ОбъектРасчета, Пок.Ссылка);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыРасчета.ИспользуемаяИБ) Тогда
		ПараметрыРасчета.ИспользуемаяИБ = ОбъектРасчета.ИспользуемаяИБ;
	КонецЕсли;
	
	ЧислоАналитикОтбора = 0;
	// Исключение элементов с пустой аналитикой
	ПараметрыРасчета.Вставить("СтруктураОтбора", Новый Структура);
	Если ЗначениеЗаполнено(СтруктураОтбора) Тогда
		Для Каждого Элемент Из СтруктураОтбора Цикл
			Если ЗначениеЗаполнено(Элемент.Значение) Тогда
				ПараметрыРасчета.СтруктураОтбора.Вставить(Элемент.Ключ, Элемент.Значение);
				ЧислоАналитикОтбора = ЧислоАналитикОтбора + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("СтрПоказатель", ОбъектРасчета.мСоответствиеДляПоискаПоСсылке[Пок.Ссылка]);
	Потребитель = ПараметрыРасчета.СтрПоказатель.Ссылка;
	ПараметрыРасчета.Вставить("Потребитель", ПараметрыРасчета.СтрПоказатель.Ссылка);
	
	ПараметрыРасчета.Вставить("ГруппаРаскрытия", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пок, "ГруппаРаскрытия"));
	ПараметрыРасчета.Вставить("ЭтоВалютныйПоказатель", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пок, "Валютный"));
	ПараметрыРасчета.Вставить("ЧислоАналитикПоказателя", 0);
	Если ЗначениеЗаполнено(ПараметрыРасчета.ГруппаРаскрытия) Тогда
		ПараметрыРасчета.ЧислоАналитикПоказателя =
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пок, "ГруппаРаскрытия.ЧислоАналитик");
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("ЭтоРасшифровка", Истина);
	Если ПараметрыРасчета.ЭтоВалютныйПоказатель Тогда
		РасшифровкаСДетализацией = (ПараметрыРасчета.ЧислоАналитикПоказателя + 1 > ЧислоАналитикОтбора);
	Иначе
		РасшифровкаСДетализацией = (ПараметрыРасчета.ЧислоАналитикПоказателя > ЧислоАналитикОтбора);
	КонецЕсли;
	ПараметрыРасчета.Вставить("РасшифровкаСДетализацией", РасшифровкаСДетализацией);
	
	ПараметрыРасчета.Вставить("ЗначениеПоказателяНач", ОбъектРасчета.ЗначениеЯчейки);
	ПараметрыРасчета.Вставить("ЗначениеПоказателяТек", 0);
	
	ПараметрыРасчета.Вставить("ТаблицаФормулы");
	ПараметрыРасчета.Вставить("ДанныеФормулы");
	ПараметрыРасчета.Вставить("ТекстПроцедуры", "");
	ПараметрыРасчета.Вставить("ПоказателиТекущегоОтчета", Истина);
	
	ПараметрыРасчета.Вставить("ОбщееВремяРасчетов", 0);
	
	ПараметрыРасчета.Вставить("МаксАналитикОтчета", ОбъектРасчета.МаксАналитикОтчета);
	ПараметрыРасчета.Вставить("НомерПервойНеключевойАналитики", ОбъектРасчета.МаксАналитикОтчета + 1);
	КолонкиАналитик = Новый Массив;
	Для Номер = 1 По ПараметрыРасчета.ЧислоАналитикПоказателя Цикл
		НомерНеключевойАналитики = ОбъектРасчета.МаксАналитикОтчета + Номер;
		КолонкиАналитик.Добавить("Аналитика" + НомерНеключевойАналитики);
	КонецЦикла;
	Если ПараметрыРасчета.ЭтоВалютныйПоказатель Тогда
		КолонкиАналитик.Добавить("АналитикаВалюта");
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("КолонкиАналитик", КолонкиАналитик);
	ПараметрыРасчета.Вставить("СтрокаАналитик", СтрСоединить(КолонкиАналитик, ","));
	
	ПараметрыРасчета.Вставить("КолонкиОперандов");
	ПараметрыРасчета.Вставить("ТипЧисло", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(18, 5));
	
	ФорматЗначения = НовыйФорматЗначения(ОбъектРасчета.ЕдиницаИзмеренияОтображения, ОбъектРасчета.УровеньТочности);
	ПараметрыРасчета.Вставить("ФорматЗначения", ФорматЗначения);
	ПараметрыРасчета.Вставить("ТекстОшибки", "");
	
	Возврат ПараметрыРасчета;
	
КонецФункции

&НаСервере
Функция НовыйФорматЗначения(ЕдиницаИзмеренияОтображения, УровеньТочности)
	
	Делитель = 0;
	ФорматнаяСтрока = "";
	УправлениеОтчетамиУХ.ЗаполнитьПараметрыОкругления(ЕдиницаИзмеренияОтображения, Делитель, ФорматнаяСтрока);
	
	ФорматнаяСтрока = ФорматнаяСтрока + ";ЧДЦ=" + УровеньТочности;
	
	ФорматЗначения = Новый Структура;
	ФорматЗначения.Вставить("Делитель", Делитель);
	ФорматЗначения.Вставить("ФорматнаяСтрока", ФорматнаяСтрока);
	
	Возврат ФорматЗначения;
	
КонецФункции

&НаСервере
Функция ЭтоРасшифровкаКонсолидации(СпособФормированияОтчета)
	
	Возврат (СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Консолидация
		ИЛИ  СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.КонсолидацияПропорционально
		ИЛИ  СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.СвернувПоАналитикам
		ИЛИ  СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.СвернувПоПроектам
		ИЛИ  СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.СвернувПоОрганизациямПроекта
		ИЛИ  СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.СвернувПоПериоду
		ИЛИ  СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Элиминация);
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляРасшифровкиКонсолидация(ОбъектРасчета,СпособФормированияОтчета,Знач Пок, Знач СтруктураОтбора)
	
	РабочийОбъект=ОбщегоНазначенияУХ.ПолучитьРабочийОбъект(ОбъектРасчета);
	РабочийОбъект.СпособФормированияОтчета=СпособФормированияОтчета;
	
	ТабличныйДокумент=РабочийОбъект.ВернутьТабличныйДокументРасшифровки(
		Истина, СтруктураОтбора, ОбъектРасчета.ВыделенныеПоказатели);
	
	Возврат Новый Структура("ТекстОшибки,ТабДокумент,МассивРасшифровок", "", ТабличныйДокумент, Новый Массив);	
	
КонецФункции // ПолучитьДанныеДляРасшифровкиКонсолидация()

&НаСервере
Функция ВозможнаРасшифровка(ПравилоОбработки, ПараметрыРасчета)
	
	ВозможнаРасшифровка = Истина;
	
	Если ПараметрыРасчета.ТаблицаФормулы.Количество() = 0 Тогда
		
		ПараметрыРасчета.ТекстОшибки = СтрШаблон(Нстр("ru = 'Для показателя %1 в правиле обработки %2 не определены формулы расчета.'"),
			ПараметрыРасчета.СтрПоказатель.Наименование, ПравилоОбработки);
		
		ВозможнаРасшифровка = Ложь;
		
	ИначеЕсли ПараметрыРасчета.ДанныеФормулы.ПроизвольныйКод Тогда
		
		ПараметрыРасчета.ТекстОшибки = Нстр("ru = 'Показатель заполнялся на основании произвольного кода. Расшифровка невозможна.'");
		
		ВозможнаРасшифровка = Ложь;
		
	КонецЕсли;
	
	Возврат ВозможнаРасшифровка;
	
КонецФункции

&НаСервере
Функция ПолучитьРеквизитыОперандов(ПравилоОбработки, ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПравилаИспользованияПолейЗапроса.Ссылка КАК Ссылка,
	|	ПравилаИспользованияПолейЗапроса.КодАналитики КАК КодАналитики
	|ПОМЕСТИТЬ ВТ_ДополняемыеАналитики
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов.ПравилаИспользованияПолейЗапроса КАК ПравилаИспользованияПолейЗапроса
	|ГДЕ
	|	ПравилаИспользованияПолейЗапроса.Ссылка.ПотребительРасчета = &ПотребительРасчета
	|	И НЕ ПравилаИспользованияПолейЗапроса.Ссылка.НеИспользуется
	|	И ПравилаИспользованияПолейЗапроса.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияПолейИсточника.ПолеДругогоИсточникаДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДополняемыеАналитики.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ИсточникиСДополнениемАналитик
	|ИЗ
	|	ВТ_ДополняемыеАналитики КАК ВТ_ДополняемыеАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СОКРЛП(РеквизитыИсточников.КодИсточника) КАК КодИсточника,
	|	РеквизитыИсточников.КодУпрощеннойФормулы КАК КодУпрощеннойФормулы,
	|	РеквизитыИсточников.КодПоказательОтбор КАК КодПоказательОтбор,
	|	РеквизитыИсточников.ПоказательТекущегоОтчета КАК ПоказательТекущегоОтчета,
	|	РеквизитыИсточников.ЕстьНестандартныеОтборы КАК ЕстьНестандартныеОтборы,
	|	РеквизитыИсточников.ИсточникДанных КАК ИсточникДанных,
	|	РеквизитыИсточников.СпособПолучения КАК СпособПолучения,
	|	РеквизитыИсточников.СпособИспользования КАК СпособИспользования,
	|	РеквизитыИсточников.ИсточникДанных.Наименование КАК Наименование,
	|	ЕСТЬNULL(РеквизитыИсточников.ИсточникДанных.ПоказательОтбор.Владелец, НЕОПРЕДЕЛЕНО) КАК ВидОтчета,
	|	РеквизитыИсточников.ИсточникДанных.ПоказательОтбор КАК ПоказательОтбор,
	|	ВЫБОР
	|		КОГДА ВТ_ИсточникиСДополнениемАналитик.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьДополнениеАналитик
	|ИЗ
	|	РегистрСведений.РеквизитыИсточниковДанныхДляФормул КАК РеквизитыИсточников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсточникиСДополнениемАналитик КАК ВТ_ИсточникиСДополнениемАналитик
	|		ПО РеквизитыИсточников.ИсточникДанных = ВТ_ИсточникиСДополнениемАналитик.Ссылка
	|ГДЕ
	|	РеквизитыИсточников.НазначениеРасчетов = &НазначениеРасчетов
	|	И РеквизитыИсточников.ПотребительРасчета = &ПотребительРасчета
	|	И НЕ РеквизитыИсточников.ИсточникДанных.НеИспользуется";
	
	Запрос.УстановитьПараметр("НазначениеРасчетов", ПравилоОбработки);
	Запрос.УстановитьПараметр("ПотребительРасчета", ПараметрыРасчета.Потребитель);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	РеквизитыОперандов = РезультатыЗапроса.Получить(2).Выгрузить();
	
	СоответствиеКодов = Новый Соответствие;
	РеквизитыОперандов.Колонки.Добавить("ИмяКолонкиОперанда", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(150));
	Для Каждого Строка Из РеквизитыОперандов Цикл
		
		Если СтрНайти(Строка.КодУпрощеннойФормулы, "[") = 0 Тогда
			Строка.КодУпрощеннойФормулы = СтрШаблон("[%1]", Строка.КодУпрощеннойФормулы);
			
			ПараметрыРасчета.ТекстПроцедуры = СтрЗаменить(ПараметрыРасчета.ТекстПроцедуры,
				СтрШаблон("[%1]", Строка.КодИсточника), Строка.КодУпрощеннойФормулы);
		КонецЕсли;
		
		Строка.ИмяКолонкиОперанда = Строка.КодУпрощеннойФормулы;
		
		СоответствиеКодов.Вставить(Строка.КодИсточника, Строка.КодУпрощеннойФормулы);
		
	КонецЦикла;
	
	ПараметрыРасчета.Вставить("СоответствиеКодов", СоответствиеКодов);
	
	ОперандыСДополнениемАналитик = Новый Соответствие;
	ДополняемыеАналитики = РезультатыЗапроса.Получить(0).Выгрузить();
	Для Каждого Строка Из ДополняемыеАналитики Цикл
		
		КодыАналитик = ОперандыСДополнениемАналитик.Получить(Строка.Ссылка);
		Если КодыАналитик = Неопределено Тогда
			КодыАналитик = Новый Массив;
		КонецЕсли;
		
		КодыАналитик.Добавить(Строка.КодАналитики);
		ОперандыСДополнениемАналитик.Вставить(Строка.Ссылка, КодыАналитик);
		
	КонецЦикла;
	
	ПараметрыРасчета.Вставить("ОперандыСДополнениемАналитик", ОперандыСДополнениемАналитик);
	
	Возврат РеквизитыОперандов;
	
КонецФункции

&НаСервере
Процедура РасчетРасшифровки(ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета)
	
	ОбработкаРасчета = Обработки.РасчетИЗаписьПоказателей.Создать();
	ОбработкаРасчета.УникальныйИдентификаторСеанса = Новый УникальныйИдентификатор(ОбъектРасчета.ИдентификаторСеанса);
	ОбработкаРасчета.ЭтоРасшифровка = ПараметрыРасчета.ЭтоРасшифровка;
	
	ЦелевойПоказатель = ПолучитьЦелевойПоказатель(ОбъектРасчета);
	СтруктураРасчета = ОбработкаРасчета.РассчитатьПоЗначениямЦелевыхПоказателей(ЦелевойПоказатель, Ложь);
	
	ИнициализироватьЗначенияПотребителя(ОбъектРасчета, СтруктураРасчета.ЗначенияПоказателей, ПараметрыРасчета);
	РассчитатьЗначениеПотребителя(ОбъектРасчета.тЗначенияПотребителя, ПараметрыРасчета);
	
	ИнициализироватьЗначенияОперандов(ОбъектРасчета, СтруктураРасчета, ПараметрыРасчета);
	РассчитатьЗначенияОперандовСинтетика(ОбъектРасчета.тЗначенияОперандов, РеквизитыОперандов, ПараметрыРасчета);
	ПроверитьВозможностьДетализации(ОбъектРасчета.тЗначенияОперандов, ПараметрыРасчета);
	
	Если ПараметрыРасчета.РасшифровкаСДетализацией Тогда
		
		РассчитатьЗначенияОперандовАналитика(ОбъектРасчета.тЗначенияОперандов, РеквизитыОперандов, ПараметрыРасчета);
		
		ИнициализироватьКроссТаблицуДетализации(ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета);
		РассчитатьЗначенияКроссТаблицы(ОбъектРасчета, ПараметрыРасчета);
		
	КонецЕсли;
	
	ПараметрыРасчета.ОбщееВремяРасчетов = ОбработкаРасчета.ОбщееВремяРасчетов;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦелевойПоказатель(ОбъектРасчета)
	
	ЦелевойПоказатель = УправлениеРасчетомПоказателей.ОписаниеЛогаИзмененныхПоказателей();
	ЦелевойПоказатель.Колонки.Добавить("ВалютаОтображения", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ЦелевойПоказатель.Колонки.Добавить("ПересчетВДопВалюты", Новый ОписаниеТипов("Булево"));
	
	НоваяСтрока = ЦелевойПоказатель.Добавить();
	НоваяСтрока.Валюта = ОбъектРасчета.ОсновнаяВалюта;
	НоваяСтрока.ВалютаОтображения = ОбъектРасчета.ВалютаОтображения;
	НоваяСтрока.ПересчетВДопВалюты = ОбъектРасчета.ПересчетВДопВалюты;
	НоваяСтрока.Организация = ОбъектРасчета.Организация;
	НоваяСтрока.Сценарий = ОбъектРасчета.Сценарий;
	НоваяСтрока.ПериодОтчета = ОбъектРасчета.ПериодОтчета;
	НоваяСтрока.Показатель = ОбъектРасчета.ПоказательОтчета;
	НоваяСтрока.Значение = ОбъектРасчета.ЗначениеЯчейки;
	НоваяСтрока.ПравилоОбработки = ОбъектРасчета.ПравилоОбработки; // для получения параметрической настройки
	
	Если ЗначениеЗаполнено(ОбъектРасчета.Проект) Тогда
		НоваяСтрока.Проект = ОбъектРасчета.Проект;
	КонецЕсли;
	
	Для Номер = 1 По ОбъектРасчета.МаксАналитикОтчета Цикл
		АналитикаН = "Аналитика" + Номер;
		НоваяСтрока[АналитикаН] = ОбъектРасчета[АналитикаН];
	КонецЦикла;
	
	Возврат ЦелевойПоказатель;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьЗначенияПотребителя(ОбъектРасчета, ЗначенияПоказателей, ПараметрыРасчета)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЭтоЛог", Ложь);
	Отбор.Вставить("ПериодОтчета", ОбъектРасчета.ПериодОтчета);
	Отбор.Вставить("Показатель", ПараметрыРасчета.Потребитель);
	
	ЗначенияПотребителя = ЗначенияПоказателей.Скопировать(Отбор);
	Если ОбъектРасчета.ПересчетВДопВалюты И ОбъектРасчета.РассчитываетсяПослеКонвертации Тогда
		СвернутьЗначенияПотребителя(ЗначенияПотребителя);
	КонецЕсли;
	
	ОбъектРасчета.Вставить("тЗначенияПотребителя", ЗначенияПотребителя);
	
КонецПроцедуры

&НаСервере
Процедура СвернутьЗначенияПотребителя(ЗначенияПотребителя)
	
	КолонкиСуммирования = Новый Массив;
	КолонкиСуммирования.Добавить("Значение");
	КолонкиСуммирования.Добавить("ЗначениеВалюта");
	
	КолонкиИсключения = Новый Массив;
	КолонкиИсключения.Добавить("ЭтоЛог");
	КолонкиИсключения.Добавить("НомерЗаписи");
	КолонкиИсключения.Добавить("НомерТранзакции");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КолонкиИсключения, КолонкиСуммирования);
	
	КолонкиГруппировки = Новый Массив;
	Для Каждого Колонка Из ЗначенияПотребителя.Колонки Цикл
		
		Если КолонкиИсключения.Найти(Колонка.Имя) = Неопределено Тогда
			КолонкиГруппировки.Добавить(Колонка.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	КолонкиГруппировки = СтрСоединить(КолонкиГруппировки, ",");
	КолонкиСуммирования = СтрСоединить(КолонкиСуммирования, ",");
	
	ЗначенияПотребителя.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЗначениеПотребителя(ЗначенияПотребителя, ПараметрыРасчета)
	
	// Расчет итогового значения Потребителя для шапки макета
	ОтборПотребителя = Новый Структура;
	ОтборПотребителя.Вставить("Показатель", ПараметрыРасчета.Потребитель);
	Для Каждого Элемент Из ПараметрыРасчета.СтруктураОтбора Цикл
		ОтборПотребителя.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	ЗначениеПотребителя = 0;
	НайденныеСтроки = ЗначенияПотребителя.НайтиСтроки(ОтборПотребителя);
	Для Каждого СтрокаПотребителя Из НайденныеСтроки Цикл
		ЗначениеПотребителя = ЗначениеПотребителя + СтрокаПотребителя.Значение;
	КонецЦикла;
	
	ПараметрыРасчета.ЗначениеПоказателяТек = ЗначениеПотребителя;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЗначенияОперандов(ОбъектРасчета, СтруктураРасчета, ПараметрыРасчета)
	
	ЗначенияОперандов = СтруктураРасчета.тОперанды.СкопироватьКолонки();
	ЗначенияОперандов.Колонки.Добавить("ИмяКолонкиОперанда",
		ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(150));
	Для Каждого Строка Из СтруктураРасчета.тОперанды Цикл
		Если Строка.ПериодОтчета = ОбъектРасчета.ПериодОтчета
			И ЗначениеЗаполнено(Строка.КодВФормуле) Тогда
			
			НоваяСтрока = ЗначенияОперандов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.СтруктураОтбора) Тогда
		ЗначенияОперандов = ЗначенияОперандов.Скопировать(ПараметрыРасчета.СтруктураОтбора);
	КонецЕсли;
	
	Если ЗначенияОперандов.Колонки.Найти("АналитикаВалюта") <> Неопределено Тогда
		
		ОперандыСВалютой = СтруктураРасчета.рОперанды.Скопировать();
		МассивСтрокКУдалению = ОперандыСВалютой.НайтиСтроки(Новый Структура("Значение", 0));
		Для Каждого СтрокаМассива Из МассивСтрокКУдалению Цикл
			ОперандыСВалютой.Удалить(СтрокаМассива);
		КонецЦикла;
		
		ОперандыСВалютой.Свернуть(ПараметрыРасчета.СтрокаАналитик + ",АналитикаВалюта");
		
		// Отфильтровать операнды по аналитикам показателя
		пЗначенияОперандов = ЗначенияОперандов.СкопироватьКолонки();
		Отбор = Новый Структура(ПараметрыРасчета.СтрокаАналитик + ",АналитикаВалюта");
		Для каждого Строка Из ОперандыСВалютой Цикл
			
			ЗаполнитьЗначенияСвойств(Отбор, Строка);
			НайденныеСтроки = ЗначенияОперандов.НайтиСтроки(Отбор);
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				НоваяСтрока = пЗначенияОперандов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
				
			КонецЦикла;
		КонецЦикла;
		
		ЗначенияОперандов.Очистить();
		ЗначенияОперандов = пЗначенияОперандов;
		
	КонецЕсли;
	
	ОбъектРасчета.Вставить("тЗначенияОперандов", ЗначенияОперандов);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЗначенияОперандовСинтетика(ЗначенияОперандов, РеквизитыОперандов, ПараметрыРасчета)
	
	// Заполнение значений операндов для строк области макета Операнды
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.ОперандыСДополнениемАналитик) Тогда
		
		КолонкиОперандов = Новый Массив;
		Для Каждого Колонка Из ЗначенияОперандов.Колонки Цикл
			КолонкиОперандов.Добавить(Колонка.Имя);
		КонецЦикла;
		
	КонецЕсли;
	
	РеквизитыОперандов.Колонки.Добавить("Значение", ПараметрыРасчета.ТипЧисло);
	Для Каждого Строка Из РеквизитыОперандов Цикл
		
		Если Строка.ЕстьДополнениеАналитик Тогда
			
			КолонкиИсключения = ПараметрыРасчета.ОперандыСДополнениемАналитик.Получить(Строка.ИсточникДанных);
			КолонкиГруппировки = ОбщегоНазначенияКлиентСервер.РазностьМассивов(КолонкиОперандов, КолонкиИсключения);
			ЗначенияОперандовКопия = ЗначенияОперандов.Скопировать();
			ЗначенияОперандовКопия.Свернуть(СтрСоединить(КолонкиГруппировки, ","));
			
			СтруктураОтбораКопия = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыРасчета.СтруктураОтбора);
			Для Каждого Аналитика Из КолонкиИсключения Цикл
				СтруктураОтбораКопия.Удалить(Аналитика);
			КонецЦикла;
			
		Иначе
			ЗначенияОперандовКопия = ЗначенияОперандов;
			СтруктураОтбораКопия = ПараметрыРасчета.СтруктураОтбора;
		КонецЕсли;
		
		ОтборОперанда = Новый Структура;
		ОтборОперанда.Вставить("КодВФормуле", Строка.КодИсточника);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОтборОперанда, СтруктураОтбораКопия, Ложь);
		
		НайденныеСтроки = ЗначенияОперандовКопия.НайтиСтроки(ОтборОперанда);
		Для Каждого СтрокаОперанда Из НайденныеСтроки Цикл
			Строка.Значение = Строка.Значение + СтрокаОперанда.Значение;
			СтрокаОперанда.ИмяКолонкиОперанда = Строка.ИмяКолонкиОперанда;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьДетализации(ЗначенияОперандов, ПараметрыРасчета)
	
	// При незаполненном способе заполнения аналитики приемника в источнике данных
	Если ПараметрыРасчета.РасшифровкаСДетализацией Тогда
		
		Для Каждого Строка Из ЗначенияОперандов Цикл
			
			Если Строка[ПараметрыРасчета.КолонкиАналитик[0]] = Неопределено Тогда
				ПараметрыРасчета.РасшифровкаСДетализацией = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЗначенияОперандовАналитика(ЗначенияОперандов, РеквизитыОперандов, ПараметрыРасчета)
	
	МассивСтрокКУдалению = Новый Массив;
	КлючевыеАналитики = ЗначенияОперандов.Скопировать(, ПараметрыРасчета.СтрокаАналитик);
	КлючевыеАналитики.Свернуть(ПараметрыРасчета.СтрокаАналитик);
	
	ОперандыФормулы = РеквизитыОперандов.ВыгрузитьКолонку("КодИсточника");
	Отбор = Новый Структура(ПараметрыРасчета.СтрокаАналитик);
	
	// Добавление строк для отсутствующих операндов с 0-ми значениями
	Для Каждого СрезАналитик Из КлючевыеАналитики Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СрезАналитик);
		НайденныеСтроки = ЗначенияОперандов.НайтиСтроки(Отбор);
		
		// Строки с 0-ми значениями операндов не дополняем, а удаляем
		СрезНулевыхЗначений = Истина;
		ОперандыСреза = Новый Массив;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			ОперандыСреза.Добавить(НайденнаяСтрока.КодВФормуле);
			
			Если НайденнаяСтрока.Значение <> 0 Тогда
				СрезНулевыхЗначений = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СрезНулевыхЗначений Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрокКУдалению, НайденныеСтроки);
			Продолжить;
		ИначеЕсли НайденныеСтроки.Количество() = ОперандыФормулы.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		ОтсутствующиеОперанды = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ОперандыФормулы, ОперандыСреза);
		Для Каждого Операнд Из ОтсутствующиеОперанды Цикл
			
			НоваяСтрока = ЗначенияОперандов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
			НоваяСтрока.КодВФормуле = Операнд;
			НоваяСтрока.ИмяКолонкиОперанда = ПараметрыРасчета.СоответствиеКодов[Операнд];
			НоваяСтрока.Значение = 0;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из МассивСтрокКУдалению Цикл
		ЗначенияОперандов.Удалить(СтрокаМассива);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКроссТаблицуДетализации(ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета)
	
	// Колонки: АналитикаН, АналитикаВалюта | Операнд (код) | Значение
	КроссТаблица = Новый ТаблицаЗначений;
	
	Для Номер = 1 По ПараметрыРасчета.ЧислоАналитикПоказателя Цикл
		
		НомерНеключевойАналитики = ОбъектРасчета.МаксАналитикОтчета + Номер;
		ТипАналитики = ПараметрыРасчета.ГруппаРаскрытия["ВидАналитики" + НомерНеключевойАналитики].ТипЗначения;
		КроссТаблица.Колонки.Добавить("Аналитика" + НомерНеключевойАналитики, ТипАналитики);
		
	КонецЦикла;
	
	Если ПараметрыРасчета.ЭтоВалютныйПоказатель Тогда
		КроссТаблица.Колонки.Добавить("АналитикаВалюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	КонецЕсли;
	
	КолонкиОперандов = Новый Массив;
	Для Каждого Строка Из РеквизитыОперандов Цикл
		
		КроссТаблица.Колонки.Добавить(Строка.КодИсточника, ПараметрыРасчета.ТипЧисло);
		
		КолонкиОперандов.Добавить(Строка.КодИсточника);
		
	КонецЦикла;
	КроссТаблица.Колонки.Добавить("Значение", ПараметрыРасчета.ТипЧисло);
	
	ОбъектРасчета.Вставить("тКроссТаблица", КроссТаблица);
	ПараметрыРасчета.Вставить("КолонкиОперандов", КолонкиОперандов);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЗначенияКроссТаблицы(ОбъектРасчета, ПараметрыРасчета)
	
	Для Каждого Строка Из ОбъектРасчета.тЗначенияОперандов Цикл
		
		НоваяСтрока = ОбъектРасчета.тКроссТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока[Строка.КодВФормуле] = Строка.Значение;
		
	КонецЦикла;
	
	СтрокаОперандов = СтрСоединить(ПараметрыРасчета.КолонкиОперандов, ",");
	ОбъектРасчета.тКроссТаблица.Свернуть(ПараметрыРасчета.СтрокаАналитик, СтрокаОперандов + ",Значение");
	Отбор = Новый Структура(ПараметрыРасчета.СтрокаАналитик);
	
	Для Каждого СтрокаКТ Из ОбъектРасчета.тКроссТаблица Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаКТ);
		НайденныеСтроки = ОбъектРасчета.тЗначенияПотребителя.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			СтрокаКТ.Значение = НайденныеСтроки[0].Значение;
		Иначе
			СтрокаКТ.Значение = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабДокСРасшифровками(ТабличныйДокумент, ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета)
	
	Макет = Обработки.РасшифровкаРассчитанныхЗначений.ПолучитьМакет("МакетРасшифровкиРасширенный");
	ОбластиРасшифровки = НовыеОбластиРасшифровки(Макет);
	
	// Области над табличной частью
	ВывестиОбласти(ТабличныйДокумент, ОбластиРасшифровки, ОбъектРасчета, ПараметрыРасчета);
	
	// Область  "Операнды"
	ВывестиОбластьОперанды(ТабличныйДокумент, ОбластиРасшифровки, ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета);
	
	// Область  "Подвал"
	ТабличныйДокумент.Вывести(ОбластиРасшифровки.Подвал);
	
	// Область  "ОбластьДетализация"
	Если ПараметрыРасчета.РасшифровкаСДетализацией Тогда
		
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.ОбластьДетализация);
		
		Макет = Обработки.РасшифровкаРассчитанныхЗначений.ПолучитьМакет("ДетализацияРасчетовРасширенный");
		// Детализация расчета в виде кросс-таблицы
		ВывестиДетализациюКроссТаблицей(ТабличныйДокумент, Макет, ОбъектРасчета.тКроссТаблица,
			РеквизитыОперандов, ПараметрыРасчета);
		
		//// Детализация расчета в виде группировки
		//ВывестиДетализациюГруппировкой(ТабличныйДокумент, Макет, ОбъектРасчета.тЗначенияОперандов,
		//	ОбъектРасчета.тКроссТаблица, ПараметрыРасчета);
		
	КонецЕсли;
	
	// Область  "ОбластьНеСовпадаютЗначения"
	Если НЕ (ПараметрыРасчета.ЗначениеПоказателяНач = ПараметрыРасчета.ЗначениеПоказателяТек
		ИЛИ ОбъектРасчета.Свойство("ПериодТрансляции")
		ИЛИ ОбъектРасчета.Свойство("ДокументКорректировки")) Тогда
		
		ТекстСообщения = СтрШаблон(Нстр("ru = 'Данные актуальной расшифровки не соответствуют данным текущей ячейки: 
		|Значение ячейки: %1
		|Значение, рассчитанное по правилу: %2'"), ПараметрыРасчета.ЗначениеПоказателяНач, ПараметрыРасчета.ЗначениеПоказателяТек);
		
		ОбластиРасшифровки.ОбластьНеСовпадаютЗначения.Параметры.ТекстСообщения = ТекстСообщения;
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.ОбластьНеСовпадаютЗначения);
		
		ТекстСообщения = Нстр("ru = 'Возможные причины:'");
		
		ОбластиРасшифровки.ОбластьНеСовпадаютЗначенияПричины.Параметры.ТекстСообщения = ТекстСообщения;
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.ОбластьНеСовпадаютЗначенияПричины);
		
		//Различные предупрежедения о том, почему текущее значение может отличаться от расшифровки
		
		//Устарело
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПоказательДанныеУстарели);	
		
		//Ожидают другое правило расчета
		Если ЗначениеЗаполнено(ОбъектРасчета.ПравилоОбработкиПоРегламенту) И
			НЕ ОбъектРасчета.ПравилоОбработкиПоРегламенту = ОбъектРасчета.ПравилоОбработки Тогда
			
			ОбластиРасшифровки.ПравилоОбработкиОтличается.Параметры.ПравилоПоРегламенту = ОбъектРасчета.ПравилоОбработкиПоРегламенту;
			ОбластиРасшифровки.ПравилоОбработкиОтличается.Параметры.ПравилоТекущее 		= ОбъектРасчета.ПравилоОбработки;
			ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПравилоОбработкиОтличается);	
		КонецЕсли;	
		
		//Кодом могли изменить
		Если ЗначениеЗаполнено(ОбъектРасчета.ПравилоОбработки) И
			ЗначениеЗаполнено(СокрЛП(ОбъектРасчета.ПравилоОбработки.ПроцедураПослеВычисления)) Тогда	
			ОбластиРасшифровки.ПравилоОбработкиСодержитПроцедуру.Параметры.ПравилоТекущее 		= ОбъектРасчета.ПравилоОбработки;
			ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПравилоОбработкиСодержитПроцедуру);	
		КонецЕсли;	
		
		//Руками могли отредактировать
		Если ПараметрыРасчета.Свойство("ДанныеФормулы")
			И ПараметрыРасчета.ДанныеФормулы.РедактированиеВозможно  Тогда		
			ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПоказательРедактируется);	
		КонецЕсли;
		
		//Содержит корректировки после заполнения
		тКорректировка = ПослеРасчетаБылиКорректировки(ПараметрыРасчета,ОбъектРасчета);
		Если НЕ тКорректировка = Неопределено Тогда				
			ОбластиРасшифровки.ПоказательСодержитКорректировки.Параметры.Корректировка = тКорректировка;
			ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПоказательСодержитКорректировки);	
		КонецЕсли;
		
		//На ячейке у бланка установлены доп отборы, которые расшифровка расчета не видит.
		Если ЗначениеЗаполнено(ОтборыТеущейЯчейкиБланкаСтрока) Тогда
			
			тДополнительныеОтборы = ПолучитьДопОтборыЯчейки(ОтборыТеущейЯчейкиБланкаСтрока);
			Если тДополнительныеОтборы.Количество()>0 Тогда
				ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПоказательСодержитОтборыБланкаШапка);	
				
				ТабличныйДокумент.НачатьГруппуСтрок("ДетализацияОтборов", Ложь);
				
				Для Каждого СтрОтбор Из тДополнительныеОтборы Цикл
					ОбластиРасшифровки.ПоказательСодержитОтборыБланкаОтбор.Параметры.ОтборВидОтбора = СтрОтбор.Ключ; 
					ОбластиРасшифровки.ПоказательСодержитОтборыБланкаОтбор.Параметры.ЗначениеОтбора = СтрОтбор.Значение; 
					ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПоказательСодержитОтборыБланкаОтбор);	
				КонецЦикла;			
				
				ТабличныйДокумент.ЗакончитьГруппуСтрок()	
			КонецЕсли;	
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НовыеОбластиРасшифровки(Макет)
	
	ИменаОбластей = Новый Массив;
	ИменаОбластей.Добавить("ОбластьШапка");
	ИменаОбластей.Добавить("КлючевыеРеквизиты");
	ИменаОбластей.Добавить("ЗначениеПоказателя");
	ИменаОбластей.Добавить("ОбщиеДанные");
	ИменаОбластей.Добавить("Операнды");
	ИменаОбластей.Добавить("Подвал");
	ИменаОбластей.Добавить("Аналитики");
	ИменаОбластей.Добавить("ПравилоОбработки");
	ИменаОбластей.Добавить("ПравилоОбработкиОтличается");
	ИменаОбластей.Добавить("ПравилоОбработкиСодержитПроцедуру");
	ИменаОбластей.Добавить("ПоказательРедактируется");
	ИменаОбластей.Добавить("ПоказательСодержитКорректировки");
	ИменаОбластей.Добавить("ИспользуемаяИБ");
	ИменаОбластей.Добавить("ОбластьНеСовпадаютЗначения");
	ИменаОбластей.Добавить("ОбластьНеСовпадаютЗначенияПричины");
	ИменаОбластей.Добавить("ОбластьДетализация");
	ИменаОбластей.Добавить("ПоказательСодержитОтборыБланкаШапка");
	ИменаОбластей.Добавить("ПоказательСодержитОтборыБланкаОтбор");
	ИменаОбластей.Добавить("ПоказательДанныеУстарели");
	
	ОбластиРасшифровки = Новый Структура;
	Для Каждого ИмяОбласти Из ИменаОбластей Цикл
		ОбластиРасшифровки.Вставить(ИмяОбласти, Макет.ПолучитьОбласть(ИмяОбласти));
	КонецЦикла;
	
	Возврат ОбластиРасшифровки;
	
КонецФункции

&НаСервере
Процедура ВывестиОбласти(ТабличныйДокумент, ОбластиРасшифровки, ОбъектРасчета, ПараметрыРасчета)
	
	ТабличныйДокумент.ОтображатьГруппировки = Истина;
	
	// Область  "ОбластьШапка"
	ТабличныйДокумент.Вывести(ОбластиРасшифровки.ОбластьШапка);
	
	// Область  "КлючевыеРеквизиты"
	ТабличныйДокумент.НачатьГруппуСтрок("КлючевыеРеквизиты", Ложь);
	ЗаполнитьЗначенияСвойств(ОбластиРасшифровки.КлючевыеРеквизиты.Параметры, ОбъектРасчета);
	ОбластиРасшифровки.КлючевыеРеквизиты.Параметры.ПериодОтчета = ОбъектРасчета.ПериодШапка;
	ТабличныйДокумент.Вывести(ОбластиРасшифровки.КлючевыеРеквизиты);
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
	
	// Область  "ЗначениеПоказателя"
	ОбластиРасшифровки.ЗначениеПоказателя.Параметры.Наименование = ПараметрыРасчета.СтрПоказатель.Наименование;
	ОбластиРасшифровки.ЗначениеПоказателя.Параметры.Ссылка       = ПараметрыРасчета.СтрПоказатель.Ссылка;
	
	ФорматЗначения = ПараметрыРасчета.ФорматЗначения;
	ОбластиРасшифровки.ЗначениеПоказателя.Области.ЗначениеПоказателя.Формат = ФорматЗначения.ФорматнаяСтрока;
	ОбластиРасшифровки.ЗначениеПоказателя.Параметры.Значение =
		ПараметрыРасчета.ЗначениеПоказателяТек / ФорматЗначения.Делитель;
	
	ТабличныйДокумент.Вывести(ОбластиРасшифровки.ЗначениеПоказателя);
	
	// Область  "ПравилоОбработки"
	ОбластиРасшифровки.ПравилоОбработки.Параметры.ПравилоОбработки = ОбъектРасчета.ПравилоОбработки;
	ТабличныйДокумент.Вывести(ОбластиРасшифровки.ПравилоОбработки);
	
	// Область  "ИспользуемаяИБ"
	Если ЗначениеЗаполнено(ОбъектРасчета.ИспользуемаяИБ) Тогда
		
		ОбластиРасшифровки.ИспользуемаяИБ.Параметры.ИспользуемаяИБ = ОбъектРасчета.ИспользуемаяИБ;
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.ИспользуемаяИБ);
		
	КонецЕсли;
	
	// Область  "Аналитики"
	Для Номер = 1 По ОбъектРасчета.МаксАналитикОтчета Цикл
		
		АналитикаН = "Аналитика" + Номер;
		ОбластиРасшифровки.Аналитики.Параметры.КодАналитики = АналитикаН;
		ОбластиРасшифровки.Аналитики.Параметры.ЗначениеАналитики = ОбъектРасчета[АналитикаН];
		ОбластиРасшифровки.Аналитики.Параметры.Ссылка = ОбъектРасчета[АналитикаН];
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.Аналитики);
		
	КонецЦикла;
	
	Для Каждого Аналитика Из ПараметрыРасчета.СтруктураОтбора Цикл
		
		ОбластиРасшифровки.Аналитики.Параметры.КодАналитики = Аналитика.Ключ;
		ОбластиРасшифровки.Аналитики.Параметры.ЗначениеАналитики = Аналитика.Значение;
		ОбластиРасшифровки.Аналитики.Параметры.Ссылка = Аналитика.Значение;
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.Аналитики);
		
	КонецЦикла;
	
	// Область  "ОбщиеДанные"
	ОбластиРасшифровки.ОбщиеДанные.Параметры.ФормулаВычисления = ПараметрыРасчета.ТекстПроцедуры;
	ТабличныйДокумент.Вывести(ОбластиРасшифровки.ОбщиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОбластьОперанды(ТабличныйДокумент, ОбластиРасшифровки, ОбъектРасчета, РеквизитыОперандов, ПараметрыРасчета)
	
	ФорматЗначения = ПараметрыРасчета.ФорматЗначения;
	
	НачалоОбластиТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	
	Для Каждого ДанныеОперанда Из РеквизитыОперандов Цикл
		
		Если ДанныеОперанда.СпособИспользования <> Перечисления.СпособыИспользованияОперандов.ДляФормулРасчета Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластиРасшифровки.Операнды.Параметры.Код              = ДанныеОперанда.КодУпрощеннойФормулы;
		ОбластиРасшифровки.Операнды.Параметры.СпособПолучения  = ДанныеОперанда.СпособПолучения;
		ОбластиРасшифровки.Операнды.Параметры.Описание         = ДанныеОперанда.Наименование;
		ОбластиРасшифровки.Операнды.Параметры.ВидОтчета        = ДанныеОперанда.ВидОтчета;
		ОбластиРасшифровки.Операнды.Параметры.Ссылка           = ДанныеОперанда.ИсточникДанных;
		
		ОбластиРасшифровки.Операнды.Параметры.РасшифровкаОперанда =
			ЗначениеРасшифровкиОперанда(ДанныеОперанда, ПараметрыРасчета.СтруктураОтбора);
		
		ОбластиРасшифровки.Операнды.Области.ОбластьЗначения.Формат = ФорматЗначения.ФорматнаяСтрока;
		ОбластиРасшифровки.Операнды.Параметры.Значение = ДанныеОперанда.Значение / ФорматЗначения.Делитель;
		
		ОбъектРасчета.МассивРасшифровок.Добавить(ОбластиРасшифровки.Операнды.Параметры.РасшифровкаОперанда);
		
		ТабличныйДокумент.Вывести(ОбластиРасшифровки.Операнды);
		
	КонецЦикла;
	
	ТабличныйДокумент.Область(НачалоОбластиТаблицы+1,0,ТабличныйДокумент.ВысотаТаблицы,0).Имя = "ТаблицаОперандов";
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРасшифровкиОперанда(ДанныеОперанда, СтруктураОтбора)
	
	Результат = Новый Структура;
	
	Если ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеПоказательОтчета Тогда
		
		Результат.Вставить("Операнд", ДанныеОперанда.ИсточникДанных);
		Результат.Вставить("СтруктураОтбора", СтруктураОтбора);
		Результат.Вставить("КодУпрощеннойФормулы", ДанныеОперанда.КодУпрощеннойФормулы);
		Результат.Вставить("Наименование", ДанныеОперанда.Наименование);
		
	ИначеЕсли ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнешниеДанныеРегистрНакопления
		  ИЛИ ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнешниеДанныеРегистрБухгалтерии
		  ИЛИ ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеРегистрБухгалтерии
		  ИЛИ ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеРегистрНакопления Тогда
		
		Результат.Вставить("ОперандРаскрытия", ДанныеОперанда.ИсточникДанных);
		Результат.Вставить("СтруктураОтбора", СтруктураОтбора);
		Результат.Вставить("КодУпрощеннойФормулы", ДанныеОперанда.КодУпрощеннойФормулы);
		Результат.Вставить("Наименование", ДанныеОперанда.Наименование);
		
	ИначеЕсли ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнешниеДанныеПроизвольныйЗапрос
		  ИЛИ ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеПроизвольныйЗапрос
		  ИЛИ ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеПараметрическаяНастройка
		  ИЛИ ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнешниеДанныеОстаткиИОборотыИзПланаСчетов
		  ИЛИ ДанныеОперанда.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнешниеДанныеРегистр Тогда
		
		Результат.Вставить("Операнд", ДанныеОперанда.ИсточникДанных);
		Результат.Вставить("СтруктураОтбора", СтруктураОтбора);
		Результат.Вставить("КодУпрощеннойФормулы", ДанныеОперанда.КодУпрощеннойФормулы);
		Результат.Вставить("Наименование", ДанныеОперанда.Наименование);

	Иначе	
		
		Результат.Вставить("Операнд", ДанныеОперанда.ИсточникДанных);
		Результат.Вставить("СтруктураОтбора", СтруктураОтбора);
		Результат.Вставить("КодУпрощеннойФормулы", ДанныеОперанда.КодУпрощеннойФормулы);
		Результат.Вставить("Наименование", ДанныеОперанда.Наименование);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВывестиДетализациюКроссТаблицей(ТабличныйДокумент, Макет, КроссТаблица, РеквизитыОперандов, ПараметрыРасчета)
	
	ГруппаРаскрытия = ПараметрыРасчета.ГруппаРаскрытия;
	МаксАналитикОтчета = ПараметрыРасчета.МаксАналитикОтчета;
	КолонкиАналитик = ПараметрыРасчета.КолонкиАналитик;
	ЧислоАналитик = ПараметрыРасчета.ЧислоАналитикПоказателя;
	ФорматЗначения = ПараметрыРасчета.ФорматЗначения;
	ЭтоВалютныйПоказатель = ПараметрыРасчета.ЭтоВалютныйПоказатель;
	
	ОбластиКроссТаблицы = ОбластиКроссТаблицы(Макет);
	
	ТабличныйДокумент.НачатьГруппуСтрок("ДетализацияРасчета", Ложь);
		
	НачалоОбластиТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	
	ТабличныйДокумент.Вывести(ОбластиКроссТаблицы.ШапкаОтступ);
	Для Номер = 1 По ЧислоАналитик Цикл
		
		НомерНеключевойАналитики = МаксАналитикОтчета + Номер;
		ОбластиКроссТаблицы.ШапкаАналитика.Параметры.Номер = НомерНеключевойАналитики;
		ОбластиКроссТаблицы.ШапкаАналитика.Параметры.Вид   = ГруппаРаскрытия["ВидАналитики" + НомерНеключевойАналитики];
		ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ШапкаАналитика);
		
	КонецЦикла;
	
	Если ЭтоВалютныйПоказатель Тогда
		ОбластиКроссТаблицы.ШапкаАналитика.Параметры.Номер = "Валюта";
		ОбластиКроссТаблицы.ШапкаАналитика.Параметры.Вид   = "Валюта раскрытия";
		ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ШапкаАналитика);
	КонецЕсли;
	
	Для каждого ДанныеОперанда Из РеквизитыОперандов Цикл
		ОбластиКроссТаблицы.ШапкаОперанд.Параметры.КодОперанда = ДанныеОперанда.КодУпрощеннойФормулы;
				
		РасшифровкаОперанда = ЗначениеРасшифровкиОперанда(ДанныеОперанда, ПараметрыРасчета.СтруктураОтбора);
		
		ОбластиКроссТаблицы.ШапкаОперанд.Область(1,1,1,1).Расшифровка = РасшифровкаОперанда; 
		ОбластиКроссТаблицы.ШапкаОперанд.Область(2,1,2,1).Расшифровка = РасшифровкаОперанда; 
		
		ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ШапкаОперанд);
			
	КонецЦикла;
	
	ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ШапкаРезультат);
	
	
	//Вывод строк таблицы
	Для каждого СтрокаТаблицы из КроссТаблица Цикл
		
		//Если СтрокаТаблицы.Значение = 0 И РеквизитыОперандов[0].КодИсточника Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластиКроссТаблицы.СтрокаТаблицыОтступ);
		
		Для Каждого АналитикаН Из КолонкиАналитик Цикл
			ОбластиКроссТаблицы.СтрокаТаблицыАналитика.Параметры.Аналитика = СтрокаТаблицы[АналитикаН];
			ОбластиКроссТаблицы.СтрокаТаблицыАналитика.Область(1,1,1,1).Расшифровка =
				Новый Структура(АналитикаН + ",ЭтоСтрокаАналитики", СтрокаТаблицы[АналитикаН], Истина);
			ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.СтрокаТаблицыАналитика);
		КонецЦикла;
		
		Для Каждого ДанныеОперанда Из РеквизитыОперандов Цикл
			
			Если НЕ КроссТаблица.Колонки.Найти(ДанныеОперанда.КодИсточника) = Неопределено Тогда
				
				ОбластиКроссТаблицы.СтрокаТаблицыОперанд.Параметры.Значение =
					Формат(СтрокаТаблицы[ДанныеОперанда.КодИсточника] / ФорматЗначения.Делитель, ФорматЗначения.ФорматнаяСтрока);
				ОбластиКроссТаблицы.СтрокаТаблицыОперанд.Область(1,1,1,1).Расшифровка = Новый Структура("ЗначениеПоАналитике",ОбластиКроссТаблицы.СтрокаТаблицыОперанд.Параметры.Значение);	
					
				ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.СтрокаТаблицыОперанд);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластиКроссТаблицы.СтрокаТаблицыРезультат.Параметры.Значение =
			Формат(СтрокаТаблицы.Значение / ФорматЗначения.Делитель, ФорматЗначения.ФорматнаяСтрока);
		ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.СтрокаТаблицыРезультат);
		
	КонецЦикла;
	
	// Вывод подвала
	ТабличныйДокумент.Вывести(ОбластиКроссТаблицы.ПодвалОтступ);
	Для Номер = 1 По ЧислоАналитик Цикл
		ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ПодвалАналитика);
	КонецЦикла;
	Если ЭтоВалютныйПоказатель Тогда
		ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ПодвалАналитика);
	КонецЕсли;
	
	Для Каждого ДанныеОперанда Из РеквизитыОперандов Цикл
		
		Если НЕ КроссТаблица.Колонки.Найти(ДанныеОперанда.КодИсточника) = Неопределено Тогда
			
			ОбластиКроссТаблицы.ПодвалОперанд.Параметры.Значение =
				Формат(КроссТаблица.Итог(ДанныеОперанда.КодИсточника) / ФорматЗначения.Делитель, ФорматЗначения.ФорматнаяСтрока);
			ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ПодвалОперанд);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластиКроссТаблицы.ПодвалРезультат.Параметры.Значение =
		Формат(КроссТаблица.Итог("Значение") / ФорматЗначения.Делитель, ФорматЗначения.ФорматнаяСтрока);
	
	ТабличныйДокумент.Присоединить(ОбластиКроссТаблицы.ПодвалРезультат);
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
	
	ТабличныйДокумент.Область(НачалоОбластиТаблицы+1,0,ТабличныйДокумент.ВысотаТаблицы,0).Имя = "ТаблицаАналитики";
	
КонецПроцедуры

&НаСервере
Функция ОбластиКроссТаблицы(Макет)
	
	ОбластиКроссТаблицы = Новый Структура;
	
	ОбластиКроссТаблицы.Вставить("Заголовок",               Макет.ПолучитьОбласть("Заголовок"));
	ОбластиКроссТаблицы.Вставить("ШапкаОтступ",             Макет.ПолучитьОбласть("Шапка|Отступ"));
	ОбластиКроссТаблицы.Вставить("ШапкаАналитика",          Макет.ПолучитьОбласть("Шапка|Аналитика"));
	ОбластиКроссТаблицы.Вставить("ШапкаОперанд",            Макет.ПолучитьОбласть("Шапка|Операнд"));
	ОбластиКроссТаблицы.Вставить("ШапкаРезультат",          Макет.ПолучитьОбласть("Шапка|Результат"));
	
	ОбластиКроссТаблицы.Вставить("СтрокаТаблицыОтступ",     Макет.ПолучитьОбласть("СтрокаТаблицы|Отступ"));
	ОбластиКроссТаблицы.Вставить("СтрокаТаблицыАналитика",  Макет.ПолучитьОбласть("СтрокаТаблицы|Аналитика"));
	ОбластиКроссТаблицы.Вставить("СтрокаТаблицыОперанд",    Макет.ПолучитьОбласть("СтрокаТаблицы|Операнд"));
	ОбластиКроссТаблицы.Вставить("СтрокаТаблицыРезультат",  Макет.ПолучитьОбласть("СтрокаТаблицы|Результат"));
	ОбластиКроссТаблицы.Вставить("СтрокаТаблицыНедоступно", Макет.ПолучитьОбласть("СтрокаТаблицы|Недоступно"));
	
	ОбластиКроссТаблицы.Вставить("ПодвалОтступ",            Макет.ПолучитьОбласть("Подвал|Отступ"));
	ОбластиКроссТаблицы.Вставить("ПодвалАналитика",         Макет.ПолучитьОбласть("Подвал|Аналитика"));
	ОбластиКроссТаблицы.Вставить("ПодвалОперанд",           Макет.ПолучитьОбласть("Подвал|Операнд"));
	ОбластиКроссТаблицы.Вставить("ПодвалРезультат",         Макет.ПолучитьОбласть("Подвал|Результат"));
	
	Возврат ОбластиКроссТаблицы;
	
КонецФункции

&НаСервере
Процедура ВывестиДетализациюГруппировкой(ТабличныйДокумент, Макет, ЗначенияОперандов, КроссТаблица, ПараметрыРасчета)
	
	ФорматЗначения = ПараметрыРасчета.ФорматЗначения;
	
	Группировка = ОбластиГруппировки(Макет);
	
	ТабличныйДокумент.Вывести(Группировка.грОтступ);
	ТабличныйДокумент.Вывести(Группировка.грЗаголовок);
	ТабличныйДокумент.Вывести(Группировка.грШапка);
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	ДеревоАналитикОперандов = ДеревоАналитикОперандов(ЗначенияОперандов, ПараметрыРасчета);
	ЗаполнитьСтрокиГруппировки(ТабличныйДокумент, Группировка.грСтрока, ДеревоАналитикОперандов.Строки,
		КроссТаблица, ПараметрыРасчета);
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	Группировка.грПодвал.Параметры.Значение =
		Формат(ПараметрыРасчета.ЗначениеПоказателяТек / ФорматЗначения.Делитель, ФорматЗначения.ФорматнаяСтрока);
	ТабличныйДокумент.Вывести(Группировка.грПодвал);
	
КонецПроцедуры

&НаСервере
Функция ОбластиГруппировки(Макет)
	
	ИменаОбластей = Новый Массив;
	ИменаОбластей.Добавить("грОтступ");
	ИменаОбластей.Добавить("грЗаголовок");
	ИменаОбластей.Добавить("грШапка");
	ИменаОбластей.Добавить("грСтрока");
	ИменаОбластей.Добавить("грПодвал");
	
	ОбластиГруппировки = Новый Структура;
	Для Каждого ИмяОбласти Из ИменаОбластей Цикл
		ОбластиГруппировки.Вставить(ИмяОбласти, Макет.ПолучитьОбласть(ИмяОбласти));
	КонецЦикла;
	
	Возврат ОбластиГруппировки;
	
КонецФункции

&НаСервере
Функция ДеревоАналитикОперандов(ЗначенияОперандов, ПараметрыРасчета)
	
	ПоляАналитик = "";
	ГруппировкиАналитик = ПараметрыРасчета.СтрокаАналитик;
	Для Каждого Аналитика Из ПараметрыРасчета.КолонкиАналитик Цикл
		ПоляАналитик = ПоляАналитик + Символы.ПС + Символы.Таб + СтрШаблон("ЗначенияОперандов.%1 КАК %1,", Аналитика);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ"
		+ ПоляАналитик + "
	|	ЗначенияОперандов.ИмяКолонкиОперанда КАК Операнд,
	|	ЗначенияОперандов.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ЗначенияОперандов
	|ИЗ
	|	&ЗначенияОперандов КАК ЗначенияОперандов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ"
		+ ПоляАналитик + "
	|	ЗначенияОперандов.Операнд КАК Операнд,
	|	ЗначенияОперандов.Значение КАК Значение
	|ИЗ
	|	ВТ_ЗначенияОперандов КАК ЗначенияОперандов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Операнд
	|ИТОГИ
	|	СУММА(Значение)
	|ПО
	|	" + ГруппировкиАналитик;
	
	Запрос.УстановитьПараметр("ЗначенияОперандов", ЗначенияОперандов);
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокиГруппировки(ТабличныйДокумент, СтрокаОбласти, СтрокиДерева, КроссТаблица,
	ПараметрыРасчета, Уровень = 1)
	
	ГруппаРаскрытия = ПараметрыРасчета.ГруппаРаскрытия;
	ЧислоАналитик = ПараметрыРасчета.ЧислоАналитикПоказателя;
	ФорматЗначения = ПараметрыРасчета.ФорматЗначения;
	Отбор = Новый Структура(ПараметрыРасчета.СтрокаАналитик);
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева.Родитель = Неопределено Тогда
			Уровень = 1;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаДерева);
		Для Каждого Элемент Из Отбор Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.Значение) Тогда
				Отбор.Удалить(Элемент.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		СуммаГруппировки = 0;
		НайденныеСтроки = КроссТаблица.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СуммаГруппировки = СуммаГруппировки + НайденнаяСтрока.Значение;
		КонецЦикла;
		
		СтрокаОбласти.Параметры.АналитикаОперанд =
			СтрШаблон("(%1) %2", ГруппаРаскрытия["ВидАналитики" + Уровень], СтрокаДерева["Аналитика" + Уровень]);
		СтрокаОбласти.Параметры.Значение =
			Формат(СуммаГруппировки / ФорматЗначения.Делитель, ФорматЗначения.ФорматнаяСтрока);
		ТабличныйДокумент.Вывести(СтрокаОбласти, Уровень, "Аналитики", Истина);
		
		Если Уровень < ЧислоАналитик Тогда
			
			ЗаполнитьСтрокиГруппировки(ТабличныйДокумент, СтрокаОбласти, СтрокаДерева.Строки, КроссТаблица,
				ПараметрыРасчета, Уровень + 1);
			
		Иначе // Заполняем операнды
			
			Для Каждого ПоследняяСтрока Из СтрокаДерева.Строки Цикл
				
				СтрокаОбласти.Параметры.АналитикаОперанд = ПоследняяСтрока.Операнд;
				СтрокаОбласти.Параметры.Значение =
					Формат(ПоследняяСтрока.Значение / ФорматЗначения.Делитель, ФорматЗначения.ФорматнаяСтрока);
				
				ТабличныйДокумент.Вывести(СтрокаОбласти, Уровень + 1, "Операнды", Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПослеРасчетаБылиКорректировки(ПараметрыРасчета,ОбъектРасчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетовСинтетика.Версия КАК Версия,
	|	ЗначенияПоказателейОтчетовСинтетика.Версия.Регистратор КАК ВерсияРегистратор
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетовСинтетика КАК ЗначенияПоказателейОтчетовСинтетика
	|ГДЕ
	|	ЗначенияПоказателейОтчетовСинтетика.Показатель = &Показатель
	|	И ЗначенияПоказателейОтчетовСинтетика.Версия.Организация = &Организация
	|	И ЗначенияПоказателейОтчетовСинтетика.Версия.ПериодОтчета = &ПериодОтчета
	|	И ЗначенияПоказателейОтчетовСинтетика.Версия.Сценарий = &Сценарий
	|	И ЗначенияПоказателейОтчетовСинтетика.Версия.Проект = &Проект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначенияПоказателейОтчетовСинтетика.ДатаИзменения УБЫВ";
	
	Запрос.УстановитьПараметр("Показатель",ПараметрыРасчета.ДанныеФормулы.ПотребительРасчета);
	Запрос.УстановитьПараметр("Организация",ОбъектРасчета.Организация);
	Запрос.УстановитьПараметр("ПериодОтчета",ОбъектРасчета.ПериодОтчета);
	Запрос.УстановитьПараметр("Сценарий",ОбъектРасчета.Сценарий);
	Запрос.УстановитьПараметр("Проект",ОбъектРасчета.Проект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Если ТипЗнч(Выборка.ВерсияРегистратор) = Тип("ДокументСсылка.КорректировкаЗначенийПоказателей") Тогда
			Возврат Выборка.ВерсияРегистратор;
		КонецЕсли;	
	
	КонецЦикла;
		
	Возврат Неопределено;
	
КонецФункции	

&НаСервере
Функция ПолучитьДопОтборыЯчейки(ОтборыТеущейЯчейкиБланкаСтрока)
	
	ВлияющиеОтборы = Новый Соответствие;
	
	тОтборы = ЗначениеИзСтрокиВнутр(ОтборыТеущейЯчейкиБланкаСтрока);
	Для Каждого Стр Из тОтборы Цикл
		Если Стр.ПорядокОтбора = 99 И ЗначениеЗаполнено(Стр.ЗначениеОтбораСтрока) Тогда
			ВлияющиеОтборы.Вставить(Стр.Поле +" "+Строка(Стр.Отбор),Стр.ЗначениеОтбора);		
		КонецЕсли			
	КонецЦикла;	
	
	Возврат ВлияющиеОтборы;
	
КонецФункции

&НаСервере
Функция НовыеКодыНаименованияОперандов(РеквизитыОперандов, ТекстПроцедуры)
	
	тКодыНаименованияОперандов = Новый ТаблицаЗначений;
	тКодыНаименованияОперандов.Колонки.Добавить("Код", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(50));
	тКодыНаименованияОперандов.Колонки.Добавить("КодУпрощеннойФормулы", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(150));
	тКодыНаименованияОперандов.Колонки.Добавить("Наименование", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(150));
	
	Для Каждого Строка ИЗ РеквизитыОперандов Цикл
		
		НоваяСтрока = тКодыНаименованияОперандов.Добавить();
		НоваяСтрока.Код = Строка.КодИсточника;
		НоваяСтрока.КодУпрощеннойФормулы = Строка.КодУпрощеннойФормулы;
		НоваяСтрока.Наименование = Строка.Наименование;
		
		ЧисловойСуффикс = Новый Массив;
		ДлинаКода = СтрДлина(Строка.КодИсточника);
		Для сч = 0 По 2 Цикл
			Символ = Сред(Строка.КодИсточника, ДлинаКода - сч, 1);
			Если СтрНайти("1234567890", Символ) > 0 Тогда
				ЧисловойСуффикс.Вставить(0, Символ);
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЧисловойСуффикс) Тогда
			НоваяСтрока.Наименование = СтрШаблон("[%1_%2]", Строка.Наименование, СтрСоединить(ЧисловойСуффикс));
		Иначе
			НоваяСтрока.Наименование = СтрШаблон("[%1]", Строка.Наименование);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат тКодыНаименованияОперандов;
	
КонецФункции

&НаСервере
Функция НовыйРезультатРасшифровки(ТабличныйДокумент, МассивРасшифровок, тКодыНаименованияОперандов)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТабДокумент", ТабличныйДокумент);
	Результат.Вставить("МассивРасшифровок", МассивРасшифровок);
	Результат.Вставить("КодыНаименованияОперандов", тКодыНаименованияОперандов);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


&НаСервере
Процедура ПолучитьРеквизитыДополнительногоКонтроля(ОбъектРасчета)
	
	//Вычислим ожидаемые по регламенту параметры обработки отчета и сравним с текущими
	ДанныеУПС = БюджетированиеИОтчетностьПовтИсп.НайтиУправлениеПериодомСценария(ОбъектРасчета.Сценарий, ОбъектРасчета.ПериодОтчета);
	Если ЗначениеЗаполнено(ДанныеУПС) Тогда
		Регламент = ДанныеУПС.ВерсияРегламента;
	КонецЕсли;	
	
	ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ОбъектРасчета);
	ПараметрыНастроек.ШаблонДокумента = ОбъектРасчета.ВидОтчета;
	ПараметрыНастроек.ВерсияРегламента = Регламент;
	
	НастройкиОбработкиДокумента = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыНастроек);
	
	СпособФормированияПоРегламенту = НастройкиОбработкиДокумента.СпособФормированияОтчета;
    ПравилоОбработкиПоРегламенту   = НастройкиОбработкиДокумента.ПравилоОбработки;
	
	ОбъектРасчета.Вставить("СпособФормированияПоРегламенту",СпособФормированияПоРегламенту);
	ОбъектРасчета.Вставить("ПравилоОбработкиПоРегламенту",ПравилоОбработкиПоРегламенту);
	
	//Проверим процедуру после вычисления
	
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьНачальныеПараметрыРисункаФормулы()
	
	Множитель 				= 1.7; 
	ВысотаСтрокиВПикселях 	= 17;
	ПраваяГраницаФормулы    = 240;
	
	МаркерФормулы = ПолеТабличногоДокумента.Рисунки[0];

	НачальныйXЭталон 		= МаркерФормулы.Лево;
	НачальныйYЭталон 		= МаркерФормулы.Верх;
	ВысотаРисункаВПикселях 	= 4.5;
	
	ПолеТабличногоДокумента.Рисунки.Удалить(МаркерФормулы);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТаблицуДокументовРасшифровки(ОбъектРасчета)
	
	НоваяСтрока=ДокументыРасшифровки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ОбъектРасчета);
	
	МассивПок=Новый Массив;
	МассивПок.Добавить(СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчета.ПоказательОтчета,"Код")));
	
	МассивПоказателей=Новый ФиксированныйМассив(МассивПок);
	
КонецПроцедуры // ЗаполнитьТаблицуДокументовРасшифровки() 

&НаСервере
Процедура ВывестиТабличныйДокументРасшифровки(ОбъектРасчета,Отказ)
	
	ОбработкаОбъект=РеквизитФормыВЗначение("Объект");	
	
	СтруктураРасшифровка = ОбработатьРасшифровкуАналитикПоказателяПоПравилуОбработки(
		ОбъектРасчета, Параметры.ПоказательОтчета, Параметры.СтруктураОтбора);
	
	Если НЕ ПустаяСтрока(СтруктураРасшифровка.ТекстОшибки) Тогда
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(СтруктураРасшифровка.ТекстОшибки,,,СтатусСообщения.Информация);
		Отказ=Истина;
		Возврат;
		
	КонецЕсли;
			
	МассивРасшифровок=Новый ФиксированныйМассив(СтруктураРасшифровка.МассивРасшифровок);
	
	ТекстОшибки=СтруктураРасшифровка.ТекстОшибки;
	
	Если СтруктураРасшифровка.Свойство("КодыНаименованияОперандов") Тогда
		
		Для Каждого Строка ИЗ СтруктураРасшифровка.КодыНаименованияОперандов Цикл
			
			НоваяСтрока=КодыНаименованияОперандов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ОтображатьНаименования.Видимость=(КодыНаименованияОперандов.Количество()>0);
	
	Если Параметры.ВсегдаПоказыватьБланкРасшифровки ИЛИ (НЕ МассивРасшифровок.Количество()=1) Тогда
		
		ПолеТабличногоДокумента.Вывести(СтруктураРасшифровка.ТабДокумент);
		
	КонецЕсли;
		
КонецПроцедуры // ВывестиТабличныйДокументРасшифровки() 


&НаКлиенте
Процедура ОбработатьДанныеРасшифровки(Расшифровка)
	
	Если Расшифровка.Свойство("Отчет") 
		ИЛИ (Расшифровка.Свойство("Показатель") и Расшифровка.Свойство("Регистратор")) Тогда
		
		СтруктураВызова=ВернутьСтруктуруВызоваОкнаОтчетаРасшифровки(Расшифровка);
		СтруктураВызова.Вставить("СтруктураОтбора",СтруктураОтбора);
		СтруктураВызова.Вставить("ПериодРасшифровки",ПериодРасшифровки);
		
		ОткрытьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта", СтруктураВызова);
		
	ИначеЕсли Расшифровка.Свойство("ЗначениеПоАналитике") Тогда
		
		ТаблДок = Неопределено;
		ИспользуемаяИБ = Неопределено;
		
		тРасшифровка = ПолеТабличногоДокумента.Область(
		ПолеТабличногоДокумента.Область("ТаблицаАналитики").Верх
		,ПолеТабличногоДокумента.ТекущаяОбласть.Лево
		,ПолеТабличногоДокумента.Область("ТаблицаАналитики").Верх
		,ПолеТабличногоДокумента.ТекущаяОбласть.Лево).Расшифровка;
					
		Для Индколонки = 1 По ПолеТабличногоДокумента.ТекущаяОбласть.Лево Цикл
			
			ОбластьАналитики = ПолеТабличногоДокумента.Область(
			ПолеТабличногоДокумента.ТекущаяОбласть.Верх
			,Индколонки
			,ПолеТабличногоДокумента.ТекущаяОбласть.Верх
			,Индколонки).Расшифровка; 
			
			Если ТипЗнч(ОбластьАналитики) = Тип("Структура")
				И ОбластьАналитики.Свойство("ЭтоСтрокаАналитики") Тогда
				Для Каждого СтрАналитика Из ОбластьАналитики Цикл
					Если Не СтрАналитика.Ключ = "ЭтоСтрокаАналитики" Тогда 
						тРасшифровка.СтруктураОтбора.Вставить(СтрАналитика.Ключ,СтрАналитика.Значение);		
					КонецЕсли;	
				КонецЦикла;		
			КонецЕсли;				
		КонецЦикла;	
		
		
		Если тРасшифровка.Свойство("Операнд") Тогда
			ДанныеРасшифровки=РасшифроватьОперанд(тРасшифровка.Операнд, ИспользуемаяИБ,?(ВладелецФормы=Неопределено,"",ВладелецФормы.ИмяФормы),тРасшифровка.СтруктураОтбора);
		ИначеЕсли тРасшифровка.Свойство("ОперандРаскрытия") Тогда
			ДанныеРасшифровки=РасшифроватьОперанд(тРасшифровка.ОперандРаскрытия, ИспользуемаяИБ,,тРасшифровка.СтруктураОтбора);
		КонецЕсли;
		
		ОбработатьДанныеРасшифровкиФормой(тРасшифровка,ДанныеРасшифровки,ИспользуемаяИБ);				
		
	ИначеЕсли Расшифровка.Свойство("Операнд") Тогда
		
		ТаблДок = Неопределено;
		ИспользуемаяИБ = Неопределено;
		
		ДанныеРасшифровки=РасшифроватьОперанд(Расшифровка.Операнд, ИспользуемаяИБ,?(ВладелецФормы=Неопределено,"",ВладелецФормы.ИмяФормы));
		
		ОбработатьДанныеРасшифровкиФормой(Расшифровка,ДанныеРасшифровки,ИспользуемаяИБ);
		
	ИначеЕсли Расшифровка.Свойство("ОперандРаскрытия") Тогда
		
		ТаблДок = Неопределено;
		ИспользуемаяИБ = Неопределено;
		
		ДанныеРасшифровки=РасшифроватьОперанд(Расшифровка.ОперандРаскрытия, ИспользуемаяИБ,, Расшифровка.СтруктураОтбора);
		
		ОбработатьДанныеРасшифровкиФормой(Расшифровка,ДанныеРасшифровки,ИспользуемаяИБ);

		
	ИначеЕсли ИспользуетсяДляРасшифровкиАналитики Тогда
		Оповестить("РасшифроватьОперанд", Расшифровка, ЭтаФорма.ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры // ОбработатьДанныеРасшифровки() 

&НаКлиенте
Процедура ОбработатьДанныеРасшифровкиФормой(Расшифровка,ДанныеРасшифровки,ИспользуемаяИБ)
	
	Если Расшифровка.Свойство("Операнд") Тогда
		
		Если ТипЗнч(ДанныеРасшифровки)=Тип("ТабличныйДокумент") Тогда
			
			ОткрытьФорму("Документ.НастраиваемыйОтчет.Форма.РасшифровкаВИБ", Новый Структура("Результат, ИспользуемаяИБ", ДанныеРасшифровки, ИспользуемаяИБ));
			
		ИначеЕсли ТипЗнч(ДанныеРасшифровки)=Тип("Структура") Тогда
			
			Если ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнешниеДанныеРегистрБухгалтерии")
				ИЛИ ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнутренниеДанныеРегистрБухгалтерии") Тогда
				
				ОткрытьФорму("Отчет.ОтчетПоРегиструБухгалтерииБД.Форма.ФормаОтчета",ДанныеРасшифровки,,Новый УникальныйИдентификатор);
				
			ИначеЕсли ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнешниеДанныеРегистрНакопления")
				ИЛИ ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнутренниеДанныеРегистрНакопления")Тогда
				
				ОткрытьФорму("Отчет.ОтчетПоРегиструНакопленияБД.Форма.ФормаОтчета",ДанныеРасшифровки,,Новый УникальныйИдентификатор);
				
			ИначеЕсли ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнешниеДанныеПроизвольныйЗапрос") Тогда
				
				Имя = "Отчет.ОтчетПоПроизвольномуЗапросуВИБ.Форма.ФормаОтчета";
				ОткрытьФорму(Имя, ДанныеРасшифровки, , Новый УникальныйИдентификатор);
				
			ИначеЕсли ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнутренниеДанныеПроизвольныйЗапрос") Тогда
				
				ОткрытьФорму("Отчет.ОтчетПоПроизвольномуЗапросуТек.Форма.ФормаОтчета",ДанныеРасшифровки,,Новый УникальныйИдентификатор);
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДанныеРасшифровки)=Тип("ФиксированныйМассив") Тогда
			
			ВладелецФормы.ВыделитьОбластиПоказателей(ДанныеРасшифровки);
			ВладелецФормы.Активизировать();
			
		Иначе
			ОткрытьДокументыРасшифровки();
		КонецЕсли;	
		
	ИначеЕсли Расшифровка.Свойство("ОперандРаскрытия")  Тогда
		
		Если ТипЗнч(ДанныеРасшифровки)=Тип("ТабличныйДокумент") Тогда
			
			ОткрытьФорму("Документ.НастраиваемыйОтчет.Форма.РасшифровкаВИБ", Новый Структура("Результат, ИспользуемаяИБ", ДанныеРасшифровки, ИспользуемаяИБ));
			
		ИначеЕсли ТипЗнч(ДанныеРасшифровки)=Тип("Структура") Тогда
			
			Если ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнешниеДанныеРегистрБухгалтерии")
				ИЛИ ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнутренниеДанныеРегистрБухгалтерии") Тогда
				
				ОткрытьФорму("Отчет.ОтчетПоРегиструБухгалтерииБД.Форма.ФормаОтчета",ДанныеРасшифровки,,Новый УникальныйИдентификатор);
				
			ИначеЕсли ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнешниеДанныеРегистрНакопления")
				ИЛИ ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнутренниеДанныеРегистрНакопления")Тогда
				
				ОткрытьФорму("Отчет.ОтчетПоРегиструНакопленияБД.Форма.ФормаОтчета",ДанныеРасшифровки,,Новый УникальныйИдентификатор);
				
			ИначеЕсли ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнешниеДанныеПроизвольныйЗапрос") Тогда
				
				Имя = "Отчет.ОтчетПоПроизвольномуЗапросуВИБ.Форма.ФормаОтчета";
				ОткрытьФорму(Имя, ДанныеРасшифровки, , Новый УникальныйИдентификатор);
				
			ИначеЕсли ДанныеРасшифровки.СпособПолучения=ПредопределенноеЗначение("Перечисление.СпособыПолученияОперандов.ВнутренниеДанныеПроизвольныйЗапрос") Тогда
				
				ОткрытьФорму("Отчет.ОтчетПоПроизвольномуЗапросуТек.Форма.ФормаОтчета",ДанныеРасшифровки,,Новый УникальныйИдентификатор);
				
			КонецЕсли;
			
		Иначе
			ОткрытьДокументыРасшифровки();
		КонецЕсли;

		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПолеТабличногоДокументаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
   Если  ТипЗнч(Элемент.ТекущаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		
		ОбластьОбщиеДанные 	=  ПолеТабличногоДокумента.Область("ОбщиеДанные");
		ОбластьПодвал 		=  ПолеТабличногоДокумента.Область("Подвал");
		ОбластьПоиска = ПолеТабличногоДокумента.Область(ОбластьОбщиеДанные.Низ,2,ОбластьПодвал.Верх,2);	
		ТекОбласть = ПолеТабличногоДокумента.НайтиТекст(Элемент.ТекущаяОбласть.Текст,, ОбластьПоиска,, Истина);
		
		Если Не ТекОбласть = Неопределено Тогда	
			тРасшифровка = ПолеТабличногоДокумента.Область(ТекОбласть.Верх,4,ТекОбласть.Низ,4).Расшифровка; 
			Если ТипЗнч(тРасшифровка) = Тип("Структура") Тогда
				
				СтандартнаяОбработка=Ложь;
				
				ОповещениеКонтекстноеМеню = Новый ОписаниеОповещения("ВыборДействияИзКонтекстногоМеню", ЭтаФорма,тРасшифровка);
				
				СписокКоманд = Новый СписокЗначений;
				
				СписокКоманд.Добавить("РасшифроватьЗначение",Нстр("ru = 'Расшифровать значение'"));
				СписокКоманд.Добавить("ОткрытьОперанд",Нстр("ru = 'Открыть операнд'"));
				
				ЭтаФорма.ПоказатьВыборИзМеню(ОповещениеКонтекстноеМеню,СписокКоманд,Элемент);	
				
				
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборДействияИзКонтекстногоМеню(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
		Если Результат.Значение = "РасшифроватьЗначение" Тогда
			ОбработатьДанныеРасшифровки(ДополнительныеПараметры);;
		ИначеЕсли Результат.Значение = "ОткрытьОперанд" Тогда	
			ОткрытьЗначение(ДополнительныеПараметры.Операнд);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		
		СтандартнаяОбработка=Ложь;
		ДокументыРасшифровки.Очистить();
		
		ОбработатьДанныеРасшифровки(Расшифровка);
		
	ИначеЕсли  ТипЗнч(Элемент.ТекущаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		
		ОбластьОбщиеДанные 	=  ПолеТабличногоДокумента.Область("ОбщиеДанные");
		ОбластьПодвал 		=  ПолеТабличногоДокумента.Область("Подвал");
		ОбластьПоиска = ПолеТабличногоДокумента.Область(ОбластьОбщиеДанные.Низ,2,ОбластьПодвал.Верх,2);	
		ТекОбласть = ПолеТабличногоДокумента.НайтиТекст(Элемент.ТекущаяОбласть.Текст,, ОбластьПоиска,, Истина);
		Если Не ТекОбласть = Неопределено Тогда	
			тРасшифровка = ПолеТабличногоДокумента.Область(ТекОбласть.Верх,4,ТекОбласть.Низ,4).Расшифровка; 
			Если ТипЗнч(тРасшифровка) = Тип("Структура") Тогда
				
				СтандартнаяОбработка=Ложь;
				ДокументыРасшифровки.Очистить();	
				
				ОбработатьДанныеРасшифровки(тРасшифровка);
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьСтруктуруВызоваОкнаОтчетаРасшифровки(Расшифровка)
	
	МассивРасшифровки = Новый Массив;
	МассивРасшифровки.Добавить(Расшифровка.Показатель.Код);
	
	МассивПоказателейСсылка = Новый Массив;
	МассивПоказателейСсылка.Добавить(Расшифровка.Показатель);
	МассивПоказателейСсылка = Новый ФиксированныйМассив(МассивПоказателейСсылка);
	
	Возврат Новый Структура("Ключ, МассивПоказателей,МассивПоказателейСсылка"
							, Расшифровка.Регистратор
							, Новый ФиксированныйМассив(МассивРасшифровки)
							, МассивПоказателейСсылка);
	
КонецФункции
						
&НаСервере
Функция ПолучитьДанныеОперанда(Операнд)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ИсточникиДанныхДляРасчетов.Ссылка,
	|	ИсточникиДанныхДляРасчетов.СпособПолучения,
	|	ИсточникиДанныхДляРасчетов.ПоказательТекущегоОтчета,
	|	ИсточникиДанныхДляРасчетов.ПоказательОтбор.Код КАК ПоказательОтборКод,
	|	ИсточникиДанныхДляРасчетов.ПравилаИспользованияПолейЗапроса.(
	|		Ссылка,
	|		НомерСтроки,
	|		Поле,
	|		Синоним,
	|		АналитикаОперанда,
	|		КодАналитики,
	|		НастройкаСоответствия,
	|		РеквизитАналитики,
	|		ТаблицаАналитики,
	|		ТаблицаАналитикиВИБ,
	|		НеИспользоватьДляСинхронизации,
	|		СпособЗаполнения,
	|		ФиксированноеЗначение,
	|		РеквизитОбъекта
	|	) КАК ПравилаИспользованияПолейЗапроса
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	|ГДЕ
	|	ИсточникиДанныхДляРасчетов.Ссылка = &Операнд";
	
	Запрос.УстановитьПараметр("Операнд",Операнд);
	
	Возврат Запрос.Выполнить().Выгрузить()[0];
					 	
КонецФункции

&НаСервере
Функция РасшифроватьОперанд(Операнд, ИспользуемаяИБ,ИмяВладельца="",тСтруктураОтбора = Неопределено)
	
	ОбъектРасчета=ПолучитьИзВременногоХранилища(АдресХранилищаПеременныхДляРасчета);
	СтрОперанд= ПолучитьДанныеОперанда(Операнд);
	
	Если СтрОперанд.СпособПолучения=Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеПоказательОтчета Тогда
		
		МассивСервер=Новый Массив;
		МассивСервер.Добавить(СокрЛП(СтрОперанд.ПоказательОтборКод));
		
		МассивПоказателей=Новый ФиксированныйМассив(МассивСервер);
		
		ПоказательРасшифровкаСсылка = СтрОперанд.Ссылка.ПоказательОтбор;
		
		Если СтрОперанд.ПоказательТекущегоОтчета 
			И ИмяВладельца="Документ.НастраиваемыйОтчет.ФормаОбъекта" Тогда
						
			Возврат МассивПоказателей;
			
		Иначе	
			
			ТабЗапросы=УправлениеОтчетамиУХ.ПолучитьДанныеОперандовДляРасчета(,,,,Операнд).мТабПоказателиЗапросы;
			
			Если ТабЗапросы.Количество()=0 Тогда
				ОбщегоНазначенияУХ.СообщитьОбОшибке(Нстр("ru = 'Не удалось определить данные операнда для расчета.'"),,,СтатусСообщения.Внимание);
				Возврат Неопределено;
			КонецЕсли;
				
			ДанныеОтчетов=УправлениеОтчетамиУХ.ПолучитьТаблицуОтчетовРасшифровки(ОбъектРасчета,ТабЗапросы[0],СтруктураОтбора);
			
			ТабСписокОтчетов=ДанныеОтчетов.ТабСписокОтчетов;
				
			Для Каждого СтрОтчет ИЗ ТабСписокОтчетов Цикл
				
				НоваяСтрока=ДокументыРасшифровки.Добавить();
				
				Если ЗначениеЗаполнено(СтрОтчет.Регистратор) Тогда
					
					НоваяСтрока.ИмяОбъекта=СтрОтчет.Регистратор.Метаданные().Имя;
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрОтчет);
				НоваяСтрока.Ссылка=СтрОтчет.Регистратор;
				
			КонецЦикла;	
			
		КонецЕсли;
		
		СтруктураАналитики = Новый Структура;
		Для Номер = 1 По ОбъектРасчета.МаксАналитикОтчета Цикл
			АналитикаН = "Аналитика" + Номер;
			СтруктураАналитики.Вставить(АналитикаН, ОбъектРасчета[АналитикаН]);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Параметры.СтруктураОтбора) Тогда
						
			Для Каждого КлючИЗначение ИЗ Параметры.СтруктураОтбора Цикл
				
				СтрокаИсточник=СтрОперанд.ПравилаИспользованияПолейЗапроса.Найти(КлючИЗначение.Ключ,"КодАналитики");
				
				Если НЕ (СтрокаИсточник=Неопределено ИЛИ СтрНайти(СтрокаИсточник.Поле,"Аналитика")=0) Тогда
					
					ПутьКАналитике=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(СтрокаИсточник.Поле,".");
					
					СтруктураАналитики.Вставить(ПутьКАналитике[0],КлючИЗначение.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не тСтруктураОтбора = Неопределено Тогда
			
			Для Каждого КлючИЗначение ИЗ тСтруктураОтбора Цикл
				
				СтрокаИсточник=СтрОперанд.ПравилаИспользованияПолейЗапроса.Найти(КлючИЗначение.Ключ,"КодАналитики");
				
				Если НЕ (СтрокаИсточник=Неопределено ИЛИ СтрНайти(СтрокаИсточник.Поле,"Аналитика")=0) Тогда
					
					ПутьКАналитике=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(СтрокаИсточник.Поле,".");
					
					СтруктураАналитики.Вставить(ПутьКАналитике[0],КлючИЗначение.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

					
	Иначе
		
		КонтекстОтчета = ОбъектРасчета;
		Параметры.СтруктураОтбора = Новый Структура;
		
		Если Не тСтруктураОтбора = Неопределено Тогда
			
			Для Каждого КлючИЗначение ИЗ тСтруктураОтбора Цикл				
				Параметры.СтруктураОтбора.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);	
			КонецЦикла;
			
		КонецЕсли;
	
		Результат = УправлениеОтчетамиУХ.РасшифроватьДанныеОперанда(СтрОперанд.Ссылка, ОбъектРасчета,Параметры.СтруктураОтбора,ОбъектРасчета);
		Если ТипЗнч(КонтекстОтчета) = Тип("Структура") Тогда
			КонтекстОтчета.Свойство("ИспользуемаяИБ", ИспользуемаяИБ);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
			
КонецФункции // РасшифроватьОперанд()

&НаСервереБезКонтекста
Функция МногопериодныйЭкземпляр()
	
	Возврат ОбщегоНазначенияПовтИспУХ.ИспользуетсяМногопериоднаяОтчетность();
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДокументыРасшифровки(ИскатьОбъекты=Истина)
	
	Если ДокументыРасшифровки.Количество()>0 Тогда
		
		Для Каждого СтрДокумент ИЗ ДокументыРасшифровки Цикл
			
			СтруктураПараметров=Новый Структура;
			
			Если ЗначениеЗаполнено(СтрДокумент.Ссылка) Тогда
				
				ИмяФормыОбъекта="Документ."+СтрДокумент.ИмяОбъекта+".ФормаОбъекта";
				
				МассивПоказателейСсылка = Новый Массив;
				МассивПоказателейСсылка.Добавить(ПоказательРасшифровкаСсылка);
				МассивПоказателейСсылка = Новый ФиксированныйМассив(МассивПоказателейСсылка);
				
				СтруктураПараметров.Вставить("Ключ",СтрДокумент.Ссылка);
				СтруктураПараметров.Вставить("ДокументКлюч",СтрДокумент.Ссылка);
				СтруктураПараметров.Вставить("МассивПоказателей",МассивПоказателей);
				СтруктураПараметров.Вставить("МассивПоказателейСсылка",МассивПоказателейСсылка);
				СтруктураПараметров.Вставить("мТекущаяВалюта",Параметры.мТекущаяВалюта);
				СтруктураПараметров.Вставить("СтруктураОтбора",СтруктураАналитики);
				СтруктураПараметров.Вставить("ПериодРасшифровки",СтрДокумент.ПериодОтчета);
				СтруктураПараметров.Вставить("УникальныйИдентификаторСеанса", УникальныйИдентификатор);
								
				Если СтрДокумент.ИмяОбъекта="НастраиваемыйОтчет"
					И МассивПоказателей.Количество()=1
					И ТипЗнч(Параметры.СтруктураОтбора)=Тип("Структура")
					И (Не МногопериодныйЭкземпляр()) Тогда
					
					Форма=ПолучитьФорму(ИмяФормыОбъекта,СтруктураПараметров);
					Форма.Открыть();
					Форма.ОткрытьФормуРаскрытияПоАналитике(МассивПоказателей[0],,СтруктураАналитики);
					
				Иначе
										
					Если (НЕ ВладелецФормы=Неопределено) Тогда
						
						Если ВладелецФормы.ИмяФормы = "Обработка.АналитическийБланк.Форма.ФормаРаскрытияПоказателей" И ВладелецФормы.Ссылка = СтрДокумент.Ссылка Тогда
							ВладелецФормы.ВыделитьОбластиПоказателей(СтруктураПараметров,СтруктураПараметров.ПериодРасшифровки,СтруктураПараметров.СтруктураОтбора);
							ВладелецФормы.Активизировать();
							
						ИначеЕсли НЕ ВладелецФормы.ИмяФормы = "Обработка.АналитическийБланк.Форма.ФормаРаскрытияПоказателей" 
							И ВладелецФормы.Объект.Свойство("Ссылка") 
							И ВладелецФормы.Объект.Ссылка = СтрДокумент.Ссылка Тогда		
							ВладелецФормы.ВыделитьОбластиПоказателей(СтруктураПараметров,СтруктураПараметров.ПериодРасшифровки,СтруктураПараметров.СтруктураОтбора);
							ВладелецФормы.Активизировать();
						Иначе	
							ОткрытьФорму(ИмяФормыОбъекта,СтруктураПараметров);

						КонецЕсли;
					Иначе	
						ОткрытьФорму(ИмяФормыОбъекта,СтруктураПараметров);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Если НЕ ИскатьОбъекты Тогда
					
					Возврат;
					
				КонецЕсли;
				
				ДокументСсылка=ПолучитьЭкземплярОтчета(СтрДокумент.Организация,СтрДокумент.ПериодОтчета,
				СтрДокумент.Сценарий,СтрДокумент.ВидОтчета,,Истина,Истина,,?(ЗначениеЗаполнено(СтрДокумент.Проект),СтрДокумент.Проект,Неопределено));
				
				Если ЗначениеЗаполнено(ДокументСсылка) Тогда
					
					МассивПоказателейСсылка = Новый Массив;
					МассивПоказателейСсылка.Добавить(ПоказательРасшифровкаСсылка);
					МассивПоказателейСсылка = Новый ФиксированныйМассив(МассивПоказателейСсылка);
						
					СтруктураПараметров.Вставить("Ключ",ДокументСсылка);
					СтруктураПараметров.Вставить("ДокументКлюч",ДокументСсылка);
					СтруктураПараметров.Вставить("МассивПоказателей",МассивПоказателей);
					СтруктураПараметров.Вставить("МассивПоказателейСсылка",МассивПоказателейСсылка);
					СтруктураПараметров.Вставить("мТекущаяВалюта",Параметры.мТекущаяВалюта);
					СтруктураПараметров.Вставить("СтруктураОтбора",СтруктураАналитики);
					СтруктураПараметров.Вставить("ПериодРасшифровки",СтрДокумент.ПериодОтчета);
					СтруктураПараметров.Вставить("УникальныйИдентификаторСеанса", УникальныйИдентификатор);
					
					Если ТипЗнч(Параметры.СтруктураОтбора)=Тип("Структура")
						И (Не МногопериодныйЭкземпляр()) Тогда
						
						Форма=ПолучитьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта",СтруктураПараметров);
						Форма.Открыть();
						Форма.ОткрытьФормуРаскрытияПоАналитике(МассивПоказателей[0],,СтруктураАналитики);
						
					Иначе
						
						Если (НЕ ВладелецФормы=Неопределено) Тогда
							
							Если ВладелецФормы.ИмяФормы = "Обработка.АналитическийБланк.Форма.ФормаРаскрытияПоказателей" И ВладелецФормы.Ссылка = ДокументСсылка Тогда
								ВладелецФормы.ВыделитьОбластиПоказателей(СтруктураПараметров,СтруктураПараметров.ПериодРасшифровки,СтруктураПараметров.СтруктураОтбора);
								ВладелецФормы.Активизировать();
								
							ИначеЕсли НЕ ВладелецФормы.ИмяФормы = "Обработка.АналитическийБланк.Форма.ФормаРаскрытияПоказателей" 
								И ВладелецФормы.Объект.Свойство("Ссылка")
								И ВладелецФормы.Объект.Ссылка = ДокументСсылка Тогда		
								ВладелецФормы.ВыделитьОбластиПоказателей(СтруктураПараметров,СтруктураПараметров.ПериодРасшифровки,СтруктураПараметров.СтруктураОтбора);
								ВладелецФормы.Активизировать();
							Иначе	
								ОткрытьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта",СтруктураПараметров);
							КонецЕсли;
						Иначе
							
							ОткрытьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта",СтруктураПараметров);            
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОткрытьДокументыРасшифровки()

&НаСервереБезКонтекста
Функция ПолучитьЭкземплярОтчета(Организация,ПериодОтчета,Сценарий,ВидОтчета,
	ОсновнаяВалюта=Неопределено,ПроверятьНаличие=Истина,СоздаватьНовые=Истина,Комментарий="",Проект=Неопределено)
	
	Возврат Документы.НастраиваемыйОтчет.ПолучитьЭкземплярОтчета(Организация,ПериодОтчета,Сценарий,ВидОтчета,
			ОсновнаяВалюта,ПроверятьНаличие,СоздаватьНовые,Комментарий,Проект);
		
КонецФункции // ПолучитьЭкземплярОтчета() 

&НаКлиенте
Процедура ОтображатьНаименованияПриИзменении(Элемент)
	
		
	ОбластьФормулы=ПолеТабличногоДокумента.Область("ТекстПроцедуры");
	
	ОбластьПоиска=ПолеТабличногоДокумента.Область(1,2,ПолеТабличногоДокумента.ВысотаТаблицы,ПолеТабличногоДокумента.ШиринаТаблицы);
	
	Для Каждого Строка ИЗ КодыНаименованияОперандов Цикл
		
		Если ОтображатьНаименования=1 Тогда
			
			ТекущийТекст = СтрЗаменить(ТекущийТекст,Строка.КодУпрощеннойФормулы, Строка.Наименование);
			
			ТекОбласть=ПолеТабличногоДокумента.НайтиТекст(Строка.КодУпрощеннойФормулы,,ОбластьПоиска,,Истина);
			
			Пока ТекОбласть<>Неопределено Цикл	
				
				Если НЕ ТекОбласть.СодержитЗначение Тогда
					
					ТекОбласть.Текст = СтрЗаменить(ТекОбласть.Текст, Строка.КодУпрощеннойФормулы, Строка.Наименование);
					
				КонецЕсли;
				
				ТекОбласть=ПолеТабличногоДокумента.НайтиТекст(Строка.КодУпрощеннойФормулы,ТекОбласть,ОбластьПоиска,,Истина);		
				
			КонецЦикла;
			
		Иначе
			
			ТекущийТекст=СтрЗаменить(ТекущийТекст, Строка.Наименование, Строка.КодУпрощеннойФормулы);
			
			ТекОбласть=ПолеТабличногоДокумента.НайтиТекст(Строка.Наименование,,ОбластьПоиска,,Истина);
			
			Пока ТекОбласть<>Неопределено Цикл	
				
				Если НЕ ТекОбласть.СодержитЗначение Тогда
					
					ТекОбласть.Текст=Строка.КодУпрощеннойФормулы;
					
				КонецЕсли;
				
				ТекОбласть=ПолеТабличногоДокумента.НайтиТекст(Строка.Наименование,ТекОбласть,ОбластьПоиска,,Истина);		
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстФормулыИсходный		=	ТекущийТекст;
	
	ОбновитьФормулуРасчета();
	
КонецПроцедуры



