
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьИменаСубконто() Экспорт
	
	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетДоходовПоПереоценкеСубконто1");
	Субконто.Вставить(2, "СчетДоходовПоПереоценкеСубконто2");
	Субконто.Вставить(3, "СчетДоходовПоПереоценкеСубконто3");
	
	Результат.Вставить("СчетДоходовПоПереоценке", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетРасходовПоПереоценкеСубконто1");
	Субконто.Вставить(2, "СчетРасходовПоПереоценкеСубконто2");
	Субконто.Вставить(3, "СчетРасходовПоПереоценкеСубконто3");
	
	Результат.Вставить("СчетРасходовПоПереоценке", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетНакопленнойПереоценкиСубконто1");
	Субконто.Вставить(2, "СчетНакопленнойПереоценкиСубконто2");
	Субконто.Вставить(3, "СчетНакопленнойПереоценкиСубконто3");
	
	Результат.Вставить("СчетНакопленнойПереоценки", Субконто);	
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаРезерваСубконто1");
	Субконто.Вставить(2, "СчетУчетаРезерваСубконто2");
	Субконто.Вставить(3, "СчетУчетаРезерваСубконто3");
	
	Результат.Вставить("СчетУчетаРезерва", Субконто);		
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
