//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеУзловОбъектовЭксплуатации);
	ОписаниеОтчета.ФункциональныеОпции.Добавить("ИспользоватьУзлыОбъектовЭксплуатации");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какой статус?
									 |Какая наработка?
									 |Какие виды ремонтов проводились и когда?
									 |Какие дефекты были зарегистрированы?
									 |Когда были выполнены последние ремонты?
									 |Какие текущие и плановые показатели наработок?
									 |Какой остаточный ресурс в величине показателя и срока службы?';
									 |en = 'Check the sub-asset status.
									 |Verify the operating time.
									 |See what R&M works were carried out and when.
									 |Check what defects were registered.
									 |See the last R&M performed.
									 |Take an overview of the current and planned operating time units.
									 |Track the residual lifetime in terms of unit and service life.'");
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеУзловОбъектовЭксплуатации");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какой статус?
									 |Какая наработка?
									 |Какие виды ремонтов проводились и когда?
									 |Какие дефекты были зарегистрированы?
									 |Когда были выполнены последние ремонты?
									 |Какие текущие и плановые показатели наработок?
									 |Какой остаточный ресурс в величине показателя и срока службы?';
									 |en = 'Check the sub-asset status.
									 |Verify the operating time.
									 |See what R&M works were carried out and when.
									 |Check what defects were registered.
									 |See the last R&M performed.
									 |Take an overview of the current and planned operating time units.
									 |Track the residual lifetime in terms of unit and service life.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
