#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоБазоваяВерсияКонфигурации = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();;
	ТолькоПросмотр = ЭтоБазоваяВерсияКонфигурации;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоБазоваяВерсияКонфигурации Тогда
		
		ТолькоПросмотр = Истина;
		
		ТекстСообщения = НСтр("ru = 'Используются ограничения базовой версии. Выбранный план обмена не доступен.';
								|en = 'Base version restrictions are used. The selected exchange plan is unavailable.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти