
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АккредитацияПоставщиковУХ.ПриСозданииНаСервереФормыВнешнегоПоставщика(ЭтаФорма, Отказ, "Список", "Ссылка", "Ссылка", Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСреза = Параметры.ДатаСреза;
	Если НЕ ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДатаСеанса();
		Элементы.ДатаСреза.ТолькоПросмотр = Ложь;
	КонецЕсли;
	УстановитьОтборПоДатеСреза();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДатеСреза()
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", ДатаСреза);
КонецПроцедуры

&НаКлиенте
Процедура ДатаСрезаПриИзменении(Элемент)
	УстановитьОтборПоДатеСреза();
КонецПроцедуры
