#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьЗаголовки(СхемаКомпоновкиДанных) Экспорт
	
	Поля = СхемаКомпоновкиДанных.ВычисляемыеПоля;
	
	Выражение = НСтр("ru = '""Раздел ВГО: "" + %1'");
	УстановитьВыражение(Поля, "РазделВГОДляГруппы", СтрШаблон(Выражение, "РазделВГО.Наименование"));
	
	Выражение = НСтр("ru = '""Контрагент: "" + %1 + "" (ИНН "" + %2 + "")""'");
	Выражение = СтрШаблон(Выражение, "Контрагент.Наименование", "Контрагент.ИНН");
	УстановитьВыражение(Поля, "КонтрагентДляГруппы", Выражение);
    
КонецПроцедуры

Процедура УстановитьВыражение(Поля, ИмяПоля, Выражение)
	
	Поле = Поля.Найти(ИмяПоля);
	Если Поле = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Поле.Выражение = Выражение;

КонецПроцедуры
	
#КонецЕсли
