
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодготовитьФормуНаСервере(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура СчетСписанияПриВыбытииПриИзменении(Элемент)
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СчетВыбытияВНАПриИзменении(Элемент)
	
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланСчетовБДПриИзменении(Элемент)
	МСФОКлиентСерверУХ.УстановитьПланСчетов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПодготовитьФормуНаСервере(Форма)
	
	Форма.КэшируемыеЗначения = Новый Структура;	
	Форма.КэшируемыеЗначения.Вставить("ИменаСубконто", 		Справочники.ПараметрыВыбытияВНАМСФО.ПолучитьИменаСубконто());
	Форма.КэшируемыеЗначения.Вставить("КлючевыеСубконто", 	МСФОВНАУХ.ПолучитьКлючевыеСубконтоВНА());

	ПланСчетовБД = МСФОКлиентСерверУХ.ПланСчетовПараметровУчета(Форма.Объект.СчетСписанияПриВыбытии);
	
	ПараметрыВыбораИсточник = Новый Массив;
	ПараметрыВыбораИсточник.Добавить(Новый ПараметрВыбора("Владелец", ПланСчетовБД));
	ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораИсточник);	
	
	Для каждого ИмяСчета Из Форма.КэшируемыеЗначения.ИменаСубконто Цикл
		Форма.Элементы[ИмяСчета.Ключ].ПараметрыВыбора = ПараметрыВыбора;
		МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(Форма, ИмяСчета.Ключ);
	КонецЦикла;
	
	УправлениеФормой(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
			
КонецПроцедуры

#КонецОбласти