
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Сохраняет место партий в структуре заказа.
// 
// Параметры:
//  Таблица - ТаблицаЗначений - Данные партий
//  
Процедура ЗаписатьНовыеПартии(Таблица) Экспорт
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.МестоПартииВСтруктуреЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Таблица);
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
