
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Метрика.СписокВыбора.Добавить("КоличествоРисков",		НСтр("ru = 'Количество рисков'"));
	Элементы.Метрика.СписокВыбора.Добавить("КоличествоМероприятий", НСтр("ru = 'Количество мероприятий'"));
	Элементы.Метрика.СписокВыбора.Добавить("ПлановыеЗатраты",		НСтр("ru = 'Плановые затраты'"));
	Элементы.Метрика.СписокВыбора.Добавить("ФактическиеЗатраты",	НСтр("ru = 'Фактические затраты'"));
	Элементы.Метрика.СписокВыбора.Добавить("Инциденты",				НСтр("ru = 'Инциденты'"));
	Элементы.Метрика.СписокВыбора.Добавить("ПризнанныйУбыток",		НСтр("ru = 'Признанный ущерб'"));
	Отчет.Метрика = Элементы.Метрика.СписокВыбора[0].Значение;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаОшибка.Видимость = ПроверитьЗаполненностьУровнейРисков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МетрикаПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Отчет.НачалоПериода, Отчет.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Отчет, РезультатВыбора, "НачалоПериода, КонецПериода");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	Диаграмма.Очистить();
	
	ИмяРесурса = Отчет.Метрика;
	
	Диаграмма.Обновление = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииУщерба.Ссылка КАК Ссылка,
		|	КатегорииУщерба.Представление КАК Представление
		|ИЗ
		|	Справочник.КатегорииУщерба КАК КатегорииУщерба
		|ГДЕ
		|	КатегорииУщерба.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорииУщерба.МинимальныйУщерб";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивТочек = Новый Массив;
	
	Для Инд = 0 По РезультатЗапроса.Количество() - 1 Цикл
		Диаграмма.Точки.Добавить(РезультатЗапроса[Инд].Представление);
		МассивТочек.Добавить(РезультатЗапроса[Инд].Ссылка);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВероятностиРисков.Ссылка КАК Ссылка,
		|	ВероятностиРисков.МинимальнаяВероятность КАК МинимальнаяВероятность,
		|	ВероятностиРисков.МаксимальнаяВероятность КАК МаксимальнаяВероятность,
		|	ВероятностиРисков.Представление КАК Представление
		|ИЗ
		|	Справочник.ВероятностиРисков КАК ВероятностиРисков
		|ГДЕ
		|	ВероятностиРисков.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	МинимальнаяВероятность";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Уровни = Новый Соответствие();
	Значения = Новый Соответствие();
	
	Для Уровень = 1 По 3 Цикл
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СоответствиеСерий = Новый Соответствие();
		СоответствиеСерийЗначения = Новый Соответствие();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Серия = Диаграмма.Серии.Добавить(ВыборкаДетальныеЗаписи.Представление);
			Серия.Цвет = ?(Уровень = 3, Новый Цвет(237, 56, 51),?(Уровень = 1, Новый Цвет(115, 244, 64), Новый Цвет(253, 248, 81)));
			СерияЗначение = Диаграмма.Серии.Добавить(ИмяРесурса);
			Для Инд = 0 По МассивТочек.ВГраница() Цикл
				Диаграмма.УстановитьЗначение(Инд, Серия, ВыборкаДетальныеЗаписи.МаксимальнаяВероятность);
				Диаграмма.УстановитьЗначение(Инд, СерияЗначение, -1);
			КонецЦикла;
			СоответствиеСерий.Вставить(ВыборкаДетальныеЗаписи.Ссылка, Серия);
			СоответствиеСерийЗначения.Вставить(ВыборкаДетальныеЗаписи.Ссылка, СерияЗначение);
		КонецЦикла;
		
		Уровни.Вставить(Уровень, СоответствиеСерий);
		Значения.Вставить(Уровень, СоответствиеСерийЗначения);
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаУровняРиска.Вероятность КАК Вероятность,
		|	УстановкаУровняРиска.Ущерб КАК Ущерб,
		|	УстановкаУровняРиска.УровеньРиска КАК УровеньРиска,
		|	Мероприятие.Ссылка КАК КоличествоМероприятий,
		|	Риски.Ссылка КАК КоличествоРисков,
		|	Риски.ОценкаПоследствий КАК ОценкаПоследствий,
		|	Мероприятие.РезультатВыполнения КАК РезультатВыполнения,
		|	Мероприятие.ПлановыеЗатраты КАК ПлановыеЗатраты,
		|	Мероприятие.ФактическиеЗатраты КАК ФактическиеЗатраты,
		|	РисковоеСобытие.Ссылка КАК Инциденты,
		|	РисковоеСобытие.ПризнанныйУбыток КАК ПризнанныйУбыток
		|ИЗ
		|	РегистрСведений.УстановкаУровняРиска КАК УстановкаУровняРиска
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Риски КАК Риски
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Мероприятие КАК Мероприятие
		|			ПО Риски.Ссылка = Мероприятие.Контекст
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РисковоеСобытие КАК РисковоеСобытие
		|			ПО Риски.Ссылка = РисковоеСобытие.Риск
		|		ПО УстановкаУровняРиска.Вероятность = Риски.Вероятность
		|			И УстановкаУровняРиска.Ущерб = Риски.Ущерб
		|			И (Риски.ПометкаУдаления = ЛОЖЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ущерб
		|ИТОГИ
		|	МАКСИМУМ(УровеньРиска),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоМероприятий),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРисков),
		|	СУММА(ОценкаПоследствий),
		|	СУММА(ПлановыеЗатраты),
		|	СУММА(ФактическиеЗатраты),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Инциденты),
		|	СУММА(ПризнанныйУбыток)
		|ПО
		|	Вероятность,
		|	Ущерб";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВероятность = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВероятность.Следующий() Цикл
	
		ВыборкаУщерб = ВыборкаВероятность.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаУщерб.Следующий() Цикл
	        ИндексТочки = МассивТочек.Найти(ВыборкаУщерб.Ущерб);
			Если ИндексТочки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ВыборкаУщерб.УровеньРиска = Справочники.УровниРиска.Низкий Тогда
				Уровень = 1;
			ИначеЕсли ВыборкаУщерб.УровеньРиска = Справочники.УровниРиска.Средний Тогда
				Уровень = 2;

			ИначеЕсли ВыборкаУщерб.УровеньРиска = Справочники.УровниРиска.Высокий Тогда
				Уровень = 3;
			Иначе
				Продолжить;
			КонецЕсли;
			Диаграмма.УстановитьЗначение(ИндексТочки, Значения.Получить(Уровень).Получить(ВыборкаВероятность.Вероятность), ?(ЗначениеЗаполнено(ВыборкаУщерб[Отчет.Метрика]) = 0, -1, ВыборкаУщерб[Отчет.Метрика]));
		КонецЦикла;
	КонецЦикла;
	
	
	Диаграмма.ИсточникЗначенийОсиТочек = ИсточникЗначенийОсиТочекДиаграммы.Точки;
	Диаграмма.ОтображениеОтрицательныхЗначенийПузырьковойДиаграммы = ОтображениеОтрицательныхЗначенийПузырьковойДиаграммы.НеОтображать;
	
	Диаграмма.Обновление = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЗаполненностьУровнейРисков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВероятностиРисков.Ссылка КАК Вероятность,
		|	КатегорииУщерба.Ссылка КАК Ущерб
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Справочник.ВероятностиРисков КАК ВероятностиРисков,
		|	Справочник.КатегорииУщерба КАК КатегорииУщерба
		|ГДЕ
		|	ВероятностиРисков.ПометкаУдаления = ЛОЖЬ
		|	И КатегорииУщерба.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВременнаяТаблица.Вероятность КАК Вероятность
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановкаУровняРиска КАК УстановкаУровняРиска
		|		ПО ВременнаяТаблица.Вероятность = УстановкаУровняРиска.Вероятность
		|			И ВременнаяТаблица.Ущерб = УстановкаУровняРиска.Ущерб
		|ГДЕ
		|	УстановкаУровняРиска.УровеньРиска ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

#КонецОбласти


