
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПредставлениеПлатежногоКалендаря.Организация КАК Организация,
	|	ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ПредставлениеПлатежногоКалендаря.Валюта КАК Валюта,
	|	ПредставлениеПлатежногоКалендаря.Дата КАК Дата,
	|	ПредставлениеПлатежногоКалендаря.Банк КАК Банк,
	|	ПредставлениеПлатежногоКалендаря.ПулЛиквидности КАК ПулЛиквидности,
	|	ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря КАК РазделПлатежногоКалендаря,
	|	ВЫБОР
	|		КОГДА ПредставлениеПлатежногоКалендаря.Сумма >= 0
	|			ТОГДА ПредставлениеПлатежногоКалендаря.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПриход,
	|	ВЫБОР
	|		КОГДА ПредставлениеПлатежногоКалендаря.Сумма <= 0
	|			ТОГДА -ПредставлениеПлатежногоКалендаря.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасход
	|ИЗ
	|	РегистрСведений.ПредставлениеПлатежногоКалендаря КАК ПредставлениеПлатежногоКалендаря
	|ГДЕ
	|	ПредставлениеПлатежногоКалендаря.ИдентификаторДобавившейОперации = &ИдентификаторОперации
	|	И ПредставлениеПлатежногоКалендаря.ВерсияПлатежногоКалендаря = &ВерсияПлатежногоКалендаря
	|	И ПредставлениеПлатежногоКалендаря.Пользователь = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредставлениеПлатежногоКалендаря.Организация,
	|	ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса,
	|	ПредставлениеПлатежногоКалендаря.Валюта,
	|	ПредставлениеПлатежногоКалендаря.Дата,
	|	ПредставлениеПлатежногоКалендаря.Банк,
	|	ПредставлениеПлатежногоКалендаря.ПулЛиквидности,
	|	ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря,
	|	ВЫБОР
	|		КОГДА ПредставлениеПлатежногоКалендаря.Сумма >= 0
	|			ТОГДА -ПредставлениеПлатежногоКалендаря.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПредставлениеПлатежногоКалендаря.Сумма <= 0
	|			ТОГДА ПредставлениеПлатежногоКалендаря.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.ПредставлениеПлатежногоКалендаря КАК ПредставлениеПлатежногоКалендаря
	|ГДЕ
	|	ПредставлениеПлатежногоКалендаря.ВерсияПлатежногоКалендаря = &ВерсияПлатежногоКалендаря
	|	И ПредставлениеПлатежногоКалендаря.Пользователь = &Пользователь
	|	И ПредставлениеПлатежногоКалендаря.ИдентификаторОтменившейОперации = &ИдентификаторОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата");
	
	Запрос.УстановитьПараметр("ИдентификаторОперации", Параметры.ИдентификаторОперации);
	Запрос.УстановитьПараметр("ВерсияПлатежногоКалендаря", 
						Справочники.СохраненныеВерсииПлатежногоКалендаря.ПустаяСсылка());
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	ЗависимыеЯчейки.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ПредставлениеОперации = Параметры.ПредставлениеОперации;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКЯчейке(Команда)
	
	ПерейтиКВыбраннойЯчейке();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЗависимыеЯчейки

&НаКлиенте
Процедура ЗависимыеЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПерейтиКВыбраннойЯчейке();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерейтиКВыбраннойЯчейке()
	
	ТекущаяСтрока = Элементы.ЗависимыеЯчейки.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = Элементы.ЗависимыеЯчейки.ТекущиеДанные;
		ДанныеЯчейки = Новый Структура("Организация, БанковскийСчетКасса, Дата,
								|Валюта, Банк, ПулЛиквидности, РазделПлатежногоКалендаря");
		ЗаполнитьЗначенияСвойств(ДанныеЯчейки, ТекущиеДанные);
		Закрыть(ДанныеЯчейки);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите строку в списке зависимых ячеек!'"));
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти