
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьСчета() Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетаУчетаФИ.Ссылка КАК Ссылка,
	|	СчетаУчетаФИ.ЭтоГруппа КАК ЭтоГруппа,
	|	СчетаУчетаФИ.Наименование КАК Наименование,
	|	СчетаУчетаФИ.Забалансовый КАК Забалансовый,
	|	СчетаУчетаФИ.РазделПланаСчетов КАК РазделПланаСчетов,
	|	СчетаУчетаФИ.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	СчетаУчетаФИ.Родитель.ИмяПредопределенныхДанных КАК Родитель,
	|	СчетаУчетаФИ.Код КАК Код,
	|	СчетаУчетаФИ.Описание КАК Описание
	|ИЗ
	|	Справочник.СчетаУчетаФИ КАК СчетаУчетаФИ
	|ГДЕ
	|	НЕ СчетаУчетаФИ.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетаУчетаФИ.Код");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область ОбновлениеПредопределенныхСтарое

Процедура ОбновитьПредопределенные() Экспорт

	КэшРазделПланаСчетов = Неопределено;
	ТабДок = Справочники.СчетаУчетаФИ.ПолучитьМакет("ЗаполнениеПредопределенных");
	
	Для НомерСтроки = 2 По ТабДок.ВысотаТаблицы Цикл
		
		ИмяПредопределенного = ТабДок.Область(НомерСтроки, 1).Текст;
		ПредопределенныйЭлемент = Справочники.СчетаУчетаФИ[ИмяПредопределенного];
		
		Если ПредопределенныйЭлемент.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Объект = ПредопределенныйЭлемент.ПолучитьОбъект();
		
		Объект.РазделПланаСчетов	= РазделПланаСчетовИзТекста(СокрЛП(ТабДок.Область(НомерСтроки, 2).Текст), КэшРазделПланаСчетов);
		Объект.Забалансовый 		= ЗначениеИзТекста(ТабДок.Область(НомерСтроки, 3).Текст);
		Объект.Описание 			= СокрЛП(ТабДок.Область(НомерСтроки, 4).Текст);
		
		Объект.Записать();			
		
	КонецЦикла;

КонецПроцедуры

Функция ЗначениеИзТекста(ТекстОбласти)
	Возврат ?(ТекстОбласти = "Истина", Истина, ?(ТекстОбласти = "Ложь", Ложь, Неопределено));
КонецФункции

Функция РазделПланаСчетовИзТекста(ТекстОбласти, КэшРазделПланаСчетов = Неопределено)

	Если КэшРазделПланаСчетов = Неопределено Тогда
	
		КэшРазделПланаСчетов = Новый Соответствие;
		Выборка = Справочники.РазделыПланаСчетов.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Предопределенный Тогда
				КэшРазделПланаСчетов.Вставить(Выборка.ИмяПредопределенныхДанных, Выборка.Ссылка);
			КонецЕсли;			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат КэшРазделПланаСчетов.Получить(ТекстОбласти);

КонецФункции

#КонецОбласти

#Область ОбновлениеПредопределенных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов справочника.
//  ТабличныеЧасти - Структура из КлючИЗначение - данные заполнения табличных частей.
//                                                Состав колонок соответствует набору реквизитов табличных частей.
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АктивыОбязательства";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Активы и обязательства'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00100";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Лизинг";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Лизинг'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00400";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДоходыРасходы";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счета учета доходов и расходов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00200";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Переоценка";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счета учета переоценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00300";
	
	// элементы
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетАктиваДолгосрочный";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет актива долгосрочный'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00101";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета долгосрочной части финансового актива. Служит для отражения учетной стоимости долгосрочного финансового актива (справедливой или амортизированной), за вычетом краткосрочной задолженности по этому активу'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетАктиваКраткосрочный";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет актива краткосрочный'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00102";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета краткосрочных финансовых активов. Служит для отражения учетной стоимости краткосрочного финансового актива (справедливой или амортизированной)'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетОбязательстваДолгосрочный";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет обязательства долгосрочный'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00103";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета долгосрочной части финансового обязательства. Служит для отражения учетной стоимости долгосрочного финансового обязательства, за вычетом краткосрочной задолженности по этому обязательству'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетОбязательстваКраткосрочный";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет обязательства краткосрочный'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00104";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета краткосрочных финансовых обязательств. Служит для отражения учетной стоимости краткосрочного финансового обязательства'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетКраткосрочнойЧасти";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет краткосрочной части долгосрочного финансового инструмента'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00105";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета краткосрочной части долгосрочных финансовых активов и обязательств. Служит для отражения краткосрочной задолженности по долгосрочным финансовым активам и обязательствам, например для выделения задолженности по долгосрочному кредиту, подлежащей погашению в течение 12 месяцев после отчетной даты'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетКраткосрочныхПроцентов";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет краткосрочных процентов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00106";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета задолженности по процентам, срок уплаты которых наступит в течение следующих 12 месяцев после отчетной даты'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетДолгосрочныхПроцентов";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет долгосрочных процентов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00107";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета задолженности по процентам, срок уплаты которых наступит не ранее чем через 12 месяцев после отчетной даты'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетСправедливойСтоимости";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет справедливой стоимости для Примечаний'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00108";
	Элемент.Забалансовый = Истина;
	Элемент.Описание = НСтр("ru = 'Забалансовый справочный счет для учета справедливой стоимости финансового инструмента, рассчитанной как произведение его котировки на количество котируемых инструментов на отчетную дату'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетАмортизацииПоправки";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет дисконта (поправка по ЧПС)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00109";
	Элемент.Забалансовый = Истина;
	Элемент.Описание = НСтр("ru = 'Забалансовый справочный счет для учета дохода/расхода от изменения справедливой стоимости, признанного в отчете о прибылях и убытках или капитале за отчетный период. На счете отражается доход/расход по финансовому инструменту, рассчитанный с применением эффективной процентной ставки в разрезе периодов. На основе расшифровки по счету можно сформировать таблицу амортизации поправки по справедливой стоимости с применением эффективной процентной ставки в разрезе периодов'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетНачисленияАванса";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет аванса по НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00115";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета аванса выданного в счет оплаты задолженности за полученной лизинг'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетНДССРеализации";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет НДС с реализации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00120";
	Элемент.Забалансовый = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетДисконтаБалансовый";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.АктивыОбязательства;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет дисконта (поправка по ЧПС)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00140";
	Элемент.Забалансовый = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетНачисленияПлатежа";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет начисления платежа'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00402";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета краткосрочной задолженности по платежам по финансовому лизингу. Служит для отражения задолженности по текущим платежам, срок выплаты которых уже наступил в соответствии с договором лизинга. Долгосрочные обязательства по финансовому лизингу уменьшаются на сумму начисленного платежа в момент наступления срока его уплаты - эта задолженность переносится на счет начисления платежа'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетПрочейЗадолженностиКраткосрочный";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет прочей задолженности краткосрочный'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00403";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.Взаиморасчеты;
	Элемент.Описание = НСтр("ru = 'Счет учета краткосрочной задолженности по договорам финансового лизинга. Служит для учета краткосрочной задолженности не связанной с минимальными арендными платежами - задолженность по пеням, штрафам, условные платежи и т.п.'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРаскрытияМинимальныхПлатежей";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет раскрытия минимальных платежей'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00404";
	Элемент.Забалансовый = Истина;
	Элемент.Описание = НСтр("ru = 'Забалансовый справочный счет, на котором отражается сумма минимальных арендных платежей в разрезе периодов и в соответствии с графиком платежей в договоре лизинга'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетБудущихРасходов";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет будущих расходов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00405";
	Элемент.Забалансовый = Истина;
	Элемент.Описание = НСтр("ru = 'Забалансовый справочный счет, на котором отражается сумма будущих расходов (процентов) по договору лизинга полученного, посчитанная с применением эффективной процентной ставки, в разрезе периодов их начисления'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетБудущихДоходов";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет будущих доходов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00406";
	Элемент.Забалансовый = Истина;
	Элемент.Описание = НСтр("ru = 'Забалансовый справочный счет, на котором отражается сумма будущих доходов (процентов) по договору лизинга выданного, посчитанная с применением эффективной процентной ставки, в разрезе периодов их начисления'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРаскрытияЧистыеИнвестиции";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет раскрытия чистые инвестиции'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00407";
	Элемент.Забалансовый = Истина;
	Элемент.Описание = НСтр("ru = 'Забалансовый справочный счет, на котором отражается номинальная сумма чистой инвестиции в аренду'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетДоходаОсновной";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет поправки - доход'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00201";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается сумма поправки по дисконтированию финансовых обязательств'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРасходаОсновной";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет поправки - расход'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00202";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается сумма поправки по дисконтированию финансовых активов'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетДоходаПоПроцентам";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет дохода по процентам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00203";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается процентный доход от амортизации поправки по дисконтированию финансовых активов'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРасходаПоПроцентам";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет расхода по процентам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00204";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается процентный расход от амортизации поправки по дисконтированию финансовых обязательств'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетОбесценения";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет обесценения'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00205";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается убыток от обесценения финансовых инструментов, учитываемых по амортизируемой стоимости'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетДоходаПоКурсовымРазницам";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет дохода по курсовым разницам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00206";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках или отчете о совокупном доходе, на котором отражаются положительные курсовые разницы'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРасходаПоКурсовымРазницам";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет расхода по курсовым разницам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00207";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках или отчете о совокупном доходе, на котором отражаются отрицательные курсовые разницы'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетДоходаОтВыбытия";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет дохода от выбытия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00408";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках или отчете о совокупном доходе, на котором отражается доход от продажи финансовых инструментов'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРасходаОтВыбытия";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет расхода от выбытия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00409";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках или отчете о совокупном доходе, на котором отражается себестоимость выбывающих в результате продажи или списания финансовых инструментов'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетСписанияНеарендногоПлатежа";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.ДоходыРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет списания неарендного платежа'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00410";
	Элемент.Забалансовый = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетДоходаОтПереоценки";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Переоценка;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет дохода от переоценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00301";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается сумма положительной переоценки финансовых инструментов, учитываемых по справедливой стоимости через ОПУ'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРасходаОтПереоценки";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Переоценка;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет расхода от переоценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00302";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается сумма отрицательной переоценки финансовых инструментов, учитываемых по справедливой стоимости через ОПУ'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетКапиталаПриПереоценке";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Переоценка;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет капитала при переоценке'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00303";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в составе прочего совокупного дохода , на котором отражается сумма переоценки финансовых инструментов, учитываемых по справедливой стоимости через ПСД'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетУбыткаОтОбесценения";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Переоценка;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет убытка от обесценения'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00304";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором отражается убыток от обесценения финансовых инструментов, учитываемых по справедливой стоимости'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРеализованнойПереоценки";
	Элемент.Родитель = Справочники.СчетаУчетаФИ.Переоценка;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет реализованной переоценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "00305";
	Элемент.Забалансовый = Ложь;
	Элемент.РазделПланаСчетов = Справочники.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы;
	Элемент.Описание = НСтр("ru = 'Счет в отчете о прибылях и убытках , на котором будет реклассифицирована величина переоценки из капитала в случае выбытия переоцененных финансовых инструментов'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.НастройкиХозяйственныхОпераций - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
