#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму редактирования корректировок выплаты сотрудника.
//
// Параметры:
//   ПараметрыФормы - Структура - См. функцию ПараметрыФормыРедактированияСтажейСотрудника().
//   Обработчик - ОписаниеОповещения - Описание процедуры, вызываемой при окончании редактировании стажей с параметрами.
//       * АдресРезультата - Неопределено, КодВозвратаДиалога, Строка - 
//           При успешном окончании редактирования удержаний процедура будет вызвана с параметром типа "Строка",
//           в котором хранится адрес временного хранилища, в котором размещена Структура с полями:
//               ** ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//               ** КорректировкиВыплаты - ТаблицаЗначений
//               ** РаспределениеРезультатовУдержаний - ТаблицаЗначений
//           Данную строку можно передать в процедуру РасчетЗарплатыРасширенныйФормы.ОбновитьДанныеКорректировокВыплаты().
//           При отказе от редактирования процедура будет вызвана с параметром типа "Неопределено" или "КодВозвратаДиалога".
//           Пример чтения результатов процедуры см. в форме документа БольничныйЛист.
//       * ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта ОписаниеОповещения.
//
Процедура НачатьРедактированиеКорректировокВыплаты(ПараметрыФормы, Обработчик) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеКорректировокВыплаты", ПараметрыФормы, , , , , Обработчик);
	
КонецПроцедуры

// Возвращает параметры, необходимые для процедуры ОткрытьФормуРедактированияСтажей.
//
// Возвращаемое значение:
//   Структура - Параметры, необходимые для вызова процедуры НачатьРедактированиеКорректировокВыплаты.
//       * ТолькоПросмотр - Булево - Признак возможности редактирования отображаемых данных.
//       * Организация - СправочникСсылка.Организации
//       * МесяцНачисления - Дата
//       * СотрудникФизическоеЛицо - СправочникСсылка.Сотрудники, СправочникСсылка.ФизическиеЛица
//       * ДанныеКорректировокВыплаты - Строка - Адрес временного хранилища с данными корректировок выплаты.
//           См. РасчетЗарплатыРасширенныйФормы.ДанныеКорректировокВыплаты().
//
Функция ПараметрыРедактированияКорректировокВыплаты() Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
	ПараметрыФормы.Вставить("Организация", Неопределено);
	ПараметрыФормы.Вставить("МесяцНачисления", Неопределено);
	ПараметрыФормы.Вставить("СотрудникФизическоеЛицо", Неопределено);
	ПараметрыФормы.Вставить("ДанныеКорректировокВыплаты", Неопределено);
	Возврат ПараметрыФормы;
КонецФункции

#КонецОбласти
