
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.НациональныйРежимЗакупок = Перечисления.НациональныйРежимЗакупок.НеИспользовать; 
	Элементы.Преференции.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НациональныйРежимЗакупокПриИзменении(Элемент)
	Элементы.Преференции.Доступность = ЭтотОбъект.НациональныйРежимЗакупок = ПредопределенноеЗначение("Перечисление.НациональныйРежимЗакупок.Преференции");
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)   
	Если ЭтотОбъект.НациональныйРежимЗакупок = ПредопределенноеЗначение("Перечисление.НациональныйРежимЗакупок.Преференции") И ЭтотОбъект.Преференции = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать преференции'"));
	Иначе
		ЭтотОбъект.Закрыть(Новый Структура("НациональныйРежимЗакупок, Преференции", ЭтотОбъект.НациональныйРежимЗакупок, ЭтотОбъект.Преференции));  
	КонецЕсли;
КонецПроцедуры
