#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновшикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновшикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД);//, ДанныеРасшифровки);
	
	//Сформируем доп набор данных
	ТаблицаФайловСФ = СформироватьТаблицуФайловСФ(МакетКомпоновки.НаборыДанных.НаборДанныхСФ.Запрос, 
						МакетКомпоновки.ЗначенияПараметров);
	
	ВнешнийНабор = Новый Структура;
	ВнешнийНабор.Вставить("ТаблицаФайловЭД", ТаблицаФайловСФ);
	
	ПроцессорКомпановки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановки.Инициализировать(МакетКомпоновки, ВнешнийНабор);//,ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент ;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпановки, Истина);
	
КонецПроцедуры

// Формируем Таблицу для файлов ЭДО Счет Фактуры
//
// Параметры:
//  ТекстЗапроса  - Текст запроса из первого набора
//  ПараметрыЗапрос  - Тип ЗначениеПараметровМакетаКомпановкиДанных
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица с данными файлов ЭДО счет фактуры
//
Функция СформироватьТаблицуФайловСФ(ТекстЗапроса, ПараметрыЗапроса)

	ТаблицаФайлов = Новый ТаблицаЗначений;
	ОписаниеПолейТаблицыФайлов(ТаблицаФайлов);  
	
	// НАЧАЛО Белышев Игорь 13.12.2022 Выполнение задач №000043668
	//// НАЧАЛО Ситалов Дмитрий 23.01.2022
	//// переопределяется в расширении для обращения к ОМ ОбменСКонтрагентамиВнутренний в расширении
	//// КОНЕЦ  Ситалов Дмитрий 23.01.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	//Установим параметры
	Для Каждого СтрПарам из ПараметрыЗапроса Цикл
		
		Если НЕ СтрПарам.Имя = "ПериодОтчета" Тогда
			Запрос.УстановитьПараметр(СтрПарам.Имя, СтрПарам.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	// получим список актуальный файловЭДО
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	МАКСИМУМ(СообщениеЭДО.Ссылка) КАК СообщениеЭДО,
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета КАК СсылкаНаОбъект,
	|	МАКСИМУМ(СообщениеЭДО.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_Сообщения
	|ИЗ
	|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
	|		ПО ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = СообщениеЭДО.ЭлектронныйДокумент
	|ГДЕ
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета В(&СсылкаСФ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент,
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Сообщения.ЭлектронныйДокумент КАК ЭлектронныйДокументССылка,
	|	ВТ_Сообщения.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	СообщениеЭДОПрисоединенныеФайлы.Ссылка КАК ЭлектронныйДокумент
	|ИЗ
	|	ВТ_Сообщения КАК ВТ_Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
	|		ПО ВТ_Сообщения.СообщениеЭДО = СообщениеЭДОПрисоединенныеФайлы.ВладелецФайла";
	
	Запрос.УстановитьПараметр("СсылкаСФ", Результат.ВыгрузитьКолонку("Ссылка"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		
		ТаблицаФайловЭДО = РезультатЗапроса.Выгрузить();
		
		тн_ОбменСКонтрагентамиВнутренний.тн_ПолучитьДанныеФайловЭДДляОтчетов(ТаблицаФайловЭДО, ТаблицаФайлов);
		
	КонецЕсли;
	// КОНЕЦ Белышев Игорь 13.12.2022 Выполнение задач №000043668
	
	Возврат ТаблицаФайлов;

КонецФункции // СформироватьТаблицуФайловСФ()

Процедура ОписаниеПолейТаблицыФайлов(ТаблицаФайлов)

	// Создание описателя типов для таблицы значений
	
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки;
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	// Создание таблицы значений 
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	// добавим в таблицу значений три колонки
	
	ТаблицаФайлов.Колонки.Добавить("ИдентификаторЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("СсылкаСФ");
	ТаблицаФайлов.Колонки.Добавить("ДатаПодписанияЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("СтатусЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("ПродавецЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("ИННОрганизацияЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("ИННКонтрагентЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("УвеличениеЭДО",ОписаниеТиповЧ);
	ТаблицаФайлов.Колонки.Добавить("УменьшениеЭДО",ОписаниеТиповЧ);
	ТаблицаФайлов.Колонки.Добавить("НДСУвеличениеЭДО",ОписаниеТиповЧ);
	ТаблицаФайлов.Колонки.Добавить("НДСУменьшениеЭДО",ОписаниеТиповЧ);
	ТаблицаФайлов.Колонки.Добавить("СуммаДокументаЭДО",ОписаниеТиповЧ);
	ТаблицаФайлов.Колонки.Добавить("СуммаНДСЭДО",ОписаниеТиповЧ);
	ТаблицаФайлов.Колонки.Добавить("ДатаСФЭДО");
	ТаблицаФайлов.Колонки.Добавить("НомерСФЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("НомерКоррЭДО",ОписаниеТиповС);
	ТаблицаФайлов.Колонки.Добавить("ДатаКоррЭДО",ОписаниеТиповС);

КонецПроцедуры

#КонецЕсли
