#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НомерСтроки = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокСделок(Команда)
	ОткрытьФорму("Отчет.СписокЦепочекСозданияСтоимостиКонтролируемыхСделок.Форма.ФормаОтчета", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НомерСтроки",             НомерСтроки);
	ДопПараметры.Вставить("ЗагружатьДоСтроки",       ЗагружатьДоСтроки);
	ДопПараметры.Вставить("НомерМаксимальнойСтроки", НомерМаксимальнойСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьФайлПослеПомещенияФайла", ЭтотОбъект, ДопПараметры);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьФайлПослеПомещенияФайла (Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		
		// Результат - это Структура с полямя Хранение - адрес хранилища значений, Расширение - расширение файла
		
		Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Результат.Имя));
		
		ДопПараметры.Вставить("Хранение", Результат.Хранение);
		ДопПараметры.Вставить("Расширение", Расширение);
		
		// 1. Запуск фонового задания на сервере.
		ДлительнаяОперация = ЗагрузитьЦепочкиСделокВФоне(ДопПараметры);
		
		// 2. Подключение обработчика завершения фонового задания.
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьЦепочкиСделокЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция ЗагрузитьЦепочкиСделокВФоне(ПараметрыФункции)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	Расширение = ПараметрыФункции.Расширение;
	АдресВременногоХранилищаФайла = ПараметрыФункции.Хранение;
	
	КаталогВременныхФайлов = ФайловаяСистема.СоздатьВременныйКаталог(Расширение);
	ВременныйФайл = Новый Файл(ПолучитьИмяВременногоФайла(Расширение));
	ИмяВременногоФайла = ФайловаяСистема.УникальноеИмяФайла(КаталогВременныхФайлов + ВременныйФайл.Имя);
	
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресВременногоХранилищаФайла); // ДвоичныеДанные
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ДвоичныеДанные = Неопределено;
	УдалитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
	
	ПараметрыФункции.Вставить("ИмяВременногоФайла", ИмяВременногоФайла);
	ПараметрыФункции.Вставить("КаталогВременныхФайлов", КаталогВременныхФайлов);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
				"Документы.ЦепочкаСозданияСтоимостиКонтролируемойСделки.ЗагрузитьЦепочкиСделок",
				ПараметрыФункции, АдресХранилища);

КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьРезультат(Знач АдресХранилищаРезультата)
	
	Возврат ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьЦепочкиСделокЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'При загрузке файла возникла ошибка по причине %1';
							|en = 'An error occurred when importing the file due to: %1'"),
			Результат.КраткоеПредставлениеОшибки));
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Загрузка завершена.';
														|en = 'Import completed.'"));
		
		СообщенияПользователю = ЗагрузитьРезультат(АдресХранилища);
		
		Если ТипЗнч(СообщенияПользователю) = Тип("Массив") Тогда
		
			// Выводим сообщения об ошибках загрузки, которые были на сервере.
			Для Каждого Сообщение Из СообщенияПользователю Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	УдалитьИзВременногоХранилища(АдресХранилища);
	
КонецПроцедуры

#КонецОбласти
