//////////////////////////////////////////////////////////////////
// Copyright (c) 21.11.2021 Варгасов Д.О. dovargasov@gmail.com  //
////////////////////////////////////////////////////////////////// 
 

#Область ПрограммныйИнтерфейс

Функция ПолучитьСписокУведомлений() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат РегистрыСведений.ТН_ОчередьУведомлений.СписокУведомленийПользователя(ПараметрыСеанса.ТекущийПользователь);
	
КонецФункции 

Функция МассивВсехПользователей() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Недействителен";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ТаблицаПользователей = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаПользователей.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция МассивАктивныхПользователей() Экспорт     

	УстановитьПривилегированныйРежим(Истина);
	
	МассивПользователей = Новый Массив;
	СеансыИнформационнойБазы = ПолучитьСеансыИнформационнойБазы();
		
	Для Каждого СеансИБ Из СеансыИнформационнойБазы Цикл
		
		Если ТипЗнч(СеансИБ.Пользователь) = Тип("ПользовательИнформационнойБазы")
		   И ЗначениеЗаполнено(СеансИБ.Пользователь.Имя) 
		   И (СеансИБ.ИмяПриложения = "1CV8" 
				Или СеансИБ.ИмяПриложения = "1CV8C" 
				Или СеансИБ.ИмяПриложения = "WebClient") Тогда
			
			ПользовательСсылка  = НайтиСсылкуПоИдентификаторуПользователя(СеансИБ.Пользователь.УникальныйИдентификатор);
			Если ЗначениеЗаполнено(ПользовательСсылка) 
				И МассивПользователей.Найти(ПользовательСсылка) = Неопределено Тогда
				МассивПользователей.Добавить(ПользовательСсылка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат МассивПользователей;   
	
КонецФункции

// Обертка для получения реквизитов на клиенте
Функция ЗначенияРеквизитовУведомления(Ссылка, Знач Реквизиты) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТН_Уведомления.Ссылка КАК Ссылка,
		|	ТН_Уведомления.ПометкаУдаления КАК ПометкаУдаления,
		|	ТН_Уведомления.Родитель КАК Родитель,
		|	ТН_Уведомления.ЭтоГруппа КАК ЭтоГруппа,
		|	ТН_Уведомления.Код КАК Код,
		|	ТН_Уведомления.Наименование КАК Наименование,
		|	ТН_Уведомления.ДатаСоздания КАК ДатаСоздания,
		|	ТН_Уведомления.Содержание КАК Содержание,
		|	ТН_Уведомления.Автор КАК Автор
		|ИЗ
		|	Справочник.ТН_Уведомления КАК ТН_Уведомления
		|ГДЕ
		|	ТН_Уведомления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СтруктураРеквизитов = Новый Структура(Реквизиты);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции   

Функция ЗначениеКонстанты(Знач ИмяКонстанты) Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

Функция ЕстьПравоЧтенияУведомлений() Экспорт

	Возврат ПравоДоступа("Чтение", Метаданные.Справочники.ТН_Уведомления);
	
КонецФункции

Процедура СоздатьИДобавитьУведомление(Текст, СрокУведомления) Экспорт
	
	Уведомление = Справочники.ТН_Уведомления.СоздатьУведомление(Текст, СрокУведомления);
	
	СтруктураОтправки = Новый Структура;
	СтруктураОтправки.Вставить("ВыбранныеПолучатели", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.Пользователи.ПустаяСсылка()));
	СтруктураОтправки.Вставить("МассивУведомлений", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Уведомление));  
	
	РегистрыСведений.ТН_ОчередьУведомлений.ДобавитьУведомления(СтруктураОтправки); 
				
КонецПроцедуры

Процедура ОчиститьОчередьУведомлений() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТН_ОчередьУведомлений.Уведомление КАК Уведомление
		|ИЗ
		|	РегистрСведений.ТН_ОчередьУведомлений КАК ТН_ОчередьУведомлений
		|ГДЕ
		|	ТН_ОчередьУведомлений.СрокУведомления <= &СрокУведомления
		|	И ТН_ОчередьУведомлений.СрокУведомления <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("СрокУведомления", ТекущаяДатаСеанса() - 7 * 24 * 60 * 60); // 1 неделя
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.ТН_ОчередьУведомлений.СоздатьНаборЗаписей();
		Набор.Отбор.Уведомление.Установить(Выборка.Уведомление);
		Набор.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиСсылкуПоИдентификаторуПользователя(Идентификатор)

	УстановитьПривилегированныйРежим(Истина);	
	
	Запрос = Новый Запрос;
	
	ШаблонТекстаЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Ссылка КАК Ссылка
					|ИЗ
					|	&ИмяТаблицы
					|ГДЕ
					|	ИдентификаторПользователяИБ = &Идентификатор";
					
	ТекстЗапросаПоПользователям = СтрЗаменить(ШаблонТекстаЗапроса, "&ИмяТаблицы", Метаданные.Справочники.Пользователи.ПолноеИмя());
	
	Запрос.Текст = ТекстЗапросаПоПользователям;
	Запрос.Параметры.Вставить("Идентификатор", Идентификатор);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
		
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

#КонецОбласти