////////////////////////////////////////////////////////////////////////////////
// Модуль предназначен для реализации специфической функциональности печати
// для продукта 1С:Управление Холдингом.
////////////////////////////////////////////////////////////////////////////////

// Получает список объектов печати для решения 1С:Управление холдингом и
// записывает его в СписокИзм.
Процедура СписокОбъектыПечатиУХ(СписокИзм) Экспорт
	СписокИзм = Новый СписокЗначений;
	СписокИзм.Добавить(Документы.СправкаОПодтверждающихДокументах);
	СписокИзм.Добавить(Документы.РеестрПлатежей);
	СписокИзм.Добавить(Документы.ЗаявкаНаРасходованиеДенежныхСредств);
	СписокИзм.Добавить(Документы.ЗаявкаНаРасход);
	СписокИзм.Добавить(Документы.ОжидаемоеПоступлениеДенежныхСредств);
	СписокИзм.Добавить(Документы.ПланируемыйДоход);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияАккредитив);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияБанковскаяГарантия);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияВалютноПроцентныйСвоп);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияВалютныйСвоп);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияВалютныйФорвард);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияДепозит);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияКоммерческийДоговор);
	СписокИзм.Добавить(Документы.ВерсияСоглашенияКредит);

	СписокИзм.Добавить(Документы.ПокрытиеПотребностиВФинансировании); 
	СписокИзм.Добавить(Документы.ЗаявкаНаПривлечениеФинансирования);

КонецПроцедуры // СписокОбъектыПечатиУХ()

Процедура СпискиПолейДобавитьСсылкуНаОбъект(СпискиПолей, Объекты) Экспорт
	
	Если Объекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если СпискиПолей.Колонки.Найти("СсылкаНаОбъект") = Неопределено Тогда
		СпискиПолей.Колонки.Добавить("СсылкаНаОбъект");	
	КонецЕсли;	
		
	Для Каждого СтрокаСписка Из СпискиПолей Цикл
		СтрокаСписка.СсылкаНаОбъект = Объекты[0];	
	КонецЦикла;		
	
КонецПроцедуры
