#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.Параметры.Свойство("ПараметрКоманды") Тогда
	
		ДокументСсылка = Форма.Параметры.ПараметрКоманды[0];
		
		РеквизитДоговор = "ДоговорКонтрагента";
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АкцептПротестПереводногоВекселя") Тогда
			РеквизитДоговор = "ДоговорАкцепта";
		КонецЕсли;

		Отбор = Новый Структура("ДоговорБрокерскогоСчета,ПериодОтчета", ДокументСсылка[РеквизитДоговор], Новый СтандартныйПериод);
		
		Компоновщик = Форма.Отчет.КомпоновщикНастроек;
		ТиповыеОтчетыУХ.УстановитьЗначенияПолей(Компоновщик, Отбор);
		Форма.Параметры.ПользовательскиеНастройки = Компоновщик.ПользовательскиеНастройки;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	ТекстЗапроса = ВзаиморасчетыВстраиваниеУХ.ЗаменитьТекстЗапросаРасчетыСБрокером(ТекстЗапроса);
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
