#Область ПрограммныйИнтерфейс

Функция ТребуетсяОбновлениеИсторииВыбранныхПослеОбработкиОповещения(Форма, ВидИнструмента, ИмяСобытия, Параметр, Источник) Экспорт
	
	Возврат (ИмяСобытия = "ИзмененаИсторияВыбранных"
				ИЛИ Источник = Форма
				ИЛИ ВидИнструмента = Параметр);
	
КонецФункции

&НаКлиенте
Процедура ЗавершенаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Если ВыбранноеЗначение.Количество() > 1 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Выбрано несколько объектов, будет выбран первый'; en = 'Several objects are selected, the first one will be selected'"));
		КонецЕсли;
		
		ВыбранноеЗначение = ВыбранноеЗначение[0];
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
