#Область СлужебныйПрограммныйИнтерфейс
//++ Локализация

//++ НЕ УТ

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения
Процедура УправлениеНастройкойГОЗ(Форма) Экспорт
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	ПоддержкаПлатежей275ФЗ = Форма.ПоддержкаПлатежей275ФЗ;
	
	Форма.ВариантПлатежаГОЗ = ИнициализироватьВариантПлатежаГОЗ(Форма.Объект.ПлатежиПо275ФЗ,
		Форма.Объект.ДоговорСУчастникомГОЗ,
		Форма.Объект.ОплатаРасходовПоТарифамСГосрегулированием);
	ВозможныПлатежи275ФЗ = (Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоровМеждуОрганизациями.КупляПродажа"));
	
	Элементы.ИдентификаторГосКонтракта.Видимость = НЕ ПоддержкаПлатежей275ФЗ И ВозможныПлатежи275ФЗ;

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(Форма, Форма.Объект);
	
	Форма.Элементы.ЛокализацияГруппаНастроитьГОЗ.Видимость = ВозможныПлатежи275ФЗ И Объект.ПлатежиПо275ФЗ;
КонецПроцедуры

Функция ИнициализироватьВариантПлатежаГОЗ(ПлатежиПо275ФЗ, ДоговорСУчастникомГОЗ, ОплатаРасходовПоТарифамСГосрегулированием) Экспорт
	ВариантПлатежаГОЗ = 0;
	Если ПлатежиПо275ФЗ И ДоговорСУчастникомГОЗ Тогда
		ВариантПлатежаГОЗ = 1;
	ИначеЕсли ОплатаРасходовПоТарифамСГосрегулированием Тогда
		ВариантПлатежаГОЗ = 2;
	КонецЕсли;
	Возврат ВариантПлатежаГОЗ
КонецФункции

//-- НЕ УТ

//-- Локализация
#КонецОбласти
