
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураЗаказа.ИнициализироватьНастройкиРасчетаСтруктурыЗаказа();
	
	СтруктураЗаказаСлужебный.УстановитьИспользованиеРеглЗаданияРасчетСтруктурыЗаказа();
	СтруктураЗаказаСлужебный.УстановитьИспользованиеРеглЗаданияСверткаРегистраСтруктураЗаказа();
	СтруктураЗаказаСлужебный.УстановитьИспользованиеРеглЗаданияОчисткаИсторииЗагрузкиВидовРабочихЦентров();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
