
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОбъектаОповещения = Справочники.СправочникиБД.НайтиПоНаименованию("СтрокиОтчетов",,,Справочники.ТипыБазДанных.ТекущаяИБ);
		
	РеквизитыСтрок.ЗагрузитьЗначения(Параметры.РеквизитыСтрок.ВыгрузитьЗначения());
	
	Для Каждого Стр Из РеквизитыСтрок Цикл
		Если Стр.Значение =  "Строка" Тогда
			Стр.Картинка = БиблиотекаКартинок.ЗамокЗакрыт;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСтрокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные.Значение = "Строка" Тогда
		Возврат;
	КонецЕсли;	

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОграничиватьСсылочные",	 Истина);
	СтруктураПараметров.Вставить("ОграничениеТипа",			 Неопределено);
	СтруктураПараметров.Вставить("ТипОбъектаОповещения",	 ТипОбъектаОповещения);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаОкончание", ЭтаФорма);
	ОткрытьФорму("Обработка.НастройкаСтруктурыОтчета.Форма.ФормаВыбораРеквизитов", СтруктураПараметров, ЭтаФорма, , , , Оповещение, РежимОткрытия);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборРеквизитаОкончание(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	РеквизитыСтрок.НайтиПоИдентификатору(Элементы.РеквизитыСтрок.ТекущаяСтрока).Значение = Строка(Результат.Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОграничиватьСсылочные",	 Истина);
	СтруктураПараметров.Вставить("ОграничениеТипа",			 Неопределено);
	СтруктураПараметров.Вставить("ТипОбъектаОповещения",	 ТипОбъектаОповещения);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаОкончание", ЭтаФорма);
	ОткрытьФорму("Обработка.НастройкаСтруктурыОтчета.Форма.ФормаВыбораРеквизитов", СтруктураПараметров, ЭтаФорма, , , , Оповещение, РежимОткрытия);

	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ЭтаФорма.Закрыть(РеквизитыСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСтрокПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.Значение = "Строка" Тогда
		 Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры



