
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Сценарий = Параметры.Сценарий; // СправочникСсылка.СценарииТоварногоПланирования -
	ВидПлана = Параметры.ВидПлана; // СправочникСсылка.ВидыПланов -
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрерватьОбучение(Команда)
	
	Оповестить("ПрерываниеОбученияМодели", , ВладелецФормы);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти