////////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы, используемые обработчиками событий модулей объектов
// финансовых инструментов
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОбновитьКолонкиЗадолженности(Таблица, ОписаниеГрафика, СортироватьТаблицу = Истина) Экспорт
	
	Если СортироватьТаблицу Тогда
		Таблица.Сортировать("Дата");
	КонецЕсли;
	
	Для Каждого ТекСекцияГрафика Из ОписаниеГрафика Цикл
		
		ОписаниеСекции = ТекСекцияГрафика.Значение;
		Остаток = 0;
		
		Для Каждого ТекСтрокаТаблицы Из Таблица Цикл
			Остаток = Остаток + ТекСтрокаТаблицы[ОписаниеСекции.КолонкаПриход] - ТекСтрокаТаблицы[ОписаниеСекции.КолонкаРасход];
			ТекСтрокаТаблицы[ОписаниеСекции.КолонкаОстаток] = Остаток;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаИзмененияБазыИзГрафика(ГрафикРасчетов, Знач ОписаниеГрафика, Знач СекцияОписанияОсновнойДолг = Неопределено) Экспорт
	
	Если СекцияОписанияОсновнойДолг = Неопределено Тогда
		СекцияОписанияОсновнойДолг = ОписаниеГрафика["ОсновнойДолг"];
	КонецЕсли;
	
	ОперацииИзмененияБазы = НовыйОперацииИзмененияБазы();
	
	СтруктураПоиска = Новый Структура("ЭлементСтруктурыЗадолженности");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СекцияОписанияОсновнойДолг);
	СтрокиГрафика = ГрафикРасчетов.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого ТекСтрокаГрафика Из СтрокиГрафика Цикл
		
		НовОперацияИзмененияБазы = ОперацииИзмененияБазы.Добавить();
		НовОперацияИзмененияБазы.Дата = ТекСтрокаГрафика.Дата;
		
		Если ТекСтрокаГрафика.КолонкаСекции = Перечисления.ВидыДвиженийПриходРасход.Приход Тогда
			НовОперацияИзмененияБазы.Приход = ТекСтрокаГрафика.Сумма;
		Иначе
			НовОперацияИзмененияБазы.Расход = ТекСтрокаГрафика.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	ОперацииИзмененияБазы.Свернуть("Дата","Приход,Расход");
	
	Возврат ОперацииИзмененияБазы;
	
КонецФункции   

Функция ТаблицаИзмененияБазы(Сумма, ДатаНачала, ДатаОкончания) Экспорт

	ОперацииИзмененияБазы = НовыйОперацииИзмененияБазы();
	
	Строка1 = ОперацииИзмененияБазы.Добавить();
	Строка1.Дата = ДатаНачала;
	Строка1.Приход = Сумма;
	
	Строка2 = ОперацииИзмененияБазы.Добавить();
	Строка2.Дата = ДатаОкончания;
	Строка2.Расход = Сумма;
	
	
	Возврат ОперацииИзмененияБазы;

КонецФункции // ТаблицаИзмененияБазы()

Процедура ОбновитьОсновнойДолгПоДаннымОбъекта(Объект, Знач ОписаниеГрафика, Знач СекцияОписанияГрафика = Неопределено, 
								Знач ДанныеЗаполнения = Неопределено, Знач ОперацииГрафика = Неопределено) Экспорт
	
	Если СекцияОписанияГрафика = Неопределено Тогда
		СекцияОписанияГрафика = ОписаниеГрафика["ОсновнойДолг"];
	КонецЕсли;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполнения = Объект;
	КонецЕсли;
	
	КолонкаПриход = СекцияОписанияГрафика.КолонкаПриход;
	КолонкаРасход = СекцияОписанияГрафика.КолонкаРасход;
	
	СтрокиОсновногоДолга = СтрокиСекцииГрафика(Объект.ГрафикРасчетов, СекцияОписанияГрафика);
	
	РабочаяТаблицаГрафика = Объект.ГрафикРасчетов.Выгрузить(СтрокиОсновногоДолга);
	РабочаяТаблицаГрафика.Сортировать("Дата");
	
	КоличествоСтрокРабочейТаблицы = РабочаяТаблицаГрафика.Количество();
	
	ИтогоПриход = 0;
	ИтогоРасход = 0;   
	
	// определение ДатаНачалаПересчета
	ДатаНачалаПересчета = Дата(1, 1, 1);
	Если Объект.Свойство("НомерДополнительногоСоглашения") 
			И Объект.НомерДополнительногоСоглашения > 1 Тогда
		ДатаНачалаПересчета =  НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ДатаНачалаПересчета) 
			И Объект.Свойство("АвтоматическиеВычисления")
			И НЕ Объект.АвтоматическиеВычисления Тогда
		Возврат;	
	КонецЕсли;
	
	Для Сч = 1 По КоличествоСтрокРабочейТаблицы Цикл
		
		ТекСтрокаГрафика = РабочаяТаблицаГрафика[КоличествоСтрокРабочейТаблицы - Сч];
		
		Если ЗначениеЗаполнено(ДатаНачалаПересчета)
				 И ТекСтрокаГрафика.Дата  < ДатаНачалаПересчета  Тогда	

			Если ЭтоСтрокаПриходнойКолонкиГрафика(ТекСтрокаГрафика) Тогда
				ИтогоПриход = ИтогоПриход + ТекСтрокаГрафика.Сумма;
			Иначе
				ИтогоРасход = ИтогоРасход + ТекСтрокаГрафика.Сумма;
			КонецЕсли;
	
			
		ИначеЕсли (ТекСтрокаГрафика.Дата <> ДанныеЗаполнения.ДатаНачалаДействия
				И ЭтоСтрокаПриходнойКолонкиГрафика(ТекСтрокаГрафика) )
			Или ТекСтрокаГрафика.Дата >= ДанныеЗаполнения.ДатаОкончанияДействия  Тогда

			// Суммы, которые выходят за границы действия инструмента, надо удалить
			РабочаяТаблицаГрафика.Удалить(ТекСтрокаГрафика);
			
		Иначе
			
			Если ЭтоСтрокаПриходнойКолонкиГрафика(ТекСтрокаГрафика) Тогда
				ИтогоПриход = ИтогоПриход + ТекСтрокаГрафика.Сумма;
			Иначе
				ИтогоРасход = ИтогоРасход + ТекСтрокаГрафика.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// На случай пролонгации инструмента, поставим последний возврат на крайнюю дату.
	// Учтем, что мы уже отсортировали график по дате.
	Если ИтогоРасход = ДанныеЗаполнения.Сумма Тогда
		
		ДатаПоследнегоВозврата = Дата(1,1,1);
		КоличествоСтрокРабочейТаблицы = РабочаяТаблицаГрафика.Количество();
		
		Для Сч = 1 По КоличествоСтрокРабочейТаблицы Цикл
			ТекСтрокаГрафика = РабочаяТаблицаГрафика[КоличествоСтрокРабочейТаблицы - Сч];
			Если Не ЭтоСтрокаПриходнойКолонкиГрафика(ТекСтрокаГрафика) Тогда 
				Если ЗначениеЗаполнено(ДатаНачалаПересчета)
				 	И ТекСтрокаГрафика.Дата  < ДатаНачалаПересчета Тогда 
					Продолжить;
				ИначеЕсли ТекСтрокаГрафика.Дата >= ДатаПоследнегоВозврата Тогда
					ДатаПоследнегоВозврата = ТекСтрокаГрафика.Дата;
					ТекСтрокаГрафика.Дата = ДанныеЗаполнения.ДатаОкончанияДействия;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	КРаспределениюПриход = ДанныеЗаполнения.Сумма - ИтогоПриход;
	КРаспределениюРасход = ДанныеЗаполнения.Сумма - ИтогоРасход;
	
	Если КРаспределениюПриход > 0  Тогда
		// Сумма увеличилась. Добавим значение. 
		ДатаОтбора = ?(ЗначениеЗаполнено(ДатаНачалаПересчета), ДанныеЗаполнения.ДатаОкончанияДействия, ДанныеЗаполнения.ДатаНачалаДействия);
		СтруктураПоиска = Новый Структура("КолонкаСекции,Дата", Перечисления.ВидыДвиженийПриходРасход.Приход, ДатаОтбора);
		СтрокиПервойВыборки = РабочаяТаблицаГрафика.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПервойВыборки.Количество() Тогда
			СтрокиПервойВыборки[0].Сумма = СтрокиПервойВыборки[0].Сумма +  КРаспределениюПриход
		Иначе
			
			РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, 
																	КРаспределениюПриход, 
																	ДатаОтбора,, 
																	?(ОперацииГрафика = Неопределено, Неопределено, ОперацииГрафика[СекцияОписанияГрафика.КолонкаПриходОперация]));
		КонецЕсли;
	Иначе
		// Сумма уменьшилась. Будем списывать снизу вверх.
		КРаспределениюПриход = -КРаспределениюПриход;
		КоличествоСтрокРабочейТаблицы = РабочаяТаблицаГрафика.Количество();
		
		Для Сч = 1 По КоличествоСтрокРабочейТаблицы Цикл
			
			Если КРаспределениюПриход = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаГрафика = РабочаяТаблицаГрафика[КоличествоСтрокРабочейТаблицы - Сч];
			Если ЭтоСтрокаПриходнойКолонкиГрафика(СтрокаГрафика) Тогда
				СуммаРаспределения = Мин(СтрокаГрафика.Сумма, КРаспределениюПриход);
				Если СуммаРаспределения = СтрокаГрафика.Сумма Тогда
					РабочаяТаблицаГрафика.Удалить(СтрокаГрафика);
				Иначе
					СтрокаГрафика.Сумма = СтрокаГрафика.Сумма - СуммаРаспределения;
				КонецЕсли;
				КРаспределениюПриход = КРаспределениюПриход - СуммаРаспределения;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если КРаспределениюРасход > 0  Тогда
		РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, 
																КРаспределениюРасход, 
																ДанныеЗаполнения.ДатаОкончанияДействия,, 
																?(ОперацииГрафика = Неопределено, Неопределено, ОперацииГрафика[СекцияОписанияГрафика.КолонкаРасходОперация]));
	Иначе
		// Сумма уменьшилась. Будем списывать снизу вверх.
		КРаспределениюРасход = -КРаспределениюРасход;
		КоличествоСтрокРабочейТаблицы = РабочаяТаблицаГрафика.Количество();
		
		Для Сч = 1 По КоличествоСтрокРабочейТаблицы Цикл
			
			Если КРаспределениюРасход = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаГрафика = РабочаяТаблицаГрафика[КоличествоСтрокРабочейТаблицы - Сч];
			Если Не ЭтоСтрокаПриходнойКолонкиГрафика(СтрокаГрафика) Тогда
				
				СуммаРаспределения = Мин(СтрокаГрафика.Сумма, КРаспределениюРасход);
				Если СуммаРаспределения = СтрокаГрафика.Сумма Тогда
					РабочаяТаблицаГрафика.Удалить(СтрокаГрафика);
				Иначе
					СтрокаГрафика.Сумма = СтрокаГрафика.Сумма - СуммаРаспределения;
				КонецЕсли;
				
				КРаспределениюРасход = КРаспределениюРасход - СуммаРаспределения;

			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Заместим старую секцию графика новой
	Для Каждого ТекСтрокаОсновногоДолга из СтрокиОсновногоДолга Цикл
		Объект.ГрафикРасчетов.Удалить(ТекСтрокаОсновногоДолга);
	КонецЦикла;
	
	Для Каждого ТекСтрокаРабочейТаблицы из РабочаяТаблицаГрафика Цикл
		ЗаполнитьЗначенияСвойств(Объект.ГрафикРасчетов.Добавить(), ТекСтрокаРабочейТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Процедура НачальноеЗаполнениеОсновногоДолга(Объект, ИмяСекции, ОписаниеГрафика, ОперацииГрафика, Знач СуммаОбязательств = Неопределено) Экспорт
	
	Если СуммаОбязательств = Неопределено Тогда
		СуммаОбязательств = Объект.Сумма;
	КонецЕсли;
	
	РабочаяТаблицаГрафика = Объект.ГрафикРасчетов;
	СекцияОписанияГрафика = ОписаниеГрафика[ИмяСекции];
	
	ОперацияПриход = ?(ОперацииГрафика = Неопределено, Неопределено, ОперацииГрафика[СекцияОписанияГрафика.КолонкаПриходОперация]);
	РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, СуммаОбязательств, Объект.ДатаНачалаДействия,,ОперацияПриход);
	
	ОперацияРасход = ?(ОперацииГрафика = Неопределено, Неопределено, ОперацииГрафика[СекцияОписанияГрафика.КолонкаРасходОперация]);
	РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, СуммаОбязательств, Объект.ДатаОкончанияДействия,,ОперацияРасход);
		
КонецПроцедуры

Функция ЭтоПустойГрафик(График) Экспорт
	
	ПустыеСтроки = График.НайтиСтроки(Новый Структура("ПустаяСтрока", Истина));
	
	Возврат (ПустыеСтроки.Количество() = График.Количество());
	
КонецФункции

Функция ЧисловыеКолонкиГрафика(ОписаниеГрафика) Экспорт
	
	МассивКолонок = Новый Массив;
	Для Каждого КлючИЗначение Из ОписаниеГрафика Цикл
		СекцияГрафика = КлючИЗначение.Значение;
		
		МассивКолонок.Добавить(СекцияГрафика.КолонкаПриход);
		МассивКолонок.Добавить(СекцияГрафика.КолонкаРасход);
		
		Если СекцияГрафика.ЭтоРасчетнаяСекция Тогда
			МассивКолонок.Добавить(СекцияГрафика.КолонкаПриход + "Расчет");
			МассивКолонок.Добавить(СекцияГрафика.КолонкаПриход + "Корректировка");
			МассивКолонок.Добавить(СекцияГрафика.КолонкаРасход + "Расчет");
			МассивКолонок.Добавить(СекцияГрафика.КолонкаРасход + "Корректировка");
		КонецЕсли;
		
		МассивКолонок.Добавить(СекцияГрафика.КолонкаОстаток);
	КонецЦикла;
	
	Возврат СтрСоединить(МассивКолонок, ",");
КонецФункции

// Процедура обеспечивает выполнение различных действий по пересчету графика в корректной последовательности.
//
// Параметры:
//  Объект				 - 	ДанныеФормыСтруктура,ДокументОбъект.ВерсияСоглашенияКредит, ДокументОбъект.ВерсияСоглашенияДепозит и т.д. - 
//		версия графика, которую требуется обработать
//  ТекущаяСтрокаГрафика - 	 - Текущая строка графика.
//  ОписаниеГрафика		 - 	Структура - Описание графика конкретного вида ФИ, генерируемое методом ОписаниеГрафика() модуля менеджера
//		соответствующего документа
//  СтруктураДействий	 - 	Структура - Ключами структуры являются действия, которые необходимо выполнить. Значениями - структуры с дополнительными параметрами.
//		Перечень действий следующий:
//			Замкнуть - скорректировать секцию так, чтобы вся задолженность была погашена.
//			Пересчитать - выполнить пересчет секции графика.
//			Свернуть - свернуть график по дате.
//			Сортировать - сортировать график по дате.
//
Процедура ПересчетГрафика(Объект,
						ИндексТекущейСтрокиГрафика,
						ОписаниеГрафика,
						ОперацииГрафика,
						СтруктураДействий,
						Отказ = Ложь) Экспорт
							
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		ТипОбъекта = "ДокументОбъект." + Объект.Ссылка.Метаданные().Имя;
		ОбъектРасчет = ДанныеФормыВЗначение(Объект, Тип(ТипОбъекта));
	Иначе
		ОбъектРасчет = Объект;
 	КонецЕсли;
	
	//Проверим дату окончания первого процентного периода
	Если ТипЗнч(ОбъектРасчет) = Тип("ДокументОбъект.ВерсияСоглашенияКредит") тогда
		Если ОбъектРасчет.ДатаОтсчетаПроцентныхПериодов = Перечисления.ВидыДатОтсчетаПериодичности.ДатаПервогоПогашения 
			И ЗначениеЗаполнено(ОбъектРасчет.ДатаОкончанияПервогоПроцентногоПериода) тогда
			
			Если Не (ОбъектРасчет.ДатаОкончанияПервогоПроцентногоПериода >= ОбъектРасчет.ДатаНачалаДействия 
				И ОбъектРасчет.ДатаОкончанияПервогоПроцентногоПериода <= ОбъектРасчет.ДатаОкончанияДействия) тогда
				
				ТекстСообщения = НСтр("ru = 'Дата первого погашения процентов должна быть между началом и окончанием периода действия кредита'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Если ОписаниеГрафика.Свойство("ТекстОшибки") Тогда  
					ОписаниеГрафика.ТекстОшибки = ТекстСообщения;	     
				КонецЕсли;	

				Возврат;
				
			КонецЕсли;
			                        
		КонецЕсли;
	КонецЕсли;   
	
	УпорядочитьГрафик(ОбъектРасчет.ГрафикРасчетов);

	График = ОбъектРасчет.ГрафикРасчетов;  
	
	// "Замкнем" недостающие секции.
	Если СтруктураДействий.Свойство("Замкнуть") Тогда
		Для Каждого ИмяСекцииГрафика Из СтруктураДействий.Замкнуть.СекцииГрафика Цикл
			СекцияГрафика = ОписаниеГрафика[ИмяСекцииГрафика];
			
			Если СекцияГрафика.ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг         
				ИЛИ СекцияГрафика.ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолгКонтрагента Тогда
				// в первую очередь корректируем последнюю операцию.
				ДатаОтсчета = ОбъектРасчет.ДатаОкончанияДействия;
				НаправлениеСписания = "Назад";
				СдвигИндекса = 0; // Всегда считаем от последней строки графика.
			ИначеЕсли СекцияГрафика.ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.Проценты
				ИЛИ СекцияГрафика.ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.ПроцентыКонтрагента Тогда
				// в первую очередь корректируем первую операцию. Предположим, что график упорядочен.
				ДатаОтсчета = График[ИндексТекущейСтрокиГрафика].Дата;
				Для Сч = ИндексТекущейСтрокиГрафика по График.Количество()-1 Цикл
					//Если График[Сч][СекцияГрафика.КолонкаРасход] > 0  Тогда
					Если График[Сч].СуммаРасчет > 0 
						И График[Сч].НаправлениеДвижения = Перечисления.ВидыДвиженийПриходРасход.Расход 
						И График[Сч].ВидБюджета = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств 
						И График[Сч].ОперацияГрафика = СекцияГрафика.КолонкаРасходОперация Тогда
						ДатаОтсчета =  График[Сч].Дата;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				НаправлениеСписания = "Вперед";
				СдвигИндекса = ИндексТекущейСтрокиГрафика;
			Иначе
				// комиссии, штрафы.
				ДатаОтсчета = График[ИндексТекущейСтрокиГрафика].Дата;
				НаправлениеСписания = "Вперед";
				СдвигИндекса = ИндексТекущейСтрокиГрафика;
			КонецЕсли;
			
			СбалансироватьСекциюГрафика(График, СекцияГрафика, ДатаОтсчета, НаправлениеСписания, СдвигИндекса);
		КонецЦикла;
	КонецЕсли;
	
	// Пересчет секций
	Если СтруктураДействий.Свойство("Пересчитать") Тогда
		
		ДопПараметры = Неопределено;
		СтруктураДействий.Пересчитать.Свойство("ДопПараметры", ДопПараметры); 		
		
		Для Каждого ИмяСекцииГрафика Из СтруктураДействий.Пересчитать.СекцииГрафика Цикл
			ОбъектРасчет.ПересчитатьСекциюГрафика(ИмяСекцииГрафика, ОписаниеГрафика, ОперацииГрафика, ДопПараметры, Отказ);
			Если Отказ тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		ОбработатьПустыеСтрокиГрафика(График);
		
	КонецЕсли;     
	
	// Сортировка по дате.
	Если СтруктураДействий.Свойство("Пересчитать") ИЛИ СтруктураДействий.Свойство("Сортировать") Тогда
		График.Сортировать("Дата");
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		ЗначениеВДанныеФормы(ОбъектРасчет,Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСекциюГрафика(Объект, ИмяСекции, ОписаниеГрафика, ОперацииГрафика, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт
	
	СекцияГрафика = ОписаниеГрафика[ИмяСекции];
	
	ТаблицаРасшифровка = Объект[ИмяСекции];
	КолонкаПриход = СекцияГрафика.КолонкаПриход;
	КолонкаРасход = СекцияГрафика.КолонкаРасход;
	
	ТекстОшибки = "";

	ПараметрыРасчета = Объект.ПараметрыРасчетаСекции(ИмяСекции, ОписаниеГрафика);
	ТаблицаПроцентов = ФинансоваяМатематика.ПолучитьТаблицуПроцентов(ПараметрыРасчета, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);  
		Если ОписаниеГрафика.Свойство("ТекстОшибки") Тогда
			ОписаниеГрафика.ТекстОшибки = ТекстОшибки;	
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ДатаНачалаПересчета = Дата(1, 1, 1);
	Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("ДатаНачалаПересчета") Тогда
		ДатаНачалаПересчета = ДопПараметры.ДатаНачалаПересчета;
	КонецЕсли;
	
	Если ТаблицаПроцентов.Количество() Тогда
		
		// Перенесем таблицу процентов в таблицу графика.
		ТаблицаПроцентов.Колонки.База.Имя = "СуммаЗадолженности";
		
		ТаблицаРасшифровка.Очистить();   
		
		СтрокиГрафикаТекущейСекции = СтрокиСекцииГрафика(Объект.ГрафикРасчетов, СекцияГрафика);
		
		РазницаСуммУплат = 0; // разница уплаченных процентов по расчету и по факту
		РазницаСуммНачислений = 0; // разница рассчитанных начислений процентов и по факту
		Если ЗначениеЗаполнено(ДатаНачалаПересчета) Тогда		
			
			СуммаУплатыРасчет = 0;
			СуммаУплатыНакопленная = 0;
			СуммаНачисленийРасчет = 0;
			Для каждого СтрокаПроцентов Из ТаблицаПроцентов Цикл
				
				Если ЗначениеЗаполнено(СтрокаПроцентов.ДатаНачисления)
					И СтрокаПроцентов.ДатаНачисления < ДатаНачалаПересчета Тогда
					СуммаУплатыНакопленная = СуммаУплатыНакопленная + СтрокаПроцентов.Сумма;
					СуммаНачисленийРасчет = СуммаНачисленийРасчет + СтрокаПроцентов.Сумма;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаПроцентов.ДатаПлатежа)
					И СтрокаПроцентов.ДатаПлатежа < ДатаНачалаПересчета Тогда
					
					СуммаУплатыРасчет = СуммаУплатыРасчет + СуммаУплатыНакопленная;
					СуммаУплатыНакопленная = 0;
				КонецЕсли;			
			КонецЦикла;
			
			СуммаУплатыПоФакту = 0;
			СуммаНачисленийПоФакту = 0;
			Для Каждого ТекСтрокаГрафика Из СтрокиГрафикаТекущейСекции Цикл
				Если ТекСтрокаГрафика.Дата < ДатаНачалаПересчета Тогда
					Если ТекСтрокаГрафика.ОперацияГрафика = СекцияГрафика.КолонкаРасходОперация Тогда // уплата процентов
						СуммаУплатыПоФакту = СуммаУплатыПоФакту + ТекСтрокаГрафика.СуммаРасчет;
					ИначеЕсли ТекСтрокаГрафика.ОперацияГрафика = СекцияГрафика.КолонкаПриходОперация Тогда
						СуммаНачисленийПоФакту = СуммаНачисленийПоФакту + ТекСтрокаГрафика.СуммаРасчет;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;
			
			РазницаСуммУплат = СуммаУплатыРасчет - СуммаУплатыПоФакту;
			РазницаСуммНачислений = СуммаНачисленийРасчет - СуммаНачисленийПоФакту;
		КонецЕсли;
		
		
		СуммаНачисленийНачальныйОстаток = 0;
		СуммаУплатНачальныйОстаток = 0;
		
		Для Каждого ТекСтрокаГрафика Из СтрокиГрафикаТекущейСекции Цикл   
			
			Если ЭтоВводНачальныхОстатковПриход(ТекСтрокаГрафика.ОперацияГрафика, ОперацииГрафика) Тогда 
				СуммаНачисленийНачальныйОстаток = СуммаНачисленийНачальныйОстаток + ТекСтрокаГрафика.Сумма;
			КонецЕсли;   
			
			Если ЭтоВводНачальныхОстатковРасход(ТекСтрокаГрафика.ОперацияГрафика, ОперацииГрафика) Тогда 
				СуммаУплатНачальныйОстаток = СуммаУплатНачальныйОстаток + ТекСтрокаГрафика.Сумма;
			КонецЕсли;
			
			Если ТекСтрокаГрафика.Дата >= ДатаНачалаПересчета И Не ЭтоВводНачальныхОстатков(ТекСтрокаГрафика.ОперацияГрафика, ОперацииГрафика) Тогда
				Объект.ГрафикРасчетов.Удалить(ТекСтрокаГрафика);
			КонецЕсли;	
		КонецЦикла;
				
		СуммаКУплате = 0;
		Для Каждого ТекСтрокаТаблицыПроцентов Из ТаблицаПроцентов Цикл 
			
			Если ТекСтрокаТаблицыПроцентов.ДатаНачисления <> Дата(1,1,1) Тогда
				
				// добавим начисление
				НоваяСтрока = ТаблицаРасшифровка.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТаблицыПроцентов);
				НоваяСтрока.Дата = ТекСтрокаТаблицыПроцентов.ДатаНачисления;
				НоваяСтрока[КолонкаПриход +"Расчет"] = ТекСтрокаТаблицыПроцентов.Сумма;
				
				СуммаКУплате = СуммаКУплате + ТекСтрокаТаблицыПроцентов.Сумма;
				
				Если ТекСтрокаТаблицыПроцентов.ДатаНачисления = ТекСтрокаТаблицыПроцентов.ДатаПлатежа
					И ТекСтрокаТаблицыПроцентов.ДатаПлатежа >= Объект.ГраницаФактическихДанных Тогда
					// добавим уплату
					НоваяСтрока[КолонкаРасход +"Расчет"] = СуммаКУплате;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекСтрокаТаблицыПроцентов.ДатаНачисления <> ТекСтрокаТаблицыПроцентов.ДатаПлатежа 
				И ЗначениеЗаполнено(ТекСтрокаТаблицыПроцентов.ДатаПлатежа) Тогда
						
				// добавим уплату
				НоваяСтрока = ТаблицаРасшифровка.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТаблицыПроцентов);
				НоваяСтрока.Дата = ТекСтрокаТаблицыПроцентов.ДатаПлатежа;
				НоваяСтрока[КолонкаРасход +"Расчет"] = СуммаКУплате;
			
			КонецЕсли;
			
			Если ТекСтрокаТаблицыПроцентов.ДатаНачисления >= ДатаНачалаПересчета Тогда
				
				СуммаНачисления = ТекСтрокаТаблицыПроцентов.Сумма;
				Если РазницаСуммНачислений > 0 Тогда // добавляем не начисленные по факту
					СуммаНачисления = СуммаНачисления + РазницаСуммНачислений;
					РазницаСуммНачислений = 0;
				ИначеЕсли РазницаСуммНачислений < 0 Тогда
					
					Если СуммаНачисления + РазницаСуммНачислений >= 0 Тогда
						СуммаНачисления = СуммаНачисления + РазницаСуммНачислений;
						РазницаСуммНачислений = 0;
					Иначе
						СуммаНачисления = 0;
						РазницаСуммНачислений = РазницаСуммНачислений + СуммаНачисления;
					КонецЕсли;
					
				КонецЕсли;
				
				СуммаНачисления = СуммаНачисления + СуммаНачисленийНачальныйОстаток;
				СуммаНачисленийНачальныйОстаток = 0;
				
				РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(
					Объект.ГрафикРасчетов,
					СуммаНачисления,
					ТекСтрокаТаблицыПроцентов.ДатаНачисления,
					,
					ОперацииГрафика[СекцияГрафика.КолонкаПриходОперация]);
					
			КонецЕсли;	

			Если ЗначениеЗаполнено(ТекСтрокаТаблицыПроцентов.ДатаПлатежа) Тогда
				
				Если ТекСтрокаТаблицыПроцентов.ДатаПлатежа >= ДатаНачалаПересчета Тогда	
				
					Если РазницаСуммУплат > 0 Тогда // надо доплатить
						СуммаКУплате = СуммаКУплате + РазницаСуммУплат;
						РазницаСуммУплат = 0;
					ИначеЕсли РазницаСуммУплат < 0 Тогда		
						Если СуммаКУплате + РазницаСуммУплат >= 0 Тогда 
							СуммаКУплате = СуммаКУплате + РазницаСуммУплат;
							РазницаСуммУплат = 0;
						Иначе
							РазницаСуммУплат = РазницаСуммУплат + СуммаКУплате;
							СуммаКУплате = 0;
						КонецЕсли;	
					КонецЕсли;
					
					СуммаКУплате = СуммаКУплате + СуммаУплатНачальныйОстаток;
					СуммаУплатНачальныйОстаток = 0;
					
					РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(
						Объект.ГрафикРасчетов,
						СуммаКУплате,
						ТекСтрокаТаблицыПроцентов.ДатаПлатежа,
						,
						ОперацииГрафика[СекцияГрафика.КолонкаРасходОперация]);
						
				КонецЕсли;	
				
				СуммаКУплате = 0;
			КонецЕсли;	
			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЛинейныйГрафикИзТаблицы(ГрафикРасчетовЛинейный, ТаблицаЗагрузкиГрафика, ОписаниеГрафика, ОперацииГрафика) Экспорт
	
	// Колонки таблицы соответствуют именам секций графика: Дата, ОсновнойДолгПолучение, ОсновнойДолгВозврат и т.д.
	Для каждого СтрокаЗагрузки Из ТаблицаЗагрузкиГрафика Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаЗагрузки.Дата) Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СекцияОписанияГрафика Из ОписаниеГрафика Цикл
			
			// 1. Приход
			СуммаПриход = СтрокаЗагрузки[СекцияОписанияГрафика.Значение.КолонкаПриход];
			Если СуммаПриход <> 0 Тогда
				ОперацияПриход = ОперацииГрафика[СекцияОписанияГрафика.Значение.КолонкаПриходОперация];
				РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(ГрафикРасчетовЛинейный, 
					СуммаПриход, СтрокаЗагрузки.Дата,,ОперацияПриход);
			КонецЕсли;	
			
			// 2. Расход
			СуммаРасход = СтрокаЗагрузки[СекцияОписанияГрафика.Значение.КолонкаРасход];
			Если СуммаРасход <> 0 Тогда
				ОперацияРасход = ОперацииГрафика[СекцияОписанияГрафика.Значение.КолонкаРасходОперация];
				РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(ГрафикРасчетовЛинейный, 
					СуммаРасход, СтрокаЗагрузки.Дата,,ОперацияРасход);
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры	

// Функция возвращает вид операции бюджетирования для заданной операции финансового инструмента,
// определяемой через свои свойства.
//
// Параметры:
//  ВидФинансовогоИнструмента		 - ПеречислениеСсылка.ВидыФинансовыхИнструментов	 - вид финансового инструмента искомой операции
//  ЭлементСтруктурыЗадолженности	 - ПеречислениеСсылка.ЭлементыСтруктурыЗадолженности	 - элемент структуры задолженности искомой операции
//  ПриходРасход					 - ПеречислениеСсылка.ВидыДвиженийПриходРасход	 - Увеличивает ли операция задолженность по инструменту (Приход) или уменьшает (Расход)
// 
// Возвращаемое значение:
//  Структура:
//    ВидОперацииУХ - СправочникСсылка.ВидыОперацийУХ - заданный в настройках вид операции.
//    СтатьяБюджета - Статья бюджета, соответствующая данной операции.
//
Функция НастройкиОперацииФинансовогоИнструмента(ВидФинансовогоИнструмента, ЭлементСтруктурыЗадолженности, ПриходРасход) Экспорт
	
	Результат = Новый Структура("ВидОперацииУХ,СтатьяБюджета");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиФинансовыхИнструментов.Операция.ВидОперацииУХ КАК ВидОперацииУХ,
	|	НастройкиФинансовыхИнструментов.СтатьяБюджета КАК СтатьяБюджета
	|ИЗ
	|	РегистрСведений.НастройкиФинансовыхИнструментов КАК НастройкиФинансовыхИнструментов
	|ГДЕ
	|	НастройкиФинансовыхИнструментов.Операция.ВидФинансовогоИнструмента = &ВидФинансовогоИнструмента
	|	И НастройкиФинансовыхИнструментов.Операция.КолонкаСекции = &ПриходРасход
	|	И НастройкиФинансовыхИнструментов.Операция.ЭлементСтруктурыЗадолженности = &ЭлементСтруктурыЗадолженности
	|	И НЕ НастройкиФинансовыхИнструментов.Операция.ВидОперацииУХ = ЗНАЧЕНИЕ(Справочник.ВидыОперацийУХ.ПустаяСсылка)";

	Запрос.УстановитьПараметр("ВидФинансовогоИнструмента", ВидФинансовогоИнструмента);	
	Запрос.УстановитьПараметр("ЭлементСтруктурыЗадолженности", ЭлементСтруктурыЗадолженности);
	Запрос.УстановитьПараметр("ПриходРасход", ПриходРасход);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьПустыеСтрокиГрафика(График) Экспорт
	
	КоличествоЭлементовКоллекции = График.Количество();
	
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
	
		Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		
		СтрокаГрафика = График[Индекс];
		СостояниеЗаполнения = СостояниеЗаполненияСтрокиГрафика(СтрокаГрафика);
		
		Если СостояниеЗаполнения = СостояниеСтрокиГрафикаНеЗаполнена() Тогда
			График.Удалить(Индекс);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Функция СтрокиСекцииГрафика(ГрафикРасчетов, ОписаниеСекции) Экспорт
	
	СтруктураПоиска = Новый Структура("ЭлементСтруктурыЗадолженности");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ОписаниеСекции);
	
	Возврат ГрафикРасчетов.НайтиСтроки(СтруктураПоиска);
	
КонецФункции

Процедура УдалитьСтрокиСекцииГрафика(ГрафикРасчетов, ОписаниеСекции) Экспорт
	
	СтрокиСекции = СтрокиСекцииГрафика(ГрафикРасчетов, ОписаниеСекции);
	Для каждого Строка Из СтрокиСекции Цикл
		ГрафикРасчетов.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

Функция ОстатокЗадолженностиСекцииГрафика(ГрафикРасчетов, ОписаниеСекции, ДатаЗадолженности = Неопределено) Экспорт
	
	СтруктураПоиска = Новый Структура("ЭлементСтруктурыЗадолженности");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ОписаниеСекции);
	СтрокиГрафика = ГрафикРасчетов.НайтиСтроки(СтруктураПоиска);
	
	Результат = 0;
	Для Каждого ТекНайденнаяСтрока Из СтрокиГрафика Цикл
		
		Если ДатаЗадолженности <> Неопределено И ТекНайденнаяСтрока.Дата > ДатаЗадолженности Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоСтрокаПриходнойКолонкиГрафика(ТекНайденнаяСтрока) Тогда
			Результат = Результат + ТекНайденнаяСтрока.Сумма;
		Иначе
			Результат = Результат - ТекНайденнаяСтрока.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаПоследнегоНачисленияСекцииГрафика(ГрафикРасчетов, ОписаниеСекции, ДатаЗадолженности = Неопределено) Экспорт
	
	СтруктураПоиска = Новый Структура("ЭлементСтруктурыЗадолженности");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ОписаниеСекции);
	СтрокиГрафика = ГрафикРасчетов.НайтиСтроки(СтруктураПоиска);
	
	ДатаНачисления = Дата(1,1,1);
	
	Для Каждого ТекНайденнаяСтрока Из СтрокиГрафика Цикл
		
		Если ДатаЗадолженности <> Неопределено И ТекНайденнаяСтрока.Дата > ДатаЗадолженности Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоСтрокаПриходнойКолонкиГрафика(ТекНайденнаяСтрока) Тогда
			Если ДатаНачисления < ТекНайденнаяСтрока.Дата Тогда
				ДатаНачисления = ТекНайденнаяСтрока.Дата;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДатаНачисления;
	
КонецФункции

Функция СекцияГрафикаЗамкнута(ГрафикРасчетов, ОписаниеСекции) Экспорт
	
	Результат = (ОстатокЗадолженностиСекцииГрафика(ГрафикРасчетов, ОписаниеСекции) = 0);
	Возврат Результат;
	
КонецФункции

Функция ЕстьСтрокиГрафикаССуммой(ГрафикРасчетов, ЭлементСтруктурыЗадолженности) Экспорт
	
	СтрокиГрафика = ГрафикРасчетов.НайтиСтроки(Новый Структура("ЭлементСтруктурыЗадолженности", ЭлементСтруктурыЗадолженности));
	Для каждого Строка Из СтрокиГрафика Цикл
		Если ЗначениеЗаполнено(Строка.Сумма) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбщаяСуммаКолонкиСекции(ГрафикРасчетов, ЭлементСтруктурыЗадолженности = Неопределено, КолонкаСекции) Экспорт
	
	СтруктураПоиска = Новый Структура;
	Если ЭлементСтруктурыЗадолженности <> Неопределено Тогда
		СтруктураПоиска.Вставить("ЭлементСтруктурыЗадолженности", ЭлементСтруктурыЗадолженности);
	КонецЕсли;
	СтруктураПоиска.Вставить("КолонкаСекции", КолонкаСекции);
		
	СтрокиГрафика = ГрафикРасчетов.Выгрузить(СтруктураПоиска, "Сумма");
	Возврат СтрокиГрафика.Итог("Сумма");
	
КонецФункции

Функция МаксимальнаяСуммаЗадолженностиСекцииГрафика(ГрафикРасчетов, ЭлементСтруктурыЗадолженности) Экспорт
	
	СтруктураПоиска = Новый Структура("ЭлементСтруктурыЗадолженности", ЭлементСтруктурыЗадолженности);
	СтрокиГрафика = ГрафикРасчетов.НайтиСтроки(СтруктураПоиска);
	ТекущаяЗадолженность = 0;
	МаксимальнаяЗадолженность = 0;
	Для Каждого ТекНайденнаяСтрока Из СтрокиГрафика Цикл
		
		Если ТекНайденнаяСтрока.КолонкаСекции = Перечисления.ВидыДвиженийПриходРасход.Приход Тогда
			ТекущаяЗадолженность = ТекущаяЗадолженность + ТекНайденнаяСтрока.Сумма;
		Иначе
			ТекущаяЗадолженность = ТекущаяЗадолженность - ТекНайденнаяСтрока.Сумма;
		КонецЕсли;
		
		Если ТекущаяЗадолженность > МаксимальнаяЗадолженность Тогда
			МаксимальнаяЗадолженность = ТекущаяЗадолженность;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальнаяЗадолженность;
	
КонецФункции

Функция ЭтоСтрокаПриходнойКолонкиГрафика(СтрокаГрафика) Экспорт

	Возврат СтрокаГрафика.КолонкаСекции = Перечисления.ВидыДвиженийПриходРасход.Приход;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения_СчетаУчета(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт

	СчетНоминала = Справочники.ВидыСчетовФИ.СчетНоминала;
	
	Для каждого СтрокаСчетУчета Из Объект.СчетаУчета Цикл
		
		Если Не СтрокаСчетУчета.Счет.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Если СчетНоминала = СтрокаСчетУчета.ВидСчетаФИ Тогда
			Продолжить;//счет номинала не обязателен		
		КонецЕсли;
		
		ТекстОшибки =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не заполнен <%1> в счетах учета'"), СтрокаСчетУчета.ВидСчетаФИ);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, ,, Отказ);
		
	КонецЦикла;
	
	МассивНепроверяемыхРеквизитов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СчетаУчета.Счет");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ОчиститьНеиспользуемыеРеквизитыДокументовЦБ(Объект) Экспорт
	
	// очищаем неиспользуемые реквизиты
	ВидФинансовогоИнструмента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ФинансовыйИнструмент, "ВидФинансовогоИнструмента");
	Если ВидФинансовогоИнструмента <> Перечисления.ВидыФинансовыхИнструментов.Облигация Тогда
		Объект.ЦФО = Неопределено;
		Объект.Проект = Неопределено;
		Объект.СчетОрганизации = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.ПараметрыОпераций.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммуПроцентовВариантаФинансирования(Объект, СуммаЗаимствования,ПериодичностьНачисленияПроцентов, НеОчищатьГрафик = Ложь, Заявка = Неопределено)  Экспорт

	Если Не ЗначениеЗаполнено(Объект.ДатаПривлечения) Тогда
		Возврат;	
	КонецЕсли;
              	
	Если Не ЗначениеЗаполнено(Объект.ДатаВозврата) Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодичностьНачисленияПроцентов) Тогда
		Возврат;	
	КонецЕсли;
	Если НЕ НеОчищатьГрафик Тогда
		Объект.ГрафикУплатыПроцентов.Очистить();
	КонецЕсли;
    
	ПараметрыРасчета = ПараметрыРасчетаСекции(Объект, СуммаЗаимствования, ПериодичностьНачисленияПроцентов);
	ТаблицаПроцентов = ФинансоваяМатематика.ПолучитьТаблицуПроцентов(ПараметрыРасчета);

	Для каждого СтрокаТаблица Из ТаблицаПроцентов Цикл
		НоваяСтрокаГрафика 	= Объект.ГрафикУплатыПроцентов.Добавить(); 
		НоваяСтрокаГрафика.Дата 	= СтрокаТаблица.ДатаПлатежа;		
		НоваяСтрокаГрафика.Сумма 	= СтрокаТаблица.Сумма;    
		Если Заявка <> Неопределено Тогда 
			НоваяСтрокаГрафика.Заявка 	= Заявка;	
		КонецЕсли;				
	КонецЦикла;    
	
	Объект.СуммаПроцентов = Объект.ГрафикУплатыПроцентов.Итог("Сумма");

КонецПроцедуры  

Процедура АктуализироватьГрафикиЦенныхБумаг(ДатаАктуализации = Неопределено, ОтборФИ = Неопределено) Экспорт
	
	Процессор = ПроцессорАктуализироватьГрафикиЦенныхБумаг(ДатаАктуализации, ОтборФИ);
	
	//ВерсияГрафикаЦеннойБумаги
	ОбновитьГрафик_ВерсияГрафикаЦеннойБумаги(Процессор);
	//ПараметрыЦеннойБумагиВексель
	
	//РасчетыСКонтрагентамиГрафики
	//РасшифровкиГрафиковЦБ
	ОбновитьГрафик_ГрафикиДокументовЦБ(Процессор);
		
	//АкцептПротестПереводногоВекселя
	//ПоступлениеВекселя
	ОбновитьГрафик_ГрафикиДокументовВексели(Процессор);
	
КонецПроцедуры

Функция ПроцессорАктуализироватьГрафикиЦенныхБумаг(ДатаАктуализации = Неопределено, ОтборВидКотировки = Неопределено) Экспорт

	Процессор = Новый Структура(
		"Дата, ОтборВидКотировки, Облигации, Вексели, ГрафикЦБ, ГрафикДокумента, ВыводитьСообщения", 
		ДатаАктуализации, ОтборВидКотировки, Истина, Истина, Истина, Истина, Ложь);
		
	Если Не ЗначениеЗаполнено(ДатаАктуализации) Тогда
		Процессор.Вставить("Дата", ТекущаяДата());
	КонецЕсли;
	
	Возврат Процессор;

КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УпорядочитьГрафик(График)
	
	График.Сортировать("Дата");	
	
КонецФункции

Функция ЭтоВводНачальныхОстатков(ОперацияГрафика, ОперацииГрафика)
	
	ОписаниеОперации = ОперацииГрафика.Получить(ОперацияГрафика);
	
	Если ОписаниеОперации = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОписаниеОперации.ЭтоВводНачальныхОстатков И ОписаниеОперации.ФактическийВводНачальныхОстатков; 

КонецФункции  

Функция ЭтоВводНачальныхОстатковПриход(ОперацияГрафика, ОперацииГрафика)
	
	ОписаниеОперации = ОперацииГрафика.Получить(ОперацияГрафика);
	
	Если ОписаниеОперации = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОписаниеОперации.ЭтоВводНачальныхОстатков 
		И ОписаниеОперации.ФактическийВводНачальныхОстатков 
		И ОписаниеОперации.НаправлениеДвижения = Перечисления.ВидыДвиженийПриходРасход.Приход; 

КонецФункции 
	
Функция ЭтоВводНачальныхОстатковРасход(ОперацияГрафика, ОперацииГрафика)
	
	ОписаниеОперации = ОперацииГрафика.Получить(ОперацияГрафика);
	
	Если ОписаниеОперации = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОписаниеОперации.ЭтоВводНачальныхОстатков 
		И ОписаниеОперации.ФактическийВводНачальныхОстатков 
		И ОписаниеОперации.НаправлениеДвижения = Перечисления.ВидыДвиженийПриходРасход.Расход; 

КонецФункции    

Функция НовыйОперацииИзмененияБазы()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("Приход", РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	Результат.Колонки.Добавить("Расход", РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	
	Возврат Результат;
	
КонецФункции  

Процедура СбалансироватьСекциюГрафика(График, ТекСекцияГрафика, ДатаОтсчета, НаправлениеПересчета, ТекущийИндекс = 0)
	
	ГрафикСекции = График.НайтиСтроки(Новый Структура("ЭлементСтруктурыЗадолженности", ТекСекцияГрафика.ЭлементСтруктурыЗадолженности));
	
	СуммаККорректировке = 0;
	
	Для Каждого ТекСтрокаГрафика Из ГрафикСекции Цикл
		
		Если ТекСтрокаГрафика.КолонкаСекции = Перечисления.ВидыДвиженийПриходРасход.Приход Тогда
			СуммаККорректировке = СуммаККорректировке + ТекСтрокаГрафика.Сумма;
		Иначе
			СуммаККорректировке = СуммаККорректировке - ТекСтрокаГрафика.Сумма
		КонецЕсли;
		
	КонецЦикла;
	
	Если СуммаККорректировке = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаККорректировке > 0 Тогда
		// Поставим сумму на дату завершения.
		СтрокаГрафика = Неопределено;
		СтруктураПоиска = Новый Структура("ЭлементСтруктурыЗадолженности,КолонкаСекции,Дата",
			ТекСекцияГрафика.ЭлементСтруктурыЗадолженности, 
			Перечисления.ВидыДвиженийПриходРасход.Расход,
			ДатаОтсчета);
		ЗавершающиеСтроки = График.НайтиСтроки(СтруктураПоиска);
		Если ЗавершающиеСтроки.Количество() Тогда
			СтрокаГрафика = ЗавершающиеСтроки[0];
		КонецЕсли;
		
		Если СтрокаГрафика = Неопределено Тогда
			СтрокаГрафика = График.Добавить();
			СтрокаГрафика.Дата = ДатаОтсчета;
			СтрокаГрафика.ОперацияГрафика = ТекСекцияГрафика.КолонкаРасходОперация;
			
			ПараметрыОперацииГрафика = УправлениеДоговорамиУХВызовСервераПовтИсп.ПараметрыОперацииГрафика(СтрокаГрафика.ОперацияГрафика);
			ЗаполнитьЗначенияСвойств(СтрокаГрафика,ПараметрыОперацииГрафика);
			// !!!
		КонецЕсли;
		
		СтрокаГрафика.Сумма = СтрокаГрафика.Сумма + СуммаККорректировке;
		Если ТекСекцияГрафика.ЭтоРасчетнаяСекция Тогда
			СтрокаГрафика.СуммаКорректировка = СтрокаГрафика.СуммаКорректировка + СуммаККорректировке;
		КонецЕсли;
		СтрокаГрафика.РучнаяКорректировка = СтрокаГрафика.СуммаКорректировка <> 0;
	Иначе
		// Будем списывать сумму согласно нашему алгоритму - вперед или назад.
		ОсталосьРаспределить = - СуммаККорректировке;
		СтрокиГрафика = График.НайтиСтроки(
			Новый Структура("ЭлементСтруктурыЗадолженности,КолонкаСекции", ТекСекцияГрафика.ЭлементСтруктурыЗадолженности, Перечисления.ВидыДвиженийПриходРасход.Расход));
				
		КоличествоСтрокГрафика = СтрокиГрафика.Количество();
		Для Сч = 1 по КоличествоСтрокГрафика - ТекущийИндекс Цикл
			
			Если НаправлениеПересчета = "Вперед" Тогда
				ИндексСтроки = ТекущийИндекс + Сч - 1;
			Иначе
				// "Назад"
				ИндексСтроки = КоличествоСтрокГрафика - Сч;
			КонецЕсли;
			
			СтрокаГрафика = СтрокиГрафика[ИндексСтроки];
			
			Если СтрокаГрафика.Сумма > 0 Тогда
				СуммаКСписанию = Мин(СтрокаГрафика.Сумма, ОсталосьРаспределить);
				СтрокаГрафика.Сумма = СтрокаГрафика.Сумма - СуммаКСписанию;
				Если ТекСекцияГрафика.ЭтоРасчетнаяСекция Тогда
					СтрокаГрафика.СуммаКорректировка = СтрокаГрафика.СуммаКорректировка - СуммаКСписанию;
				КонецЕсли;
				
				ОсталосьРаспределить = ОсталосьРаспределить - СуммаКСписанию;
				
				Если ОсталосьРаспределить = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция СостояниеЗаполненияСтрокиГрафика(СтрокаГрафика)
	
	СостояниеЗаполнения = СостояниеСтрокиГрафикаНеЗаполнена();
	
	Если СтрокаГрафика.Сумма <> 0 Тогда
		СостояниеЗаполнения = СостояниеСтрокиГрафикаЗаполнена();
	КонецЕсли;
		
	Возврат СостояниеЗаполнения;
	
КонецФункции

Функция СостояниеСтрокиГрафикаНеЗаполнена()
	
	Возврат "НеЗаполнена";
	
КонецФункции

Функция СостояниеСтрокиГрафикаНетЗначимыхДанных()
	Возврат "НетЗначимыхДанных";
КонецФункции

Функция СостояниеСтрокиГрафикаЗаполнена()
	Возврат "Заполнена";
КонецФункции

Функция ПараметрыРасчетаСекции(Объект, СуммаЗаимствования, ПериодичностьНачисленияПроцентов)	
	
	Результат = ФинансоваяМатематикаКлиентСервер.СтруктураПараметровРасчетаПроцентов();
	Результат.ДатаНачала 			= Объект.ДатаПривлечения;  
	Результат.ДатаНачалаДействия 	= Объект.ДатаПривлечения;
	Результат.ДатаПервойВыборки 	= Объект.ДатаПривлечения;
	Результат.ДатаОкончания = Объект.ДатаВозврата;
	Результат.ПроизводственныйКалендарь 		= Константы.ПроизводственныйКалендарьПоУмолчанию.Получить();
	Результат.ПериодичностьУплаты 				= ПериодичностьНачисленияПроцентов;
	Результат.ДатаОтсчетаПроцентныхПериодов		= Перечисления.ВидыДатОтсчетаПериодичности.ДатаОткрытияКредита;
	Результат.ОперацииИзмененияБазы 			= ТаблицаИзмененияБазы(СуммаЗаимствования, Объект.ДатаПривлечения, Объект.ДатаВозврата);
	Результат.ПроцентнаяСтавка 					= Объект.ПроцентнаяСтавка;
	Результат.ВыплачиватьПроцентыПериодически 	= Истина;    
	Результат.ИзменятьПроцентныйПериод			= Ложь;  
	Результат.ВыплачиватьПроцентыВДатыПогашенияТела = Истина;
	Результат.ТочкаОтсчетаДатыФиксацииСтавки 	= Перечисления.СпособыОпределенияДатыОперацииПоПериоду.ОкончаниеПериода;
	Результат.ТочкаОтсчетаСдвигаДатыУплаты 		= Перечисления.СпособыОпределенияДатыОперацииПоПериоду.ОкончаниеПериода; 
	Результат.ТипПроцентнойСтавки				= Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная;
	Результат.НачислениеПроцентовНаКрайниеДаты	= Перечисления.СпособыНачисленияПроцентовНаГраницыПериодов.НачислятьПроцентыНаПоследнийДень;
    Результат.БазаДляРасчетаПроцентов			= справочники.СпособыРасчетаДнейПериодическихОпераций.ГодФактМесяцФакт;
	
	Возврат Результат;
	
КонецФункции
  
#КонецОбласти

#Область СтандартныеПодсистемы_ВариантыОтчетов

// Определяет объекты конфигурации, в модулях менеджеров которых предусмотрена процедура ДобавитьКомандыОтчетов,
// описывающая команды открытия контекстных отчетов.
// Синтаксис процедуры ДобавитьКомандыОтчетов см. в документации.
//
// Параметры:
//   Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами отчетов.
//
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	
	Объекты.Добавить(Метаданные.Справочники.ЦенныеБумаги);
	Объекты.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов);
	
	Объекты.Добавить(Метаданные.Документы.АкцептПротестПереводногоВекселя);
	Объекты.Добавить(Метаданные.Документы.ВыбытиеВекселей);
	Объекты.Добавить(Метаданные.Документы.ВыбытиеИнвестиций);
	Объекты.Добавить(Метаданные.Документы.ВыкупЦеннойБумаги);
	Объекты.Добавить(Метаданные.Документы.ВыпускЦеннойБумаги);
	Объекты.Добавить(Метаданные.Документы.НачисленияПоФинансовымИнструментам);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеВекселя);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеИнвестиций);
	Объекты.Добавить(Метаданные.Документы.ПриобретениеЦеннойБумаги);
	Объекты.Добавить(Метаданные.Документы.ПродажаЦеннойБумаги);

	Объекты.Добавить(Метаданные.ЖурналыДокументов.ДвижениеИнвестиций);
	Объекты.Добавить(Метаданные.ЖурналыДокументов.ОперацииСВекселями);
	Объекты.Добавить(Метаданные.ЖурналыДокументов.ОперацииСЦеннымиБумагами);
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетовФИ(КомандыОтчетов, Параметры) Экспорт
	
	ВстраиваниеУХ.ДобавитьКомандуОбработчик(КомандыОтчетов, "КарточкаФинансовогоИнструмента", 	НСтр("ru = 'Карточка ценной бумаги'"));
	ВстраиваниеУХ.ДобавитьКомандуОбработчик(КомандыОтчетов, "ВзаиморасчетыПоДоговору", 			НСтр("ru = 'Взаиморасчеты по договору'"));
	//ДобавитьКомандуОбработчик(КомандыОтчетов, "ГрафикНоминалаФИ", НСтр("ru = 'График номинала финансового инструмента'"));
	
	РеквизитВидФИ = "ФинансовыйИнструмент.ВидФинансовогоИнструмента";
	Вексель = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхИнструментов.Вексель");
	 
	Команда = ДобавитьКомандуОтчет(КомандыОтчетов, "Отчет.ГрафикиЦенныхБумаг", НСтр("ru = 'График ценной бумаги'"));
	ДобавитьУсловиеВидимостиКоманды(Команда, РеквизитВидФИ, Вексель);
	
	Команда = ДобавитьКомандуОтчет(КомандыОтчетов, "Отчет.ГрафикиЦенныхБумаг", НСтр("ru = 'График ценной бумаги'"));
	ДобавитьУсловиеВидимостиКоманды(Команда, РеквизитВидФИ, Вексель);
	
	ДобавитьКомандуОтчет(КомандыОтчетов, "Отчет.ВедомостьПоПартиямЦенныхБумаг", НСтр("ru = 'Ведомость по партиям ценной бумаги'"));
	ДобавитьКомандуОтчет(КомандыОтчетов, "Отчет.РасчетыСБрокером", НСтр("ru = 'Расчеты с брокером'"));
	//ДобавитьКомандуОтчет(КомандыОтчетов, "Отчет.АнализГрафикаФинансовогоИнструмента", НСтр("ru = 'Сводный график'"));
	
КонецПроцедуры

Процедура ДобавитьУсловиеВидимостиКоманды(Команда, Реквизит, Значение)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		Команда, Реквизит, Значение);

КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетовИнвестиции(КомандыОтчетов, Параметры) Экспорт
	
	//** структура подчиненности
	//** расчеты с Контрагент
	//** карточка субконто РСБУ, МСФО
	//** графики ФИ казна, МСФО
	
	ВстраиваниеУХ.ДобавитьКомандуОбработчик(КомандыОтчетов, "КарточкаФинансовогоИнструмента", 	НСтр("ru = 'Карточка субконто по объекту инвестирования'"));
	ВстраиваниеУХ.ДобавитьКомандуОбработчик(КомандыОтчетов, "ВзаиморасчетыПоДоговору", 			НСтр("ru = 'Взаиморасчеты по договору'"));
		
КонецПроцедуры

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//
Функция ДобавитьКомандуОтчет(КомандыОтчетов, Менеджер, Представление, ИмяКоманды = Неопределено) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.НайтиПоПолномуИмени(Менеджер)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КомандаОтчет = КомандыОтчетов.Добавить();
	
	КомандаОтчет.Менеджер = Менеджер;
	КомандаОтчет.Представление = Представление;
	КомандаОтчет.МножественныйВыбор = Истина;
	
	Если ИмяКоманды <> Неопределено Тогда
		КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
	КонецЕсли;
	
	Возврат КомандаОтчет;
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы_СозданиеНаОсновании

Процедура ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт

	Объекты.Добавить(Метаданные.Справочники.ЦенныеБумаги);
	
	Объекты.Добавить(Метаданные.Документы.АкцептПротестПереводногоВекселя);
	Объекты.Добавить(Метаданные.Документы.ВыбытиеВекселей);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеВекселя);
	
	Объекты.Добавить(Метаданные.Документы.ВыкупЦеннойБумаги);
	Объекты.Добавить(Метаданные.Документы.ВыпускЦеннойБумаги);
	Объекты.Добавить(Метаданные.Документы.ПриобретениеЦеннойБумаги);
	Объекты.Добавить(Метаданные.Документы.ПродажаЦеннойБумаги);
	
	Объекты.Добавить(Метаданные.Документы.ПоступлениеИнвестиций);
	Объекты.Добавить(Метаданные.Документы.ВыбытиеИнвестиций);	

КонецПроцедуры

Функция УсловиеВидимостиКоманды() Экспорт

	

КонецФункции

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Идентификатор, Представление) Экспорт

	КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
	
	КомандаСоздатьНаОсновании.Обработчик = "ФинансовыеИнструментыФормыКлиент.Подключаемый_ОткрытьФормуСозданияНаОсновании";
	КомандаСоздатьНаОсновании.Идентификатор = Идентификатор;
	КомандаСоздатьНаОсновании.Представление = Представление;
	КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	
	Возврат КомандаСоздатьНаОсновании;

КонецФункции

#КонецОбласти

#Область БСП_УправлениеДоступом

Функция ТекстУправлениеДоступом_ОграничениеФИ() Экспорт

	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
		
		Возврат
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Подразделение)";
		
	КонецЕсли;

	Возврат
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецФункции

#КонецОбласти

#Область Проведение

Функция ТекстЗапросаВерсияГрафика(НомераТаблиц, ИмяДокумента, ИмяТаблицы, ВерсияЦеннойБумаги = Ложь) Экспорт

	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВерсияФИ.Дата КАК Период,
	|	&ДоговорКонтрагента КАК ПредметГрафика,
	|	&Организация КАК Организация,	
	|	ВерсияФИ.ОпорныйГрафик КАК ОпорныйГрафик,
	|	&Ссылка КАК ВерсияГрафика
	|ИЗ
	|	Документ.ВерсияСоглашенияКредит КАК ВерсияФИ
	|ГДЕ
	|	ВерсияФИ.Ссылка = &Ссылка";
	
	Если ВерсияЦеннойБумаги = Истина Тогда//у ценных бумаг график всегда опорный
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВерсияФИ.ОпорныйГрафик", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДоговорКонтрагента", "ФинансовыйИнструмент");
	КонецЕсли;
	
	Возврат СтрЗаменить(ТекстЗапроса, "ВерсияСоглашенияКредит", ИмяДокумента);

КонецФункции

#КонецОбласти

#Область ПроведениеФИ

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ОписаниеГрафика = Неопределено) Экспорт
	
	ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	
	ИмяРегистраВерсий = "ВерсииГрафиковРасчетов";
	ИмяРегистраЗадолженность = "РасчетыСКонтрагентамиГрафики";
	
	ТаблицыДляДвижений = Новый Структура;		
	ДополнительныеСвойства = Новый Структура;
	НомераТаблиц = Новый Структура;
	
	// Реквизиты документа.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = ТекстЗапросаРеквизитыДокументаФИ(, ИмяДокумента);
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
	ДополнительныеСвойства.Вставить("Реквизиты", Реквизиты);
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из Реквизиты Цикл
		Запрос.УстановитьПараметр(ТекРеквизит.Ключ, ТекРеквизит.Значение);
	КонецЦикла;
	
	УстановитьПараметрыСтатьиБюджетов(Запрос);
	
	Запрос.Текст = 
	ТекстЗапросаВерсияГрафика(НомераТаблиц, ИмяДокумента, ИмяРегистраВерсий)
	+ "
	  |
	  |;
	  |"
	+ ТекстЗапросаЗадолженностьПоГрафикам(НомераТаблиц, ИмяДокумента, ИмяРегистраЗадолженность, ОписаниеГрафика, Реквизиты.ВидФинансовогоИнструмента);
	
	Результат = Запрос.ВыполнитьПакет();

	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		Если СтрНачинаетсяС(НомерТаблицы.Ключ, "Таблица")
			ИЛИ СтрНачинаетсяС(НомерТаблицы.Ключ, "ВТ_") Тогда
			Продолжить;
		КонецЕсли;
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
			
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);
	
	Возврат ДополнительныеСвойства;

КонецФункции

Функция ТекстЗапросаРеквизитыДокументаФИ(НомераТаблиц = Неопределено, ИмяДокумента) Экспорт 

	Если НомераТаблиц <> Неопределено Тогда
		НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());	
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ	
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.ВидДоговораУХ.ВидФинансовогоИнструмента КАК ВидФинансовогоИнструмента,	
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.ВалютаВзаиморасчетов КАК Валюта
	|ИЗ
	|	Документ.ВерсияСоглашенияКредит КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат СтрЗаменить(ТекстЗапроса, "ВерсияСоглашенияКредит", ИмяДокумента);

КонецФункции

Функция ТекстЗапросаЗадолженностьПоГрафикам(НомераТаблиц, ИмяДокумента, ИмяТаблицы, ОписаниеГрафика, ВидФинансовогоИнструмента) Экспорт
	
	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());
	
	Возврат ПолучитьТекстЗапросаРасчетыПоГрафикамФИ(ИмяДокумента, ВидФинансовогоИнструмента, ОписаниеГрафика);
	
КонецФункции

Функция ПолучитьТекстЗапросаРасчетыПоГрафикамФИ(ИмяДокумента,ВидФинансовогоИнструмента,ОписаниеГрафика) Экспорт
	
	ЭтоДоходныйИнструмент = УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоходныйИнструмент(ВидФинансовогоИнструмента);
	
	Если ЭтоДоходныйИнструмент Тогда
		ИмяВидаДвиженияПриходнойКолонки = "Приход";
		ИмяВидаДвиженияРасходнойКолонки = "Расход";
	Иначе
		ИмяВидаДвиженияПриходнойКолонки = "Расход";
		ИмяВидаДвиженияРасходнойКолонки = "Приход";
	КонецЕсли;
	
	ШаблонТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ДоговорКонтрагента КАК ПредметГрафика,
	|	&Ссылка КАК ВерсияГрафика,
	|	&ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
	|	&ВидДвиженияНакопления КАК ВидДвижения,
	|	График.Дата КАК Период,
	|	&Валюта КАК Валюта,
	|	&СтатьяБюджетаПараметр КАК СтатьяБюджета,
	|	&ОперацияПараметр КАК Операция,
	|	&ПриходРасходПараметр КАК ПриходРасход,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	График.ОсновнойДолгПолучение КАК Сумма,
	|	График.ОсновнойДолгПолучение КАК СуммаПлатежа,
	|	&Валюта КАК ВалютаПлатежа,
	|	1 КАК КурсПлатежа,
	|	1 КАК КратностьПлатежа
	|	
	|ИЗ
	|	Документ.ВерсияСоглашенияКредит.График КАК График
	|ГДЕ
	|	График.ОсновнойДолгПолучение <> 0
	|	И График.Ссылка = &Ссылка";
	
	ШаблонТекстЗапроса = СтрЗаменить(ШаблонТекстЗапроса, "ВерсияСоглашенияКредит", ИмяДокумента);	
	
	ТекстЗапроса = "";
	
	МассивФрагментовЗапроса = Новый Массив;
	СтрокаРазделитель = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
	
	Для Каждого ТекСекцияГрафика Из ОписаниеГрафика Цикл
		
		ОписаниеСекции = ТекСекцияГрафика.Значение;
		
		Если Не ОписаниеСекции.ЭтоСекцияВзаиморасчетов Тогда
			Продолжить;
		КонецЕсли;
		
		// добавим две секции - "приходную" и "расходную".
		// Установим предопределенные ЭлементСтруктурыЗадолженности и ВидДвиженияНакопления,
		
		ИмяЭлементаСтруктурыЗадолженности = ОбщегоНазначения.ИмяЗначенияПеречисления(ОписаниеСекции.ЭлементСтруктурыЗадолженности);
		// заменим поле ОсновнойДолгПолучение.
		ТекстСекции = СтрЗаменить(ШаблонТекстЗапроса, "&ЭлементСтруктурыЗадолженности", 
			СтрШаблон("ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.%1)", ИмяЭлементаСтруктурыЗадолженности));
			
		ТекстПриход = СтрЗаменить(ТекстСекции, "&ВидДвиженияНакопления", СтрШаблон("Значение(ВидДвиженияНакопления.%1)", ИмяВидаДвиженияПриходнойКолонки));
		ТекстПриход = СтрЗаменить(ТекстПриход, "ОсновнойДолгПолучение", ОписаниеСекции.КолонкаПриход);
		ТекстПриход = СтрЗаменить(ТекстПриход, "СтатьяБюджетаПараметр", "СтатьяБюджета" + ИмяЭлементаСтруктурыЗадолженности + "Приход");
		ТекстПриход = СтрЗаменить(ТекстПриход, "ОперацияПараметр", "Операция" + ИмяЭлементаСтруктурыЗадолженности + "Приход");
		ЭтоОсновнойДолг = (ОписаниеСекции.ЭлементСтруктурыЗадолженности = Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг);
		ЭтоПриходнаяОперация = (ЭтоДоходныйИнструмент И Не ЭтоОсновнойДолг) ИЛИ (ЭтоОсновнойДолг И Не ЭтоДоходныйИнструмент);
		ТекстПриход = СтрЗаменить(ТекстПриход, "&ПриходРасходПараметр", СтрШаблон("ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.%1)", ?(ЭтоПриходнаяОперация, "Приход", "Расход")));
		
		МассивФрагментовЗапроса.Добавить(ТекстПриход);
		
		ТекстРасход = СтрЗаменить(ТекстСекции, "&ВидДвиженияНакопления", СтрШаблон("Значение(ВидДвиженияНакопления.%1)", ИмяВидаДвиженияРасходнойКолонки));
		ТекстРасход = СтрЗаменить(ТекстРасход, "ОсновнойДолгПолучение", ОписаниеСекции.КолонкаРасход);
		ТекстРасход = СтрЗаменить(ТекстРасход, "СтатьяБюджетаПараметр", "СтатьяБюджета" + ИмяЭлементаСтруктурыЗадолженности + "Расход");
		ТекстРасход = СтрЗаменить(ТекстРасход, "ОперацияПараметр", "Операция" + ИмяЭлементаСтруктурыЗадолженности + "Расход");
		ТекстРасход = СтрЗаменить(ТекстРасход, "&ПриходРасходПараметр", СтрШаблон("ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.%1)", ?(ЭтоДоходныйИнструмент, "Приход", "Расход")));

		МассивФрагментовЗапроса.Добавить(ТекстРасход);
		
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(МассивФрагментовЗапроса, СтрокаРазделитель);
		
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УстановитьПараметрыСтатьиБюджетов(ЗапросВход) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииФинансовыхИнструментов.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
	|	ОперацииФинансовыхИнструментов.КолонкаСекции КАК ПриходРасход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НастройкиФинансовыхИнструментов.СтатьяБюджета, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ОперацииФинансовыхИнструментов.ВидБюджета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|					КОГДА ОперацииФинансовыхИнструментов.ВидБюджета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НастройкиФинансовыхИнструментов.СтатьяБюджета
	|	КОНЕЦ КАК СтатьяБюджета,
	|	ОперацииФинансовыхИнструментов.Ссылка КАК Операция
	|ИЗ
	|	Справочник.ОперацииГрафиковДоговоров КАК ОперацииФинансовыхИнструментов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФинансовыхИнструментов КАК НастройкиФинансовыхИнструментов
	|		ПО (НастройкиФинансовыхИнструментов.Операция = ОперацииФинансовыхИнструментов.Ссылка)
	|ГДЕ
	|	ОперацииФинансовыхИнструментов.ВидФинансовогоИнструмента = &ВидФинансовогоИнструмента";

	
	Запрос.УстановитьПараметр("ВидФинансовогоИнструмента", ЗапросВход.Параметры.ВидФинансовогоИнструмента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗапросВход.УстановитьПараметр("СтатьяБюджета" + ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ЭлементСтруктурыЗадолженности) + Выборка.ПриходРасход, Выборка.СтатьяБюджета);
		ЗапросВход.УстановитьПараметр("Операция" + ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ЭлементСтруктурыЗадолженности) + Выборка.ПриходРасход, Выборка.Операция);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокументовФИ

Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения = Неопределено, ТекстЗаполнения = Неопределено, СтандартнаяОбработка = Истина) Экспорт
	
	ТипЗнчДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗнчДанныеЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ФинансовыйИнструмент") Тогда
			ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения.ФинансовыйИнструмент, ,);
		КонецЕсли;
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда
		
		ДопИскл = "";// у ПоступлениеИнвестиций нет тч СчетаУчета
		Если ДанныеЗаполнения.Метаданные().ТабличныеЧасти.Найти("СчетаУчета") <> Неопределено Тогда
			ДопИскл = ",СчетаУчета";		
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения, , "Дата,Номер,Ответственный,Комментарий" + ДопИскл);
		
	КонецЕсли;
	
	МСФОУХ.ОбработкаЗаполнения(Объект, ДанныеЗаполнения, Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область Проведение_ИнициализироватьДанныеДокумента

#Область ЗаполнитьПараметрыИнициализации

Процедура ЗаполнитьПараметрыИнициализации(Запрос, Документ) Экспорт
	
	Если Запрос.Параметры.Свойство("ИмяДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументМД = Документ.Метаданные();
	Запрос.УстановитьПараметр("ИмяДокумента", ДокументМД.Имя);
	
	Ссылка = Документ;
	Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Документ)) Тогда
		Ссылка = Документ.Ссылка;
	КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапросаРеквизитыДокументаЦБ(, ДокументМД.Имя, ДокументМД);
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();

	РеквизитыДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Реквизиты);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Запрос.Параметры, РеквизитыДокумента, Ложь);
	
	ВстраиваниеУХФинансовыеИнструменты.УстановитьПараметры(Запрос);
	УстановитьПараметрыДокументаФИ(Запрос);
	
КонецПроцедуры

Функция ТекстЗапросаРеквизитыДокументаЦБ(НомераТаблиц = Неопределено, ИмяДокумента, МетаданныеДокумента) Экспорт 

	Если НомераТаблиц <> Неопределено Тогда
		НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());	
	КонецЕсли;	
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	НАЧАЛОПЕРИОДА(Реквизиты.Дата,ДЕНЬ) КАК ДатаНачала,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Проект КАК Проект,
	|	Реквизиты.СчетОрганизации КАК СчетОрганизации,
	|	Реквизиты.СчетКонтрагента КАК СчетКонтрагента	
	|ИЗ
	|	Документ.ПриобретениеЦеннойБумаги КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	ЗаПериод = (ИмяДокумента = "НачисленияПоФинансовымИнструментам");
	Если ЗаПериод Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(Реквизиты.Дата,ДЕНЬ)", "НАЧАЛОПЕРИОДА(Реквизиты.ДатаНачала,ДЕНЬ)");	
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ЦФО") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Реквизиты.ЦФО", "Неопределено");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("Проект") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Реквизиты.Проект", "Неопределено");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("СчетОрганизации") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Реквизиты.СчетОрганизации", "Неопределено");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("СчетКонтрагента") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Реквизиты.СчетКонтрагента", "Неопределено");
	КонецЕсли;
	
	Возврат СтрЗаменить(ТекстЗапроса, "ПриобретениеЦеннойБумаги", ИмяДокумента);

КонецФункции

Функция ПолучитьВыданнаяЦБ(ИмяДокумента)
	
	ВыданнаяЦБ = Неопределено;
	Если (ИмяДокумента = "ВыпускЦеннойБумаги") Или (ИмяДокумента = "ВыкупЦеннойБумаги") Тогда
		ВыданнаяЦБ = Истина;
	ИначеЕсли (ИмяДокумента = "ПриобретениеЦеннойБумаги") Или (ИмяДокумента = "ПродажаЦеннойБумаги") 
		Или (ИмяДокумента = "ВерсияГрафикаЦеннойБумаги")Тогда
		ВыданнаяЦБ = Ложь;	
	КонецЕсли;
	
	Возврат ВыданнаяЦБ;

КонецФункции

Процедура УстановитьПараметрыДокументаФИ(Запрос)
	
	Параметры = Запрос.Параметры;
	
	ЭтоНачисление = (Параметры.ИмяДокумента = "НачисленияПоФинансовымИнструментам");
	//ВыданнаяЦБ = ПолучитьВыданнаяЦБ(Параметры.ИмяДокумента);
	//ЭтоПродажа = (Параметры.ИмяДокумента = "ПродажаЦеннойБумаги");
	//
	МоментДокумента = Новый МоментВремени(Параметры.Период, Параметры.Ссылка);
	
	Запрос.УстановитьПараметр("ТекущаяДата",		ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаОперации",		НачалоДня(Параметры.Период));
	Запрос.УстановитьПараметр("НачалоПериода",		Новый Граница(МоментДокумента, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодДокумента", 	Новый Граница(МоментДокумента, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодДоДокумента",	Новый Граница(МоментДокумента, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("УчетПоФИФО",			Истина);
	//Запрос.УстановитьПараметр("ЭтоПродажа",			ЭтоПродажа);
	//Запрос.УстановитьПараметр("ВыданнаяЦБ",			ВыданнаяЦБ);
	
	Запрос.УстановитьПараметр("ДатаНачала",		Параметры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(Параметры.Период));
		
	Запрос.УстановитьПараметр("ПустаяСсылкаРБП", 	ВстраиваниеУХКлиентСервер.ПолучитьПустуюСсылкуРБП());
	Запрос.УстановитьПараметр("ТипСсылкаРБП", 		ТипЗнч(Запрос.Параметры.ПустаяСсылкаРБП));
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияРегистровУХ

Процедура ТекстЗапроса_ДанныеЦБ(Запрос, МассивТекстовЗапроса, НомераТаблиц) Экспорт
	
	Параметры = Запрос.Параметры;
	
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втГрафикНоминала(НомераТаблиц));
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втВерсияДоДокумента(НомераТаблиц));	
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втГрафикДоДокумента(НомераТаблиц));
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втДоговорыФИ(НомераТаблиц));
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_ОперацииФИ(НомераТаблиц, Параметры.ИмяДокумента));
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втГрафикЦБ(НомераТаблиц));
	
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_ВерсииРасчетов(НомераТаблиц));
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_РасчетыСКонтрагентамиГрафики(НомераТаблиц, Параметры.ИмяДокумента, МассивТекстовЗапроса));
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_РасшифровкиГрафиковЦБ(НомераТаблиц));
	
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втПартииКСписанию(НомераТаблиц));
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втСписаниеПартий(НомераТаблиц));
	Если Запрос.Параметры.ИмяДокумента <> "НачисленияПоФинансовымИнструментам" Тогда //движения задаются в документе
		МассивТекстовЗапроса.Добавить(ТекстЗапроса_ПартииЦенныхБумагСобытия(НомераТаблиц));
	КонецЕсли;
	
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_БрокерскиеСчета(НомераТаблиц));
	
	Добавить_ТекстЗапроса_СчетаДокумента(МассивТекстовЗапроса, НомераТаблиц, Параметры);
	
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_втОстатки(НомераТаблиц));
	
	МассивТекстовЗапроса.Добавить(ВстраиваниеУХФинансовыеИнструменты.ТекстЗапроса_СчетаУчета(НомераТаблиц));
	МассивТекстовЗапроса.Добавить(Документы[Параметры.ИмяДокумента].ТекстЗапроса_Проводки(НомераТаблиц));
	
	ВстраиваниеУХФинансовыеИнструменты.ТекстЗапроса_Проводки(МассивТекстовЗапроса, НомераТаблиц, Параметры.ИмяДокумента);
	
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_ОшибкиПроводок(НомераТаблиц));

КонецПроцедуры

#Область ТекстыЗапросов_Графики

Функция ТекстЗапроса_втГрафикНоминала(НомераТаблиц)

	НомераТаблиц.Вставить("втГрафикНоминала", НомераТаблиц.Количество());
	Возврат
	"ВЫБРАТЬ
	|	втСобытия.ДоговорКонтрагента КАК Договор,
	|	втСобытия.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	ГрафикиНоминалаЦенныхБумаг.ДатаОперации КАК ДатаОперации,
	|	ГрафикиНоминалаЦенныхБумаг.КолонкаГрафика КАК КолонкаГрафика,
	|	ГрафикиНоминалаЦенныхБумаг.Сумма КАК Сумма
	|ПОМЕСТИТЬ втГрафикНоминала
	|ИЗ
	|	втСобытия КАК втСобытия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияГрафикаЦеннойБумаги.ГрафикНоминалаЛинейный КАК ГрафикиНоминалаЦенныхБумаг
	|		ПО втСобытия.ПараметрыЦеннойБумаги = ГрафикиНоминалаЦенныхБумаг.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСобытия.ДоговорКонтрагента,
	|	втСобытия.ФинансовыйИнструмент,
	|	ВЫБОР
	|		КОГДА КолонкаГрафика.Ссылка = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПроцентыКупоныНачисление)
	|			ТОГДА ПоступлениеВекселейГрафик.Дата
	|		ИНАЧЕ ПоступлениеВекселейГрафик.Ссылка.ДатаПлатежа
	|	КОНЕЦ,
	|	КолонкаГрафика.Ссылка,
	|	СУММА(ПоступлениеВекселейГрафик.Сумма)
	|ИЗ
	|	втСобытия КАК втСобытия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеВекселя.График КАК ПоступлениеВекселейГрафик
	|		ПО (ПоступлениеВекселейГрафик.Ссылка = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.КолонкиГрафика КАК КолонкаГрафика
	|		ПО (КолонкаГрафика.Ссылка В (ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПроцентыКупоныНачисление), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПроцентыКупоныСписание)))
	|
	|СГРУППИРОВАТЬ ПО
	|	КолонкаГрафика.Ссылка,
	|	ВЫБОР
	|		КОГДА КолонкаГрафика.Ссылка = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПроцентыКупоныНачисление)
	|			ТОГДА ПоступлениеВекселейГрафик.Дата
	|		ИНАЧЕ ПоступлениеВекселейГрафик.Ссылка.ДатаПлатежа
	|	КОНЕЦ,
	|	втСобытия.ФинансовыйИнструмент,
	|	втСобытия.ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСобытия.ДоговорКонтрагента,
	|	втСобытия.ФинансовыйИнструмент,
	|	ВЫБОР
	|		КОГДА КолонкаГрафика.Ссылка = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгПоступление)
	|			ТОГДА ПоступлениеВекселя.ДатаНачалаНачисленияПроцентов
	|		ИНАЧЕ ПоступлениеВекселя.ДатаПлатежа
	|	КОНЕЦ,
	|	КолонкаГрафика.Ссылка,
	|	ПоступлениеВекселя.СуммаОперации * втСобытия.КроссКурсНоминалаИзРасчетов
	|ИЗ
	|	втСобытия КАК втСобытия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеВекселя КАК ПоступлениеВекселя
	|		ПО (ПоступлениеВекселя.Ссылка = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.КолонкиГрафика КАК КолонкаГрафика
	|		ПО (КолонкаГрафика.Ссылка В (ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгПоступление), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгСписание)))";

КонецФункции

Функция ТекстЗапроса_втВерсияДоДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("втВерсияДоДокумента", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	Версии.ПредметГрафика КАК ФинансовыйИнструмент,
	|	ВЫРАЗИТЬ(Версии.ПредметГрафика КАК Справочник.ЦенныеБумаги).ВидФинансовогоИнструмента КАК ВидФИ,
	|	МАКСИМУМ(Версии.Регистратор) КАК Регистратор,
	|	ЕСТЬNULL(МАКСИМУМ(ВерсииПоступлений.Регистратор), МАКСИМУМ(Версии.Регистратор)) КАК РегистраторПоступления
	|ПОМЕСТИТЬ втВерсияДоДокумента
	|ИЗ
	|	РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних(
	|			&ПериодДоДокумента,
	|			Организация = &Организация
	|				И ПредметГрафика В
	|					(ВЫБРАТЬ
	|						т.ФинансовыйИнструмент
	|					ИЗ
	|						втСобытия КАК т)) КАК Версии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних(
	|				&ПериодДоДокумента,
	|				Организация = &Организация
	|					И ПредметГрафика В
	|						(ВЫБРАТЬ
	|							т.ФинансовыйИнструмент
	|						ИЗ
	|							втСобытия КАК т)
	|					И ТИПЗНАЧЕНИЯ(Регистратор) В (ТИП(Документ.АкцептПротестПереводногоВекселя), ТИП(Документ.ВыпускЦеннойБумаги), ТИП(Документ.ПоступлениеВекселя), ТИП(Документ.ПриобретениеЦеннойБумаги))) КАК ВерсииПоступлений
	|		ПО Версии.ПредметГрафика = ВерсииПоступлений.ПредметГрафика
	|			И (НЕ ТИПЗНАЧЕНИЯ(Версии.Регистратор) В (ТИП(Документ.АкцептПротестПереводногоВекселя), ТИП(Документ.ВыпускЦеннойБумаги), ТИП(Документ.ПоступлениеВекселя), ТИП(Документ.ПриобретениеЦеннойБумаги)))
	|
	|СГРУППИРОВАТЬ ПО
	|	Версии.ПредметГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор";

КонецФункции

Функция ТекстЗапроса_втГрафикДоДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("втГрафикДоДокумента", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	втВерсияДоДокумента.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	График.ДатаОперации КАК ДатаОперации,
	|	График.КолонкаГрафика КАК КолонкаГрафика,
	|	График.Сумма КАК Сумма,
	|	График.Договор КАК Договор
	|ПОМЕСТИТЬ втГрафикДоДокумента
	|ИЗ
	|	РегистрСведений.РасшифровкиГрафиковЦБ КАК График
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВерсияДоДокумента КАК втВерсияДоДокумента
	|		ПО График.Регистратор = втВерсияДоДокумента.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФинансовыйИнструмент,
	|	ДатаОперации";

КонецФункции

Функция ТекстЗапроса_втДоговорыФИ(НомераТаблиц)

	НомераТаблиц.Вставить("втДоговорыФИ", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	МАКСИМУМ(т.Договор) КАК Договор
	|ПОМЕСТИТЬ втДоговорыФИ
	|ИЗ
	|	втГрафикДоДокумента КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.ФинансовыйИнструмент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФинансовыйИнструмент";

КонецФункции

Функция ТекстЗапроса_ОперацииФИ(НомераТаблиц, ИмяДокумента)

	НомераТаблиц.Вставить("втОперацииФИ", НомераТаблиц.Количество());
	
	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	втСобытия.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	КолонкиФИ.КолонкаГрафика КАК КолонкаГрафика,
	|	МАКСИМУМ(ОперацииФИ.Ссылка) КАК ОперацияФИ
	|ПОМЕСТИТЬ втОперацииФИ
	|ИЗ
	|	втСобытия КАК втСобытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КолонкиОтчетов.Ссылка КАК КолонкаГрафика,
	|			КолонкиОтчетов.Ссылка В (ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгПоступление), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгСписание)) КАК ЭтоОсновнойДолг,
	|			КолонкиОтчетов.Ссылка В (ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгПоступление), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.НКДПриПокупке), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПремияПриПокупке), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПроцентыКупоныНачисление)) КАК ЭтоПриход
	|		ИЗ
	|			Перечисление.КолонкиГрафика КАК КолонкиОтчетов) КАК КолонкиФИ
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОперацииГрафиковДоговоров КАК ОперацииФИ
	|		ПО (НЕ ОперацииФИ.ЭтоГруппа)
	|			И (КолонкиФИ.ЭтоОсновнойДолг = (ОперацииФИ.ЭлементСтруктурыЗадолженности = ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг)))
	|			И (КолонкиФИ.ЭтоПриход = (ОперацииФИ.НаправлениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)))
	|			И (ВЫБОР
	|				КОГДА втСобытия.ВыданнаяЦБ
	|					ТОГДА ОперацииФИ.Родитель = ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияВыпущенная)
	|				ИНАЧЕ ОперацииФИ.Родитель = ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияКупленная)
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	втСобытия.ФинансовыйИнструмент,
	|	КолонкиФИ.КолонкаГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФинансовыйИнструмент,
	|	КолонкаГрафика";
	
	//Если ИмяДокумента = "ВыпускЦеннойБумаги" ИЛИ ИмяДокумента = "ВыкупЦеннойБумаги" Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.ОперацииГрафиковДоговоров.ОблигацияКупленная_",
	//		"Справочник.ОперацииГрафиковДоговоров.ОблигацияВыпущенная_");
	//КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапроса_втГрафикЦБ(НомераТаблиц)
	
	НомераТаблиц.Вставить("втГрафикЦБ",	НомераТаблиц.Количество());
	
	Возврат	
	"ВЫБРАТЬ
	|	График.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	График.ФинансовыйИнструмент В
	|		(ВЫБРАТЬ
	|			т.ФинансовыйИнструмент
	|		ИЗ
	|			втСобытия КАК т
	|		ГДЕ
	|			т.ВыданнаяЦБ) КАК ВыданнаяЦБ,
	|	ЕСТЬNULL(МАКСИМУМ(втДоговорыФИ.Договор), МАКСИМУМ(График.Договор)) КАК Договор,
	|	График.ДатаОперации КАК ДатаОперации,
	|	График.КолонкаГрафика КАК КолонкаГрафика,
	|	МАКСИМУМ(втОперацииФИ.ОперацияФИ) КАК ОперацияФИ,
	|	СУММА(График.Сумма) КАК Сумма
	|ПОМЕСТИТЬ втГрафикЦБ
	|ИЗ
	|	(ВЫБРАТЬ
	|		втГрафикДоДокумента.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|		втГрафикДоДокумента.ДатаОперации КАК ДатаОперации,
	|		втГрафикДоДокумента.КолонкаГрафика КАК КолонкаГрафика,
	|		втГрафикДоДокумента.Сумма КАК Сумма,
	|		втГрафикДоДокумента.Договор КАК Договор
	|	ИЗ
	|		втГрафикДоДокумента КАК втГрафикДоДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ втСобытия КАК втСобытия
	|			ПО втГрафикДоДокумента.ФинансовыйИнструмент = втСобытия.ФинансовыйИнструмент
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА втСобытия.ВидФИ = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Вексель)
	|						И втСобытия.ЭтоПродажа
	|						И втГрафикДоДокумента.ДатаОперации > втСобытия.ДатаОперации
	|					ТОГДА ЛОЖЬ
	|				КОГДА втСобытия.ВидФИ = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Облигация)
	|						И втГрафикДоДокумента.ДатаОперации = втСобытия.СрокПогашения
	|						И втСобытия.ВыданнаяЦБ = ИСТИНА
	|						И втСобытия.ДатаОперации = втСобытия.СрокПогашения
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втГрафикНоминала.ФинансовыйИнструмент,
	|		втГрафикНоминала.ДатаОперации,
	|		втГрафикНоминала.КолонкаГрафика,
	|		ВЫБОР
	|			КОГДА втСобытия.ЭтоПродажа = ИСТИНА
	|				ТОГДА -втГрафикНоминала.Сумма * втСобытия.Количество
	|			ИНАЧЕ втГрафикНоминала.Сумма * втСобытия.Количество
	|		КОНЕЦ,
	|		втГрафикНоминала.Договор
	|	ИЗ
	|		втГрафикНоминала КАК втГрафикНоминала
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСобытия КАК втСобытия
	|			ПО втГрафикНоминала.ФинансовыйИнструмент = втСобытия.ФинансовыйИнструмент
	|	ГДЕ
	|		втГрафикНоминала.ДатаОперации >= втСобытия.ДатаОперации
	|		И ВЫБОР
	|				КОГДА НЕ втСобытия.ВыданнаяЦБ
	|						И втГрафикНоминала.ДатаОперации = втСобытия.ДатаОперации
	|						И втГрафикНоминала.КолонкаГрафика В (ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгСписание), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгПоступление))
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втСобытия.ФинансовыйИнструмент,
	|		втСобытия.ДатаОперации,
	|		ВЫБОР
	|			КОГДА втСобытия.ЭтоПродажа = ИСТИНА
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.НКДПриПродаже)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.НКДПриПокупке)
	|		КОНЕЦ,
	|		втСобытия.НКД * втСобытия.КроссКурсНоминалаИзРасчетов,
	|		втСобытия.ДоговорКонтрагента
	|	ИЗ
	|		втСобытия КАК втСобытия
	|	ГДЕ
	|		втСобытия.НКД <> 0
	|		И втСобытия.ЭтоПродажа <> НЕОПРЕДЕЛЕНО
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втСобытия.ФинансовыйИнструмент,
	|		втСобытия.ДатаОперации,
	|		ВЫБОР
	|			КОГДА втСобытия.ЭтоПродажа = ИСТИНА
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПремияПриПродаже)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПремияПриПокупке)
	|		КОНЕЦ,
	|		втСобытия.Премия * втСобытия.КроссКурсНоминалаИзРасчетов,
	|		втСобытия.ДоговорКонтрагента
	|	ИЗ
	|		втСобытия КАК втСобытия
	|	ГДЕ
	|		втСобытия.Премия <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втСобытия.ФинансовыйИнструмент,
	|		втСобытия.ДатаОперации,
	|		ВЫБОР
	|			КОГДА втСобытия.ЭтоПродажа = ИСТИНА
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.КоличествоСписание)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.КоличествоПоступление)
	|		КОНЕЦ,
	|		втСобытия.Количество,
	|		втСобытия.ДоговорКонтрагента
	|	ИЗ
	|		втСобытия КАК втСобытия
	|	ГДЕ
	|		втСобытия.Количество <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втСобытия.ФинансовыйИнструмент,
	|		втСобытия.СрокПогашения,
	|		ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.КоличествоСписание),
	|		ВЫБОР
	|			КОГДА втСобытия.ЭтоПродажа = ИСТИНА
	|				ТОГДА -втСобытия.Количество
	|			ИНАЧЕ втСобытия.Количество
	|		КОНЕЦ,
	|		втСобытия.ДоговорКонтрагента
	|	ИЗ
	|		втСобытия КАК втСобытия
	|	ГДЕ
	|		втСобытия.Количество <> 0
	|		И втСобытия.СрокПогашения <> втСобытия.ДатаОперации
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втСобытия.ФинансовыйИнструмент,
	|		втСобытия.ДатаОперации,
	|		ВЫБОР
	|			КОГДА втСобытия.ЭтоПродажа = ИСТИНА
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгСписание)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгПоступление)
	|		КОНЕЦ,
	|		(втСобытия.Сумма - втСобытия.Премия - втСобытия.НКД) * втСобытия.КроссКурсНоминалаИзРасчетов,
	|		втСобытия.ДоговорКонтрагента
	|	ИЗ
	|		втСобытия КАК втСобытия
	|	ГДЕ
	|		втСобытия.Сумма - втСобытия.Премия - втСобытия.НКД <> 0
	|		И втСобытия.ВидФИ <> ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Вексель)
	|		И ВЫБОР
	|				КОГДА втСобытия.ВыданнаяЦБ И НЕ втСобытия.ЭтоПродажа
	|					ТОГДА втСобытия.ДатаВыпуска <> втСобытия.ДатаОперации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК График
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговорыФИ КАК втДоговорыФИ
	|		ПО График.ФинансовыйИнструмент = втДоговорыФИ.ФинансовыйИнструмент
	|			И (График.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОперацииФИ КАК втОперацииФИ
	|		ПО График.ФинансовыйИнструмент = втОперацииФИ.ФинансовыйИнструмент
	|			И График.КолонкаГрафика = втОперацииФИ.КолонкаГрафика
	|
	|СГРУППИРОВАТЬ ПО
	|	График.КолонкаГрафика,
	|	График.ДатаОперации,
	|	График.Договор,
	|	График.ФинансовыйИнструмент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФинансовыйИнструмент,
	|	КолонкаГрафика,
	|	ДатаОперации";
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов_Движения

Функция ТекстЗапроса_ВерсииРасчетов(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("ВерсииГрафиковРасчетов", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	т.Дата КАК Период,
	|	т.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	т.ФинансовыйИнструмент КАК ПредметГрафика,
	|	&Организация КАК Организация,
	|	ИСТИНА КАК ОпорныйГрафик,
	|	т.Ссылка КАК ВерсияГрафика
	|ИЗ
	|	втСобытия КАК т
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(т.ФинансовыйИнструмент) = ТИП(Справочник.ЦенныеБумаги)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Дата,
	|	т.ДоговорКонтрагента,
	|	т.ДоговорКонтрагента,
	|	&Организация,
	|	ИСТИНА,
	|	т.Ссылка
	|ИЗ
	|	втСобытия КАК т
	|ГДЕ
	|	т.ДоговорКонтрагента <> т.ФинансовыйИнструмент
	|	И т.ДоговорКонтрагента.Организация = &Организация";
	
КонецФункции

Функция ТекстЗапроса_втПартииКСписанию(НомераТаблиц)

	НомераТаблиц.Вставить("втПартииКСписанию", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	ПартииЦенныхБумагОстатки.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	ПартииЦенныхБумагОстатки.Договор КАК Договор,
	|	ПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
	|	ПартииЦенныхБумагОстатки.СтоимостьОстаток КАК Стоимость,
	|	ПартииЦенныхБумагОстатки.НоминалОстаток КАК Номинал,
	|	ПартииЦенныхБумагОстатки.Партия.Дата КАК ПартияДата,
	|	ПартииЦенныхБумагОстатки.Партия КАК Партия,
	|	ПартииЦенныхБумагОстатки.РыночнаяСтоимостьОстаток КАК РыночнаяСтоимость
	|ПОМЕСТИТЬ втПартииКСписанию
	|ИЗ
	|	РегистрНакопления.ПартииЦенныхБумаг.Остатки(
	|			&ПериодДоДокумента,
	|			ФинансовыйИнструмент В
	|					(ВЫБРАТЬ
	|						т.ФинансовыйИнструмент
	|					ИЗ
	|						втСобытия КАК т
	|					ГДЕ
	|						т.ЭтоПродажа
	|						И т.ВидФИ В (ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Облигация), ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Акция), ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.ПрочиеЦенныеБумаги)))
	|				И Партия.Организация = &Организация
	|				И &УчетПоФИФО) КАК ПартииЦенныхБумагОстатки
	|ГДЕ
	|	ПартииЦенныхБумагОстатки.КоличествоОстаток <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФинансовыйИнструмент,
	|	ПартияДата,
	|	Партия";

КонецФункции

Функция ТекстЗапроса_втСписаниеПартий(НомераТаблиц)

	НомераТаблиц.Вставить("втСписаниеПартий", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	втСобытия.Дата КАК Период,
	|	ОценкаПоСредней.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	ОценкаПоСредней.Договор КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	втСобытия.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ОценкаПоСредней.КоличествоКонечныйОстаток
	|			ТОГДА ОценкаПоСредней.НоминалКонечныйОстаток
	|		ИНАЧЕ втСобытия.Сумма
	|	КОНЕЦ КАК Номинал,
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ОценкаПоСредней.КоличествоКонечныйОстаток
	|			ТОГДА ОценкаПоСредней.СтоимостьКонечныйОстаток
	|		ИНАЧЕ (ОценкаПоСредней.СтоимостьНачальныйОстаток + ОценкаПоСредней.СтоимостьПриход) * втСобытия.Количество / ОценкаПоСредней.КоличествоКонечныйОстаток
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ОценкаПоСредней.КоличествоКонечныйОстаток
	|			ТОГДА ОценкаПоСредней.РыночнаяСтоимостьКонечныйОстаток
	|		ИНАЧЕ (ОценкаПоСредней.РыночнаяСтоимостьНачальныйОстаток + ОценкаПоСредней.РыночнаяСтоимостьПриход) * втСобытия.Количество / ОценкаПоСредней.КоличествоКонечныйОстаток
	|	КОНЕЦ КАК РыночнаяСтоимость
	|ПОМЕСТИТЬ втСписаниеПартий
	|ИЗ
	|	РегистрНакопления.ПартииЦенныхБумаг.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&ПериодДоДокумента,
	|			,
	|			,
	|			ФинансовыйИнструмент В
	|					(ВЫБРАТЬ
	|						т.ФинансовыйИнструмент
	|					ИЗ
	|						втСобытия КАК т
	|					ГДЕ
	|						т.ЭтоПродажа
	|						И т.ВидФИ В (ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Облигация), ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Акция), ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.ПрочиеЦенныеБумаги)))
	|				И Партия.Организация = &Организация
	|				И НЕ &УчетПоФИФО) КАК ОценкаПоСредней
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСобытия КАК втСобытия
	|		ПО ОценкаПоСредней.ФинансовыйИнструмент = втСобытия.ФинансовыйИнструмент
	|			И ОценкаПоСредней.Договор = втСобытия.ДоговорКонтрагента
	|ГДЕ
	|	НЕ &УчетПоФИФО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСобытия.Дата,
	|	ПартияСписания.ФинансовыйИнструмент,
	|	ПартияСписания.Договор,
	|	ПартияСписания.Партия,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0) + ПартияСписания.Количество
	|			ТОГДА ПартияСписания.Количество
	|		КОГДА втСобытия.Количество > ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)
	|			ТОГДА втСобытия.Количество - ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0) + ПартияСписания.Количество
	|			ТОГДА ПартияСписания.Номинал
	|		КОГДА втСобытия.Количество > ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)
	|				И ПартияСписания.Количество <> 0
	|			ТОГДА ПартияСписания.Номинал * (втСобытия.Количество - -ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)) / ПартияСписания.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0) + ПартияСписания.Количество
	|			ТОГДА ПартияСписания.Стоимость
	|		КОГДА втСобытия.Количество > ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)
	|				И ПартияСписания.Количество <> 0
	|			ТОГДА ПартияСписания.Стоимость * (втСобытия.Количество - ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)) / ПартияСписания.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0) + ПартияСписания.Количество
	|			ТОГДА ПартияСписания.РыночнаяСтоимость
	|		КОГДА втСобытия.Количество > ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)
	|				И ПартияСписания.Количество <> 0
	|			ТОГДА ПартияСписания.РыночнаяСтоимость * (втСобытия.Количество - ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)) / ПартияСписания.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	втПартииКСписанию КАК ПартияСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПартииКСписанию КАК втПартииДоПартииСпасания
	|		ПО (ВЫБОР
	|				КОГДА ПартияСписания.ПартияДата > втПартииДоПартииСпасания.ПартияДата
	|					ТОГДА ИСТИНА
	|				КОГДА ПартияСписания.ПартияДата = втПартииДоПартииСпасания.ПартияДата
	|					ТОГДА ПартияСписания.Партия > втПартииДоПартииСпасания.Партия
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСобытия КАК втСобытия
	|		ПО ПартияСписания.ФинансовыйИнструмент = втСобытия.ФинансовыйИнструмент
	|ГДЕ
	|	&УчетПоФИФО
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартияСписания.ФинансовыйИнструмент,
	|	ПартияСписания.Договор,
	|	ПартияСписания.Количество,
	|	ПартияСписания.Стоимость,
	|	ПартияСписания.РыночнаяСтоимость,
	|	ПартияСписания.Номинал,
	|	ПартияСписания.ПартияДата,
	|	ПартияСписания.Партия,
	|	втСобытия.Дата,
	|	втСобытия.Количество
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА втСобытия.Количество >= ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0) + ПартияСписания.Количество
	|			ТОГДА ПартияСписания.Количество
	|		КОГДА втСобытия.Количество > ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)
	|			ТОГДА втСобытия.Количество - ЕСТЬNULL(СУММА(втПартииДоПартииСпасания.Количество), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ > 0";
	
КонецФункции

Функция ТекстЗапроса_ПартииЦенныхБумагСобытия(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПартииЦенныхБумаг", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	втСписаниеПартий.Период КАК Период,
	|	втСписаниеПартий.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	втСписаниеПартий.Партия КАК Партия,
	|	втСписаниеПартий.ВидДвижения КАК ВидДвижения,
	|	втСписаниеПартий.Договор КАК Договор,
	|	втСписаниеПартий.Количество КАК Количество,
	|	втСписаниеПартий.Номинал КАК Номинал,
	|	втСписаниеПартий.Стоимость КАК Стоимость,
	|	втСписаниеПартий.РыночнаяСтоимость КАК РыночнаяСтоимость
	|ИЗ
	|	втСписаниеПартий КАК втСписаниеПартий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Дата,
	|	т.ФинансовыйИнструмент,
	|	ВЫБОР
	|		КОГДА &УчетПоФИФО
	|			ТОГДА т.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	т.ДоговорКонтрагента,
	|	т.Количество,
	|	(т.Сумма - т.НКД - т.Премия) * т.КроссКурсНоминалаИзРасчетов,
	|	т.Сумма * т.КроссКурсНоминалаИзРасчетов,
	|	(т.Сумма - т.НКД) * т.КроссКурсНоминалаИзРасчетов
	|ИЗ
	|	втСобытия КАК т
	|ГДЕ
	|	НЕ т.ВыданнаяЦБ
	|	И НЕ т.ЭтоПродажа
	|	И т.ВидФИ В (ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Облигация), ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Акция), ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.ПрочиеЦенныеБумаги))";

КонецФункции

Функция ТекстЗапроса_РасчетыСКонтрагентамиГрафики(НомераТаблиц, ИмяДокумента, МассивТекстовЗапроса)

	Если ИмяДокумента = "НачисленияПоФинансовымИнструментам"
		ИЛИ ИмяДокумента = "ПоступлениеИнвестиций"
		ИЛИ ИмяДокумента = "ВыбытиеИнвестиций"
		Тогда
		
		// нет таблицы ПараметрыОпераций в документе
	
		НомераТаблиц.Вставить("РасчетыСКонтрагентамиГрафики", НомераТаблиц.Количество());
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Ссылка КАК ВерсияГрафика,
		|	&Организация КАК Организация,
		|	График.ФинансовыйИнструмент КАК ПредметГрафика,
		|	МАКСИМУМ(ЕСТЬNULL(График.ФинансовыйИнструмент.ВалютаНоминала, График.ФинансовыйИнструмент.ВалютаВзаиморасчетов)) КАК Валюта,
		|	График.Договор.Контрагент КАК Контрагент,
		|	График.ДатаОперации КАК Период,
		|	НастройкиФинансовыхИнструментов.СтатьяБюджета КАК СтатьяБюджета,
		|	График.ОперацияФИ КАК Операция,
		|	МАКСИМУМ(График.ОперацияФИ.ВидБюджета) КАК ВидБюджета,
		|	МАКСИМУМ(График.ОперацияФИ.ЭлементСтруктурыЗадолженности) КАК ЭлементСтруктурыЗадолженности,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(График.ОперацияФИ.НаправлениеВзаиморасчетов) = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(График.ОперацияФИ.НаправлениеДвижения) = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
		|			ТОГДА МАКСИМУМ(График.ОперацияФИ.НаправлениеДвижения)
		|		ИНАЧЕ МАКСИМУМ(График.ОперацияФИ.НаправлениеДвижения)
		|	КОНЕЦ КАК ПриходРасход,
		|	СУММА(График.Сумма) КАК Сумма
		|ИЗ
		|	втГрафикЦБ КАК График
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФинансовыхИнструментов КАК НастройкиФинансовыхИнструментов
		|		ПО (ВЫБОР
		|				КОГДА График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгПоступление)
		|						ИЛИ График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.НКДПриПокупке)
		|						ИЛИ График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПремияПриПокупке)
		|					ТОГДА НастройкиФинансовыхИнструментов.Операция В (ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияКупленная_ОсновнойДолгПолучение), ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияВыпущенная_ОсновнойДолгПолучение))
		|				КОГДА График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ОсновнойДолгСписание)
		|						ИЛИ График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.НКДПриПродаже)
		|						ИЛИ График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПремияПриПродаже)
		|					ТОГДА НастройкиФинансовыхИнструментов.Операция В (ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияКупленная_ОсновнойДолгВозврат), ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияВыпущенная_ОсновнойДолгВозврат))
		|				КОГДА График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПроцентыКупоныНачисление)
		|					ТОГДА НастройкиФинансовыхИнструментов.Операция В (ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияКупленная_ПроцентыНачислено), ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияВыпущенная_ПроцентыНачислено))
		|				КОГДА График.КолонкаГрафика = ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.ПроцентыКупоныСписание)
		|					ТОГДА НастройкиФинансовыхИнструментов.Операция В (ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияКупленная_ПроцентыУплачено), ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ОблигацияВыпущенная_ПроцентыУплачено))
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	График.ФинансовыйИнструмент.ВидФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Облигация)
		|	И &ИмяДокумента <> ""НачисленияПоФинансовымИнструментам""
		|	И НЕ График.КолонкаГрафика В (ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.КоличествоПоступление), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.КоличествоСписание))
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиФинансовыхИнструментов.СтатьяБюджета,
		|	График.ФинансовыйИнструмент,
		|	График.ДатаОперации,
		|	График.ОперацияФИ,
		|	График.Договор.Контрагент";
		
		Если Не ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Договор.Контрагент", "Договор.Владелец");
		КонецЕсли;
	
	Иначе	
		
		//каждый подзапрос дб отдельно
		МассивТекстовЗапроса.Добавить(ТекстЗапроса_ВТ_ПараметрыОпераций(НомераТаблиц, ИмяДокумента));
		
		НомераТаблиц.Вставить("РасчетыСКонтрагентамиГрафики", НомераТаблиц.Количество());
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Ссылка КАК ВерсияГрафика,
		|	&Организация КАК Организация,
		|	График.ФинансовыйИнструмент КАК ПредметГрафика,
		|	МАКСИМУМ(ЕСТЬNULL(График.ФинансовыйИнструмент.ВалютаНоминала, График.ФинансовыйИнструмент.ВалютаВзаиморасчетов)) КАК Валюта,
		|	График.Договор.Контрагент КАК Контрагент,
		|	График.ДатаОперации КАК Период,
		|	ВТ_ПараметрыОпераций.СтатьяБюджета КАК СтатьяБюджета,
		|	График.ОперацияФИ КАК Операция,
		|	МАКСИМУМ(График.ОперацияФИ.ВидБюджета) КАК ВидБюджета,
		|	МАКСИМУМ(График.ОперацияФИ.ЭлементСтруктурыЗадолженности) КАК ЭлементСтруктурыЗадолженности,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(График.ОперацияФИ.НаправлениеВзаиморасчетов) = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(График.ОперацияФИ.НаправлениеДвижения) = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
		|			ТОГДА МАКСИМУМ(График.ОперацияФИ.НаправлениеДвижения)
		|		ИНАЧЕ МАКСИМУМ(График.ОперацияФИ.НаправлениеДвижения)
		|	КОНЕЦ КАК ПриходРасход,
		|	СУММА(График.Сумма) КАК Сумма,
		|	ВТ_ПараметрыОпераций.Аналитика1 КАК Аналитика1,
		|	ВТ_ПараметрыОпераций.Аналитика2 КАК Аналитика2,
		|	ВТ_ПараметрыОпераций.Аналитика3 КАК Аналитика3,
		|	ВТ_ПараметрыОпераций.Аналитика4 КАК Аналитика4,
		|	ВТ_ПараметрыОпераций.Аналитика5 КАК Аналитика5,
		|	ВТ_ПараметрыОпераций.Аналитика6 КАК Аналитика6,
		|	&ЦФО КАК ЦФО,
		|	&Проект КАК Проект,
		|	&СчетОрганизации КАК СчетОрганизации,
		|	&СчетКонтрагента КАК СчетКонтрагента
		|ИЗ
		|	втГрафикЦБ КАК График
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыОпераций КАК ВТ_ПараметрыОпераций
		|		ПО (ВТ_ПараметрыОпераций.ОперацияГрафика = График.ОперацияФИ)
		|ГДЕ
		|	НЕ График.КолонкаГрафика В (ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.КоличествоПоступление), ЗНАЧЕНИЕ(Перечисление.КолонкиГрафика.КоличествоСписание))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПараметрыОпераций.СтатьяБюджета,
		|	График.ФинансовыйИнструмент,
		|	График.ДатаОперации,
		|	График.ОперацияФИ,
		|	График.Договор.Контрагент,
		|	ВТ_ПараметрыОпераций.Аналитика1,
		|	ВТ_ПараметрыОпераций.Аналитика2,
		|	ВТ_ПараметрыОпераций.Аналитика3,
		|	ВТ_ПараметрыОпераций.Аналитика4,
		|	ВТ_ПараметрыОпераций.Аналитика5,
		|	ВТ_ПараметрыОпераций.Аналитика6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	т.ВерсияГрафика,
		|	т.Организация,
		|	т.ПредметГрафика,
		|	т.Валюта,
		|	т.Контрагент,
		|	&ДатаОперации,
		|	МАКСИМУМ(т.СтатьяБюджета),
		|	МАКСИМУМ(т.Операция),
		|	МАКСИМУМ(т.ВидБюджета),
		|	т.ЭлементСтруктурыЗадолженности,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
		|	СУММА(т.Сумма * ВЫБОР
		|			КОГДА т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ),
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	МАКСИМУМ(т.ЦФО),
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентамиГрафики КАК т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВерсияДоДокумента КАК втВерсияДоДокумента
		|		ПО т.Регистратор = втВерсияДоДокумента.Регистратор
		|			И (втВерсияДоДокумента.ВидФИ = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Акция))
		|
		|СГРУППИРОВАТЬ ПО
		|	т.Валюта,
		|	т.Организация,
		|	т.Контрагент,
		|	т.ПредметГрафика,
		|	т.ВерсияГрафика,
		|	т.ЭлементСтруктурыЗадолженности
		|
		|ИМЕЮЩИЕ
		|	СУММА(т.Сумма * ВЫБОР
		|			КОГДА т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ) <> 0";

		Если Не ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Договор.Контрагент", "Договор.Владелец");
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ВыпускЦеннойБумаги.ПараметрыОпераций", 
			"Документ." + ИмяДокумента + ".ПараметрыОпераций");
	
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_ВТ_ПараметрыОпераций(НомераТаблиц, ИмяДокумента)

	НомераТаблиц.Вставить("ВТ_ПараметрыОпераций", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПараметрыОпераций.ОперацияГрафика КАК ОперацияГрафика,
	|	ПараметрыОпераций.СтатьяБюджета КАК СтатьяБюджета,
	|	ПараметрыОпераций.Аналитика1 КАК Аналитика1,
	|	ПараметрыОпераций.Аналитика2 КАК Аналитика2,
	|	ПараметрыОпераций.Аналитика3 КАК Аналитика3,
	|	ПараметрыОпераций.Аналитика4 КАК Аналитика4,
	|	ПараметрыОпераций.Аналитика5 КАК Аналитика5,
	|	ПараметрыОпераций.Аналитика6 КАК Аналитика6
	|ПОМЕСТИТЬ ВТ_ПараметрыОпераций
	|ИЗ
	|	Документ.ВыпускЦеннойБумаги.ПараметрыОпераций КАК ПараметрыОпераций
	|ГДЕ
	|	ПараметрыОпераций.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ВыпускЦеннойБумаги.ПараметрыОпераций", 
						"Документ." + ИмяДокумента + ".ПараметрыОпераций");
	
	Возврат ТекстЗапроса;

КонецФункции
	
Функция ТекстЗапроса_РасшифровкиГрафиковЦБ(НомераТаблиц)

	НомераТаблиц.Вставить("РасшифровкиГрафиковЦБ",	НомераТаблиц.Количество());
		
	Возврат 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	График.Договор,
	|	График.ДатаОперации,
	|	График.КолонкаГрафика,
	|	СУММА(График.Сумма) КАК Сумма
	|ИЗ
	|	втГрафикЦБ КАК График
	|
	|СГРУППИРОВАТЬ ПО
	|	График.ДатаОперации,
	|	График.КолонкаГрафика,
	|	График.Договор";

КонецФункции

Функция ТекстЗапроса_БрокерскиеСчета(НомераТаблиц)

	НомераТаблиц.Вставить("БрокерскиеСчета", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Дата КАК Период,
	|	т.ФинансовыйИнструмент КАК _ФинансовыйИнструмент,
	|	т.ДоговорКонтрагента КАК ДоговорБрокерскогоСчета,
	|	ВЫБОР
	|		КОГДА т.ЭтоПродажа
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	т.Сумма КАК Сумма
	|ИЗ
	|	втСобытия КАК т
	|ГДЕ
	|	т.Биржа <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И НЕ т.ВыданнаяЦБ";

КонецФункции

#КонецОбласти

#Область ТекстыЗапросов_Проводки

Процедура Добавить_ТекстЗапроса_СчетаДокумента(МассивТекстовЗапроса, НомераТаблиц, Параметры)
	
	МенеджерДокумента = Документы[Параметры.ИмяДокумента];
	Если Параметры.ИмяДокумента = "НачисленияПоФинансовымИнструментам" Тогда
		МассивТекстовЗапроса.Добавить(МенеджерДокумента.ТекстЗапроса_СчетаДокумента(НомераТаблиц, МассивТекстовЗапроса));
	Иначе
		МассивТекстовЗапроса.Добавить(МенеджерДокумента.ТекстЗапроса_СчетаДокумента(НомераТаблиц));
	КонецЕсли;

КонецПроцедуры

Функция ТекстЗапроса_втОстатки(НомераТаблиц)

	//если счет НКД и счет учета ФИ совпадают, тогда возможен остаток НКД на счете ФИ, его спишем отдельно, для этого отделим рыночную стоимость от НКД
	
	НомераТаблиц.Вставить("втОстатки", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Дата КАК Дата,
	|	т.ВидОперации КАК ВидОперации,
	|	т.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	т.Валюта КАК Валюта,
	|	т.Счет КАК Счет,
	|	т.Подразделение КАК Подразделение,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	т.СуммаОстаток КАК СуммаОстаток,
	|	т.ОстатокВВалюте КАК ОстатокВВалюте,
	|	т.ОстатокБУ КАК ОстатокБУ,
	|	т.ОстатокНУ КАК ОстатокНУ,
	|	т.ОстатокПР КАК ОстатокПР,
	|	т.ОстатокВР КАК ОстатокВР,
	|	ВЫБОР
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокВВалюте
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокВВалюте * т.КоличествоСписание / т.КоличествоОстаток КАК ЧИСЛО(18, 0))
	|	КОНЕЦ КАК СписаниеВВалюте,
	|	ВЫБОР
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокБУ
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокБУ * т.КоличествоСписание / т.КоличествоОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеБУ,
	|	ВЫБОР
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокНУ
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокНУ * т.КоличествоСписание / т.КоличествоОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеНУ,
	|	ВЫБОР
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокПР
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокПР * т.КоличествоСписание / т.КоличествоОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеПР,
	|	ВЫБОР
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокВР
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокВР * т.КоличествоСписание / т.КоличествоОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеВР,
	|	ВЫБОР
	|		КОГДА НЕ т.СтоимостьВключаетНКД
	|			ТОГДА 0
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокВВалюте
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокВВалюте * т.КоличествоСписание / т.КоличествоОстаток * (т.СуммаОстаток - т.РыночнаяСтоимостьПартий) / т.СуммаОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеНКД_ВВалюте,
	|	ВЫБОР
	|		КОГДА НЕ т.СтоимостьВключаетНКД
	|			ТОГДА 0
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокБУ
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокБУ * т.КоличествоСписание / т.КоличествоОстаток * (т.СуммаОстаток - т.РыночнаяСтоимостьПартий) / т.СуммаОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеНКД_БУ,
	|	ВЫБОР
	|		КОГДА НЕ т.СтоимостьВключаетНКД
	|			ТОГДА 0
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокНУ
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокНУ * т.КоличествоСписание / т.КоличествоОстаток * (т.СуммаОстаток - т.РыночнаяСтоимостьПартий) / т.СуммаОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеНКД_НУ,
	|	ВЫБОР
	|		КОГДА НЕ т.СтоимостьВключаетНКД
	|			ТОГДА 0
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокПР
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокПР * т.КоличествоСписание / т.КоличествоОстаток * (т.СуммаОстаток - т.РыночнаяСтоимостьПартий) / т.СуммаОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеНКД_ПР,
	|	ВЫБОР
	|		КОГДА НЕ т.СтоимостьВключаетНКД
	|			ТОГДА 0
	|		КОГДА т.СписаниеВсейСуммы
	|			ТОГДА т.ОстатокВР
	|		ИНАЧЕ ВЫРАЗИТЬ(т.ОстатокВР * т.КоличествоСписание / т.КоличествоОстаток * (т.СуммаОстаток - т.РыночнаяСтоимостьПартий) / т.СуммаОстаток КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СписаниеНКД_ВР,
	|	т.ЭтоСчетФИ КАК ЭтоСчетФИ,
	|	т.СтоимостьВключаетНКД КАК СтоимостьВключаетНКД,
	|	т.РыночнаяСтоимостьПартий КАК РыночнаяСтоимостьПартий,
	|	т.КоличествоОстаток КАК КоличествоОстаток,
	|	т.КоличествоСписание КАК КоличествоСписание,
	|	т.СписаниеВсейСуммы КАК СписаниеВсейСуммы
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		втСобытия.Дата КАК Дата,
	|		втСобытия.ВидОперации КАК ВидОперации,
	|		ХозрасчетныйОстатки.Субконто1 КАК ФинансовыйИнструмент,
	|		ХозрасчетныйОстатки.Валюта КАК Валюта,
	|		ХозрасчетныйОстатки.Счет КАК Счет,
	|		ЕСТЬNULL(ХозрасчетныйОстатки.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
	|		ЕСТЬNULL(ХозрасчетныйОстатки.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
	|		ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|		ХозрасчетныйОстатки.ВалютнаяСуммаОстаток КАК ОстатокВВалюте,
	|		ХозрасчетныйОстатки.СуммаОстаток КАК ОстатокБУ,
	|		ХозрасчетныйОстатки.СуммаНУОстаток КАК ОстатокНУ,
	|		ХозрасчетныйОстатки.СуммаПРОстаток КАК ОстатокПР,
	|		ХозрасчетныйОстатки.СуммаВРОстаток КАК ОстатокВР,
	|		ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Валютный
	|				ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток
	|		КОНЕЦ КАК СуммаОстаток,
	|		втСписаниеПартийДляДисконта.РыночнаяСтоимость КАК РыночнаяСтоимостьПартий,
	|		НЕ СовпадаютСчета_ФИ_НКД.СчетУчетаФИ ЕСТЬ NULL КАК ЭтоСчетФИ,
	|		ЕСТЬNULL(втСписаниеПартийДляДисконта.РыночнаяСтоимость, 0) <> 0
	|			И ЕстьNULL(СовпадаютСчета_ФИ_НКД.СчетНкдСовпадает, ЛОЖЬ)
	|			И ЕСТЬNULL(ВЫБОР
	|					КОГДА ХозрасчетныйОстатки.Счет.Валютный
	|						ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
	|					ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток
	|				КОНЕЦ, 0) <> 0 КАК СтоимостьВключаетНКД,
	|		втСобытия.Количество КАК КоличествоСписание,
	|		ЕСТЬNULL(втСобытия.Количество, 0) >= ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0)
	|			ИЛИ ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0) = 0
	|			ИЛИ ЕСТЬNULL(втСобытия.Количество, 0) = 0 КАК СписаниеВсейСуммы
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&ПериодДоДокумента,
	|				Счет В
	|					(ВЫБРАТЬ
	|						т.Ссылка
	|					ИЗ
	|						ПланСчетов.Хозрасчетный.ВидыСубконто КАК т
	|					ГДЕ
	|						т.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги)),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги),
	|				Организация = &Организация
	|					И Субконто1 В
	|						(ВЫБРАТЬ
	|							т.ФинансовыйИнструмент
	|						ИЗ
	|							втСобытия КАК т
	|						ГДЕ
	|							т.ЭтоПродажа)) КАК ХозрасчетныйОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|				СчетУчетаФИ.Счет КАК СчетУчетаФИ,
	|				СчетНКД.Счет КАК СчетНКД,
	|				СчетУчетаФИ.Счет = ЕСТЬNULL(СчетНКД.Счет, НЕОПРЕДЕЛЕНО) КАК СчетНкдСовпадает
	|			ИЗ
	|				втСчетаДокумента КАК СчетУчетаФИ
	|					ЛЕВОЕ СОЕДИНЕНИЕ втСчетаДокумента КАК СчетНКД
	|					ПО СчетУчетаФИ.Счет = СчетНКД.Счет
	|						И (СчетНКД.ВидСчетаФИ = ЗНАЧЕНИЕ(Справочник.ВидыСчетовФИ.СчетНКД))
	|			ГДЕ
	|				СчетУчетаФИ.ВидСчетаФИ = ЗНАЧЕНИЕ(Справочник.ВидыСчетовФИ.СчетУчетаФИ)) КАК СовпадаютСчета_ФИ_НКД
	|			ПО ХозрасчетныйОстатки.Счет = СовпадаютСчета_ФИ_НКД.СчетУчетаФИ
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СУММА(т.Стоимость) КАК Стоимость,
	|				СУММА(т.РыночнаяСтоимость) КАК РыночнаяСтоимость
	|			ИЗ
	|				втСписаниеПартий КАК т) КАК втСписаниеПартийДляДисконта
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ втСобытия КАК втСобытия
	|			ПО ХозрасчетныйОстатки.Субконто1 = втСобытия.ФинансовыйИнструмент) КАК т";

КонецФункции

Функция ТекстЗапроса_ОшибкиПроводок(НомераТаблиц, СписокФИ = Ложь) Экспорт

	НомераТаблиц.Вставить("ОшибкиПроводок", НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПроводок.ФинансовыйИнструмент КАК ФинансовыйИнструмент,
	|	&Ссылка КАК Ссылка,
	|	втСчетДт.Счет КАК СчетДт,
	|	втСчетКт.Счет КАК СчетКт,
	|	ТаблицаПроводок.СчетДт КАК ВидСчетаДт,
	|	ТаблицаПроводок.СчетКт КАК ВидСчетаКт,
	|	ТаблицаПроводок.Комментарий КАК Комментарий
	|ИЗ
	|	втТаблицаПроводок КАК ТаблицаПроводок
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаФИ КАК втСчетДт
	|		ПО ТаблицаПроводок.СчетДт = втСчетДт.ВидСчетаФИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаФИ КАК втСчетКт
	|		ПО ТаблицаПроводок.СчетКт = втСчетКт.ВидСчетаФИ
	|ГДЕ
	|	(ЕСТЬNULL(втСчетДт.Счет, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ИЛИ ЕСТЬNULL(втСчетКт.Счет, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|	И ТаблицаПроводок.Сумма <> 0";
		
	Если СписокФИ Тогда //НачисленияПоФинансовымИнструментам
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФинансовыйИнструмент", "ТаблицаПроводок.ФИ");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область АктуализироватьГрафикиЦенныхБумаг

Процедура ОбновитьГрафик_ВерсияГрафикаЦеннойБумаги(Процессор)

	Если Не Процессор.Облигации Или Не Процессор.ГрафикЦБ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.ФинансовыйИнструмент КАК ФинансовыйИнструмент
	|ИЗ
	|	Документ.ВерсияГрафикаЦеннойБумаги КАК т
	|ГДЕ
	|	т.ТипПроцентнойСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокДляРасчетаПериодическихОпераций.Плавающая)
	|	И т.ФинансовыйИнструмент.СрокПогашения >= &Дата
	|	И &ОтборВидКотировки");
	
	Запрос.УстановитьПараметр("Дата", 				Процессор.Дата);
	Запрос.УстановитьПараметр("ОтборВидКотировки",	Процессор.ОтборВидКотировки);
	
	Если ЗначениеЗаполнено(Процессор.ОтборВидКотировки) Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ОтборВидКотировки", 
			"т.ФинансовыйИнструмент.ПараметрыЦеннойБумаги.ИндикативнаяСтавка В (&ОтборВидКотировки)");
	КонецЕсли;
	
	КэшируемыеЗначения = Новый Структура;
	КэшируемыеЗначения.Вставить("ПараметрыГрафика", ФинансовыеИнструментыФормыКлиентСервер.ПолучитьПараметрыГрафикаЦБ());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ФИ = Выборка.ФинансовыйИнструмент;
		
		ЗаполнитьОсновнойДолгЦБ = Новый Структура(
				"ДатаВыпуска, ДатаПогашения, ОсновнойДолгПолучение, ОсновнойДолгВозврат",
				ФИ.ДатаВыпуска, 
				ФИ.СрокПогашения, 
				ФИ.Номинал, 
				?(ФИ.ДисконтнаяЦБ, ФИ.ЦенаВыпуска, ФИ.Номинал)
			);

		СтрукутураДействий = Новый Структура(
			"ЗаполнитьОсновнойДолгЦБ, ЗаполнитьПроценты, СвернутьГрафик, РассчитатьСальдо",
			ЗаполнитьОсновнойДолгЦБ);
			
		Если Не ФИ.ДисконтнаяЦБ Тогда
			СтрукутураДействий.Вставить("РассчитатьПроценты");
		КонецЕсли;
		
		КэшируемыеЗначения.ПараметрыГрафика.Вставить("Финансовыйинструмент", Выборка.ФинансовыйИнструмент);
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		Объект.График.Загрузить(
			ФинансовыеИнструментыФормыВызовСервера
				.ПолучитьГрафик(СтрукутураДействий, Объект, КэшируемыеЗначения.ПараметрыГрафика));

		Объект.Записать();

		ТекстСообщения = НСтр("ru = 'Обновлен график ценной бумаги (в <%1>) по котировке'");
		СообщитьОЗаписи(СтрШаблон(ТекстСообщения, ФИ), ФИ);

	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьГрафик_ГрафикиДокументовЦБ(Процессор)

	Если Не Процессор.ГрафикДокумента Или Не Процессор.Облигации Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьТолькоВыбранные = Новый Структура(
		"РасчетыСКонтрагентамиГрафики, РасшифровкиГрафиковЦБ",
		Истина, Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	т.Ссылка КАК ВерсияФИ,
	|	т.ФинансовыйИнструмент КАК ФИ,
	|	Документы.Ссылка КАК ДокументФИ
	|ИЗ
	|	Документ.ВерсияГрафикаЦеннойБумаги КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЖурналДокументов.ОперацииСЦеннымиБумагами КАК Документы
	|		ПО т.ФинансовыйИнструмент = Документы.ФинансовыйИнструмент
	|ГДЕ
	|	т.ТипПроцентнойСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокДляРасчетаПериодическихОпераций.Плавающая)
	|	И т.ФинансовыйИнструмент.СрокПогашения >= &Дата
	|	И Документы.Проведен
	|	И &ОтборВидКотировки
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Дата");
	
	Запрос.УстановитьПараметр("Дата", Процессор.Дата);
	Запрос.УстановитьПараметр("ОтборВидКотировки",	Процессор.ОтборВидКотировки);

	Если ЗначениеЗаполнено(Процессор.ОтборВидКотировки) Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ОтборВидКотировки", 
			"т.ФинансовыйИнструмент.ПараметрыЦеннойБумаги.ИндикативнаяСтавка В (&ОтборВидКотировки)");
	КонецЕсли;

	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Отказ = Ложь;
		
		Объект = Выборка.ДокументФИ.ПолучитьОбъект();
		
		Объект.ОбменДанными.Загрузка = Истина;
		
		Объект.ДополнительныеСвойства.Вставить(
			"ПропуститьПроверкуРучныхКорректировок", Истина);

		Объект.ДополнительныеСвойства.Вставить(
			"ЗаписатьТолькоВыбранные", ЗаписатьТолькоВыбранные);
		
		ПроведениеСерверУХ.ПередЗаписью(
			Объект, Отказ, РежимЗаписи, РежимПроведения);
		
		ВстраиваниеУХФинансовыеИнструменты.ОбработкаПроведения(
			Объект, Отказ, РежимПроведения);

		ТекстСообщения = НСтр("ru = 'Обновлен график ценной бумаги (в <%1>) по котировке'");
		СообщитьОЗаписи(СтрШаблон(ТекстСообщения, Выборка.ДокументФИ), Выборка.ДокументФИ);

	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьГрафик_ГрафикиДокументовВексели(Процессор)

	Если Не Процессор.ГрафикДокумента Или Не Процессор.Вексели Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьТолькоВыбранные = Новый Структура(
		"РасчетыСКонтрагентамиГрафики, РасшифровкиГрафиковЦБ",
		Истина, Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	т.Ссылка КАК ВерсияФИ,
	|	т.ФинансовыйИнструмент КАК ФИ,
	|	Документы.Ссылка КАК ДокументФИ
	|ИЗ
	|	Документ.ВерсияГрафикаЦеннойБумаги КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЖурналДокументов.ОперацииСВекселями КАК Документы
	|		ПО т.ФинансовыйИнструмент = Документы.Вексель
	|ГДЕ
	|	т.ТипПроцентнойСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокДляРасчетаПериодическихОпераций.Плавающая)
	|	И т.ФинансовыйИнструмент.СрокПогашения >= &Дата
	|	И Документы.Проведен
	|	И &ОтборВидКотировки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.Дата");
	
	Запрос.УстановитьПараметр("Дата", Процессор.Дата);
	Запрос.УстановитьПараметр("ОтборВидКотировки",	Процессор.ОтборВидКотировки);

	Если ЗначениеЗаполнено(Процессор.ОтборВидКотировки) Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ОтборВидКотировки", 
			"т.ФинансовыйИнструмент.ПараметрыЦеннойБумаги.ИндикативнаяСтавка В (&ОтборВидКотировки)");
	КонецЕсли;

	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ДокументФИ) = Тип("ДокументСсылка.ПоступлениеВекселя") Тогда
			
			Объект = Выборка.ДокументФИ.ПолучитьОбъект();
			
			Объект.ОбменДанными.Загрузка = Истина;
		
			ЦенныеБумагиУХ.ОбновитьГрафикНачисленийПоВекселю(Объект);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			
		ИначеЕсли ТипЗнч(Выборка.ДокументФИ) = Тип("ДокументСсылка.АкцептПротестПереводногоВекселя") Тогда
			
			Объект = Выборка.ДокументФИ.ПолучитьОбъект();
			
			Объект.ОбменДанными.Загрузка = Истина;
		
			Документы.АкцептПротестПереводногоВекселя.ОбновитьРасходНаСервере(Объект);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			
		КонецЕсли;
		
		Отказ = Ложь;
		Объект = Выборка.ДокументФИ.ПолучитьОбъект();
		
		Объект.ОбменДанными.Загрузка = Истина;
		
		Объект.ДополнительныеСвойства.Вставить(
			"ПропуститьПроверкуРучныхКорректировок", Истина);
		Объект.ДополнительныеСвойства.Вставить(
			"ЗаписатьТолькоВыбранные", ЗаписатьТолькоВыбранные);
		
		ПроведениеСерверУХ.ПередЗаписью(
			Объект, Отказ, РежимЗаписи, РежимПроведения);
		
		ВстраиваниеУХФинансовыеИнструменты.ОбработкаПроведения(
			Объект, Отказ, РежимПроведенияДокумента.Неоперативный);

		ТекстСообщения = НСтр("ru = 'Обновлен график ценной бумаги (в <%1>) по котировке'");
		СообщитьОЗаписи(СтрШаблон(ТекстСообщения, Выборка.ДокументФИ), Выборка.ДокументФИ);

	КонецЦикла;

КонецПроцедуры

Процедура СообщитьОЗаписи(ТекстСообщения, Ссылка, СообщитьПользователю = Истина, ЗаписатьЖР = Истина)

	Если СообщитьПользователю = Истина Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка);
	КонецЕсли;

	Если ЗаписатьЖР = Истина Тогда
		
		ИмяСобытия = НСтр("ru = 'Обновление графиков ценных бумаг'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			Ссылка.Метаданные(),
			Ссылка,
			ТекстСообщения);
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроведениеЦБ_Устарело

Процедура ПроверитьДатуЦБ(ДокументОбъект, Отказ, Выданный = Истина, Погашение = Истина, РежимЗаписи = Неопределено) Экспорт

	Если (РежимЗаписи <> Неопределено) И (РежимЗаписи <> РежимЗаписиДокумента.Проведение) Тогда
		Возврат;
	КонецЕсли;

	Если (Не Выданный) И (ДокументОбъект.Дата < НачалоДня(ДокументОбъект.ФинансовыйИнструмент.ДатаВыпуска)) Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Дата операции по полученной ценной бумаге не может быть раньше даты выпуска'"), Отказ);
	ИначеЕсли (Выданный) И (Не Погашение) И (ДокументОбъект.Дата > КонецДня(ДокументОбъект.ФинансовыйИнструмент.ДатаВыпуска)) Тогда 
		ТекстСообщения = НСтр("ru = 'Дата операции (%ДатаОперации%) по выданной ценной бумаге не может быть позже даты выпуска (%ДатаВыпуска%)'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДатаОперации%", Строка(ДокументОбъект.Дата));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДатаВыпуска%", Строка(КонецДня(ДокументОбъект.ФинансовыйИнструмент.ДатаВыпуска)));
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения, Отказ);
	КонецЕсли;
	
	Если Погашение Тогда
		
		Если Выданный И (ДокументОбъект.Дата < НачалоДня(ДокументОбъект.ФинансовыйИнструмент.СрокПогашения)) Тогда
			//ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Дата операции погашения по выданной ценной бумаге не может быть раньше срока погашения'"), Отказ);
		ИначеЕсли (Не Выданный) И (ДокументОбъект.Дата > КонецДня(ДокументОбъект.ФинансовыйИнструмент.СрокПогашения)) Тогда
			
			Если ДокументОбъект.ФинансовыйИнструмент.ВидФинансовогоИнструмента = Перечисления.ВидыФинансовыхИнструментов.Облигация Тогда
				ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Дата операции погашения по полученной облигации не может позже срока погашения'"), Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
