
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	График = ИсходныйГрафик(ПараметрКоманды);
	
	Если ЗначениеЗаполнено(График) Тогда
		
		ПоказатьЗначение(,График);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'По данному договору нет введенных в систему графиков'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИсходныйГрафик(ПредметРасчетов)
	
	Возврат РаботаСДоговорамиКонтрагентовУХ.ИсходныйГрафик(ПредметРасчетов);
	
КонецФункции
