#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 

Функция ПолучитьПараметрыЗагрузкиНСИ(ПараметрыОбмена) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
	|	СоответствиеВнешнимИБ.Владелец КАК ТипБД
	|ПОМЕСТИТЬ НастройкиСоответствия
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|ГДЕ
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаТек = &ОписаниеОбъектаТек
	|	И НЕ СоответствиеВнешнимИБ.ПометкаУдаления
	|	И НЕ СоответствиеВнешнимИБ.СинхронизацияПоGUID";
	
	Запрос.УстановитьПараметр("ОписаниеОбъектаТек",ПараметрыОбмена.ОписаниеОбъектаМетаданных);
	
	Если ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.Все Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД,Неопределено КАК Отбор 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы";
		
	ИначеЕсли ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.ВыбранногоТипа Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ТипБД,АдресацияОбменаНСИ.Отбор
		|Поместить ТипыБД
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД, ТипыБД.Отбор КАК Отбор 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ТипыБД КАК ТипыБД
		|ПО ВнешниеИнформационныеБазы.ТипБД=ТипыБД.ТипБД";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	Иначе
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ИспользуемаяИБ,АдресацияОбменаНСИ.Отбор КАК Отбор
		|Поместить ВИБ
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|; 
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД,ВИБ.Отбор КАК Отбор 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ВИБ КАК ВИБ
		|ПО ВнешниеИнформационныеБазы.Ссылка=ВИБ.ИспользуемаяИБ";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"
	|;
	|ВЫБРАТЬ НастройкиСоответствия.НастройкаСоответствия,
	|ВнешниеИнформационныеБазы.ИспользуемаяИБ КАК ИспользуемаяИБ,
	|ВнешниеИнформационныеБазы.Отбор КАК НастройкаОтбора
	|ИЗ НастройкиСоответствия КАК НастройкиСоответствия
	|Внутреннее Соединение ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	|ПО НастройкиСоответствия.ТипБД=ВнешниеИнформационныеБазы.ТипБД";

	Возврат Запрос.Выполнить().Выгрузить();
					
КонецФункции // ПолучитьТаблицуПараметровДляОбмена()

Функция ПолучитьПараметрыВыгрузкиНСИ(ПараметрыОбмена) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
	|	СоответствиеВнешнимИБ.Владелец КАК ТипБД
	|ПОМЕСТИТЬ НастройкиСоответствия
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|ГДЕ
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаТек = &ОписаниеОбъектаТек
	|	И НЕ СоответствиеВнешнимИБ.ПометкаУдаления
	|	И НЕ СоответствиеВнешнимИБ.СинхронизацияПоGUID";
	
	Запрос.УстановитьПараметр("ОписаниеОбъектаТек",ПараметрыОбмена.ОписаниеОбъектаМетаданных);
	
	Если ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.Все Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|ГДЕ ВнешниеИнформационныеБазы.ЭкспортироватьЭлементыНСИ";
		
	ИначеЕсли ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.ВыбранногоТипа Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ТипБД
		|Поместить ТипыБД
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ТипыБД КАК ТипыБД
		|ПО ВнешниеИнформационныеБазы.ТипБД=ТипыБД.ТипБД
		|И ВнешниеИнформационныеБазы.ЭкспортироватьЭлементыНСИ";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	Иначе
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ИспользуемаяИБ
		|Поместить ВИБ
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|; 
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ВИБ КАК ВИБ
		|ПО ВнешниеИнформационныеБазы.Ссылка=ВИБ.ИспользуемаяИБ
		|И ВнешниеИнформационныеБазы.ЭкспортироватьЭлементыНСИ";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"
	|;
	|ВЫБРАТЬ НастройкиСоответствия.НастройкаСоответствия,
	|ВнешниеИнформационныеБазы.ИспользуемаяИБ КАК ИспользуемаяИБ
	|ИЗ НастройкиСоответствия КАК НастройкиСоответствия
	|Внутреннее Соединение ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	|ПО НастройкиСоответствия.ТипБД=ВнешниеИнформационныеБазы.ТипБД";
	
	Возврат Запрос.Выполнить().Выгрузить();
			
КонецФункции // ПолучитьТаблицуПараметровДляОбмена()

#КонецЕсли