#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ФормаОтчетаПроверкиКС Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Уведомление = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьСсылку(УникальныйИдентификатор);
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(
		ЭтотОбъект, "ФНС");
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Объект.Уведомление);
	
	Если НЕ ОнлайнСервисыРегламентированнойОтчетностиВызовСервера.СобытиеНаступило("Отпр.ув.об исчис.сум.нал.") Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Видимость = Ложь;
	КонецЕсли;
	
	#Область СтандартныеПодсистемы

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюПечать;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#КонецОбласти
	
	УстановитьУсловноеОформление();
	
	ОбновитьИнформационнуюПанельБРО();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбновитьИтоги();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок", Объект.Уведомление);
	СтруктураРеквизитовФормы.Вставить("Организация",     ГоловнаяОрганизация);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ПанельОтправкиВКонтролирующиеОрганы
	СохранитьСтатусОтправки(ЭтотОбъект, Объект.Уведомление);
	// Конец ПанельОтправкиВКонтролирующиеОрганы
	
	ЗаполнитьДобавленныеКолонкиТаблицы();
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Организация", Объект.Организация);
	ПараметрыОповещения.Вставить("Период",      Объект.Дата);
	
	Оповестить("Запись_УведомлениеОбИсчисленныхСуммахНалогов", ПараметрыОповещения, Объект.Уведомление);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНаименованиеЭтапаНажатие(Элемент)
	
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("Форма", ЭтотОбъект);
	ПараметрыИзменения.Вставить("Организация", Объект.Организация);
	ПараметрыИзменения.Вставить("КонтролирующийОрган",
		ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));
	РегламентированнаяОтчетностьКлиент.ИзменитьСтатусОтправки(ПараметрыИзменения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьСтатусОтправки(Форма, Ссылка)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Форма",          Форма);
	СтруктураПараметров.Вставить("СсылкаНаОбъект", Ссылка);
	СтруктураПараметров.Вставить("ЭтоОтчет",       Ложь);
	СтруктураПараметров.Вставить("НовСтатус",      Форма.Элементы.НаименованиеЭтапа.Заголовок);
	
	РегламентированнаяОтчетностьВызовСервера.СохранитьСтатусОтправки(СтруктураПараметров, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиНалоги

&НаКлиенте
Процедура НалогиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ОписаниеСтроки = ОписаниеТекущейСтрокиДокумента();
	Если НоваяСтрока Тогда
		Если Не Копирование Тогда
			ОписаниеСтроки.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
			НалогиРегистрацияВНалоговомОрганеПриИзмененииНаСервере(ОписаниеСтроки);
		КонецЕсли;
		Если Не ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки) Тогда
			ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки);
			ЗаполнитьСрокУплаты(ОписаниеСтроки);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Элементы.Налоги.ТекущиеДанные, ОписаниеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОписаниеСтроки = ОписаниеТекущейСтрокиДокумента();
	
	Если Поле = Элементы.НалогиПредставлениеПериода Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВыбораПериода = Новый Структура("НачалоПериода, КонецПериода");
		ЗаполнитьЗначенияСвойств(ПараметрыВыбораПериода, ОписаниеСтроки);
		
		ПараметрыВыбораПериода.Вставить("МинимальныйПериод",
			НачалоГода(ДобавитьМесяц(ДатаПереходаНаЕдиныйНалоговыйПлатеж, -1)));
		ПараметрыВыбораПериода.Вставить("ОграничениеСнизу", ПараметрыВыбораПериода.МинимальныйПериод);
		
		ИмяФормыПериода = "ОбщаяФорма.ВыборСтандартногоПериодаМесяц";
		Если НалогиУплачиваемыеПоквартально.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
			ИмяФормыПериода = "ОбщаяФорма.ВыборСтандартногоПериодаКвартал";
		ИначеЕсли НалогиУплачиваемыеЕжемесячно.Найти(ОписаниеСтроки.ТипНалога) = Неопределено Тогда
			ПараметрыВыбораПериода.Вставить("ВыборКварталов", Истина);
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НалогиПроверитьВыборОтчетногоПериода", ЭтотОбъект, ОписаниеСтроки);
		ОткрытьФорму(ИмяФормыПериода,
			ПараметрыВыбораПериода,
			ЭтотОбъект,
			УникальныйИдентификатор,
			,
			,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиТипНалогаПриИзменении(Элемент)
	
	ОписаниеСтроки = ОписаниеТекущейСтрокиДокумента();
	Если Не ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки) Тогда
		ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки);
	КонецЕсли;
	
	НалогиТипНалогаПриИзмененииНаСервере(ОписаниеСтроки);
	
	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ОписаниеСтроки);
	НалогиУточнитьКБК(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиРегистрацияВНалоговомОрганеПриИзменении(Элемент)
	
	ОписаниеСтроки = ОписаниеТекущейСтрокиДокумента();
	НалогиРегистрацияВНалоговомОрганеПриИзмененииНаСервере(ОписаниеСтроки);
	ЗаполнитьЗначенияСвойств(Элементы.Налоги.ТекущиеДанные, ОписаниеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиПриИзменении(Элемент)
	
	ОбновитьИтоги();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	Если Объект.Налоги.Количество() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьЗаполнение", ЭтотОбъект, ПараметрыЗаполнения),
			НСтр("ru = 'Таблица налогов будет очищена. Продолжить?';
				|en = 'The tax table will be cleared. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНДФЛЗаПервуюПоловину(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("НДФЛЗаПервуюПоловинуПериода", Истина);
	
	Если Объект.Налоги.Количество() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьЗаполнение", ЭтотОбъект, ПараметрыЗаполнения),
			НСтр("ru = 'Таблица налогов будет очищена. Продолжить?';
				|en = 'The tax table will be cleared. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаДиск(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьНаДискЗавершение", ЭтотОбъект);
	ПроверитьСЗапросомДальнейшегоДействия(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	Оповещение = Новый ОписаниеОповещения("ОтправитьВКонтролирующийОрганЗавершение", ЭтотОбъект);
	ПроверитьСЗапросомДальнейшегоДействия(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	
	ОчиститьСообщения();
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ДополнительныеПараметры = Новый Структура();
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно записать документ.
			|Выполнить запись документа и продолжить?';
			|en = 'Cannot run the command for unsaved documents.
			|Do you want to save the document and continue?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьВыгрузкуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить';
													|en = 'Continue'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьВыгрузкуЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если (Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка)) И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ПроверитьНаСервере(Отказ, ЕстьКритичныеОшибки, ТаблицаОшибок, Ложь);
	ДополнительныеПараметры.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	
	Если ЕстьКритичныеОшибки Тогда 
		ТекстПредупреждения = НСтр("ru = 'Не заполнены обязательные поля.';
									|en = 'Required fields are not filled in.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ТаблицаОшибок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибок не обнаружено");
	Иначе
		ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.НавигацияПоОшибкам",
			Новый Структура("ТаблицаОшибок", ТаблицаОшибок),
			ЭтотОбъект,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно записать документ.
			|Выполнить запись документа и продолжить?';
			|en = 'Cannot run the command for unsaved documents.
			|Do you want to save the document and continue?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьВИнтернетеЗавершение", ЭтотОбъект);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить';
													|en = 'Continue'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьВИнтернетеЗавершение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернетеЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если (Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка)) И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПроверитьВИнтернете(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрольныеСоотношения(Команда)
	
	ДополнительныеПараметры = Новый Структура();
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно записать документ.
			|Выполнить запись документа и продолжить?';
			|en = 'Cannot run the command for unsaved documents.
			|Do you want to save the document and continue?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьКонтрольныеСоотношенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить';
													|en = 'Continue'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьКонтрольныеСоотношенияЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрольныеСоотношенияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если (Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка)) И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.Свойство("СообщениеПриОтсутствииОшибок") Тогда
		ДополнительныеПараметры.Вставить("СообщениеПриОтсутствииОшибок", Истина);
	КонецЕсли;
	ДополнительныеПараметры.Вставить("Записать", Объект.Уведомление.Пустая());
	
	КлючУникальности = Объект.Уведомление;
	РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения_СКП(ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьВыгружатьСОшибками(Команда)
	Объект.РазрешитьВыгружатьСОшибками = Не Объект.РазрешитьВыгружатьСОшибками;
	Элементы.ФормаРазрешитьВыгружатьСОшибками.Пометка = Объект.РазрешитьВыгружатьСОшибками;
	Модифицированность = Истина;
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжитьЗаполнение(Ответ, ПараметрыЗаполнения) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Налоги.Очистить();
	ОчиститьСообщения();
	
	ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения)
	
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("ДатаУведомления", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Ссылка", Объект.Ссылка);
	
	ЗаполнитьНаСервере(ПараметрыЗаполнения);
	
	Если ПараметрыЗаполнения.Свойство("НДФЛЗаПервуюПоловинуПериода") И ПараметрыЗаполнения.НДФЛЗаПервуюПоловинуПериода
		И НЕ ДокументЗаПервуюПоловинуПериодаПоНДФЛ(Объект.Дата) Тогда
		
		ТекстСообщения = НСтр("ru = 'Подача уведомлений по НДФЛ за первую половину периода возможна только до 12 числа текущего месяца.';
								|en = 'You can submit PIT notifications for the first half of the period only before the 12th day of the current month.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Дата", "Объект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ПараметрыЗаполнения)
	
	ТаблицаНалоги = Документы.УведомлениеОбИсчисленныхСуммахНалогов.ПолучитьДанныеДляУведомления(ПараметрыЗаполнения);
	Объект.Налоги.Загрузить(ТаблицаНалоги);
	ЗаполнитьДобавленныеКолонкиТаблицы();
	
КонецПроцедуры

&НаСервере
Функция СформироватьВыгрузкуИПолучитьДанные() Экспорт
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	УведомлениеОбъект = ДокументОбъект.Уведомление.ПолучитьОбъект();
	Если УведомлениеОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выгрузка = СформироватьXMLНаСервере(УникальныйИдентификатор);
	Если Выгрузка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выгрузка = Выгрузка[0];
	СтруктураВыгрузки = Новый Структура("ТестВыгрузки,КодировкаВыгрузки", Выгрузка.ТестВыгрузки, Выгрузка.КодировкаВыгрузки);
	СтруктураВыгрузки.Вставить("Данные", УведомлениеОСпецрежимахНалогообложения.ПолучитьМакетДвоичныхДанных(УведомлениеОбъект.ИмяОтчета, "TIFF_2023_1"));
	СтруктураВыгрузки.Вставить("ИмяФайла", "1110355_5.03000_03.tif");
	Возврат СтруктураВыгрузки;
	
КонецФункции

&НаСервере
Функция СформироватьXMLНаСервере(УникальныйИдентификатор)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	УведомлениеОбъект = ДокументОбъект.Уведомление.ПолучитьОбъект();
	Возврат УведомлениеОбъект.ВыгрузитьДокумент(УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ОбновитьИнформационнуюПанельБРО()
	
	ПараметрыОтображения = ДокументооборотСКО.ПараметрыИнформационнойПанелиБРО();
	ПараметрыОтображения.Организация = Объект.Организация;
	ПараметрыОтображения.Группа = Элементы.ИнформационнаяПанельБРО;
	ПараметрыОтображения.Форма = ЭтотОбъект;
	ДокументооборотСКО.ОбновитьИнформационнуюПанельБРО(
		ПараметрыОтображения, 
		Перечисления.ТарифыОператораЭДО.ПромоЕНС);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельБРООбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ДокументооборотСКОКлиент.ИнформационнаяПанельБРОНажатие(
		ЭтотОбъект, 
		НавигационнаяСсылкаФорматированнойСтроки, 
		СтандартнаяОбработка);
	
КонецПроцедуры 

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	НалогиУплачиваемыеЕжемесячно = ЕдиныйНалоговыйСчетПовтИсп.НалогиУплачиваемыеЕжемесячно();
	НалогиУплачиваемыеПоквартально = ЕдиныйНалоговыйСчетПовтИсп.НалогиУплачиваемыеПоквартально();
	ТипыНалоговАгентскогоНДФЛ = ЕдиныйНалоговыйСчетПовтИсп.ВидыНалоговНДФЛНалоговогоАгента();
	
	ДатаПереходаНаЕдиныйНалоговыйПлатеж = ЕдиныйНалоговыйСчет.ДатаНачалаПрименения();
	ДатаПереходаНаПостояннуюПередачуЧастичныхУведомленийПоНДФЛ = ДобавитьМесяц(ДатаПереходаНаЕдиныйНалоговыйПлатеж, 12);
	
	СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(Объект.Дата);
	
	Элементы.ФормаРазрешитьВыгружатьСОшибками.Пометка = Объект.РазрешитьВыгружатьСОшибками;
	
	УстановитьФункциональныеОпцииФормы();
	
	ПолучитьРеквизитыОрганизации();
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок", Объект.Уведомление);
	СтруктураРеквизитовФормы.Вставить("Организация",     ГоловнаяОрганизация);
	
	ЗаполнитьДобавленныеКолонкиТаблицы();
	
	УправлениеФормой();
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ПериодПримененияЕНП =
		Объект.Дата >= ДатаПереходаНаЕдиныйНалоговыйПлатеж;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПроверитьКонтрольныеСоотношения",
		"Видимость",
		ПериодПримененияЕНП);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НалогиПредставлениеПериода",
		"Видимость",
		ПериодПримененияЕНП);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НалогиСрокУплатыПериода",
		"Видимость",
		ПериодПримененияЕНП);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НалогиСрокУплаты",
		"Видимость",
		Не ПериодПримененияЕНП);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеТекущейСтрокиДокумента()
	
	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеСтроки = Новый Структура("НомерСтроки, ТипНалога, КодБК,
		|РегистрацияВНалоговомОргане, КодПоОКТМО, Сумма, СрокУплаты,
		|НачалоПериода, КонецПериода, ПредставлениеПериода");
	ЗаполнитьЗначенияСвойств(ОписаниеСтроки, ТекущиеДанные);
	ОписаниеСтроки.КонецПериода = КонецДня(ТекущиеДанные.КонецПериода);
	
	ОписаниеСтроки.Вставить("ЭтоАгентскийНДФЛ",
		ТипыНалоговАгентскогоНДФЛ.Найти(ТекущиеДанные.ТипНалога) <> Неопределено);
	ОписаниеСтроки.Вставить("Идентификатор", Элементы.Налоги.ТекущаяСтрока);
	
	Возврат ОписаниеСтроки;
	
КонецФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(Объект.Дата);
	
	ПолучитьРеквизитыОрганизации();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ПолучитьРеквизитыОрганизации();
	ОбновитьИнформационнуюПанельБРО();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыОрганизации()
	
	ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка();
	ЭтоЮрЛицо           = Истина;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ГоловнаяОрганизация = БухгалтерскийУчетПереопределяемый.ГоловнаяОрганизация(Объект.Организация);
		ЭтоЮрЛицо           = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Объект.Организация);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РегистрацияВНалоговомОргане)  И ЗначениеЗаполнено(Объект.Организация) Тогда
		РегистрацияВНалоговомОргане = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "РегистрацияВНалоговомОргане");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НалогиТипНалогаПриИзмененииНаСервере(ОписаниеСтроки)
	
	ЗаполнитьСрокУплаты(ОписаниеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура НалогиРегистрацияВНалоговомОрганеПриИзмененииНаСервере(ОписаниеСтроки)
	
	Если ЗначениеЗаполнено(ОписаниеСтроки.РегистрацияВНалоговомОргане) Тогда
		ОписаниеСтроки.КодПоОКТМО =
			Справочники.РегистрацииВНалоговомОргане.КодТерритории(ОписаниеСтроки.РегистрацияВНалоговомОргане);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиУточнитьКБК(ТекущиеДанные)
	
	КБКПоВидуНалога = СтатьиДоходовБюджетаРФ.Получить(ТекущиеДанные.ТипНалога);
	Если Не ЗначениеЗаполнено(КБКПоВидуНалога) Тогда
		ТекущиеДанные.КодБК = "";
		Возврат;
	КонецЕсли;
	
	Если КБКПоВидуНалога.Количество() > 1 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НалогиУточнитьКБКЗавершение", ЭтотОбъект, ТекущиеДанные);
		ПоказатьВыборИзСписка(ОписаниеОповещения, КБКПоВидуНалога, Элементы.НалогиКодБК);
	Иначе
		НалогиУточнитьКБКЗавершение(КБКПоВидуНалога.Получить(0), ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиУточнитьКБКЗавершение(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КБК = Результат.Значение;
	
	КБКПоВидуПлатежа = "";
	Для Каждого ПодвидДохода Из КБК.ПодвидыДохода Цикл
		Если ПодвидДохода.Значение.ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.Налог") Тогда
			КБКПоВидуПлатежа = КБК.Администратор + КБК.ВидДохода + ПодвидДохода.Ключ + КБК.КОСГУ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеДанные.КодБК = КБКПоВидуПлатежа;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиПроверитьВыборОтчетногоПериода(Результат, ОписаниеСтроки) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПериодов = Новый СписокЗначений;
	
	Если Не ОписаниеСтроки.ЭтоАгентскийНДФЛ Тогда
		
		ОтчетныйПериод = СписокПериодов.Добавить(Результат,
			ПредставлениеПериодаОтчета(Результат.НачалоПериода, Результат.КонецПериода));
		
	ИначеЕсли Результат.НачалоПериода >= ДатаПереходаНаПостояннуюПередачуЧастичныхУведомленийПоНДФЛ Тогда
		
		// НДФЛ налогового агента с 01.01.2024 года
		
		ГраницаПериодов = Результат.НачалоПериода + 22 * 86400; // 23-е число текущего месяца
		
		ПерваяПоловина = Новый Структура("НачалоПериода, КонецПериода", Результат.НачалоПериода, ГраницаПериодов - 1);
		ВтораяПоловина = Новый Структура("НачалоПериода, КонецПериода", ГраницаПериодов, Результат.КонецПериода);
		
		ПараметрыПредставлений = Новый Структура("МесяцПрописью, ПерваяПоловина, ВтораяПоловина");
		ПараметрыПредставлений.МесяцПрописью = 
			Сред(Формат(Результат.НачалоПериода, НСтр("ru = 'ДФ=''д ММММ''';
														|en = 'DF=''MMMM d'''")), 3); // Например - "1 февраля" -> "февраля"
		ПараметрыПредставлений.ПерваяПоловина = СтрШаблон(НСтр("ru = 'до %1';
																|en = 'until %1'"), Формат(ГраницаПериодов, "ДЛФ=Д"));
		ПараметрыПредставлений.ВтораяПоловина = ПредставлениеПериодаОтчета(ГраницаПериодов, Результат.КонецПериода);
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ПерваяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Начало [МесяцПрописью]: [ПерваяПоловина]';
					|en = 'Start of [МесяцПрописью]: [ПерваяПоловина]'"),
				ПараметрыПредставлений));
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ВтораяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Конец [МесяцПрописью]: [ВтораяПоловина]';
					|en = 'End of [МесяцПрописью]: [ВтораяПоловина]'"),
				ПараметрыПредставлений));
		
	ИначеЕсли Результат.КонецПериода = КонецГода(Результат.КонецПериода) Тогда
		
		// НДФЛ налогового агента - в декабре
		
		ГраницаПериодов = Результат.НачалоПериода + 22 * 86400; // 23-е декабря
		
		ПерваяПоловина = Новый Структура("НачалоПериода, КонецПериода", Результат.НачалоПериода, Результат.КонецПериода);
		ВтораяПоловина = Новый Структура("НачалоПериода, КонецПериода", ГраницаПериодов, Результат.КонецПериода);
		
		ПараметрыПредставлений = Новый Структура("МесяцПрописью, ПерваяПоловина, ВтораяПоловина");
		ПараметрыПредставлений.МесяцПрописью = 
			Сред(Формат(Результат.НачалоПериода, НСтр("ru = 'ДФ=''д ММММ''';
														|en = 'DF=''MMMM d'''")), 3); // Например - "1 декабря" -> "декабря"
		ПараметрыПредставлений.ПерваяПоловина = СтрШаблон(НСтр("ru = 'до %1';
																|en = 'until %1'"), Формат(ГраницаПериодов, "ДЛФ=Д"));
		ПараметрыПредставлений.ВтораяПоловина = ПредставлениеПериодаОтчета(ГраницаПериодов, Результат.КонецПериода);
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ПерваяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Начало [МесяцПрописью]: [ПерваяПоловина]';
					|en = 'Start of [МесяцПрописью]: [ПерваяПоловина]'"),
				ПараметрыПредставлений));
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ВтораяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Конец [МесяцПрописью]: [ВтораяПоловина]';
					|en = 'End of [МесяцПрописью]: [ВтораяПоловина]'"),
				ПараметрыПредставлений));
		
	Иначе
		
		// НДФЛ налогового агента
		
		ОтчетныйПериод = СписокПериодов.Добавить(Результат,
			ПредставлениеПериодаОтчета(Результат.НачалоПериода, Результат.КонецПериода));
		
		Если Результат.КонецПериода = КонецГода(Результат.КонецПериода) Тогда
			ГраницаПериода = Результат.НачалоПериода + 22 * 86400; // 23-е декабря
			ОтчетныйПериод = СписокПериодов.Добавить(
				Новый Структура("НачалоПериода, КонецПериода", ГраницаПериода, Результат.КонецПериода),
				ПредставлениеПериодаОтчета(ГраницаПериода, Результат.КонецПериода));
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокПериодов.Количество() > 1 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НалогиВыборОтчетногоПериодаЗавершение", ЭтотОбъект, ОписаниеСтроки);
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокПериодов, Элементы.НалогиПредставлениеПериода);
		
	ИначеЕсли СписокПериодов.Количество() = 1 Тогда
		
		НалогиВыборОтчетногоПериодаЗавершение(ОтчетныйПериод, ОписаниеСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВыборОтчетногоПериодаЗавершение(Результат, ОписаниеСтроки) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОписаниеСтроки, Результат.Значение);
	Если Не ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки) Тогда
		ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки);
	КонецЕсли;
	
	ОписаниеСтроки.ПредставлениеПериода =
		ПредставлениеПериодаОтчета(ОписаниеСтроки.НачалоПериода, ОписаниеСтроки.КонецПериода);
	ЗаполнитьСрокУплаты(ОписаниеСтроки);
	
	ЗаполнитьЗначенияСвойств(Элементы.Налоги.ТекущиеДанные, ОписаниеСтроки);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПериодаОтчета(Знач НачалоПериода, Знач КонецПериода)
	
	Если Не ЗначениеЗаполнено(НачалоПериода) ИЛИ Не ЗначениеЗаполнено(КонецПериода) Тогда
		Возврат "";
	КонецЕсли;
	
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода  = КонецДня(КонецПериода);
	
	Возврат ПредставлениеПериода(НачалоПериода, КонецПериода, "ФП=Истина");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСрокУплаты(ОписаниеСтроки)
	
	НачалоПериода = ОписаниеСтроки.НачалоПериода;
	КонецПериода  = ОписаниеСтроки.КонецПериода;
	
	Если ОписаниеСтроки.ЭтоАгентскийНДФЛ Тогда
		
		Если НачалоПериода > НачалоМесяца(НачалоПериода) И КонецПериода = КонецМесяца(КонецПериода)
			И КонецПериода <> КонецГода(КонецПериода) Тогда
			
			// Вторая половина месяца (кроме декабря) - уплата 5-го числа следующего месяца
			МесяцПлатежа = ДобавитьМесяц(КонецПериода, 1);
			РасчетныйСрокУплаты = Дата(Год(МесяцПлатежа), Месяц(МесяцПлатежа), 5);
			
		ИначеЕсли КонецПериода = КонецГода(КонецПериода) И НачалоПериода > НачалоМесяца(НачалоПериода) Тогда
			
			// Вторая половина декабря- уплата 31-го декабря
			РасчетныйСрокУплаты = НачалоДня(КонецГода(КонецПериода));
			
		Иначе
			
			// Первая половина месяца - уплата 28-го числа текущего месяца
			РасчетныйСрокУплаты = Дата(Год(КонецПериода), Месяц(КонецПериода), 28);
			
		КонецЕсли;
		
	Иначе
		
		// Общий порядок - уплата 28-го числа следующего месяца
		МесяцПлатежа = ДобавитьМесяц(КонецПериода, 1);
		РасчетныйСрокУплаты = Дата(Год(МесяцПлатежа), Месяц(МесяцПлатежа), 28);
		
	КонецЕсли;
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	ПараметрыПолученияБлижайшихРабочихДат =
		КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат(ПроизводственныйКалендарь);
	ПараметрыПолученияБлижайшихРабочихДат.ВызыватьИсключение = Ложь;
	Если ОписаниеСтроки.ЭтоАгентскийНДФЛ И КонецДня(РасчетныйСрокУплаты) = КонецГода(КонецПериода) Тогда
		ПараметрыПолученияБлижайшихРабочихДат.ПолучатьПредшествующие = Истина;
	КонецЕсли;
	
	ГрафикПереноса = КалендарныеГрафики.БлижайшиеРабочиеДаты(
		КалендарныеГрафики.ОсновнойПроизводственныйКалендарь(),
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РасчетныйСрокУплаты),
		ПараметрыПолученияБлижайшихРабочихДат);
	
	Если ГрафикПереноса[РасчетныйСрокУплаты] <> Неопределено Тогда
		ОписаниеСтроки.СрокУплаты = ГрафикПереноса[РасчетныйСрокУплаты];
	Иначе
		ОписаниеСтроки.СрокУплаты = РасчетныйСрокУплаты;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Не удалось определить ближайшую рабочую дату для даты %1, возможно, производственный календарь не заполнен.';
				|en = 'Cannot identify the workday nearest to %1. The work schedule might be blank.'"),
			Формат(РасчетныйСрокУплаты, "ДЛФ=D")));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы() Экспорт
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	
	Объект.СуммаДокумента = Объект.Налоги.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НалогиПредставлениеПериода");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Налоги.ПредставлениеПериода", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Заполнить>';
																	|en = '<Fill>'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицы()
	
	Для каждого СтрокаТаблицы Из Объект.Налоги Цикл
		СтрокаТаблицы.ПредставлениеПериода =
			ПредставлениеПериодаОтчета(СтрокаТаблицы.НачалоПериода, СтрокаТаблицы.КонецПериода);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДокументЗаПервуюПоловинуПериодаПоНДФЛ(Знач ДатаУведомления)
	Возврат День(ДатаУведомления) <= 12;
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеСтроки.НачалоПериода)
		ИЛИ НЕ ЗначениеЗаполнено(ОписаниеСтроки.КонецПериода) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачалоПериода = НачалоДня(ОписаниеСтроки.НачалоПериода);
	КонецПериода  = КонецДня(ОписаниеСтроки.КонецПериода);
	
	Если НалогиУплачиваемыеПоквартально.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		
		Возврат НачалоКвартала(НачалоПериода) = НачалоКвартала(КонецПериода) // Начало и конец периода в одном квартале
			И НачалоПериода = НачалоКвартала(НачалоПериода) // Начало периода соответствует началу квартала
			И КонецПериода = КонецКвартала(КонецПериода); // Конец периода соответствует концу квартала
		
	ИначеЕсли ОписаниеСтроки.ЭтоАгентскийНДФЛ И НачалоПериода >= ДатаПереходаНаПостояннуюПередачуЧастичныхУведомленийПоНДФЛ Тогда
		
		Возврат НачалоМесяца(НачалоПериода) = НачалоМесяца(КонецПериода) // Начало и окончание периода в одном месяце
			И ((НачалоПериода = НачалоМесяца(НачалоПериода) И День(КонецПериода) = 22) // С начала месяца по 22-е число
				ИЛИ (День(НачалоПериода) = 23) И КонецПериода = КонецМесяца(КонецПериода)); // С 23-го числа по конец месяца
		
	ИначеЕсли ОписаниеСтроки.ЭтоАгентскийНДФЛ И КонецПериода = КонецГода(КонецПериода) Тогда
		
		Возврат НачалоМесяца(НачалоПериода) = НачалоМесяца(КонецПериода) // Начало и окончание периода в одном месяце
			И (НачалоПериода = НачалоМесяца(НачалоПериода) // Полный месяц декабрь
				ИЛИ День(НачалоПериода) = 23); // Или с 23-го декабря по конец года
		
	ИначеЕсли НалогиУплачиваемыеЕжемесячно.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		
		Возврат НачалоПериода = НачалоМесяца(КонецПериода)
			И НачалоПериода = НачалоМесяца(НачалоПериода)
			И КонецПериода = КонецМесяца(КонецПериода);
		
	Иначе
		
		Возврат НачалоПериода <= НачалоМесяца(КонецПериода)
			И НачалоПериода = НачалоМесяца(НачалоПериода)
			И КонецПериода = КонецМесяца(КонецПериода);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки)
	
	Если ЗначениеЗаполнено(ОписаниеСтроки.НачалоПериода) Тогда
		ОтчетныйПериод = ОписаниеСтроки.НачалоПериода;
	Иначе
		ОтчетныйПериод = Объект.Дата;
	КонецЕсли;
	
	Если НалогиУплачиваемыеПоквартально.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		
		НачалоПериода = НачалоКвартала(ОтчетныйПериод);
		КонецПериода  = КонецКвартала(ОтчетныйПериод);
		
	Иначе
		
		НачалоПериода = НачалоМесяца(ОтчетныйПериод);
		КонецПериода  = КонецМесяца(ОтчетныйПериод);
		
		Если ОписаниеСтроки.ЭтоАгентскийНДФЛ И НачалоПериода >= ДатаПереходаНаПостояннуюПередачуЧастичныхУведомленийПоНДФЛ Тогда
			
			ГраницаПериодов = НачалоПериода + 22 * 86400; // 23-е число отчетного месяца
			Если Объект.Дата >= ГраницаПериодов Тогда
				НачалоПериода = ГраницаПериодов; // С 23-го числа по последнее число отчетного месяца
			Иначе
				КонецПериода = ГраницаПериодов - 1; // C 1-го по 22-е число отчетного месяца
			КонецЕсли;
			
		ИначеЕсли ОписаниеСтроки.ЭтоАгентскийНДФЛ И КонецДня(Объект.Дата) = КонецГода(Объект.Дата) Тогда
			
			НачалоПериода = НачалоПериода + 22 * 86400; // С 23-го декабря до конца года
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеСтроки.НачалоПериода = НачалоПериода;
	ОписаниеСтроки.КонецПериода  = КонецПериода;
	
	ОписаниеСтроки.ПредставлениеПериода = ПредставлениеПериодаОтчета(НачалоПериода, КонецПериода);
	
КонецПроцедуры

#Область РаботаСУведомлениемКакСОтчетом

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаНаСервере(ДокументСсылка, УникальныйИдентификатор)
	
	Возврат Документы.УведомлениеОбИсчисленныхСуммахНалогов.ВыгрузитьУведомлениеОбИсчисленныхСуммахНалогов(
		ДокументСсылка,
		УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьНаДискЗавершение(Результат, Параметры) Экспорт
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	
	ДанныеФайла = ПолучитьДанныеФайлаНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	Если ДанныеФайла <> Неопределено Тогда
		РегламентированнаяОтчетностьКлиент.ВыгрузитьФайлы(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрганЗавершение(Результат, Параметры) Экспорт
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрган(ЭтотОбъект, , , Ложь, Объект.Уведомление);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере(Отказ = Ложь, ЕстьКритичныеОшибки = Ложь, ТаблицаОшибок, НеблокирующиеПроверки = Истина)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.ПроверитьОбязательныеПоля(ЕстьКритичныеОшибки);
	Если ЕстьКритичныеОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.ПроверитьДанныеДокумента(Отказ, НеблокирующиеПроверки);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УведомлениеОбъект = ДокументОбъект.Уведомление.ПолучитьОбъект();
	ТаблицаОшибок = УведомлениеОбъект.ПроверитьДокументСВыводомВТаблицу(УникальныйИдентификатор);
	Отказ = ТаблицаОшибок.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействия(ОповещениеЗавершения = Неопределено)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно записать документ.
			|Выполнить запись документа и продолжить?';
			|en = 'Cannot run the command for unsaved documents.
			|Do you want to save the document and continue?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьКонтрольныеСоотношенияСЗапросомДальнейшегоДействия", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить';
													|en = 'Continue'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе 
		ПроверитьКонтрольныеСоотношенияСЗапросомДальнейшегоДействия(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрольныеСоотношенияСЗапросомДальнейшегоДействия(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = ДополнительныеПараметры.ОповещениеЗавершения;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СообщениеПриОтсутствииОшибок", Ложь);
	ПроверитьКонтрольныеСоотношенияЗавершение(Ответ, ДополнительныеПараметры);
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Если ЕстьОшибкиПроверкиКонтрольныхСоотношений Тогда
		ТекстВопроса = НСтр("ru = 'При проверке контрольных соотношений обнаружены ошибки.
			|Наличие ошибок может привести к отказу в приеме уведомления.
			|Продолжить (не рекомендуется)?';
			|en = 'Errors were found when checking the control correlations.
			|The errors may lead to a refusal to accept the notification.
			|Continue (not recommended)?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьСЗапросомДальнейшегоДействияПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить';
													|en = 'Continue'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьСЗапросомДальнейшегоДействияПродолжение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияПродолжение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если (Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка)) И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ПроверитьНаСервере(Отказ, ЕстьКритичныеОшибки, ТаблицаОшибок, Ложь);
	ДополнительныеПараметры.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	
	Если ЕстьКритичныеОшибки Тогда 
		ТекстПредупреждения = НСтр("ru = 'Не заполнены обязательные поля.';
									|en = 'Required fields are not filled.'");
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстВопроса = НСтр("ru = 'В уведомлении обнаружены ошибки.
							|Продолжить (не рекомендуется)?';
							|en = 'Errors were detected in the notification.
							|Continue (not recommended)?'");
							
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьСЗапросомДальнейшегоДействияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Предупреждение.';
																											|en = 'Warning.'"));
	Иначе
		ПроверитьСЗапросомДальнейшегоДействияЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.Свойство("ТаблицаОшибок") Тогда
			Если ДополнительныеПараметры.ТаблицаОшибок.Количество() > 0 Тогда
				ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.НавигацияПоОшибкам",
					Новый Структура("ТаблицаОшибок", ДополнительныеПараметры.ТаблицаОшибок),
					ЭтотОбъект,
					Истина);
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКонтрольныеСоотношенияВОтчете() Экспорт
	
	РезультатПроверки = КонтрольныеСоотношенияИсчисленныеСуммыНалогов.ПроверитьКонтрольныеСоотношенияВОтчете(ЭтотОбъект, Объект.Уведомление);
	ЕстьОшибкиПроверкиКонтрольныхСоотношений = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатПроверки, "ЧислоОшибок", 0) > 0;
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьДокументирование() Экспорт
	Возврат ВыполнитьДокументированиеНаСервере();
КонецФункции

&НаСервере
Функция ВыполнитьДокументированиеНаСервере()
	Возврат КонтрольныеСоотношенияИсчисленныеСуммыНалогов.ВыполнитьДокументированиеНаСервере(ЭтотОбъект, Объект.Уведомление);
КонецФункции

&НаКлиенте
Процедура АктивизироватьЯчейку(Ячейка) Экспорт
	
	Если Ячейка.Раздел = "СумИсчНалог_2023" Тогда
		НомерСтроки = Число(СокрЛП(СтрЗаменить(Ячейка.Страница, "Стр. ", "")));
		Для Каждого СтрокаДокумента Из Объект.Налоги Цикл
			Если НомерСтроки = СтрокаДокумента.НомерСтроки Тогда
				Элементы.Налоги.ТекущаяСтрока = СтрокаДокумента.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт 
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
