&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		// Проверим, что выбрана не группа, и откроем форму выбранного отчета.
		Если НЕ ТекСтрока.ЭтоГруппа Тогда
			
			СтруктураПараметровФормы = Новый Структура;
			СтруктураПараметровФормы.Вставить("Монитор", ТекСтрока.Ссылка);
			СтруктураПараметровФормы.Вставить("ФормироватьПриОткрытии", Истина);
			ОткрытьФорму("Справочник.МониторыКлючевыхПоказателей.Форма.ФормаПроизвольногоОтчетаПоМКП", СтруктураПараметровФормы);	
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Невозможно открыть группу отчетов. Операция отменена.'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

