
// Функция - Получить параметры сервера по переданному псевдониму/ключу соединения
//
// Параметры:
//  Псевдоним	 - Строка - псевдоним/ключ соединения
// 
// Возвращаемое значение: Структура
//   - ключи: АдресСервера, ВиртуальныйХост, Порт, Логин, Пароль 
//
Функция ПолучитьПараметрыСервера(Знач Псевдоним) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерверыОчередей.Ссылка,
	|	СерверыОчередей.АдресСервера КАК АдресСервера,
	|	ВЫБОР
	|		КОГДА СерверыОчередей.Порт = 0
	|			ТОГДА 5672
	|		ИНАЧЕ СерверыОчередей.Порт
	|	КОНЕЦ КАК Порт,
	|	ВЫБОР
	|		КОГДА СерверыОчередей.Логин = """"
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СерверыОчередей.Логин
	|	КОНЕЦ КАК Логин,
	|	СерверыОчередей.Пароль КАК Пароль,
	|	ВЫБОР
	|		КОГДА СерверыОчередей.ВиртуальныйХост = """"
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СерверыОчередей.ВиртуальныйХост
	|	КОНЕЦ КАК ВиртуальныйХост
	// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
	|	,СерверыОчередей.ИспользоватьЗащищенноеСоединение КАК ИспользоватьЗащищенноеСоединение,
	|	ВЫБОР
	|		КОГДА СерверыОчередей.PEMФайлСертификатаУдостоверяющегоЦентра = """"
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СерверыОчередей.PEMФайлСертификатаУдостоверяющегоЦентра
	|	КОНЕЦ КАК PEMФайлСертификатаУдостоверяющегоЦентра,
	|	ВЫБОР
	|		КОГДА СерверыОчередей.PEMФайлЗакрытогоКлючаКлиента = """"
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СерверыОчередей.PEMФайлЗакрытогоКлючаКлиента
	|	КОНЕЦ КАК PEMФайлЗакрытогоКлючаКлиента,
	|	ВЫБОР
	|		КОГДА СерверыОчередей.PEMФайлСертификатаКлиента = """"
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СерверыОчередей.PEMФайлСертификатаКлиента
	|	КОНЕЦ КАК PEMФайлСертификатаКлиента	
	// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040
	|ИЗ
	|	Справочник.СерверыОчередейRMQ КАК СерверыОчередей
	|ГДЕ
	|	СерверыОчередей.Код = &Псевдоним";
	
	Запрос.УстановитьПараметр("Псевдоним", Псевдоним);
	
	Результат = Запрос.Выполнить();
	Параметры = Новый Структура;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Параметры.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Функция - Возвращает ключ соединения по ссылке на сервер очереди
//
// Параметры:
//  СерверСсылка - СправочникСсылка.СерверыОчередейRMQ - ссылка на сервер очереди
// 
// Возвращаемое значение: Строка
//   - ключ соединения или пустая строка, если не найден сервер
//
Функция КлючСоединения(Знач СерверСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерверыОчередей.Код
	|ИЗ
	|	Справочник.СерверыОчередейRMQ КАК СерверыОчередей
	|ГДЕ
	|	СерверыОчередей.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", СерверСсылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Код;
	Иначе
		Рез = "";
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Функция - Возвращает ключ соединения с основным сервером очередей
// 
// Возвращаемое значение:
//  Строка - Ключ соединения
//
Функция КлючСоединенияОсновной() Экспорт
	Возврат КлючСоединения(Справочники.СерверыОчередейRMQ.Основной);	
КонецФункции

