
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает объект-проверку
Функция Создать() Экспорт
	
	Проверка = КонтрольУХ.Новый_Проверка();
	Проверка.Объект = КонтрольУХБюджетныеРезервы;
	Проверка.Источник = ИмяИсточника();
	Проверка.ВидКонтроля = ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхРезервов;
	Проверка.ИмяРеквизита = "ЕстьПревышениеЛимитыРезерв";
	
	Возврат Проверка;
	
КонецФункции

// Возвращает имя источника для проверки
//
Функция ИмяИсточника() Экспорт
	
	Возврат КонтрольУХБюджетныеЛимиты.ИмяИсточника();
	
КонецФункции

// Функция возвращает Истина, если для этого документа проверка выполняется
Функция ТребуетсяДляДокумента(ИмяДокумента) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПереопределяемыеОбъектыУП") Тогда
    	Значение = Истина;
	Иначе
		Значение = (Не ИмяДокумента = "ЗаказПоставщику");	
	КонецЕсли;
	
	Возврат Значение;

КонецФункции

// Функция возвращает Истина, если требуется выполнение проверки 
Функция ТребуетсяПроверка(ПараметрыКонтроля, Источник) Экспорт
	
	Результат = Истина;
	Возврат Результат;
	
КонецФункции

// Функция выполняет обработку данных источника
Функция ОбработатьДанныеИсточника(ИнформацияДляКонтроля, Источник) Экспорт
	
	//
	Результат = Новый ТаблицаЗначений;
	
	Если ИнформацияДляКонтроля.Свойство("РезультатКонтроляРезервов") Тогда
		Результат = ИнформацияДляКонтроля.РезультатКонтроляРезервов;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаРезервов.Аналитика1 КАК Аналитика1,
			|	ТаблицаРезервов.Аналитика2 КАК Аналитика2,
			|	ТаблицаРезервов.Аналитика3 КАК Аналитика3,
			|	ТаблицаРезервов.Аналитика4 КАК Аналитика4,
			|	ТаблицаРезервов.Аналитика5 КАК Аналитика5,
			|	ТаблицаРезервов.Аналитика6 КАК Аналитика6,
			|	ТаблицаРезервов.Валюта КАК Валюта,
			|	ТаблицаРезервов.ВидБюджета КАК ВидБюджета,
			|	ТаблицаРезервов.ВидКонтроля КАК ВидКонтроля,
			|	ТаблицаРезервов.ДатаОперации КАК ДатаОперации,
			|	ТаблицаРезервов.ДокументРезервирования КАК ДокументРезервирования,
			|	ТаблицаРезервов.Зарезервировано КАК Зарезервировано,
			|	ТаблицаРезервов.ЗарезервированоИзменение КАК ЗарезервированоИзменение,
			|	ТаблицаРезервов.ЗарезервированоИзменениеПревышениеТекущегоРезерва КАК ЗарезервированоИзменениеПревышениеТекущегоРезерва,
			|	ТаблицаРезервов.ЗарезервированоСтало КАК ЗарезервированоСтало,
			|	ТаблицаРезервов.Заявлено КАК Заявлено,
			|	ТаблицаРезервов.ЗаявленоИзменение КАК ЗаявленоИзменение,
			|	ТаблицаРезервов.ЗаявленоСтало КАК ЗаявленоСтало,
			|	ТаблицаРезервов.Исполнено КАК Исполнено,
			|	ТаблицаРезервов.ИсполненоИзменение КАК ИсполненоИзменение,
			|	ТаблицаРезервов.ИсполненоСтало КАК ИсполненоСтало,
			|	ТаблицаРезервов.КонтрольНарушен КАК КонтрольНарушен,
			|	ТаблицаРезервов.КонтрольРезервов КАК КонтрольРезервов,
			|	ТаблицаРезервов.Лимит КАК Лимит,
			|	ТаблицаРезервов.ЛимитИзменение КАК ЛимитИзменение,
			|	ТаблицаРезервов.ЛимитСтало КАК ЛимитСтало,
			|	ТаблицаРезервов.НачалоПериодаКонтроля КАК НачалоПериодаКонтроля,
			|	ТаблицаРезервов.ПериодичностьКонтроля КАК ПериодичностьКонтроля,
			|	ТаблицаРезервов.Проект КАК Проект,
			|	&ТаблицаРезервов_СтатьяБюджета,
			|	ТаблицаРезервов.ЦФО КАК ЦФО
			|ПОМЕСТИТЬ ВТ_ТаблицаРезервов
			|ИЗ
			|	&ТаблицаРезервов КАК ТаблицаРезервов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТаблицаРезервов.Аналитика1 КАК Аналитика1,
			|	ВТ_ТаблицаРезервов.Аналитика2 КАК Аналитика2,
			|	ВТ_ТаблицаРезервов.Аналитика3 КАК Аналитика3,
			|	ВТ_ТаблицаРезервов.Аналитика4 КАК Аналитика4,
			|	ВТ_ТаблицаРезервов.Аналитика5 КАК Аналитика5,
			|	ВТ_ТаблицаРезервов.Аналитика6 КАК Аналитика6,
			|	ВТ_ТаблицаРезервов.Валюта КАК Валюта,
			|	ВТ_ТаблицаРезервов.ВидБюджета КАК ВидБюджета,
			|	ВТ_ТаблицаРезервов.ВидКонтроля КАК ВидКонтроля,
			|	ВТ_ТаблицаРезервов.ДатаОперации КАК ДатаОперации,
			|	ВТ_ТаблицаРезервов.ДокументРезервирования КАК ДокументРезервирования,
			|	ВТ_ТаблицаРезервов.Зарезервировано КАК Зарезервировано,
			|	ВТ_ТаблицаРезервов.ЗарезервированоИзменение КАК ЗарезервированоИзменение,
			|	ВТ_ТаблицаРезервов.ЗарезервированоИзменениеПревышениеТекущегоРезерва КАК ЗарезервированоИзменениеПревышениеТекущегоРезерва,
			|	ВТ_ТаблицаРезервов.ЗарезервированоСтало КАК ЗарезервированоСтало,
			|	ВТ_ТаблицаРезервов.Заявлено КАК Заявлено,
			|	ВТ_ТаблицаРезервов.ЗаявленоИзменение КАК ЗаявленоИзменение,
			|	ВТ_ТаблицаРезервов.ЗаявленоСтало КАК ЗаявленоСтало,
			|	ВТ_ТаблицаРезервов.Исполнено КАК Исполнено,
			|	ВТ_ТаблицаРезервов.ИсполненоИзменение КАК ИсполненоИзменение,
			|	ВТ_ТаблицаРезервов.ИсполненоСтало КАК ИсполненоСтало,
			|	ВТ_ТаблицаРезервов.КонтрольНарушен КАК КонтрольНарушен,
			|	ВТ_ТаблицаРезервов.КонтрольРезервов КАК КонтрольРезервов,
			|	ВТ_ТаблицаРезервов.Лимит КАК Лимит,
			|	ВТ_ТаблицаРезервов.ЛимитИзменение КАК ЛимитИзменение,
			|	ВТ_ТаблицаРезервов.ЛимитСтало КАК ЛимитСтало,
			|	ВТ_ТаблицаРезервов.НачалоПериодаКонтроля КАК НачалоПериодаКонтроля,
			|	ВТ_ТаблицаРезервов.ПериодичностьКонтроля КАК ПериодичностьКонтроля,
			|	ВТ_ТаблицаРезервов.Проект КАК Проект,
			|	&ВТ_ТаблицаРезервов_СтатьяБюджета,
			|	ВТ_ТаблицаРезервов.ЦФО КАК ЦФО
			|ИЗ
			|	ВТ_ТаблицаРезервов КАК ВТ_ТаблицаРезервов
			|ГДЕ
			|	ВТ_ТаблицаРезервов.ЗарезервированоИзменение <> 0
			|	И НЕ ВТ_ТаблицаРезервов.КонтрольРезервов = &НеКонтролировать";
		
		Запрос.УстановитьПараметр("ТаблицаРезервов", Результат);
		Запрос.УстановитьПараметр("НеКонтролировать", Перечисления.РежимыКонтроляДокументов.НеКонтролировать);
		
		Если Результат.Колонки.Найти("ОбъектКонтроля") <> Неопределено Тогда
	
			Замена = "ТаблицаРезервов.СтатьяБюджета КАК СтатьяБюджета,
				|	ТаблицаРезервов.ОбъектКонтроля КАК ОбъектКонтроля,";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаРезервов_СтатьяБюджета," , Замена);
			
			Замена = "ВТ_ТаблицаРезервов.СтатьяБюджета КАК СтатьяБюджета,
				|	ВТ_ТаблицаРезервов.ОбъектКонтроля КАК ОбъектКонтроля,";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВТ_ТаблицаРезервов_СтатьяБюджета," , Замена);
		Иначе
			
			Замена = "ТаблицаРезервов.СтатьяБюджета КАК СтатьяБюджета,";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаРезервов_СтатьяБюджета," , Замена);
			
			Замена = "ВТ_ТаблицаРезервов.СтатьяБюджета КАК СтатьяБюджета,";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВТ_ТаблицаРезервов_СтатьяБюджета," , Замена);
			
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		ИнформацияДляКонтроля.Удалить("РезультатКонтроляРезервов");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура выполняет контроль обработанных данных
Функция ВыполнитьКонтроль(ИнформацияДляКонтроля, ДанныеДляКонтроля) Экспорт
	
	КонтрольНарушен = Ложь;
	Для Каждого Строка Из ДанныеДляКонтроля Цикл
		
		Доступно = Окр(Строка.Зарезервировано, 2) + Окр(Строка.ЗарезервированоИзменение, 2);
		
		Строка.КонтрольНарушен = Доступно < 0;
		КонтрольНарушен = КонтрольНарушен ИЛИ Строка.КонтрольНарушен;
		
	КонецЦикла;
	
	Возврат КонтрольНарушен;
	
КонецФункции

// Функция возвращает Истина, если нарушение контроля должно приводить к блокированию проведения
Функция БлокироватьПроведение(КлючКонтроля) Экспорт
	
	Возврат БлокироватьПроведениеДляВидаКонтроля(КлючКонтроля);

КонецФункции

// Процедура возвращает табличный документ с расшифровкой контроля документа
//
Функция СформироватьРасшифровкуКонтроля(Проверка, СтрокаКонтроль) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ДанныеКонтроляИзХранилища = ПолучитьИзВременногоХранилища(СтрокаКонтроль.АдресРезультата);
	Если ТипЗнч(ДанныеКонтроляИзХранилища) <> Тип("ТаблицаЗначений") Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли; 
	
	ДанныеКонтроля = ДанныеКонтроляИзХранилища.Скопировать();
	Если ДанныеКонтроля.Колонки.Найти("ПериодЛимитирования") = неопределено Тогда
		ДанныеКонтроля.Колонки.Добавить("ПериодЛимитирования", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КонецЕсли;
	
	Для Каждого Строка Из ДанныеКонтроля Цикл
		Строка.ПериодЛимитирования = ОбщегоНазначенияОПК.ПредставлениеПериодаПоПериодичности(
			Строка.НачалоПериодаКонтроля, Строка.ПериодичностьКонтроля);
	КонецЦикла;
	
	Ресурсы = "Зарезервировано, ЗарезервированоИзменение, Заявлено, ЗаявленоИзменение, Исполнено, ИсполненоИзменение";
	
	ТаблицаРезервов = ДанныеКонтроля.Скопировать(,"ДокументРезервирования," + Ресурсы);
	ТаблицаРезервов.Свернуть("ДокументРезервирования", Ресурсы);
	
	ТаблицаВидБюджета = ДанныеКонтроля.Скопировать(,"ВидБюджета, ДокументРезервирования, " + Ресурсы);
	ТаблицаВидБюджета.Свернуть("ВидБюджета, ДокументРезервирования", Ресурсы);

	Измерения = "ВидБюджета, ДокументРезервирования, ПериодичностьКонтроля, НачалоПериодаКонтроля, ПериодЛимитирования";
	
	ТаблицаПериодов = ДанныеКонтроля.Скопировать(, Измерения + "," + Ресурсы);
	ТаблицаПериодов.Свернуть(Измерения, Ресурсы);
	ТаблицаПериодов.Сортировать("НачалоПериодаКонтроля, ПериодичностьКонтроля");
	
	Макет = ПланыВидовХарактеристик.ВидыКонтроляДокументов.ПолучитьМакет("КонтрольЛимитовПоРезервам");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьДокРезерв = Макет.ПолучитьОбласть("ГруппировкаДокументРезервирования"); 
	ОбластьВидБюджета = Макет.ПолучитьОбласть("ГруппировкаВидБюджета");
	ОбластьПериод = Макет.ПолучитьОбласть("ГруппировкаПериод");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабличныйДокумент.Очистить();
	
	// Формирование заголовка
	ОбластьЗаголовок.Параметры.Документ = СтрокаКонтроль.Документ;
	ОбластьЗаголовок.Параметры.ДатаВремяКонтроля = СтрокаКонтроль.ВремяПроверки;
	ОбластьЗаголовок.Параметры.ТекущееВремя = ТекущаяДатаСеанса();
	ОбластьЗаголовок.Параметры.ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
    
	Для Каждого СтрокаДокРезерва Из ТаблицаРезервов Цикл
		
		РезервыЗаполнитьСуммыВОбласти(ОбластьДокРезерв, СтрокаДокРезерва);
		Если Не ЗначениеЗаполнено(ОбластьДокРезерв.Параметры.ДокументРезервирования) Тогда
			ОбластьДокРезерв.Параметры.ДокументРезервирования = НСтр("ru = 'Создаваемый документ...'");
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьДокРезерв, 1); 
		
		СтрокиВидБюджета = ТаблицаВидБюджета.НайтиСтроки(Новый Структура("ДокументРезервирования", СтрокаДокРезерва.ДокументРезервирования));
		
		Для Каждого СтрокаВидБюджета Из СтрокиВидБюджета Цикл
			
			РезервыЗаполнитьСуммыВОбласти(ОбластьВидБюджета, СтрокаВидБюджета);
            ТабличныйДокумент.Вывести(ОбластьВидБюджета, 2);
			
			СтрокиПериодов = ТаблицаПериодов.НайтиСтроки(Новый Структура("ДокументРезервирования, ВидБюджета", 
														СтрокаДокРезерва.ДокументРезервирования, СтрокаВидБюджета.ВидБюджета));
			
			Для Каждого СтрокаПериод Из СтрокиПериодов Цикл
				
				РезервыЗаполнитьСуммыВОбласти(ОбластьПериод, СтрокаПериод);
				ТабличныйДокумент.Вывести(ОбластьПериод, 3);
				
				СтруктураПоиска = Новый Структура; 
				СтруктураПоиска.Вставить("ДокументРезервирования", СтрокаДокРезерва.ДокументРезервирования);
				СтруктураПоиска.Вставить("ПериодЛимитирования", СтрокаПериод.ПериодЛимитирования); 			
				СтруктураПоиска.Вставить("ВидБюджета", СтрокаПериод.ВидБюджета);
				
				СтрокиОтчета = ДанныеКонтроля.НайтиСтроки(СтруктураПоиска);
				Для Каждого ВыборкаДетальныеЗаписи Из СтрокиОтчета Цикл
					РезервыЗаполнитьСуммыВОбласти(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи);
					
					Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Проект) Тогда
						ОбластьДетальныхЗаписей.Параметры.Проект = НСтр("ru = '<без проекта>'");
					КонецЕсли;
					
					Если ДанныеКонтроля.Колонки.Найти("КонтрольРезервов") = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КонтрольРезервов) Тогда
						ОбластьДетальныхЗаписей.Параметры.КонтрольРезервов = НСтр("ru = '<не удалось определить, необходимо перевыполнить контроль в документе>'");
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьДетальныхЗаписей, 4);
				КонецЦикла;
				
			КонецЦикла; 

		КонецЦикла; 	
		
	КонецЦикла; 
        
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
	
// Процедура сохраняет данные для контроля в табличной части документа
//
// Параметры:
//  ДанныеДляКонтроля	- Таблица значений	- Результат контроля
//  РезультатыКонтроля	- ТабличнаяЧасть	- табличная часть РезультатыКонтроля проверяемого документа
//
Процедура СохранитьДанныеДляКонтроляВДокументе(ДанныеДляКонтроля, РезультатыКонтроля) Экспорт
	
	// НомерСтроки
	Если ДанныеДляКонтроля.Колонки.Найти("НомерСтроки") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
		Поз = 1;
		Для Каждого Строка Из ДанныеДляКонтроля Цикл
			Строка.НомерСтроки = Поз;
			Поз = Поз + 1;
		КонецЦикла;
	КонецЕсли;
	
	// АналитикаПланированияСтатейБюджетов
	Если ДанныеДляКонтроля.Колонки.Найти("АналитикаПланированияСтатейБюджетов") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("АналитикаПланированияСтатейБюджетов", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПланированияСтатейБюджетов"));
	КонецЕсли;
	ИменаПолей = РегистрыСведений.АналитикаПланированияСтатейБюджетов.ИменаПолейКоллекцииПоУмолчанию();
	Если ТипЗнч(ДанныеДляКонтроля) = Тип("ТаблицаЗначений") Тогда
		Если ДанныеДляКонтроля.Колонки.Найти("ПриходРасход") = Неопределено Тогда
			ИменаПолей.ПриходРасход = "";		 
		КонецЕсли;
	Иначе
		ИменаПолей.ПриходРасход = "";	 
	КонецЕсли;  
	РегистрыСведений.АналитикаПланированияСтатейБюджетов.ЗаполнитьВКоллекции(ДанныеДляКонтроля, ИменаПолей);
	
	// АналитикаПланированияСтруктуры
	Если ДанныеДляКонтроля.Колонки.Найти("АналитикаПланированияСтруктуры") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("АналитикаПланированияСтруктуры", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПланированияСтруктуры"));
	КонецЕсли;
	ИменаПолей = РегистрыСведений.АналитикаПланированияСтруктуры.ИменаПолейКоллекцииПоУмолчанию();
	ИменаПолей.Организация = "";
	РегистрыСведений.АналитикаПланированияСтруктуры.ЗаполнитьВКоллекции(ДанныеДляКонтроля, ИменаПолей);
	
	// АналитикаКонтроляБюджетныхЛимитовРезервов
	Если ДанныеДляКонтроля.Колонки.Найти("КлючКонтроля") = неопределено Тогда
		ДанныеДляКонтроля.Колонки.Добавить("КлючКонтроля", Новый ОписаниеТипов("СправочникСсылка.КлючиКонтроляБюджетныхЛимитовРезервов"));
	КонецЕсли;
	ИменаПолей = РегистрыСведений.АналитикаКонтроляБюджетныхЛимитовРезервов.ИменаПолейКоллекцииПоУмолчанию();
	ИменаПолей.АналитикаКонтроляБюджетныхЛимитовРезервов = "КлючКонтроля";
	РегистрыСведений.АналитикаКонтроляБюджетныхЛимитовРезервов.ЗаполнитьВКоллекции(ДанныеДляКонтроля, ИменаПолей);
	
	Для Каждого Строка Из ДанныеДляКонтроля Цикл
		ЗаполнитьЗначенияСвойств(РезультатыКонтроля.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры // СохранитьДанныеДляКонтроляВДокументе()
	
// Функция возвращает соответствие с описанием колонок таблицы данных контроля, которые получаются из ключа контроля
//
// Возвращаемое значение:
//   Соответствие   - {ИмяКолонки, Структура("ИмяКолонки, ОписаниеТипа, ПутьКДанным")}
//
Функция КолонкиДанныхКонтроля() Экспорт
	Возврат КонтрольУХБюджетныеЛимиты.КолонкиДанныхКонтроля();
КонецФункции

//
Функция БлокироватьПроведениеДляВидаКонтроля(КлючиКонтроля) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючиКонтроля", КлючиКонтроля);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ключи.Ссылка КАК КлючКонтроля,
	|	Ключи.Ссылка.ВидБюджета КАК ВидБюджета,
	|	Ключи.Ссылка.АналитикаПланированияСтатейБюджетов.СтатьяБюджета КАК ОбъектКонтроля,
	|	МАКСИМУМ(ПараметрыЛимитирования.Период) КАК НачалоДействия
	|ПОМЕСТИТЬ ВТ_КлючиКонтроляСНачаломДействия
	|ИЗ
	|	Справочник.КлючиКонтроляБюджетныхЛимитовРезервов КАК Ключи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитирования КАК ПараметрыЛимитирования
	|		ПО Ключи.ВидБюджета = ПараметрыЛимитирования.ВидБюджета
	|ГДЕ
	|	Ключи.Ссылка В(&КлючиКонтроля)
	|	И Ключи.НачалоПериодаКонтроля >= ПараметрыЛимитирования.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Ключи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыЛимитированияГруппыСтатей.Период КАК Период,
	|	ПараметрыЛимитированияГруппыСтатей.ВидБюджета КАК ВидБюджета,
	|	ПараметрыЛимитированияГруппыСтатей.ГруппаСтатей КАК ГруппаСтатей,
	|	ПараметрыЛимитированияГруппыСтатейСостав.СтатьяБюджета КАК СтатьяБюджета,
	|	ПараметрыЛимитированияГруппыСтатей.ИноеДействие КАК ИноеДействие,
	|	ПараметрыЛимитированияГруппыСтатей.КонтрольРезервов КАК КонтрольРезервов
	|ПОМЕСТИТЬ ВТ_ПараметрыЛимитированияГруппыСтатей
	|ИЗ
	|	РегистрСведений.ПараметрыЛимитированияГруппыСтатей КАК ПараметрыЛимитированияГруппыСтатей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитированияГруппыСтатейСостав КАК ПараметрыЛимитированияГруппыСтатейСостав
	|		ПО ПараметрыЛимитированияГруппыСтатей.Период = ПараметрыЛимитированияГруппыСтатейСостав.Период
	|			И ПараметрыЛимитированияГруппыСтатей.ВидБюджета = ПараметрыЛимитированияГруппыСтатейСостав.ВидБюджета
	|			И ПараметрыЛимитированияГруппыСтатей.ГруппаСтатей = ПараметрыЛимитированияГруппыСтатейСостав.ГруппаСтатей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КлючиКонтроляСНачаломДействия.КлючКонтроля КАК КлючКонтроля,
	|	ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета КАК ВидБюджета,
	|	ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля КАК ОбъектКонтроля,
	|	ВЫБОР
	|		КОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.ИноеДействие = ИСТИНА
	|			ТОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.КонтрольРезервов
	|		КОГДА СтатьиБюджета.ИноеДействие = ИСТИНА
	|			ТОГДА СтатьиБюджета.КонтрольРезервов
	|		ИНАЧЕ ВидыБюджетов.КонтрольРезервов
	|	КОНЕЦ КАК КонтрольЛимитов
	|ИЗ
	|	ВТ_КлючиКонтроляСНачаломДействия КАК ВТ_КлючиКонтроляСНачаломДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитирования КАК ВидыБюджетов
	|		ПО ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета = ВидыБюджетов.ВидБюджета
	|			И ВТ_КлючиКонтроляСНачаломДействия.НачалоДействия = ВидыБюджетов.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтроляЛимитаСтатейБюджетов КАК СтатьиБюджета
	|		ПО ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета = СтатьиБюджета.ВидБюджета
	|			И ВТ_КлючиКонтроляСНачаломДействия.НачалоДействия = СтатьиБюджета.Период
	|			И ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля = СтатьиБюджета.СтатьяБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияГруппыСтатей КАК ВТ_ПараметрыЛимитированияГруппыСтатей
	|		ПО ВТ_КлючиКонтроляСНачаломДействия.ВидБюджета = ВТ_ПараметрыЛимитированияГруппыСтатей.ВидБюджета
	|			И ВТ_КлючиКонтроляСНачаломДействия.НачалоДействия = ВТ_ПараметрыЛимитированияГруппыСтатей.Период
	|			И (ВЫБОР
	|				КОГДА ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля ССЫЛКА Справочник.ГруппыСтатейБюджета
	|					ТОГДА ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля = ВТ_ПараметрыЛимитированияГруппыСтатей.ГруппаСтатей
	|				ИНАЧЕ ВТ_КлючиКонтроляСНачаломДействия.ОбъектКонтроля = ВТ_ПараметрыЛимитированияГруппыСтатей.СтатьяБюджета
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.ИноеДействие = ИСТИНА
	|				ТОГДА ВТ_ПараметрыЛимитированияГруппыСтатей.КонтрольРезервов
	|			КОГДА СтатьиБюджета.ИноеДействие = ИСТИНА
	|				ТОГДА СтатьиБюджета.КонтрольРезервов
	|			ИНАЧЕ ВидыБюджетов.КонтрольРезервов
	|		КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Блокировать)";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РезервыЗаполнитьСуммыВОбласти(Область, Данные)
	
	Область.Параметры.Заполнить(Данные);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Область.Параметры, "СтрАналитики") Тогда
		Область.Параметры.СтрАналитики = КонтрольУХ.ПолучитьПредставлениеАналитикСтатьиБюджета(Данные);
	КонецЕсли;
	
	Резерв = Окр(Данные.Зарезервировано, 2);
	ТекущаяОперация = Окр(Данные.ЗарезервированоИзменение, 2);
	
	Область.Параметры.ТекущаяОперация = ТекущаяОперация;
	Область.Параметры.Доступно =  Резерв + ТекущаяОперация;
	
КонецПроцедуры

#КонецОбласти
 