#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
   
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", 	ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", 	РежимЗаписи);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	МодульУправленияПроцессамиУХ.ОтправитьНаСогласованиеПриПроведенииДокумента(ЭтотОбъект, Отказ);
	
	СинхронизироватьВариантФинансирования();

	ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка,
																		   ДополнительныеСвойства, РежимПроведения);
	ВидБюджетаДоговора = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств;
	
	ДополнительныеСвойства.ДляПроведения.Вставить(
		"ПараметрыОперПланирования", ОперативноеПланированиеПовтИспУХ.ПолучитьПараметрыОперПланирования(ВидБюджетаДоговора));
	ДополнительныеСвойства.ДляПроведения.Вставить("КонтролироватьПериодыПланирования", 	Истина);
	ДополнительныеСвойства.ДляПроведения.Вставить("КонтролироватьПериодыЛимитирования", Ложь);
	
	Документы.ПокрытиеПотребностиВФинансировании.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУХ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	РаботаСДоговорамиКонтрагентовУХ.ОтразитьРасчетыСКонтрагентамиГрафики(ДополнительныеСвойства, Движения, Отказ);
	РаботаСДоговорамиКонтрагентовУХ.ОтразитьЛимитыРамочныхДоговоровКредитовЗаймов(ДополнительныеСвойства, Движения, Отказ);
	РаботаСДоговорамиКонтрагентовУХ.ОтразитьОперацииБюджетов(ДополнительныеСвойства, Движения, Отказ);
	
	Документы.ПокрытиеПотребностиВФинансировании.ВыполнитьКонтроль(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУХ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУХ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);	
	ПроведениеСерверУХ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 

	ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);	
	ПроведениеСерверУХ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);	
	ПроведениеСерверУХ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУХ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

	СостояниеЧерновик 	= Перечисления.СостоянияСогласования.Черновик;
	НовыйСтатус 		= УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(Ссылка, СостояниеЧерновик);
	Если НовыйСтатус <> СостояниеЧерновик Тогда
		УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(
			Ссылка, СостояниеЧерновик, ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), , , Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПривлечениеФинансирования")  Тогда
		
		ЗаполнитьПоЗаявке(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	КонецЕсли;
	
	Дата 			= ТекущаяДатаСеанса();
	Ответственный 	= Пользователи.ТекущийПользователь();  
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = ОбщегоНазначенияПовтИспУХ.ПолучитьВалютуУправленческогоУчета();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ЦФО = ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнойЦФО");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Проект = ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнойПроект");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти  
#Область СлужебныеПроцедурыИФункции
Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры  

Процедура ЗаполнитьПоЗаявке(ДанныеЗаполнения)
	
	Организация 			= ДанныеЗаполнения.Организация;
	СуммаДокумента 			= ДанныеЗаполнения.СуммаЗаимствования;
	ВидФинансирования 		= ДанныеЗаполнения.ВидФинансирования;
	ДатаОкончанияДействия 	= ДанныеЗаполнения.ДатаВозврата;
	ДатаНачалаДействия 		= ДанныеЗаполнения.ДатаПривлечения; 
	
	ЦФО 			= ДанныеЗаполнения.ЦФО;
	Проект 			= ДанныеЗаполнения.Проект; 
	ВалютаДокумента = ВалютаДокумента;  
	
	СтрокаЗаявки = ЗаявкиНаПривлечениеФинансирования.Добавить();
	СтрокаЗаявки.Заявка = ДанныеЗаполнения; 
	
	

КонецПроцедуры

Процедура СинхронизироватьВариантФинансирования()
	
	Если НЕ ЗначениеЗаполнено(ОсновнойВариантФинансирования) Тогда
		Возврат;			
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ЦФО)
		И НЕ ЗначениеЗаполнено(Проект)Тогда
		Возврат;			
	КонецЕсли;


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыФинансированияГрафикРасчетов.Ссылка КАК Ссылка,
		|	ВариантыФинансированияГрафикРасчетов.ЦФО КАК ЦФО,
		|	ВариантыФинансированияГрафикРасчетов.Проект КАК Проект
		|ИЗ
		|	Справочник.ВариантыФинансирования.ГрафикРасчетов КАК ВариантыФинансированияГрафикРасчетов
		|ГДЕ
		|	ВариантыФинансированияГрафикРасчетов.Ссылка = &Ссылка
		|	И ВариантыФинансированияГрафикРасчетов.ЦФО = &ЦФО
		|	И ВариантыФинансированияГрафикРасчетов.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Справочники.Проекты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка", ОсновнойВариантФинансирования);
	Запрос.УстановитьПараметр("ЦФО", 	Справочники.Организации.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ВариантыФинансирования");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ОсновнойВариантФинансирования);
	Блокировка.Заблокировать();	

	ВариантОбъект = ОсновнойВариантФинансирования.ПолучитьОбъект();
	
	ЗаблокироватьДанныеДляРедактирования(ОсновнойВариантФинансирования);
	
	Для каждого СтрокаГрафик Из ВариантОбъект.ГрафикРасчетов Цикл
		СтрокаГрафик.ЦФО 	= ЦФО;
		СтрокаГрафик.Проект = Проект;
	КонецЦикла;
	
	ВариантОбъект.Записать();
	
КонецПроцедуры


#КонецОбласти
#КонецЕсли
