
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Клиент = ОчередьСообщений.СоздатьЭкземплярКомпоненты();
	// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
	Если Объект.ИспользоватьЗащищенноеСоединение Тогда
		Клиент.УстановитьЗащищенноеСоединение(
		    Объект.PEMФайлСертификатаУдостоверяющегоЦентра,
			Объект.PEMФайлЗакрытогоКлючаКлиента,
			Объект.PEMФайлСертификатаКлиента,
			Объект.АдресСервера,
			Объект.Логин,
			Объект.Пароль,
			Объект.Порт,
			Объект.ВиртуальныйХост);
	Иначе
	// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040	
		Клиент.УстановитьСоединение(
			Объект.АдресСервера,
			Объект.Логин,
			Объект.Пароль,
			Объект.Порт,
			Объект.ВиртуальныйХост);			
	// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
	КонецЕсли;
	// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	Попытка
		ПроверитьСоединениеНаСервере();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Соединение успешно установлено'"));
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

// Калинин А. 02.10.2019 Выполнение задач №000033040
&НаКлиенте
Процедура ИспользоватьЗащищенноеСоединениеПриИзменении(Элемент)
		
	УстановитьВидимость();
	
КонецПроцедуры

// Калинин А. 02.10.2019 Выполнение задач №000033040
&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.PEMФайлЗакрытогоКлючаКлиента.Видимость 		   = Объект.ИспользоватьЗащищенноеСоединение;
	Элементы.PEMФайлСертификатаКлиента.Видимость 			   = Объект.ИспользоватьЗащищенноеСоединение;
	Элементы.PEMФайлСертификатаУдостоверяющегоЦентра.Видимость = Объект.ИспользоватьЗащищенноеСоединение;	

КонецПроцедуры

// Калинин А. 02.10.2019 Выполнение задач №000033040
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры
