#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Перем Клиент;
Перем мИнициализирован;

////////////////////////////////////////////////////////////////////////
// Служебный интерфейс

// Замена конструктора
//
Процедура Инициализация() Экспорт
	Клиент = ОчередьСообщений.ПолучитьЭкземплярКомпоненты(ЭтотОбъект.КлючСоединения);
	Клиент.ОбъявитьТочкуОбмена(ИмяТочкиОбмена, ТипТочкиОбмена, Истина);
	
	мИнициализирован = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Отправляет сообщение в exchange
//
// Параметры:
//  Данные				 - Строка	 - Тело сообщения
//  КлючМаршрутизации	 - Строка	 - Ключ маршрутизации (см. руководство RMQ)
//  ВремяЖизни			 - Строка	 - Время жизни сообщения в миллисекундах
//  Персистентное		 - Булево	 - Сбрасывать сообщение на диск
//
Процедура ОтправитьСообщение(Знач Данные, Знач КлючМаршрутизации = "", ВремяЖизни = 0, Персистентное = Ложь) Экспорт
	Если Не мИнициализирован Тогда
		Инициализация();
	КонецЕсли;
	
	Клиент.ОтправитьСообщение(ИмяТочкиОбмена, Данные, КлючМаршрутизации, ВремяЖизни, Персистентное);
КонецПроцедуры // ОтправитьСообщение()

// Установить свойства сообщения согласно протоколу AMQP
//
// Параметры:
//  СтруктураСвойств - Структура - структура со значениями свойств, которые надо установить.
//                     Названия ключей соответствия доступны в методе ОчередьСообщений.ВозможныеСвойстваСообщения
//
Процедура УстановитьСвойстваСообщения(Знач СтруктураСвойств) Экспорт
	Если Не мИнициализирован Тогда
		Инициализация();
	КонецЕсли;

	Клиент.УстановитьСвойстваСообщения(СтруктураСвойств);
КонецПроцедуры

// Сброс всех ранее установленных свойств сообщения
//
Процедура СброситьЗначенияСвойств() Экспорт
	Если Не мИнициализирован Тогда
		Инициализация();
	КонецЕсли;
	
	Клиент.СброситьЗначенияСвойств();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////

мИнициализирован = Ложь;

#КонецЕсли