#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьТаблицуПримененияФорматов() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуПримененияФорматов();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2020_1";
	Стр.КНД = "1125309";
	Стр.ВерсияФормата = "5.02";
	
	Возврат Результат;
КонецФункции

Функция ДанноеУведомлениеДоступноДляОрганизации() Экспорт 
	Возврат Истина;
КонецФункции

Функция ДанноеУведомлениеДоступноДляИП() Экспорт 
	Возврат Ложь;
КонецФункции

Функция ПолучитьОсновнуюФорму() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьФормуПоУмолчанию() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьТаблицуФорм() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуФормУведомления();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2020_1";
	Стр.ОписаниеФормы = "Форма информации об организации системы внутреннего контроля";
	Стр.ДатаНачала = '20201001';
	Стр.ДатаКонца = '20991231';
	
	Возврат Результат;
КонецФункции

Функция ЭлектронноеПредставление(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2020_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2020_1(Объект, УникальныйИдентификатор);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПроверитьДокумент(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2020_1" Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Электронный формат для данной формы не опубликован'"));
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция СформироватьСписокЛистов(Объект) Экспорт
	Если Объект.ИмяФормы = "Форма2020_1" Тогда 
		Возврат СформироватьСписокЛистовФорма2020_1(Объект);
	КонецЕсли;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт 
	Если ИмяФормы = "Форма2020_1" Тогда 
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2020_1(УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект), УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления_Форма2020_1(СведенияОтправки)
	Префикс = "ON_KPNALMON";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу_Форма2020_1(Данные, УникальныйИдентификатор)
	СпискиВыбора = УведомлениеОСпецрежимахНалогообложения.СформироватьСпискиВыбораДляПроверкиВыгрузки(
		Данные.Объект.ИмяОтчета, "СпискиВыбора2020_1");
	ТаблицаОшибок = Новый СписокЗначений;
	УведомлениеОСпецрежимахНалогообложения.ПроверкаАктуальностиФормыПриВыгрузке(
		Данные.Объект.ИмяФормы, ТаблицаОшибок, ПолучитьТаблицуФорм());
	
	Титульная = Данные.ДанныеУведомления.Титульная;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаКодаНО(Титульная.КодНО, ТаблицаОшибок, "Титульная");
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаГода(Титульная, ТаблицаОшибок, "Титульная", "ГодНМ", Истина);
	
	Если Не ЗначениеЗаполнено(Титульная.Наименование) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование организации", "Титульная", "Наименование"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ДАТА_ПОДПИСИ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана дата формирования документа", "Титульная", "ДАТА_ПОДПИСИ"));
	КонецЕсли;
	
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаИННКПП(Истина, Титульная, ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
		Титульная, СпискиВыбора, "ПРИЗНАК_НП_ПОДВАЛ", "Титульная", Истина, "признак подписанта", ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
		Титульная, СпискиВыбора, "Период", "Титульная", Истина, "код периода", ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаПодписантаНалоговойОтчетности(Данные, ТаблицаОшибок, "Титульная", Истина);
	Если Не ЗначениеЗаполнено(Титульная.Долж) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана должность подписанта", "Титульная", "Долж"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.Период) 
		Или СтрДлина(Титульная.Период) <> 2 Тогда
		
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан/неправильно указан код периода", "Титульная", "Период"));
	КонецЕсли;
	
	Для Каждого Стр Из Данные.ДанныеМногостраничныхРазделов.КонтрПроцНМ Цикл
		КонтрПроцНМ = Стр.Значение;
		
		Если Не ЗначениеЗаполнено(КонтрПроцНМ.КодКП) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан код контрольной процедуры", "КонтрПроцНМ", "КодКП", КонтрПроцНМ.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрПроцНМ.НаимКП) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано наименование контрольной процедуры", "КонтрПроцНМ", "НаимКП", КонтрПроцНМ.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрПроцНМ.ОписКП) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано описание контрольной процедуры", "КонтрПроцНМ", "ОписКП", КонтрПроцНМ.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрПроцНМ.ОтвПодр) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано ответственное подразделение", "КонтрПроцНМ", "ОтвПодр", КонтрПроцНМ.УИД));
		КонецЕсли;
		
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			КонтрПроцНМ, СпискиВыбора, "ЧастотПров", "КонтрПроцНМ", Истина, "частота проведения", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			КонтрПроцНМ, СпискиВыбора, "ВидКонтрол", "КонтрПроцНМ", Истина, "вид контрольной процедуры", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			КонтрПроцНМ, СпискиВыбора, "УровКонтр", "КонтрПроцНМ", Истина, "уровень контроля", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			КонтрПроцНМ, СпискиВыбора, "СпособПров", "КонтрПроцНМ", Истина, "способ проведения", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			КонтрПроцНМ, СпискиВыбора, "ДокПодКП", "КонтрПроцНМ", Истина, "признак документов", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			КонтрПроцНМ, СпискиВыбора, "АвтЗапВыпКП", "КонтрПроцНМ", Истина, "признак автоматической записи результатов КП в ИС", ТаблицаОшибок);
	КонецЦикла;
	
	Для Каждого Стр Из Данные.ДанныеМногостраничныхРазделов.СвИнфСист Цикл
		СвИнфСист = Стр.Значение;
		Если Не УведомлениеОСпецрежимахНалогообложенияКлиентСервер.СтраницаЗаполнена(СвИнфСист) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СвИнфСист.НомерИС) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан номер ИС", "СвИнфСист", "НомерИС", СвИнфСист.УИД));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СвИнфСист.НаимИС) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано наименование ИС", "СвИнфСист", "НаимИС", СвИнфСист.УИД));
		КонецЕсли;
		УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаИНН(СвИнфСист, ТаблицаОшибок, "СвИнфСист", "ИННЮЛ", Истина, Истина);
		
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			СвИнфСист, СпискиВыбора, "ПризДоступИС", "СвИнфСист", Истина, "признак доступа к ИС", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			СвИнфСист, СпискиВыбора, "ВидИСОрг", "СвИнфСист", Истина, "вид ИС организации", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			СвИнфСист, СпискиВыбора, "ПризНалПД", "СвИнфСист", Истина, "признак наличия персональных данных", ТаблицаОшибок);
		УведомлениеОСпецрежимахНалогообложения.ПроверитьПоказательНаСоотвествиеСписку(
			СвИнфСист, СпискиВыбора, "ПризНалДанДр", "СвИнфСист", Истина, "признак наличия данных других организаций", ТаблицаОшибок);
	КонецЦикла;
	
	УведомлениеОСпецрежимахНалогообложения.ПроверкаДатВУведомлении(Данные, ТаблицаОшибок);
	Возврат ТаблицаОшибок;
КонецФункции

Функция ОсновныеСведенияЭлектронногоПредставления_Форма2020_1(Объект, УникальныйИдентификатор)
	ОсновныеСведения = Документы.УведомлениеОСпецрежимахНалогообложения.НачальнаяИнициализацияОбщихРеквизитовВыгрузки(Объект);
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления_Форма2020_1(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	Возврат ОсновныеСведения;
КонецФункции

Функция ЭлектронноеПредставление_Форма2020_1(Объект, УникальныйИдентификатор)
	СведенияЭлектронногоПредставления = УведомлениеОСпецрежимахНалогообложения.СведенияЭлектронногоПредставления();
	ДанныеУведомления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2020_1(ДанныеУведомления, УникальныйИдентификатор);
	УведомлениеОСпецрежимахНалогообложения.СообщитьОшибкиПриПроверкеВыгрузки(Объект, Ошибки, ДанныеУведомления);
	
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления_Форма2020_1(Объект, УникальныйИдентификатор);
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2020_1");
	УведомлениеОСпецрежимахНалогообложения.ТиповоеЗаполнениеДанными(ДанныеУведомления, ОсновныеСведения, СтруктураВыгрузки);
	УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВТаблицу(СтруктураВыгрузки, ОсновныеСведения, СведенияЭлектронногоПредставления);
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Функция ДополнитьНулями(Стр, ЧН)
	Возврат Прав("000000000000000000000" + Стр, ЧН);
КонецФункции

Функция КодИС(СвИнфСист)
	Возврат ДополнитьНулями(СвИнфСист.ПризДоступИС, 1) + "." 
		+ ДополнитьНулями(СвИнфСист.ВидИСОрг, 2) + "."
		+ ДополнитьНулями(СвИнфСист.ПризНалПД, 1) + "."
		+ ДополнитьНулями(СвИнфСист.ПризНалДанДр, 1) + "."
		+ ДополнитьНулями(СвИнфСист.ИННЮЛ, 10) + "."
		+ ДополнитьНулями(СвИнфСист.НомерИС, 3);
	КонецФункции
	
Функция СформироватьСписокЛистовФорма2020_1(Объект) Экспорт
	Листы = Новый СписокЗначений;
	ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
	МакетПФ = Отчеты[Объект.ИмяОтчета].ПолучитьМакет("ПечатныйБланк_2020");
	Заголовок = МакетПФ.ПолучитьОбласть("Заголовок");
	Подвал = МакетПФ.ПолучитьОбласть("Подвал");
	Строка = МакетПФ.ПолучитьОбласть("Строка");
	
	ДанныеУведомления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ДанныеУведомления").Получить();
	Титульная = ДанныеУведомления.ДанныеУведомления.Титульная;
	
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Титульная.ИНН, "ИНН", Заголовок.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Титульная.КПП, "КПП", Заголовок.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Титульная.КодНО, "КодНО", Заголовок.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Титульная.НомерРед, "НомерРед", Заголовок.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Титульная.ГодНМ, "ГодНМ", Заголовок.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Титульная.Период, "Период", Заголовок.Области, "-");
	Заголовок.Параметры.Наименование = Титульная.Наименование;
	ПечатнаяФорма.Вывести(Заголовок);
	ПечатнаяФорма.Вывести(МакетПФ.ПолучитьОбласть("Шапка"));
	
	НомерПП = 0;
	Для Каждого Стр0 Из ДанныеУведомления.ДанныеМногостраничныхРазделов.КонтрПроцНМ Цикл 
		Для Каждого Стр1 Из ДанныеУведомления.ДанныеМногостраничныхРазделов.СвИнфСист Цикл 
			Если Стр0.Значение.УИД <> Стр1.Значение.УИДРодителя Тогда 
				Продолжить;
			КонецЕсли;
			
			НомерПП = НомерПП + 1;
			ЗаполнитьЗначенияСвойств(Строка.Параметры, Стр0.Значение);
			ЗаполнитьЗначенияСвойств(Строка.Параметры, Стр1.Значение);
			Строка.Параметры["КодИС"] = КодИС(Стр1.Значение);
			Строка.Параметры["НомерПП"] = Формат(НомерПП, "ЧГ=");
			ПечатнаяФорма.Вывести(Строка);
		КонецЦикла;
	КонецЦикла;
	
	Подвал.Параметры.Дата = Формат(Титульная.ДАТА_ПОДПИСИ, "ДЛФ=DD");
	Подвал.Параметры.Документ = Титульная.НаимДок;
	Подвал.Параметры.Должность = "" + Титульная.ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ + ", " + Титульная.Долж;
	ПечатнаяФорма.Вывести(Подвал);
	
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, 1, Ложь);
	Возврат Листы;
КонецФункции
#КонецОбласти
#КонецЕсли
