
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
Функция ПолучитьВозможныеПустыеСсылки() Экспорт

	ПустыеСсылки = Новый Массив;
	Для каждого ДоступныйТип Из Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип.Типы() Цикл	
		ПустыеСсылки.Добавить(ОбщегоНазначенияКлиентСерверУХ.ПустоеЗначениеТипа(ДоступныйТип));
	КонецЦикла;
	
	Возврат ПустыеСсылки;

КонецФункции

Функция ПолучитьШаблонТаблицыРеквизитов()
	
	ТаблицаРеквизитов=Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("Имя",ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаРеквизитов.Колонки.Добавить("Синоним",ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ТаблицаРеквизитов.Колонки.Добавить("ТипДанных",ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат ТаблицаРеквизитов;

КонецФункции // ПолучитьШаблонТаблицыРеквизитов()

Функция ПолучитьТаблицуРеквизитовСинхронизации(ТипЗначения, ТолькоПримитивные = Ложь) Экспорт
	
	ПолеСиноним=РаботаСОбъектамиМетаданныхУХ.ПолучитьПолеСиноним();
	
	ТекстЗапроса="";
	СоответствиеОбъектов=Новый Соответствие;
	СоответствиеОбъектов.Вставить("Справочник",				"Справочник.СправочникиБД");
	СоответствиеОбъектов.Вставить("Документ",				"Справочник.ДокументыБД");
	СоответствиеОбъектов.Вставить("ПланВидовХарактеристик",	"Справочник.ПланыВидовХарактеристикБД");
	
	Если НЕ ТипЗначения=Тип("Строка") Тогда
		
		СтрокаТипов=РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьСтрокуТиповДанныхБД(Неопределено,ТипЗначения);
		
	Иначе
		
		СтрокаТипов=ТипЗначения;
		
	КонецЕсли;	
	
	МассивТипов = СтрРазделить(СтрокаТипов, ";");
	ТекстЗапроса = "";
	
	ЕстьПеречисление=Ложь;
	КоличествоСсылочных=0;
	
	Запрос=Новый Запрос;
		
	Для Каждого СтрТип ИЗ МассивТипов Цикл
		
		МассивСтрок = СтрРазделить(СтрТип, ".");
		
		Если МассивСтрок[0]="Перечисление" Тогда
			
			ЕстьПеречисление=Истина;
			Продолжить;
			
		Иначе
			
			ИмяТаблицы=СоответствиеОбъектов[МассивСтрок[0]];
			
			Если ИмяТаблицы=Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			КоличествоСсылочных=КоличествоСсылочных+1;
			
			ТекстЗапроса=ТекстЗапроса+"
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	ТаблицаРеквизитов.Имя КАК Имя,
			|	ВЫРАЗИТЬ(ТаблицаРеквизитов."+ПолеСиноним+" КАК СТРОКА(1000)) КАК Синоним,
			|	ВЫРАЗИТЬ(ТаблицаРеквизитов.ТипДанных КАК СТРОКА(1000)) КАК ТипДанных,
			|	1 КАК Вхождение
			|ИЗ "+ИмяТаблицы+".Реквизиты КАК ТаблицаРеквизитов
			|ГДЕ ТаблицаРеквизитов.Ссылка.Владелец=Значение(Справочник.ТипыБазДанных.ТекущаяИБ)
			|И ТаблицаРеквизитов.Ссылка.Наименование="""+МассивСтрок[1]+"""";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрДлина(ТекстЗапроса)=0 Тогда
		
		ТаблицаРеквизитов=ПолучитьШаблонТаблицыРеквизитов();
		
		Если ЕстьПеречисление Тогда
			
			НоваяСтрока=ТаблицаРеквизитов.Добавить();
			НоваяСтрока.Имя="Наименование";
			НоваяСтрока.Синоним=Нстр("ru = 'Наименование';en = 'Name'; tr = 'Tanım'");
			
		КонецЕсли;
		
		Возврат ТаблицаРеквизитов;
		
	КонецЕсли;
			
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|РеквизитыСвод.Имя,
	|РеквизитыСвод.Синоним,
	|РеквизитыСвод.ТипДанных,
	|СУММА(РеквизитыСвод.Вхождение) КАК Вхождение
	|ИЗ ("+Сред(ТекстЗапроса,СтрДлина("ОБЪЕДИНИТЬ ВСЕ") + 2)+") КАК РеквизитыСвод
	|СГРУППИРОВАТЬ ПО РеквизитыСвод.Имя,РеквизитыСвод.Синоним,РеквизитыСвод.ТипДанных
	|ИМЕЮЩИЕ СУММА(РеквизитыСвод.Вхождение)="+КоличествоСсылочных+";";
	
	ТаблицаРеквизитов=Запрос.Выполнить().Выгрузить();
	
	Если ЕстьПеречисление Тогда
		
		Если ТаблицаРеквизитов.Количество()=0 Тогда
			
			НоваяСтрока=ТаблицаРеквизитов.Добавить();
			НоваяСтрока.Имя="Наименование";
			НоваяСтрока.Синоним=Нстр("ru = 'Наименование';en = 'Name'; tr = 'Tanım'");
			
			Возврат ТаблицаРеквизитов;
			
		Иначе
			
			ТаблицаРеквизитов.Очистить();
			Возврат ТаблицаРеквизитов;
			
		КонецЕсли;
					
	ИначеЕсли НЕ ТолькоПримитивные Тогда
		
		Возврат ТаблицаРеквизитов;
		
	Иначе
		
		ТаблицаПримитивных=ТаблицаРеквизитов.СкопироватьКолонки();
		
		Для Каждого Строка ИЗ ТаблицаРеквизитов Цикл
			
			Если (Строка.ТипДанных = "Строка" ИЛИ СтрНачинаетсяС(Строка.ТипДанных,"Строка(")
				ИЛИ Строка.ТипДанных = "Дата" ИЛИ СтрНачинаетсяС(Строка.ТипДанных,"Дата(")
				ИЛИ Строка.ТипДанных = "Число" ИЛИ СтрНачинаетсяС(Строка.ТипДанных,"Число(")
				ИЛИ Строка.ТипДанных = "Булево") Тогда
				
				НоваяСтрока=ТаблицаПримитивных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ТаблицаПримитивных;
		
	КонецЕсли;	
	
КонецФункции // ПолучитьТаблицуРеквизитовСинхронизации()

Функция ПолучитьВидыСубконтоПоТипуЧерезСубконтоСчетов(ПолноеИмяМетаданных) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаБДВидыСубконто.ВидСубконтоСсылка КАК ВидСубконтоСсылка
	|ИЗ
	|	Справочник.СчетаБД.ВидыСубконто КАК СчетаБДВидыСубконто
	|ГДЕ
	|	СчетаБДВидыСубконто.ТипДанных ПОДОБНО &ПолноеИмяМетаданных
	|	И СчетаБДВидыСубконто.Ссылка.Владелец = &ПланСчетовБД
	|	И СчетаБДВидыСубконто.ВидСубконтоСсылка <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("ПолноеИмяМетаданных", ПолноеИмяМетаданных);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидСубконтоСсылка");
	
КонецФункции

Функция ПолучитьОписаниеТиповСтрокой(ЗначениеОписаниеТипов) Экспорт

	Результат = Новый Массив;
	
	Для каждого ТекущийТип Из ЗначениеОписаниеТипов.Типы() Цикл	
		Результат.Добавить(Метаданные.НайтиПоТипу(ТекущийТип).ПолноеИмя());	
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, ",");

КонецФункции

// Функция возвращает ПВХ по описанию типа
Функция ПолучитьПоОписаниюТипов(ОписаниеТипа) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыСубконтоКорпоративные.Ссылка КАК Ссылка,
	|	ВидыСубконтоКорпоративные.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.ВидыСубконтоКорпоративные КАК ВидыСубконтоКорпоративные";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ОписаниеТипа = Выборка.ТипЗначения Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьПоТипам(ТипыДляПоиска) Экспорт

	Результат = Новый Соответствие;
	Для каждого ТекущийТип Из ТипыДляПоиска Цикл
		Результат.Вставить(ТекущийТип, Новый Массив);
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыСубконтоКорпоративные.Ссылка КАК Ссылка,
	|	ВидыСубконтоКорпоративные.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.ВидыСубконтоКорпоративные КАК ВидыСубконтоКорпоративные");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		Для каждого ТекущийТип Из ТипыДляПоиска Цикл			
			
			Если Не Выборка.ТипЗначения.СодержитТип(ТекущийТип) Тогда
				Продолжить;
			КонецЕсли;
			
			СубконтоПоТипу = Результат.Получить(ТекущийТип);
			СубконтоПоТипу.Добавить(Выборка.Ссылка);
			Результат.Вставить(ТекущийТип, СубконтоПоТипу);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВозможныйКодПВХ(ПроектКода,Знач ДлинаКода,ИмяПВХ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПланыВидовХарактеристик[ИмяПВХ].НайтиПоКоду(ПроектКода)) Тогда
		Возврат ПроектКода;
	КонецЕсли;
	
	Если ДлинаКода=0 Тогда
		
		Если ПустаяСтрока(ИмяПВХ) Тогда
			ДлинаКода=20;
		Иначе
			ДлинаКода=Метаданные.ПланыВидовХарактеристик[ИмяПВХ].ДлинаКода;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(ПроектКода)) - ДлинаКода < -2 Тогда
		ТекПрефикс2 = СокрЛП(ПроектКода);
		ТекПрефикс3 = СокрЛП(ПроектКода);
	Иначе
		ТекПрефикс2 = Лев(СокрЛП(ПроектКода), ДлинаКода - 2);
		ТекПрефикс3 = Лев(СокрЛП(ПроектКода), ДлинаКода - 3);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТекПВХ.Код КАК Код,
	|	ВЫБОР
	|		КОГДА ТекПВХ.Код ПОДОБНО &Префикс3
	|			ТОГДА 3
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК РазрядностьНомера
	|ИЗ
	|	ПланВидовХарактеристик."+ИмяПВХ+" КАК ТекПВХ
	|ГДЕ
	|(ТекПВХ.Код ПОДОБНО &Префикс2
	|			ИЛИ ТекПВХ.Код ПОДОБНО &Префикс3)";
	
	ТекстЗапроса=ТекстЗапроса+"
	|УПОРЯДОЧИТЬ ПО
	|	РазрядностьНомера УБЫВ,
	|	Код УБЫВ";
	
	Запрос.УстановитьПараметр("Префикс2" , ТекПрефикс2 + "[0-9][0-9]%");
	Запрос.УстановитьПараметр("Префикс3" , ТекПрефикс3 + "[0-9][0-9][0-9]%");
	
	Запрос.Текст=ТекстЗапроса;
	
	Результат= Запрос.Выполнить().Выбрать();
	
	Если НЕ Результат.Следующий() Тогда
		Код = ТекПрефикс2 + "01";
		Возврат Код;
	КонецЕсли;
	
	МаксЗапись  = Результат.Код;
	
	Если ЗначениеЗаполнено(МаксЗапись) Тогда
		
		ТекРазрядностьНомера=Результат.РазрядностьНомера;
		МаксЗапись    = СокрЛП(МаксЗапись);
		ЧисловаяЧасть = Прав(МаксЗапись, ТекРазрядностьНомера);
		
		Попытка
			МаксЗначение = Число(ЧисловаяЧасть);
			
			НовоеЗначение=МаксЗначение+1;
			Если НовоеЗначение>=100 Тогда
				
				ТекРазрядностьНомера=3;
				
			КонецЕсли;
			
			Код = Лев(МаксЗапись, СтрДлина(МаксЗапись) - ТекРазрядностьНомера) + Формат(НовоеЗначение, "ЧЦ="+ТекРазрядностьНомера+"; ЧВН=");
		Исключение
			Код = Лев(МаксЗапись, СтрДлина(МаксЗапись) - ТекРазрядностьНомера) + ?(ТекРазрядностьНомера=2,"01","001");
		КонецПопытки;
		
	Иначе
		
		Код = ТекПрефикс2 + "01";
		
	КонецЕсли;
	
	Возврат Код;
	
КонецФункции // ПолучитьВозможныйКодПВХ()

#Область ОбновлениеПредопределенных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов справочника.
//  ТабличныеЧасти - Структура из КлючИЗначение - данные заполнения табличных частей.
//                                                Состав колонок соответствует набору реквизитов табличных частей.
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	
	ДобавитьСуществующиеЭлементы(Элементы, "НоменклатурныеГруппы", "СправочникСсылка.НоменклатурныеГруппы", "ru = 'Номенклатурные группы'", // @NStr-3
	"НГ00000000", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ОбъектыСтроительства", "СправочникСсылка.ОбъектыСтроительства", "ru = 'Объекты строительства'", // @NStr-3
	"ОбъектыСтр", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ПериодыОтчетов", "СправочникСсылка.Периоды", "ru = 'Периоды отчетов'", // @NStr-3
	"ПериодыОтч", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "РеализуемыеАктивыВГО", "СправочникСсылка.ОсновныеСредства,СправочникСсылка.НематериальныеАктивы,СправочникСсылка.РасходыБудущихПериодов,СправочникСсылка.НоменклатурныеГруппы,СправочникСсылка.ОбъектыСтроительства,СправочникСсылка.Номенклатура,СправочникСсылка.ЦенныеБумаги", "ru = 'Реализуемые активы ВГО'", // @NStr-3
	"РеалАктивы", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникБанки", "СправочникСсылка.Банки", "ru = 'Банки'", // @NStr-3
	"УХ00000002", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникБанковскиеСчета", "СправочникСсылка.БанковскиеСчета", "ru = 'Банковские счета (казначейство)'", // @NStr-3
	"УХ00000007", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникВалюты", "СправочникСсылка.Валюты", "ru = 'Валюты'", // @NStr-3
	"УХ00000014", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ВидыДвижений", "СправочникСсылка.ВидыДвиженийМСФО", "ru = 'Виды движений'", // @NStr-3
	"УХ00000027", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ВидыПерсонала", "СправочникСсылка.ПроизвольныйКлассификаторУХ", "ru = 'Виды персонала'", // @NStr-3
	"УХ00000038", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ВидыРасходов", "СправочникСсылка.ВидыРасходов", "ru = 'Виды расходов'", // @NStr-3
	"УХ00000044", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникДоговораКонтрагентов", "СправочникСсылка.ДоговорыКонтрагентов", "ru = 'Договоры контрагентов'", // @NStr-3
	"УХ00000090", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ЕдиницыИзмерения", "СправочникСсылка.ПроизвольныйКлассификаторУХ", "ru = 'Единицы измерения'", // @NStr-3
	"УХ00000101", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "Инициатор", "СправочникСсылка.Пользователи", "ru = 'Инициатор (казначейство)'", // @NStr-3
	"УХ00000105", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ИнтервалыЗадолженностей", "СправочникСсылка.ИнтервалыЗадолженностей", "ru = 'Интервалы задолженностей'", // @NStr-3
	"УХ00000106", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "КлассыДебиторов", "СправочникСсылка.ПроизвольныйКлассификаторУХ", "ru = 'Классы дебиторов'", // @NStr-3
	"УХ00000113", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникКонтрагенты", "СправочникСсылка.Контрагенты", "ru = 'Контрагенты'", // @NStr-3
	"УХ00000120", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ПриходРасход", "ПеречислениеСсылка.ВидыДвиженийПриходРасход", "ru = 'Направление движения денежных средств (казначейств'", // @NStr-3
	"УХ00000143", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "НМА", "СправочникСсылка.НематериальныеАктивы", "ru = 'Нематериальные активы'", // @NStr-3
	"УХ00000152", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникНоменклатура", "СправочникСсылка.Номенклатура", "ru = 'Номенклатура'", // @NStr-3
	"УХ00000160", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ОргСтруктура", "СправочникСсылка.Организации", "ru = 'Организационная структура'", // @NStr-3
	"УХ00000182", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ОрганизационныеЕдиницы", "СправочникСсылка.Организации", "ru = 'Организационные единицы'", // @NStr-3
	"УХ00000183", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ОС", "СправочникСсылка.ОсновныеСредства", "ru = 'Основные средства'", // @NStr-3
	"УХ00000188", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ПланСчетовБД", "СправочникСсылка.ПланыСчетовБД", "ru = 'План счетов БД'", // @NStr-3
	"УХ00000203", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ПодразделенияОрганизаций", "СправочникСсылка.ПодразделенияОрганизаций", "ru = 'Подразделения организаций'", // @NStr-3
	"УХ00000208", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ПоказателиОтчетов", "СправочникСсылка.ПоказателиОтчетов", "ru = 'Показатели отчетов'", // @NStr-3
	"УХ00000211", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ПричиныОграниченийПоРасчетнымСчетам", "СправочникСсылка.ПричиныОграниченийПоРасчетнымСчетам", "ru = 'Причины ограничений по расчетным счетам'", 
	"УХ00000218", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "Проекты", "СправочникСсылка.Проекты", "ru = 'Этапы проектов'", // @NStr-3
	"УХ00000220", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "РеестрДокументов", "СправочникСсылка.РеестрДокументов", "ru = 'Реестр документов'", // @NStr-3
	"УХ00000240", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "Ресурсы", "СправочникСсылка.ГруппыВНАМСФО,СправочникСсылка.Номенклатура", "ru = 'Ресурсы'", // @NStr-3
	"УХ00000244", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникСтатьиДДС", "СправочникСсылка.СтатьиДвиженияДенежныхСредств", "ru = 'Статьи ДДС (казначейство)'", // @NStr-3
	"УХ00000274", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникСтатьиЗатрат", "СправочникСсылка.СтатьиЗатрат", "ru = 'Статьи затрат'", // @NStr-3
	"УХ00000280", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СчетаБД", "СправочникСсылка.СчетаБД", "ru = 'Счета учета'", // @NStr-3
	"УХ00000302", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СчетаБД2", "СправочникСсылка.СчетаБД", "ru = 'Корр. счет'", // @NStr-3
	"УХ00000303", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ЦенныеБумаги", "СправочникСсылка.ЦенныеБумаги", "ru = 'Ценные бумаги'", // @NStr-3
	"УХ00000320", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "СправочникЦФО", "СправочникСсылка.Организации", "ru = 'ЦФО (казначейство)'", // @NStr-3
	"УХ00000323", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ЭлементыЗатрат", "ПеречислениеСсылка.ЭлементыЗатрат", "ru = 'Элементы затрат'", // @NStr-3
	"ЭлемЗатрат", КодыЯзыков);
	
	ДобавитьСуществующиеЭлементы(Элементы, "ВидВыручкиВГО", "СправочникСсылка.ВидыВыручкиВГО,СправочникСсылка.НоменклатурныеГруппы", "ru = 'Вид выручки ВГО'", // @NStr-3
	"УХ00000015", КодыЯзыков);
	
	// не БМ, НМ, ВЕ
	ДобавитьСуществующиеЭлементы(Элементы, "ПрочиеДоходыИРасходы", "СправочникСсылка.ПрочиеДоходыИРасходы", "ru = 'Прочие доходы и расходы'", // @NStr-3
	"ПДР0000000", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "МестаПоставки", "СправочникСсылка.МестаПоставки", "ru = 'Места поставки'", // @NStr-3
	"МестаПост0", КодыЯзыков);
	
	
	ДобавитьСуществующиеЭлементы(Элементы, "НоменклатураТоварныеГруппы", "СправочникСсылка.ТоварныеКатегории,СправочникСсылка.Номенклатура", "ru = 'Номенклатура и товарные группы'", // @NStr-3
	"НомТовГруп", КодыЯзыков);
	
	
	ДобавитьСуществующиеЭлементы(Элементы, "СтатьиБюджетов", "СправочникСсылка.СтатьиДоходовИРасходов,СправочникСсылка.СтатьиДвиженияРесурсов,СправочникСсылка.СтатьиДвиженияДенежныхСредств", "ru = 'Статьи бюджетов'", // @NStr-3
	"СтатьиБюдж", КодыЯзыков);
	
	
	ДобавитьСуществующиеЭлементы(Элементы, "СтатьиДоходовИРасходов", Строка("СправочникСсылка.СтатьиДоходовИРасходов"), "ru = 'Статьи доходов и расходов'", // @NStr-3
	"УХ00000277", КодыЯзыков);
	
	
	ДобавитьСуществующиеЭлементы(Элементы, "СтатьиДвиженияРесурсов", Строка("СправочникСсылка.СтатьиДвиженияРесурсов"), "ru = 'Статьи бюджета закупок'", // @NStr-3
	"УХ00000273", КодыЯзыков);

	
	ДобавитьСуществующиеЭлементы(Элементы, "ПлатежныйИнструмент", Строка("ПеречислениеСсылка.ВидыДенежныхСредств"), "ru = 'Платежный инструмент (казначейство)'", // @NStr-3
	"УХ00000204", КодыЯзыков);
	
	
	ДобавитьСуществующиеЭлементы(Элементы, "СрочностьЗадолженности", Строка("ПеречислениеСсылка.СрочностьЗадолженности"), "ru = 'Срочность задолженности'", // @NStr-3
	"УХ00000262", КодыЯзыков);

КонецПроцедуры

// Заполняет данные предопределенного элемента
//
// Параметры:
//  Элементы				- таблица значений для добавления передаётся из БСП
//  ИмяПредопределенного    - строка имя предопределенного (как в конфигураторе)
//  Типы					- строка со списком типов через запятую
//	Наименование			- наименование
//	Код						- код
//	КодыЯзыков				- массив языков передаётся из вызывающей процедуры БСП
//
Процедура ДобавитьСуществующиеЭлементы(Элементы, ИмяПредопределенного, Типы, Наименование, Код, КодыЯзыков)
	
	МассивТипов = Новый Массив;
	МассивСтрок = СтрРазделить(Типы, ",");
	Для каждого Эл Из МассивСтрок Цикл
		Поз = СтрНайти(Эл, ".");
		Если Поз <> 0 Тогда
			ИмяОбъекта = Сред(Эл, Поз + 1);
			Если Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено ИЛИ 
					Метаданные.Перечисления.Найти(ИмяОбъекта) <> Неопределено ИЛИ 
					Метаданные.ПланыВидовХарактеристик.Найти(ИмяОбъекта) <> Неопределено ИЛИ 
					Метаданные.ПланыСчетов.Найти(ИмяОбъекта) <> Неопределено Тогда
				МассивТипов.Добавить(Тип(Эл));
			ИначеЕсли МассивТипов.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
		Иначе
			МассивТипов.Добавить(Эл);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивТипов.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = ИмяПредопределенного;
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", Наименование, КодыЯзыков);
	Элемент.Код = Код;
КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.НастройкиХозяйственныхОпераций - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли