
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ СтроковыеФункцииКлиентСерверУХ.ЭтоКорректноеИмяПеременной(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Ошибка записи элемента: код элемента задан некорректно. Код не может начинаться с цифры или содержать символы, отличные от букв, цифр либо знака подчеркивания'"),,,Код, Отказ);		
	КонецЕсли;	
	
	Если СокрЛП(Код) = "Проекты" ИЛИ СокрЛП(Код) = "Организации" ИЛИ  СокрЛП(Код) = "Сценарии" ИЛИ СокрЛП(Код) = "Периоды" ИЛИ СокрЛП(Код) = "Валюты" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Ошибка записи элемента: код элемента задан некорректно. Код должен отличаться от имени ключевых измерений (Сценарии, Проекты, Валюты, Организации,Периоды)'"),,,Код, Отказ);		
	КонецЕсли;	
	
	ТаблицаАналитики = ОбщегоНазначенияУХ.ПолучитьСправочникПоВидуСубконто(Ссылка).ПолноеИмя();
	
	Если ТаблицаАналитики = "Справочник.ПроизвольныйКлассификаторУХ" Тогда
		
		ТипОбъектаКонсолидации = "ВидСубконто";
		ИмяОбъектаМетаДанных = Ссылка;
		
	Иначе
		
		ДанныеОбъекта = СтрРазделить(ТаблицаАналитики, ".");
		ТипОбъектаКонсолидации	= ДанныеОбъекта[0];
		ИмяОбъектаМетаДанных 	= ДанныеОбъекта[1];
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПравилаОбработки.Ссылка
	|ИЗ
	|	Справочник.ПравилаОбработки КАК ПравилаОбработки
	|ГДЕ
	|	ПравилаОбработки.ТипБД В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СоответствиеВнешнимИБ.Владелец
	|			ИЗ
	|				Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|			ГДЕ
	|				СоответствиеВнешнимИБ.ТипОбъектаКонсолидации = &ТипОбъектаКонсолидации
	|				И СоответствиеВнешнимИБ.ИмяОбъектаМетаданных = &ИмяОбъектаМетаданных)";
	
	Запрос.УстановитьПараметр("ТипОбъектаКонсолидации",	ТипОбъектаКонсолидации);
	Запрос.УстановитьПараметр("ИмяОбъектаМетаданных",	ИмяОбъектаМетаданных);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		УправлениеОтчетамиУХ.ОчиститьЗаписиРегистраПараметрическихНастроек(Результат.Ссылка);
	КонецЦикла;
		
КонецПроцедуры   

Функция ПеревестиКодТранслитом(ПроектКода) Экспорт
	
	Правила=Новый Соответствие;
	Правила.Вставить("а","a"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("б","b"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("в","v"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("г","g"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("д","d"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("е","e"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ё","e"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ж","zh");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("з","z"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("и","i"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("й","y"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("к","k"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("л","l"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("м","m"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("н","n"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("о","o"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("п","p"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("р","r"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("с","s"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("т","t"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("у","u"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ф","f"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("х","kh");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ц","ts");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ч","ch");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ш","sh");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("щ","shch");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ъ","hrd"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ы","y");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ь","sft"); // @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("э","e");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("ю","yu");// @Non-NLS-1 @Non-NLS-2
	Правила.Вставить("я","ya");// @Non-NLS-1 @Non-NLS-2
	
	Возврат ОбщегоНазначенияСлужебныйКлиентСервер.СтрокаЛатиницей(ПроектКода, Правила);	
	
КонецФункции // ПеревестиКодТранслитом()

Процедура СформироватьКодПВХ(ПроектКода) Экспорт

	ДанныеДляФормул=ДополнительныеЯзыкиПовтИспУХ.ПолучитьДанныеДляФормул();
	
	Если ДанныеДляФормул.КодЯзыка="en" Тогда
		
		ПроектКода=Лев(ПеревестиКодТранслитом(ПроектКода),Метаданные().ДлинаКода);
		
	КонецЕсли;
	
	ТекКод = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.ПолучитьВозможныйКодПВХ(ПроектКода, Метаданные().ДлинаКода, "ВидыСубконтоКорпоративные");
	
	Код  = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ТекКод,Метаданные().ДлинаКода,"0","Справа");

	
КонецПроцедуры // СформироватьКодПВХ() 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		ТипЗначения_ = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(Ссылка, "ТипЗначения");
		Если НЕ ТипЗначения = ТипЗначения_ И ЗначениеЗаполнено(ТипЗначения_) Тогда
			ДополнительныеСвойства.Вставить("ТипЗначения", ТипЗначения_);
		КонецЕсли;
	КонецЕсли;
	
	ПроизвольныйКласификаторУХ = (ТипЗначения.Типы()[0]=Тип("СправочникСсылка.ПроизвольныйКлассификаторУХ"));
	
	Если ПустаяСтрока(Код) Тогда
		
		ПроектКода=ОбщегоНазначенияУХ.СформироватьКодНаОснованииНаименования(Наименование,Метаданные().ДлинаКода);
		
		СформироватьКодПВХ(ПроектКода); 
					
	КонецЕсли;
		
	ЭтотОбъект.ПредставлениеТипа = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.ПолучитьОписаниеТиповСтрокой(ЭтотОбъект.ТипЗначения);
	
КонецПроцедуры
