 

Функция ВозможнаНастройкаСоответствия(ЗначениеПоля) Экспорт
	
	ТипЗначенияПоля=ТипЗнч(ЗначениеПоля);
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(ТипЗначенияПоля)
			ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗначенияПоля)
			ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначенияПоля)
			Или ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗначенияПоля);
	
КонецФункции // ВозможнаНастройкаСоответствия() 	

Процедура ЗагрузитьЗаявкиДочернихКомпаний(ДочерняяБаза=Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза КАК ДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаРодитель КАК ЗаявкаРодитель
	             |ПОМЕСТИТЬ ЗаявкиКОбработке
	             |ИЗ
	             |	РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
	             |ГДЕ
	             |	НЕ СоответствиеЗаявокНаИзменениеНСИ.ОбменВыполнен
	             |	И &Параметр1
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаявкиКОбработке.ДочерняяБаза КАК ДочерняяБаза
	             |ИЗ
	             |	ЗаявкиКОбработке КАК ЗаявкиКОбработке
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаявкиКОбработке.ДочерняяБаза КАК ДочерняяБаза,
	             |	ЗаявкиКОбработке.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза,
				 |	ЗаявкиКОбработке.ЗаявкаРодитель КАК ЗаявкаРодитель
	             |ИЗ
	             |	ЗаявкиКОбработке КАК ЗаявкиКОбработке";
	
	Если ЗначениеЗаполнено(ДочерняяБаза) Тогда
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза=&ДочерняяБаза");
		Запрос.УстановитьПараметр("ДочерняяБаза",ДочерняяБаза);
		
	Иначе
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","ИСТИНА");
		
	КонецЕсли; 
	
	Запрос.Текст=ТекстЗапроса;
	
	Результат=Запрос.ВыполнитьПакет();
	
	ТабАдресации=Результат[1].Выгрузить();
	ТабЗаявок=Результат[2].Выгрузить(); 
	
	Для Каждого Строка ИЗ ТабАдресации Цикл
		
		ЕстьОшибки=Ложь;
		
		ТаблицаОбмена=ТабЗаявок.Скопировать(Новый Структура("ДочерняяБаза",Строка.ДочерняяБаза));
		
		ДанныеЗаявок=ПолучитьДанныеЗаявок(Строка.ДочерняяБаза,ТаблицаОбмена);
		
		Если ОбработатьДанныеЗаявок(Строка.ДочерняяБаза,ДанныеЗаявок,ЕстьОшибки) Тогда
					
			ОтметитьОбменВыполнен(ТаблицаОбмена);
			
		КонецЕсли;
		
		Если ЕстьОшибки Тогда
			
			ОписаниеЗадания=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Выгрузка ошибок загрузки заявок на изменение НСИ, внешняя ИБ %1'"),Строка.ДочерняяБаза);
			КлючЗадания=Новый УникальныйИдентификатор;
			
			ПараметрыЗадания=Новый Массив;
			ПараметрыЗадания.Добавить(Строка.ДочерняяБаза);
			
			ФоновыеЗадания.Выполнить("ОбменДаннымиНСИУХ.ВыгрузитьОшибкиЗагрузкиЗаявокДочернихКомпаний",ПараметрыЗадания,КлючЗадания,ОписаниеЗадания);
			
		КонецЕсли;	
			
	КонецЦикла;
	
	
КонецПроцедуры // ЗагрузитьЗаявкиДочернихКомпаний()

Функция ПолучитьРабочуюТаблицуПоДаннымПереноса(ДочерняяБаза,ДанныеДляПереноса,РабочаяТаблица=Неопределено,Организация=Неопределено) Экспорт
	
	Перем ТолькоПроверка;
	
	ДанныеДляПереноса.Свойство("ТолькоПроверка",ТолькоПроверка);
	
	Если ДанныеДляПереноса.Свойство("ПодготовитьДляПомещенияВЗапрос") И РабочаяТаблица=Неопределено Тогда
		
		РабочаяТаблица=ИнтеграцияСВнешнимиСистемамиУХ.ПолучитьРабочуюТаблицуДляЗапроса(ДанныеДляПереноса.ТаблицаПереноса);
		
	КонецЕсли;
	
	Если ДанныеДляПереноса.ТаблицаЗначенийПолей.Количество()=0 Тогда
		
		Если РабочаяТаблица=Неопределено  Тогда
			
			Возврат ДанныеДляПереноса.ТаблицаПереноса; 
			
		Иначе
			
			ОбщегоНазначенияУХ.ЗагрузитьВТаблицуЗначений(ДанныеДляПереноса.ТаблицаПереноса,РабочаяТаблица);
			Возврат РабочаяТаблица;
			
		КонецЕсли;
		
	Иначе
		
		СоответствиеСсылок=ПолучитьСоответствиеСсылок(ДочерняяБаза,ДанныеДляПереноса.ТаблицаЗначенийПолей,Организация,ТолькоПроверка=Истина); 
		
		Возврат ПолучитьРабочуюТаблицу(ДанныеДляПереноса.ТаблицаПереноса,СоответствиеСсылок,РабочаяТаблица);
		
	КонецЕсли;
		
КонецФункции // ПолучитьРабочуюТаблицуПоДаннымПереноса() 

Функция ОбработатьДанныеЗаявок(ДочерняяБаза,ДанныеЗаявок,ЕстьОшибки)
	
	ТаблицаЗначенийПолей=ДанныеЗаявок.Шапка.ТаблицаЗначенийПолей;
	
	ОбщегоНазначенияУХ.ЗагрузитьВТаблицуЗначений(ДанныеЗаявок.ИзменениеРеквизитов.ТаблицаЗначенийПолей,ТаблицаЗначенийПолей);
	
	Для Каждого Строка ИЗ ДанныеЗаявок.ИзменениеТЧ Цикл
		
		ОбщегоНазначенияУХ.ЗагрузитьВТаблицуЗначений(Строка.НовоеЗначение.ТаблицаЗначенийПолей,ТаблицаЗначенийПолей);
		
	КонецЦикла;
	
	ТаблицаЗначенийПолей.Свернуть("GUID,ТаблицаАналитикиВИБ,ПредставлениеGUID");
	
	СоответствиеСсылок=ПолучитьСоответствиеСсылок(ДочерняяБаза,ТаблицаЗначенийПолей,Неопределено);
	
	ДанныеДокументов=Новый Структура;
	ДанныеДокументов.Вставить("Шапка",ПолучитьРабочуюТаблицу(ДанныеЗаявок.Шапка.ТаблицаПереноса,СоответствиеСсылок));
	ДанныеДокументов.Шапка.Колонки.Добавить("ЗаявкаЦентральнаяБаза"); 
	ДанныеДокументов.Шапка.Сортировать("ЕстьРодитель Убыв, Номер Убыв");
	
	ДанныеДокументов.Вставить("ИзменениеРеквизитов",ПолучитьРабочуюТаблицу(ДанныеЗаявок.ИзменениеРеквизитов.ТаблицаПереноса,СоответствиеСсылок));
	
	ИзменениеТЧ=Новый ТаблицаЗначений;		
	ИзменениеТЧ.Колонки.Добавить("НаименованиеТЧ");
	ИзменениеТЧ.Колонки.Добавить("НовоеЗначение");
	ИзменениеТЧ.Колонки.Добавить("Ссылка");
	
	Для Каждого Строка ИЗ ДанныеЗаявок.ИзменениеТЧ Цикл
		
		НоваяСтрока=ИзменениеТЧ.Добавить();
		
		НоваяСтрока.НаименованиеТЧ	= Строка.НаименованиеТЧ;
		НоваяСтрока.Ссылка			= Строка.Ссылка;
		НоваяСтрока.НовоеЗначение	= ПолучитьРабочуюТаблицу(Строка.НовоеЗначение.ТаблицаПереноса,СоответствиеСсылок);
		
	КонецЦикла;

	ДанныеДокументов.Вставить("ИзменениеТЧ",ИзменениеТЧ);
	
	ОбработатьДанныеЗаявокНаИзменениеНСИ(ДанныеДокументов,ДочерняяБаза,ЕстьОшибки);
	
	Возврат Истина;
	
КонецФункции // ОбработатьДанныеЗаявок() 

Функция ПолучитьОписаниеОбъектаТек(ДочерняяБаза,ТипОбъектаВИБ,ИмяОбъектаВИБ)
	
	ТипБД=ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДочерняяБаза,"ТипБД");
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаТек КАК ОписаниеОбъектаТек
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|ГДЕ
	|	СоответствиеВнешнимИБ.Владелец = &ТипБД
	|	И НЕ СоответствиеВнешнимИБ.НеИспользоватьПриИмпорте
	|	И СоответствиеВнешнимИБ.ТаблицаАналитикиВИБ = &ТаблицаАналитикиВИБ"; 
	
	Запрос.УстановитьПараметр("ТипБД",ТипБД);
	Запрос.УстановитьПараметр("ТаблицаАналитикиВИБ",?(ПустаяСтрока(ТипОбъектаВИБ),"Справочник",ТипОбъектаВИБ)+"."+ИмяОбъектаВИБ);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.ОписаниеОбъектаТек;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ПолучитьОписаниеОбъектаТек()

Процедура ЗаписатьИнформациюОшибкиЗагрузки(ТекстОшибки,СтрокаЗаявка,НаборЗаписей,ЕстьОшибки)
	
	СтрокаЗаявка.ИнформацияОбОшибке=ТекстОшибки;
	СтрокаЗаявка.ОбменВыполнен=Истина;
	СтрокаЗаявка.ЕстьОшибкиОбмена=Истина;
	СтрокаЗаявка.ТребуетсяПередачаСтатуса=Истина;
	ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрокаЗаявка.ИнформацияОбОшибке,,,СтатусСообщения.Важное);
	НаборЗаписей.Записать(); 
	
	ЕстьОшибки=Истина;
	
КонецПроцедуры // ЗаписатьИнформациюОшибкиЗагрузки()

Процедура ОбработатьДанныеЗаявокНаИзменениеНСИ(ДанныеДокументов,ДочерняяБаза,ЕстьОшибки)
	
	Для Каждого СтрокаШапка ИЗ ДанныеДокументов.Шапка Цикл 
		
		НаборЗаписей=РегистрыСведений.СоответствиеЗаявокНаИзменениеНСИ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДочерняяБаза.Установить(ДочерняяБаза);
		НаборЗаписей.Отбор.ЗаявкаДочерняяБаза.Установить(СтрокаШапка.Ссылка);
		
		НаборЗаписей.Прочитать();
		СтрокаЗаявка=НаборЗаписей[0];
		
		ПринятьКОбработке=НЕ СтрокаШапка.ЕстьРодитель; 
		ТаблицаАналитики=СтрокаШапка.ТипОбъектаКонсолидации+"."+СтрокаШапка.ИмяОбъектаМетаданных;
        ТекстПредставления=Нстр("ru = 'Заявка с видом операции %1 №%2 от %3, внешняя информационная база %4, объект %5'");
		ПредставлениеЗаявки=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредставления,
					СтрокаШапка.ВидОперации,СтрокаШапка.Номер,СтрокаШапка.Дата,ДочерняяБаза,ТаблицаАналитики);

			
		Если ЗначениеЗаполнено(СтрокаЗаявка.ЗаявкаЦентральнаяБаза) Тогда
			
			Если СтрокаЗаявка.Состояние=Перечисления.СостоянияСогласования.НаУтверждении
				Или СтрокаЗаявка.Состояние=Перечисления.СостоянияСогласования.Утверждена Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ДокументОбъект=СтрокаЗаявка.ЗаявкаЦентральнаяБаза.ПолучитьОбъект();
			
		Иначе
			
			СправочникБД=ПолучитьОписаниеОбъектаТек(ДочерняяБаза,СтрокаШапка.ТипОбъектаКонсолидации,СтрокаШапка.ИмяОбъектаМетаданных);
			
			Если СправочникБД=Неопределено Тогда
								
				ТекстОшибки=Нстр("ru = ' не найдена настройка соответствия для объекта %1 внешней информационной базы %2'");
				
				ЗаписатьИнформациюОшибкиЗагрузки(ПредставлениеЗаявки+": "+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТаблицаАналитики,ДочерняяБаза),
						СтрокаЗаявка,НаборЗаписей,ЕстьОшибки);
				Продолжить;
				
			КонецЕсли;
			
			ДокументОбъект=Документы.ЗаявкаНаИзменениеНСИ.СоздатьДокумент();
			ДокументОбъект.СправочникБД=СправочникБД;
			ДокументОбъект.ДочерняяБаза=ДочерняяБаза;
			ДокументОбъект.Дата=СтрокаШапка.Дата;
			ДокументОбъект.УстановитьНовыйНомер();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект,СтрокаШапка,,"Ссылка,Номер");
		
		Если Не ЗначениеЗаполнено(ДокументОбъект.ИзменяемыйОбъект) Тогда
			
			ТекстОшибки=ПредставлениеЗаявки+Нстр("ru = ': не удалось определить изменяемый объект.'");
			ЗаписатьИнформациюОшибкиЗагрузки(ТекстОшибки,СтрокаЗаявка,НаборЗаписей,ЕстьОшибки);
			Продолжить;
			
		КонецЕсли;			
		
		ДокументОбъект.ИзменениеРеквизитов.Очистить();
		ДокументОбъект.ИзменениеТЧ.Очистить();
		
		МассивРеквизиты=ДанныеДокументов.ИзменениеРеквизитов.НайтиСтроки(Новый Структура("Ссылка",СтрокаШапка.Ссылка));
		
		Для Каждого СтрокаРеквизит ИЗ МассивРеквизиты Цикл
			
			НоваяСтрока=ДокументОбъект.ИзменениеРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРеквизит);
			
		КонецЦикла;  
		
		МассивТЧ=ДанныеДокументов.ИзменениеТЧ.НайтиСтроки(Новый Структура("Ссылка",СтрокаШапка.Ссылка));
		
		ЕстьОписанияТЧ=Истина;
		
		Для Каждого СтрокаТЧ ИЗ МассивТЧ Цикл
			
			ТабличнаяЧасть=ПолучитьОписаниеТабличнойЧастиБД(ДокументОбъект.СправочникБД,СтрокаТЧ.НаименованиеТЧ);
			
			Если ТабличнаяЧасть=Неопределено Тогда
				
				ЕстьОписанияТЧ=Ложь;
				Прервать;
				
			КонецЕсли;
			
			НоваяСтрока=ДокументОбъект.ИзменениеТЧ.Добавить();
			НоваяСтрока.ТабличнаяЧасть=ТабличнаяЧасть;
			НоваяСтрока.НовоеЗначение=Новый ХранилищеЗначения(СтрокаТЧ.НовоеЗначение);
			
		КонецЦикла; 
		
		Если НЕ ЕстьОписанияТЧ Тогда
			
			ТекстОшибки=Нстр("ru = ' не удалось получить описание изменений табличной части %1'");
			ЗаписатьИнформациюОшибкиЗагрузки(ПредставлениеЗаявки+": "+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,СтрокаТЧ.НаименованиеТЧ),
					СтрокаЗаявка,НаборЗаписей,ЕстьОшибки);
			Продолжить;
			
		КонецЕсли;
		
		ТаблицаСвязанныхЗаявок=ПолучитьТаблицуСвязанныхЗаявок(СтрокаШапка.Ссылка); 
		
		Если ТаблицаСвязанныхЗаявок.Количество()>0 Тогда
			
			ЗаявкиЗагружены=Истина;
			ТекстСообщения=ПредставлениеЗаявки+Нстр("ru = ': не загружены связанные заявки'");
			
			Для Каждого СвязаннаяЗаявка ИЗ ТаблицаСвязанныхЗаявок Цикл
				
				Если СвязаннаяЗаявка.ЗаявкаЦентральнаяБаза=Неопределено Тогда
					
					ТекстОшибки=Нстр("ru = '№%1 от %2'");
					ТекстСообщения=ТекстСообщения+Символы.ПС+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,СвязаннаяЗаявка.Номер,СвязаннаяЗаявка.Дата);
					ЗаявкиЗагружены=Ложь;
					
				ИначеЕсли ДокументОбъект.ЗаявкиНаИзменениеСвязанныхОбъектов.Найти(СвязаннаяЗаявка.ЗаявкаЦентральнаяБаза,"ЗаявкаНаСвязанныйОбъект")=Неопределено Тогда
					
					НоваяСтрока=ДокументОбъект.ЗаявкиНаИзменениеСвязанныхОбъектов.Добавить();
					НоваяСтрока.ЗаявкаНаСвязанныйОбъект=СвязаннаяЗаявка.ЗаявкаЦентральнаяБаза;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗаявкиЗагружены Тогда
				
				ЗаписатьИнформациюОшибкиЗагрузки(ТекстСообщения,СтрокаЗаявка,НаборЗаписей,ЕстьОшибки);
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			
			ДокументОбъект.Записать();
						
			СтрокаЗаявка.ЗаявкаЦентральнаяБаза=ДокументОбъект.Ссылка;
			СтрокаЗаявка.ОбменВыполнен=Истина;
			СтрокаЗаявка.ЕстьОшибкиОбмена=Ложь;
			СтрокаЗаявка.ИнформацияОбОшибке="";
			СтрокаЗаявка.ТребуетсяПередачаСтатуса=Ложь;
			НаборЗаписей.Записать();
			
			СтрокаШапка.ЗаявкаЦентральнаяБаза=СтрокаЗаявка.ЗаявкаЦентральнаяБаза;
			
		Исключение
			
			ЗаписатьИнформациюОшибкиЗагрузки(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),СтрокаЗаявка,НаборЗаписей,ЕстьОшибки);
			Продолжить;
			
		КонецПопытки; 
		
		Если ПринятьКОбработке Тогда 
			
			Если ДокументОбъект.ЗаявкиНаИзменениеСвязанныхОбъектов.Количество()=0 Тогда
				
				МодульУправленияПроцессамиУХ.ПринятьКОбработке(,ДокументОбъект.Ссылка);
				
			Иначе
				
				СпособСогласования=ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.СправочникБД,"СогласованиеСвязанныхОбъектов");
				
				Если СпособСогласования=Перечисления.СпособыСогласованияСвязанныхОбъектов.СогласовыватьСинхронно Тогда
					
					МодульУправленияПроцессамиУХ.ПринятьКОбработке(,ДокументОбъект.Ссылка);
					
				Иначе
					
					Для Каждого СтрокаЗаявка ИЗ ДокументОбъект.ЗаявкиНаИзменениеСвязанныхОбъектов Цикл
						МодульУправленияПроцессамиУХ.ПринятьКОбработке(,СтрокаЗаявка.ЗаявкаНаСвязанныйОбъект);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры // ОбработатьДанныеЗаявокНаИзменениеНСИ()

Функция ПолучитьТаблицуСвязанныхЗаявок(ЗаявкаРодитель)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаЦентральнаяБаза КАК ЗаявкаЦентральнаяБаза,
	|	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБазаНомер КАК Номер,
	|	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБазаДата КАК Дата
	|ИЗ
	|	РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
	|ГДЕ
	|	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаРодитель = &ЗаявкаРодитель";
	
	Запрос.УстановитьПараметр("ЗаявкаРодитель",ЗаявкаРодитель);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции // ПолучитьМассивСвязанныхЗаявок() 


Функция ПолучитьОписаниеТабличнойЧастиБД(Владелец,НаименованиеТЧ)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ТабличныеЧастиБД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТабличныеЧастиБД КАК ТабличныеЧастиБД
	|ГДЕ
	|	ТабличныеЧастиБД.Владелец = &Владелец
	|	И ТабличныеЧастиБД.Имя = &Наименование";
	
	Запрос.УстановитьПараметр("Владелец",Владелец);
	Запрос.УстановитьПараметр("Наименование",НаименованиеТЧ);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.Ссылка;
		
	Иначе
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Для объекта %1 не найдена табличная часть %2'"),Владелец,НаименованиеТЧ),,,СтатусСообщения.Важное);
        Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции // ПолучитьОписаниеТабличнойЧастиБД() 
 

Функция ПолучитьРабочуюТаблицу(ИсходнаяТаблица,СоответствиеСсылок,РабочаяТаблица=Неопределено)
	
	Если РабочаяТаблица=Неопределено Тогда
		
		РабочаяТаблица=ИсходнаяТаблица.СкопироватьКолонки();
		
	КонецЕсли;
	
	КоличествоКолонок=ИсходнаяТаблица.Колонки.Количество();
	
	Для Каждого Строка ИЗ ИсходнаяТаблица Цикл
		
		НоваяСтрока=РабочаяТаблица.Добавить();
		
		Для Индекс=0 ПО КоличествоКолонок-1 Цикл
			
			ИсходноеЗначение=Строка[Индекс];
			
			Если ТипЗнч(ИсходноеЗначение)=Тип("Строка") И СтрНайти(ИсходноеЗначение,"_tt_")>0 Тогда
				
				НоваяСтрока[Индекс]=СоответствиеСсылок.Получить(ИсходноеЗначение);
				
			Иначе
				
				НоваяСтрока[Индекс]=ИсходноеЗначение;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Возврат РабочаяТаблица;
					
КонецФункции // ПолучитьРабочуюТаблицу()

Функция ПолучитьЗапросПоТаблицамВИБ(УзелИнформационнойБазы)
	
	Запрос=Новый Запрос;
	
	Если НЕ ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТаблицаЗначенийПолей.GUID КАК GUID,
		|	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID
		|ПОМЕСТИТЬ ТаблицаЗначенийПолей
		|ИЗ
		|	&ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
		|	СоответствиеВнешнимИБ.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	СоответствиеВнешнимИБ.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		|	СоответствиеВнешнимИБ.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ПОМЕСТИТЬ НастройкиСоответствия
		|ИЗ
		|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
		|ГДЕ
		|	СоответствиеВнешнимИБ.Владелец = &ТипБД
		|	И НЕ СоответствиеВнешнимИБ.НеИспользоватьПриИмпорте
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТаблицаЗначенийПолей.GUID КАК GUID,
		|	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID,
		|	ЕСТЬNULL(НастройкиСоответствия.НастройкаСоответствия, НЕОПРЕДЕЛЕНО) КАК НастройкаСоответствия,
		|	ЕСТЬNULL(НастройкиСоответствия.СинхронизацияПоGUID, ЛОЖЬ) КАК СинхронизацияПоGUID,
		|	НастройкиСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ПОМЕСТИТЬ ТабУстановленныеСоответствия
		|ИЗ
		|	ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСоответствия КАК НастройкиСоответствия
		|		ПО ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ = НастройкиСоответствия.ТаблицаАналитикиВИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ КАК ОбъектТекущейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ КАК ОбъектВнешнейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.НастройкаСоответствия КАК НастройкаСоответствия
		|ПОМЕСТИТЬ СоответствиеОбъектов
		|ИЗ
		|	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
		|ГДЕ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ = &ИспользуемаяИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТабУстановленныеСоответствия.GUID КАК GUID,
		|	ТабУстановленныеСоответствия.ПредставлениеGUID КАК ПредставлениеGUID,
		|	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		|	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		|	ЕСТЬNULL(СоответствиеОбъектов.ОбъектТекущейИБ, НЕОПРЕДЕЛЕНО) КАК ОбъектТекущейИБ,
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ИЗ
		|	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеОбъектов КАК СоответствиеОбъектов
		|		ПО ТабУстановленныеСоответствия.НастройкаСоответствия = СоответствиеОбъектов.НастройкаСоответствия
		|			И ТабУстановленныеСоответствия.GUID = СоответствиеОбъектов.ОбъектВнешнейИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		|	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ИЗ
		|	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия";
		
	Иначе 
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТаблицаЗначенийПолей.GUID КАК GUID,
		|	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID
		|ПОМЕСТИТЬ ТаблицаЗначенийПолей
		|ИЗ
		|	&ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
		|	СоответствиеВнешнимИБ.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	СоответствиеВнешнимИБ.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		|	СоответствиеВнешнимИБ.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ПОМЕСТИТЬ НастройкиСоответствия
		|ИЗ
		|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
		|ГДЕ
		|	СоответствиеВнешнимИБ.Владелец = &ТипБД
		|	И НЕ СоответствиеВнешнимИБ.НеИспользоватьПриИмпорте
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТаблицаЗначенийПолей.GUID КАК GUID,
		|	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID,
		|	ЕСТЬNULL(НастройкиСоответствия.НастройкаСоответствия, ЗНАЧЕНИЕ(Справочник.СоответствиеВнешнимИБ.ПустаяСсылка)) КАК НастройкаСоответствия,
		|	ЕСТЬNULL(НастройкиСоответствия.СинхронизацияПоGUID, ЛОЖЬ) КАК СинхронизацияПоGUID,
		|	НастройкиСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ПОМЕСТИТЬ ТабУстановленныеСоответствия
		|ИЗ
		|	ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСоответствия КАК НастройкиСоответствия
		|		ПО ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ = НастройкиСоответствия.ТаблицаАналитикиВИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ КАК ОбъектТекущейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ КАК ОбъектВнешнейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.НастройкаСоответствия КАК НастройкаСоответствия
		|ПОМЕСТИТЬ СоответствиеОбъектов
		|ИЗ
		|	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
		|ГДЕ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ = &ИспользуемаяИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор КАК Идентификатор,
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПубличныеИдентификаторы
		|ИЗ
		|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
		|ГДЕ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТабУстановленныеСоответствия.GUID КАК GUID,
		|	ТабУстановленныеСоответствия.ПредставлениеGUID КАК ПредставлениеGUID,
		|	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		|	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		|	ВЫБОР
		|		КОГДА СоответствиеОбъектов.ОбъектТекущейИБ ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ПубличныеИдентификаторы.Ссылка, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ СоответствиеОбъектов.ОбъектТекущейИБ
		|	КОНЕЦ КАК ОбъектТекущейИБ,
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ИЗ
		|	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеОбъектов КАК СоответствиеОбъектов
		|		ПО ТабУстановленныеСоответствия.НастройкаСоответствия = СоответствиеОбъектов.НастройкаСоответствия
		|			И ТабУстановленныеСоответствия.GUID = СоответствиеОбъектов.ОбъектВнешнейИБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПубличныеИдентификаторы КАК ПубличныеИдентификаторы
		|		ПО ТабУстановленныеСоответствия.GUID = ПубличныеИдентификаторы.Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		|	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		|	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		|	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		|ИЗ
		|	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия";
		
		Запрос.УстановитьПараметр("УзелИнформационнойБазы",УзелИнформационнойБазы);
			
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции // ПолучитьЗапросПоТаблицамВИБ() 

Функция ПолучитьЗапросПоТаблицамВИБиИменамНастроек(УзелИнформационнойБазы)
	
	Запрос=Новый Запрос;
	
	Если НЕ ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		
		Запрос.Текст="ВЫБРАТЬ
		             |	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТаблицаЗначенийПолей.НастройкаСоответствия КАК НаименованиеНастройки,
		             |	ТаблицаЗначенийПолей.GUID КАК GUID,
		             |	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID
		             |ПОМЕСТИТЬ ТаблицаЗначенийПолей
		             |ИЗ
		             |	&ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
		             |	СоответствиеВнешнимИБ.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	СоответствиеВнешнимИБ.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		             |	СоответствиеВнешнимИБ.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек,
		             |	СоответствиеВнешнимИБ.Наименование КАК Наименование,
		             |	СоответствиеВнешнимИБ.НеИспользоватьПриИмпорте КАК НеИспользоватьПриИмпорте
		             |ПОМЕСТИТЬ НастройкиСоответствия
		             |ИЗ
		             |	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
		             |ГДЕ
		             |	СоответствиеВнешнимИБ.Владелец = &ТипБД
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТаблицаЗначенийПолей.GUID КАК GUID,
		             |	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID,
		             |	ВЫБОР
		             |		КОГДА НЕ НастройкиСоответствияИмена.НастройкаСоответствия ЕСТЬ NULL
		             |			ТОГДА НастройкиСоответствияИмена.НастройкаСоответствия
		             |		ИНАЧЕ ЕСТЬNULL(НастройкиСоответствияТаблица.НастройкаСоответствия, ЗНАЧЕНИЕ(Справочник.СоответствиеВнешнимИБ.ПустаяСсылка))
		             |	КОНЕЦ КАК НастройкаСоответствия,
		             |	ВЫБОР
		             |		КОГДА НЕ НастройкиСоответствияИмена.НастройкаСоответствия ЕСТЬ NULL
		             |			ТОГДА НастройкиСоответствияИмена.СинхронизацияПоGUID
		             |		ИНАЧЕ ЕСТЬNULL(НастройкиСоответствияТаблица.СинхронизацияПоGUID, ЛОЖЬ)
		             |	КОНЕЦ КАК СинхронизацияПоGUID,
		             |	ВЫБОР
		             |		КОГДА НЕ НастройкиСоответствияИмена.НастройкаСоответствия ЕСТЬ NULL
		             |			ТОГДА НастройкиСоответствияИмена.ТаблицаАналитикиТек
		             |		ИНАЧЕ ЕСТЬNULL(НастройкиСоответствияТаблица.ТаблицаАналитикиТек, НЕОПРЕДЕЛЕНО)
		             |	КОНЕЦ КАК ТаблицаАналитикиТек
		             |ПОМЕСТИТЬ ТабУстановленныеСоответствия
		             |ИЗ
		             |	ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		             |		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСоответствия КАК НастройкиСоответствияТаблица
		             |		ПО ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ = НастройкиСоответствияТаблица.ТаблицаАналитикиВИБ
		             |			И (НЕ НастройкиСоответствияТаблица.НеИспользоватьПриИмпорте)
		             |		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСоответствия КАК НастройкиСоответствияИмена
		             |		ПО ТаблицаЗначенийПолей.НаименованиеНастройки = НастройкиСоответствияИмена.Наименование
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ КАК ОбъектТекущейИБ,
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ КАК ОбъектВнешнейИБ,
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.НастройкаСоответствия КАК НастройкаСоответствия
		             |ПОМЕСТИТЬ СоответствиеОбъектов
		             |ИЗ
		             |	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
		             |ГДЕ
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ = &ИспользуемаяИБ
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТабУстановленныеСоответствия.GUID КАК GUID,
		             |	ТабУстановленныеСоответствия.ПредставлениеGUID КАК ПредставлениеGUID,
		             |	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		             |	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек,
		             |	ЕСТЬNULL(СоответствиеОбъектов.ОбъектТекущейИБ, НЕОПРЕДЕЛЕНО) КАК ОбъектТекущейИБ
		             |ИЗ
		             |	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия
		             |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеОбъектов КАК СоответствиеОбъектов
		             |		ПО ТабУстановленныеСоответствия.НастройкаСоответствия = СоответствиеОбъектов.НастройкаСоответствия
		             |			И ТабУстановленныеСоответствия.GUID = СоответствиеОбъектов.ОбъектВнешнейИБ
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		             |	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		             |ИЗ
		             |	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия";
		
	Иначе
		
		Запрос.Текст="ВЫБРАТЬ
		             |	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТаблицаЗначенийПолей.НастройкаСоответствия КАК НаименованиеНастройки,
		             |	ТаблицаЗначенийПолей.GUID КАК GUID,
		             |	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID
		             |ПОМЕСТИТЬ ТаблицаЗначенийПолей
		             |ИЗ
		             |	&ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
		             |	СоответствиеВнешнимИБ.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	СоответствиеВнешнимИБ.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		             |	СоответствиеВнешнимИБ.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек,
		             |	СоответствиеВнешнимИБ.Наименование КАК Наименование,
		             |	СоответствиеВнешнимИБ.НеИспользоватьПриИмпорте КАК НеИспользоватьПриИмпорте
		             |ПОМЕСТИТЬ НастройкиСоответствия
		             |ИЗ
		             |	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
		             |ГДЕ
		             |	СоответствиеВнешнимИБ.Владелец = &ТипБД
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТаблицаЗначенийПолей.GUID КАК GUID,
		             |	ТаблицаЗначенийПолей.ПредставлениеGUID КАК ПредставлениеGUID,
		             |	ВЫБОР
		             |		КОГДА НЕ НастройкиСоответствияИмена.НастройкаСоответствия ЕСТЬ NULL
		             |			ТОГДА НастройкиСоответствияИмена.НастройкаСоответствия
		             |		ИНАЧЕ ЕСТЬNULL(НастройкиСоответствияТаблица.НастройкаСоответствия, ЗНАЧЕНИЕ(Справочник.СоответствиеВнешнимИБ.ПустаяСсылка))
		             |	КОНЕЦ КАК НастройкаСоответствия,
		             |	ВЫБОР
		             |		КОГДА НЕ НастройкиСоответствияИмена.НастройкаСоответствия ЕСТЬ NULL
		             |			ТОГДА НастройкиСоответствияИмена.СинхронизацияПоGUID
		             |		ИНАЧЕ ЕСТЬNULL(НастройкиСоответствияТаблица.СинхронизацияПоGUID, ЛОЖЬ)
		             |	КОНЕЦ КАК СинхронизацияПоGUID,
		             |	ВЫБОР
		             |		КОГДА НЕ НастройкиСоответствияИмена.НастройкаСоответствия ЕСТЬ NULL
		             |			ТОГДА НастройкиСоответствияИмена.ТаблицаАналитикиТек
		             |		ИНАЧЕ ЕСТЬNULL(НастройкиСоответствияТаблица.ТаблицаАналитикиТек, НЕОПРЕДЕЛЕНО)
		             |	КОНЕЦ КАК ТаблицаАналитикиТек
		             |ПОМЕСТИТЬ ТабУстановленныеСоответствия
		             |ИЗ
		             |	ТаблицаЗначенийПолей КАК ТаблицаЗначенийПолей
		             |		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСоответствия КАК НастройкиСоответствияТаблица
		             |		ПО ТаблицаЗначенийПолей.ТаблицаАналитикиВИБ = НастройкиСоответствияТаблица.ТаблицаАналитикиВИБ
		             |			И (НЕ НастройкиСоответствияТаблица.НеИспользоватьПриИмпорте)
		             |		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСоответствия КАК НастройкиСоответствияИмена
		             |		ПО ТаблицаЗначенийПолей.НаименованиеНастройки = НастройкиСоответствияИмена.Наименование
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ КАК ОбъектТекущейИБ,
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ КАК ОбъектВнешнейИБ,
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.НастройкаСоответствия КАК НастройкаСоответствия
		             |ПОМЕСТИТЬ СоответствиеОбъектов
		             |ИЗ
		             |	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
		             |ГДЕ
		             |	СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ = &ИспользуемаяИБ
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор КАК Идентификатор,
		             |	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка
		             |ПОМЕСТИТЬ ПубличныеИдентификаторы
		             |ИЗ
		             |	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
		             |ГДЕ
		             |	ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТабУстановленныеСоответствия.GUID КАК GUID,
		             |	ТабУстановленныеСоответствия.ПредставлениеGUID КАК ПредставлениеGUID,
		             |	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		             |	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек,
		             |	ВЫБОР
		             |		КОГДА СоответствиеОбъектов.ОбъектТекущейИБ ЕСТЬ NULL
		             |			ТОГДА ЕСТЬNULL(ПубличныеИдентификаторы.Ссылка, НЕОПРЕДЕЛЕНО)
		             |		ИНАЧЕ СоответствиеОбъектов.ОбъектТекущейИБ
		             |	КОНЕЦ КАК ОбъектТекущейИБ
		             |ИЗ
		             |	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия
		             |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеОбъектов КАК СоответствиеОбъектов
		             |		ПО ТабУстановленныеСоответствия.НастройкаСоответствия = СоответствиеОбъектов.НастройкаСоответствия
		             |			И ТабУстановленныеСоответствия.GUID = СоответствиеОбъектов.ОбъектВнешнейИБ
		             |		ЛЕВОЕ СОЕДИНЕНИЕ ПубличныеИдентификаторы КАК ПубличныеИдентификаторы
		             |		ПО ТабУстановленныеСоответствия.GUID = ПубличныеИдентификаторы.Идентификатор
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
		             |	ТабУстановленныеСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
		             |	ТабУстановленныеСоответствия.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
		             |	ТабУстановленныеСоответствия.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек
		             |ИЗ
		             |	ТабУстановленныеСоответствия КАК ТабУстановленныеСоответствия";
		
		
		Запрос.УстановитьПараметр("УзелИнформационнойБазы",УзелИнформационнойБазы);
		
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции // ПолучитьЗапросПоТаблицамВИБиИменамНастроек() 

Функция ПолучитьСоответствиеСсылок(ДочерняяБаза,ТаблицаЗначенийПолей,Организация,ТолькоПроверка=Ложь)

	РеквизитыИБ=ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДочерняяБаза,"ТипБД,УзелИнформационнойБазы");
	
	Если ТаблицаЗначенийПолей.Колонки.Найти("НастройкаСоответствия")=Неопределено Тогда
		
		Запрос=ПолучитьЗапросПоТаблицамВИБ(РеквизитыИБ.УзелИнформационнойБазы);
		
	Иначе
		
		Запрос=ПолучитьЗапросПоТаблицамВИБиИменамНастроек(РеквизитыИБ.УзелИнформационнойБазы);
		
	КонецЕсли;	
		
	ТипБД=РеквизитыИБ.ТипБД;
	
	Запрос.УстановитьПараметр("ТаблицаЗначенийПолей",ТаблицаЗначенийПолей);
	Запрос.УстановитьПараметр("ИспользуемаяИБ",ДочерняяБаза);
	Запрос.УстановитьПараметр("ТипБД",ТипБД); 
	
	Результат=Запрос.ВыполнитьПакет();
	
	Если ЗначениеЗаполнено(РеквизитыИБ.УзелИнформационнойБазы) Тогда
		
		Возврат ВернутьСоответствиеСсылокСУчетомED(Результат,ДочерняяБаза,Организация,ТолькоПроверка);
		
	Иначе
		
		Возврат ВернутьСоответствиеСсылок(Результат,ДочерняяБаза,Организация,ТипБД,ТолькоПроверка)
		
	КонецЕсли;	
	
КонецФункции // ПолучитьСоответствиеСсылок()

Функция ВернутьСоответствиеСсылокСУчетомED(Результат,ДочерняяБаза,Организация,ТолькоПроверка) 	
			
	РабТаблицаЗначенийПолей=Результат[5].Выгрузить();
	ТабНастройкиСоответствия=Результат[6].Выгрузить();
				
	СоответствиеСсылок=Новый Соответствие;
	
	Для Каждого СтрокаСоответствия ИЗ ТабНастройкиСоответствия  Цикл
		
		ИмяПеречисления=Неопределено;
		ИмяПеречисленияВИБ=Неопределено;
		
		Если ЗначениеЗаполнено(СтрокаСоответствия.НастройкаСоответствия) Тогда
			
			МассивДанные=РабТаблицаЗначенийПолей.НайтиСтроки(Новый Структура("НастройкаСоответствия",СтрокаСоответствия.НастройкаСоответствия));
			ТаблицаАналитикиТек=СтрокаСоответствия.ТаблицаАналитикиТек;
			
		Иначе
			
			МассивДанные=РабТаблицаЗначенийПолей.НайтиСтроки(Новый Структура("ТаблицаАналитикиВИБ",СтрокаСоответствия.ТаблицаАналитикиВИБ));
			ТаблицаАналитикиТек=СтрокаСоответствия.ТаблицаАналитикиВИБ;
			
		КонецЕсли; 
		
		Если СтрНайти(ТаблицаАналитикиТек,"Перечисление.")>0 Тогда
			
			ИмяПеречисления=СтрЗаменить(ТаблицаАналитикиТек,"Перечисление.","");
			
		КонецЕсли;
		
		Если СтрНайти(СтрокаСоответствия.ТаблицаАналитикиВИБ,"Перечисление.")>0 Тогда
			
			ИмяПеречисленияВИБ=СтрЗаменить(СтрокаСоответствия.ТаблицаАналитикиВИБ,"Перечисление.","");
	
			Если ЗначениеЗаполнено(СтрокаСоответствия.НастройкаСоответствия)
				И (СтрНайти(СтрокаСоответствия.ТаблицаАналитикиТек,"Справочник.")>0 
				ИЛИ СтрНайти(СтрокаСоответствия.ТаблицаАналитикиТек,"ПланПланВидовХарактеристик.")>0) Тогда
				
				ДанныеДляСинхронизации=ПолучитьДанныеДляСинхронизации(СтрокаСоответствия.НастройкаСоответствия); 
				
			Иначе
				
				ДанныеДляСинхронизации=Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивСсылок=Новый Массив;
		МассивСчетов=Новый Массив;
		
		Для Каждого СтрокаДанные ИЗ МассивДанные Цикл
			
			Если ЗначениеЗаполнено(СтрокаДанные.ОбъектТекущейИБ) Тогда
				
				 СоответствиеСсылок.Вставить(СтрокаДанные.ПредставлениеGUID,СтрокаДанные.ОбъектТекущейИБ);
				 
			 ИначеЕсли СтрокаСоответствия.СинхронизацияПоGUID Тогда
				 
				 Продолжить;
				 
			 ИначеЕсли НЕ ИмяПеречисления=Неопределено Тогда
				 
				 СоответствиеСсылок.Вставить(СтрокаДанные.ПредставлениеGUID,
						ОбщегоНазначенияУХ.ПолучитьЗначениеПеречисленияПоИмени(ИмяПеречисления,СтрокаДанные.GUID,СтрокаСоответствия.НастройкаСоответствия));		
						
			ИначеЕсли НЕ ИмяПеречисленияВИБ=Неопределено Тогда			
				
				Если НЕ ДанныеДляСинхронизации=Неопределено Тогда
					
					СоответствиеСсылок.Вставить(СтрокаДанные.ПредставлениеGUID,
						ПолучитьЭлементАналитикиДляПеречисления(СтрокаДанные.GUID,ДанныеДляСинхронизации));

				КонецЕсли;			
						
			ИначеЕсли НЕ СтрокаДанные.GUID="00000000-0000-0000-0000-000000000000" Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.НастройкаСоответствия) Тогда
					
					Если СтрНайти(ТаблицаАналитикиТек,"ПланСчетов.")>0 Тогда
						
						МассивСчетов.Добавить(СтрокаДанные.GUID);
						
					КонецЕсли;
					
				Иначе
					
					МассивСсылок.Добавить(СтрокаДанные.GUID);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если (МассивСсылок.Количество()=0
			И МассивСчетов.Количество()=0) ИЛИ ТолькоПроверка Тогда
			
			Продолжить;
			
		КонецЕсли; 
					
		Если ЗначениеЗаполнено(СтрокаСоответствия.НастройкаСоответствия) Тогда
			
			ТекСоответствиеСсылок=ИнтеграцияСВнешнимиСистемамиУХ.ЗагрузитьОбъектыИзВИБ(ДочерняяБаза,
			СтрокаСоответствия.НастройкаСоответствия,Организация,МассивСсылок,Истина,Истина,,,Истина);
			
			Для Каждого КлючИЗначение ИЗ ТекСоответствиеСсылок Цикл
				
				СоответствиеСсылок.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
				
			КонецЦикла;
			
		ИначеЕсли МассивСчетов.Количество()>0 Тогда
			
			ТекСоответствиеСсылок=ИнтеграцияСВнешнимиСистемамиУХ.ПолучитьСоответствиеСчетов(ДочерняяБаза,СтрокаСоответствия.ТаблицаАналитикиВИБ,МассивСчетов);
			
			Для Каждого КлючИЗначение ИЗ ТекСоответствиеСсылок Цикл
				
				СоответствиеСсылок.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
				
			КонецЦикла;		
			
		КонецЕсли;
					
	КонецЦикла;
	
	ПроверитьСинхронизациюОбъектовВИБ(ДочерняяБаза,СоответствиеСсылок,РабТаблицаЗначенийПолей);
	
	Возврат СоответствиеСсылок;	
	
КонецФункции // ВернутьСоответствиеСсылокСУчетомED()  

Функция ВернутьСоответствиеСсылок(Результат,ДочерняяБаза,Организация,ТипБД,ТолькоПроверка)
		
	РабТаблицаЗначенийПолей=Результат[4].Выгрузить();
	ТабНастройкиСоответствия=Результат[5].Выгрузить();		
		
	СоответствиеСсылок=Новый Соответствие;
	
	Для Каждого СтрокаСоответствия ИЗ ТабНастройкиСоответствия  Цикл
		
		ИмяПеречисления=Неопределено;
		ИмяПеречисленияВИБ=Неопределено;
		
		Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.НастройкаСоответствия) Тогда
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Для типа информационной базы %1 не найдена настройка соответствия для объекта %2'"),ТипБД,СтрокаСоответствия.ТаблицаАналитикиВИБ),,,СтатусСообщения.Важное);
			Продолжить;
			
		КонецЕсли; 
		
		Если СтрНайти(СтрокаСоответствия.ТаблицаАналитикиТек,"Перечисление.")>0 Тогда
			
			ИмяПеречисления=СтрЗаменить(СтрокаСоответствия.ТаблицаАналитикиТек,"Перечисление.","");
			
		КонецЕсли; 
		
		Если СтрНайти(СтрокаСоответствия.ТаблицаАналитикиВИБ,"Перечисление.")>0 Тогда
			
			ИмяПеречисленияВИБ=СтрЗаменить(СтрокаСоответствия.ТаблицаАналитикиВИБ,"Перечисление.","");
	
			Если (СтрНайти(СтрокаСоответствия.ТаблицаАналитикиТек,"Справочник.")>0 
				ИЛИ СтрНайти(СтрокаСоответствия.ТаблицаАналитикиТек,"ПланПланВидовХарактеристик.")>0) Тогда
				
				ДанныеДляСинхронизации=ПолучитьДанныеДляСинхронизации(СтрокаСоответствия.НастройкаСоответствия);
				
			Иначе
				
				ДанныеДляСинхронизации=Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивДанные=РабТаблицаЗначенийПолей.НайтиСтроки(Новый Структура("НастройкаСоответствия",СтрокаСоответствия.НастройкаСоответствия));
		МассивСсылок=Новый Массив;
		
		Для Каждого СтрокаДанные ИЗ МассивДанные Цикл
			
			Если ЗначениеЗаполнено(СтрокаДанные.ОбъектТекущейИБ) Тогда
				
				 СоответствиеСсылок.Вставить(СтрокаДанные.ПредставлениеGUID,СтрокаДанные.ОбъектТекущейИБ);
				 
			 ИначеЕсли СтрокаСоответствия.СинхронизацияПоGUID Тогда
				 
				 Продолжить;
				 
			 ИначеЕсли НЕ ИмяПеречисления=Неопределено Тогда
				 
				 СоответствиеСсылок.Вставить(СтрокаДанные.ПредставлениеGUID,
						ОбщегоНазначенияУХ.ПолучитьЗначениеПеречисленияПоИмени(ИмяПеречисления,СтрокаДанные.GUID,СтрокаСоответствия.НастройкаСоответствия));
						
			ИначеЕсли НЕ ИмяПеречисленияВИБ=Неопределено Тогда			
				
				Если НЕ ДанныеДляСинхронизации=Неопределено Тогда
					
					СоответствиеСсылок.Вставить(СтрокаДанные.ПредставлениеGUID,
						ПолучитьЭлементАналитикиДляПеречисления(СтрокаДанные.GUID,ДанныеДляСинхронизации));

				КонецЕсли;	
				
			ИначеЕсли НЕ СтрокаДанные.GUID="00000000-0000-0000-0000-000000000000" Тогда
				
				МассивСсылок.Добавить(СтрокаДанные.GUID);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивСсылок.Количество()=0
			ИЛИ ТолькоПроверка Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ТекСоответствиеСсылок=ИнтеграцияСВнешнимиСистемамиУХ.ЗагрузитьОбъектыИзВИБ(ДочерняяБаза,
			СтрокаСоответствия.НастройкаСоответствия,Организация,МассивСсылок,Истина,,,,Истина);
		
		Для Каждого КлючИЗначение ИЗ ТекСоответствиеСсылок Цикл
			
			СоответствиеСсылок.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
			
		КонецЦикла;
					
	КонецЦикла;
	
	ПроверитьСинхронизациюОбъектовВИБ(ДочерняяБаза,СоответствиеСсылок,РабТаблицаЗначенийПолей);
	
	Возврат СоответствиеСсылок;	
	
КонецФункции // ВернутьСоответствиеСсылок() 

Функция ПолучитьДанныеДляСинхронизации(НастройкаСоответствия)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СоответствиеВнешнимИБ.ОписаниеОбъектаТек.СоздаватьПриНеудачномПоискеПриИмпорте КАК СоздаватьПриНеудачномПоискеПриИмпорте,
	             |	СоответствиеВнешнимИБ.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек,
	             |	СоответствиеВнешнимИБ.СоответствиеРеквизитов.(
	             |		РеквизитОбъектаКонсолидации КАК РеквизитОбъектаКонсолидации,
	             |		НеИспользоватьДляСинхронизации КАК НеИспользоватьДляСинхронизации
	             |	) КАК СоответствиеРеквизитов,
	             |	СоответствиеВнешнимИБ.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ
	             |ИЗ
	             |	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	             |ГДЕ
	             |	СоответствиеВнешнимИБ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",НастройкаСоответствия);
	
	Возврат Запрос.Выполнить().Выгрузить()[0];
	
		
КонецФункции // ПолучитьДанныеДляСинхронизации() 

Функция ПолучитьЭлементАналитикиДляПеречисления(ИмяПеречисления,ДанныеДляСинхронизации)
	
	ПолеСинхронизации=ДанныеДляСинхронизации.СоответствиеРеквизитов.Найти(ЛОЖЬ,"НеИспользоватьДляСинхронизации").РеквизитОбъектаКонсолидации;
	ОбъектПеречисление=СтрЗаменить(ДанныеДляСинхронизации.ТаблицаАналитикиВИБ,"Перечисление.","");
	
	Запрос=Новый Запрос;
	ТекстЗапроса="ВЫБРАТЬ Ссылка ИЗ &ТаблицаАналитикиТек ГДЕ &Отбор";
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&ТаблицаАналитикиТек",ДанныеДляСинхронизации.ТаблицаАналитикиТек);
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Отбор",ПолеСинхронизации+"=&ИмяПеречисления");
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ИмяПеречисления",ИмяПеречисления);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.Ссылка;
		
	КонецЕсли;
	
	Если НЕ ДанныеДляСинхронизации.СоздаватьПриНеудачномПоискеПриИмпорте Тогда
		
		ТекстОшибки=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Не удалось определить элемент таблицы %1 текущей ИБ,'"),ДанныеДляСинхронизации.ТаблицаАналитикиТек);
		ТекстОшибки=ТекстОшибки+Символы.ПС+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'соответствующий значению %1 перечисления внешней ИБ %2'"),ИмяПеречисления,ОбъектПеречисление);		
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки,,,СтатусСообщения.Внимание);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеОбъекта=СтрРазделить(ДанныеДляСинхронизации.ТаблицаАналитикиТек,".");
	ТипОбъектаМетаданных=ДанныеОбъекта[0];
	ИмяОбъектаМетаданных=ДанныеОбъекта[1];
	
	Если ТипОбъектаМетаданных="Справочник" Тогда
		
		НовыйОбъект=Справочники[ИмяОбъектаМетаданных].СоздатьЭлемент();
		
	Иначе
		
		НовыйОбъект=ПланыВидовХарактеристик[ИмяОбъектаМетаданных].СоздатьЭлемент();
		
	КонецЕсли;
	
	НовыйОбъект[ПолеСинхронизации]=ИмяПеречисления;
	
	Попытка
		
		НовыйОбъект.Записать();
		Возврат НовыйОбъект.Ссылка;
		
	Исключение
		
		ТекстОшибки=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Не удалось создать элемент таблицы %1 текущей ИБ,'"),ДанныеДляСинхронизации.ТаблицаАналитикиТек);
		ТекстОшибки=ТекстОшибки+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'соответствующий значению %1 перечисления внешней ИБ %2'"),ИмяПеречисления,ОбъектПеречисление);		
		ТекстОшибки=ТекстОшибки+Символы.ПС+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки,,,СтатусСообщения.Внимание);
		
		Возврат Неопределено;
		
	КонецПопытки;;
			
КонецФункции // ПолучитьЭлементАналитикиДляПеречисления()

Процедура ПроверитьСинхронизациюОбъектовВИБ(ДочерняяБаза,СоответствиеСсылок,РабТаблицаЗначенийПолей)
	
	МассивОшибок=Новый Массив;
	
	Если СоответствиеСсылок.Количество()<РабТаблицаЗначенийПолей.Количество() Тогда
		
		МассивНеСинхронизированных=Новый  Массив;
		
		Для Каждого СтрокаДанные ИЗ РабТаблицаЗначенийПолей Цикл
			
			СинхронизированныйОбъект=СоответствиеСсылок.Получить(СтрокаДанные.ПредставлениеGUID);
			
			Если СинхронизированныйОбъект=Неопределено И НЕ (СтрокаДанные.GUID="00000000-0000-0000-0000-000000000000" 
				ИЛИ ПустаяСтрока(СтрокаДанные.GUID)) Тогда
				
				МассивНеСинхронизированных.Добавить(Новый Структура("ТаблицаАналитикиВИБ,GUID",СтрокаДанные.ТаблицаАналитикиВИБ,СтрокаДанные.GUID));
				
			КонецЕсли;
		
		КонецЦикла;
		
		Если МассивНеСинхронизированных.Количество()>0 Тогда
			
			МассивОшибок=GetArrayOfSyncErrors(ДочерняяБаза,МассивНеСинхронизированных); 
			
			Если МассивОшибок=Неопределено Тогда
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
			
	Для Каждого ТекстОшибки ИЗ МассивОшибок Цикл 
		
		ТекстСообщения=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Не удалось сопоставить объект текущей ИБ объекту информационной базы %1: '"),ДочерняяБаза);
		ТекстСообщения=ТекстСообщения+Символы.ПС+ТекстОшибки;
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения,,,СтатусСообщения.Внимание);
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьСинхронизациюОбъектовВИБ() 

Функция GetArrayOfSyncErrors(ДочерняяБаза,МассивНеСинхронизированных)
	
	ТекСоединениеВИБ = УправлениеСоединениямиВИБУХ.ПолучитьСоединение(ДочерняяБаза, 1);
	
	СтруктураДанных=Новый Структура;
	СтруктураДанных.Вставить("МассивНеСинхронизированных",МассивНеСинхронизированных);
	
	Если ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") Тогда 
		
		Возврат ТекСоединениеВИБ.GetArrayOfSyncErrors(Новый ХранилищеЗначения(СтруктураДанных, Новый СжатиеДанных(9))).Получить();
		
	ИначеЕсли ТипЗнч(ТекСоединениеВИБ) = Тип("Строка") Тогда
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОтвет1СШина(ТекСоединениеВИБ,"GetArrayOfSyncErrors",СтруктураДанных);
		
	Иначе
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.GetArrayOfSyncErrors(ТекСоединениеВИБ,СтруктураДанных);
		
	КонецЕсли;
		
КонецФункции // GetArrayOfSyncErrors()

Процедура ОтметитьОбменВыполнен(ТаблицаОбмена) Экспорт
	
	
	
КонецПроцедуры // ОтметитьОбменВыполнен()

Функция ПолучитьДанныеЗаявок(ДочерняяБаза,ТаблицаОбмена) Экспорт
	
	ТекСоединениеВИБ = ПодключениеКВИБУХ.ПолучитьСоединение(ДочерняяБаза, 1);
	
	Если ТекСоединениеВИБ=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаЗаявок",ТаблицаОбмена);
	
	Если ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") Тогда
				
		Возврат ТекСоединениеВИБ.GetMDMApplication(Новый ХранилищеЗначения(СтруктураПараметров, Новый СжатиеДанных(9))).Получить(); 
		
	ИначеЕсли ТипЗнч(ТекСоединениеВИБ) = Тип("Строка") Тогда
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОтвет1СШина(ТекСоединениеВИБ,"GetMDMApplication",СтруктураПараметров);
		
	Иначе
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.GetMDMApplication(ТекСоединениеВИБ,СтруктураПараметров);
		
	КонецЕсли;
		
КонецФункции // ЗагрузитьЗаявкиПоТаблице() 

Процедура ПередатьСтатусПриНеобходимости(ЗаявкаСсылка,ТекСостояние) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза КАК ДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.Состояние КАК Состояние,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза.ТипБД.ОбменДаннымиРегламентнымЗаданием КАК ОбменДаннымиРегламентнымЗаданием
	             |ИЗ
	             |	РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
	             |ГДЕ
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаЦентральнаяБаза = &ЗаявкаЦентральнаяБаза
	             |	И НЕ СоответствиеЗаявокНаИзменениеНСИ.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("ЗаявкаЦентральнаяБаза",ЗаявкаСсылка);
	Запрос.УстановитьПараметр("Состояние",ТекСостояние);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		НаборЗаписей=РегистрыСведений.СоответствиеЗаявокНаИзменениеНСИ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаявкаЦентральнаяБаза.Установить(ЗаявкаСсылка);
		НаборЗаписей.Прочитать();
		
		НаборЗаписей[0].Состояние=ТекСостояние;
		НаборЗаписей[0].ТребуетсяПередачаСтатуса=Истина;
		
		НаборЗаписей.Записать();
		
		Если НЕ Результат.ОбменДаннымиРегламентнымЗаданием Тогда
			
			ОписаниеЗадания=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Выгрузка статусов заявок, внешняя ИБ %1'"),Результат.ДочерняяБаза);
			КлючЗадания=Новый УникальныйИдентификатор;
			
			ПараметрыЗадания=Новый Массив;
			ПараметрыЗадания.Добавить(Результат.ДочерняяБаза);
			
			ФоновыеЗадания.Выполнить("ОбменДаннымиНСИУХ.ВыгрузитьСтатусыЗаявокДочернихКомпаний",ПараметрыЗадания,КлючЗадания,ОписаниеЗадания);
			
	//		ВыгрузитьСтатусыЗаявокДочернихКомпаний(Результат.ДочерняяБаза);
			
		КонецЕсли;
		
	КонецЕсли; 
			
	
КонецПроцедуры // ПередатьСтатусПриНеобходимости() 

Процедура ВыгрузитьСтатусыЗаявокДочернихКомпаний(ДочерняяБаза=Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза КАК ДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.Состояние КАК Состояние,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаЦентральнаяБаза КАК ЗаявкаЦентральнаяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаЦентральнаяБаза.Номер КАК ЗаявкаЦентральнаяБазаНомер,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаЦентральнаяБаза.Дата КАК ЗаявкаЦентральнаяБазаДата
	             |ПОМЕСТИТЬ ЗаявкиКОбработке
	             |ИЗ
	             |	РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
	             |ГДЕ
	             |	СоответствиеЗаявокНаИзменениеНСИ.ТребуетсяПередачаСтатуса
	             |	И НЕ СоответствиеЗаявокНаИзменениеНСИ.ЕстьОшибкиОбмена
	             |	И &Параметр1
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаявкиКОбработке.ДочерняяБаза КАК ДочерняяБаза
	             |ИЗ
	             |	ЗаявкиКОбработке КАК ЗаявкиКОбработке
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаявкиКОбработке.ДочерняяБаза КАК ДочерняяБаза,
	             |	ЗаявкиКОбработке.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза,
	             |	ЗаявкиКОбработке.Состояние КАК Состояние,
	             |	ЗаявкиКОбработке.ЗаявкаЦентральнаяБаза КАК ЗаявкаЦентральнаяБаза,
	             |	ЗаявкиКОбработке.ЗаявкаЦентральнаяБазаНомер КАК ЗаявкаЦентральнаяБазаНомер,
	             |	ЗаявкиКОбработке.ЗаявкаЦентральнаяБазаДата КАК ЗаявкаЦентральнаяБазаДата
	             |ИЗ
	             |	ЗаявкиКОбработке КАК ЗаявкиКОбработке";
	
	Если ЗначениеЗаполнено(ДочерняяБаза) Тогда
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза=&ДочерняяБаза");
		Запрос.УстановитьПараметр("ДочерняяБаза",ДочерняяБаза);
		
	Иначе
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","ИСТИНА");
		
	КонецЕсли; 
	
	Запрос.Текст=ТекстЗапроса;
	
	Результат=Запрос.ВыполнитьПакет();
	
	ТабАдресации=Результат[1].Выгрузить();
	ТабЗаявок=Результат[2].Выгрузить(); 
	
	Для Каждого Строка ИЗ ТабАдресации Цикл
		
		ТаблицаОбмена=ТабЗаявок.Скопировать(Новый Структура("ДочерняяБаза",Строка.ДочерняяБаза));
		
		ВыгрузитьСтатусыЗаявокНСИ(Строка.ДочерняяБаза,ТаблицаОбмена);
				
	КонецЦикла;	
	
КонецПроцедуры // ЗагрузитьЗаявкиДочернихКомпаний()

Процедура ВыгрузитьОшибкиЗагрузкиЗаявокДочернихКомпаний(ДочерняяБаза=Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза КАК ДочерняяБаза,
	             |	СоответствиеЗаявокНаИзменениеНСИ.ИнформацияОбОшибке КАК ИнформацияОбОшибке
	             |ПОМЕСТИТЬ ЗаявкиКОбработке
	             |ИЗ
	             |	РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
	             |ГДЕ
	             |	СоответствиеЗаявокНаИзменениеНСИ.ТребуетсяПередачаСтатуса
	             |	И СоответствиеЗаявокНаИзменениеНСИ.ЕстьОшибкиОбмена
	             |	И &Параметр1
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаявкиКОбработке.ДочерняяБаза КАК ДочерняяБаза
	             |ИЗ
	             |	ЗаявкиКОбработке КАК ЗаявкиКОбработке
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаявкиКОбработке.ДочерняяБаза КАК ДочерняяБаза,
	             |	ЗаявкиКОбработке.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза,
	             |	ЗаявкиКОбработке.ИнформацияОбОшибке КАК ИнформацияОбОшибке
	             |ИЗ
	             |	ЗаявкиКОбработке КАК ЗаявкиКОбработке";
	
	Если ЗначениеЗаполнено(ДочерняяБаза) Тогда
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза=&ДочерняяБаза");
		Запрос.УстановитьПараметр("ДочерняяБаза",ДочерняяБаза);
		
	Иначе
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","ИСТИНА");
		
	КонецЕсли; 
	
	Запрос.Текст=ТекстЗапроса;
	
	Результат=Запрос.ВыполнитьПакет();
	
	ТабАдресации=Результат[1].Выгрузить();
	ТабЗаявок=Результат[2].Выгрузить(); 
	
	Для Каждого Строка ИЗ ТабАдресации Цикл
		
		ТаблицаОбмена=ТабЗаявок.Скопировать(Новый Структура("ДочерняяБаза",Строка.ДочерняяБаза));
		
		ВыгрузитьОшибкиЗаявокНСИ(Строка.ДочерняяБаза,ТаблицаОбмена);
				
	КонецЦикла;	
	
КонецПроцедуры // ЗагрузитьЗаявкиДочернихКомпаний()

Процедура ВыгрузитьСтатусыЗаявокНСИ(ДочерняяБаза,ТаблицаОбмена)
	
	ТекСоединениеВИБ = ПодключениеКВИБУХ.ПолучитьСоединение(ДочерняяБаза, 1); 
	
	Если ТекСоединениеВИБ=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИспользоватьWS=(ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") ИЛИ ТипЗнч(ТекСоединениеВИБ)= Тип("Строка"));
	
	Если ИспользоватьWS Тогда
		
		ТаблицаСтатусов=Новый ТаблицаЗначений;
		
	Иначе
		
		ТаблицаСтатусов=ТекСоединениеВИБ.NewObject("ТаблицаЗначений");
		
	КонецЕсли;
	
	ТаблицаСтатусов.Колонки.Добавить("ЗаявкаДочерняяБаза");
	ТаблицаСтатусов.Колонки.Добавить("ЗаявкаЦентральнаяБаза");
	ТаблицаСтатусов.Колонки.Добавить("Состояние");
	ТаблицаСтатусов.Колонки.Добавить("ЗаявкаЦентральнаяБазаНомер");
	ТаблицаСтатусов.Колонки.Добавить("ЗаявкаЦентральнаяБазаДата");
	ТаблицаСтатусов.Колонки.Добавить("ОбработкаВыполнена");
	
	Для Каждого Строка ИЗ ТаблицаОбмена Цикл
		
		НоваяСтрока=ТаблицаСтатусов.Добавить();
		НоваяСтрока.ЗаявкаДочерняяБаза			= Строка.ЗаявкаДочерняяБаза;
		НоваяСтрока.ЗаявкаЦентральнаяБаза		= XMLСтрока(Строка.ЗаявкаЦентральнаяБаза);
		НоваяСтрока.Состояние					= XMLСтрока(Строка.Состояние); 
		НоваяСтрока.ЗаявкаЦентральнаяБазаНомер	= Строка.ЗаявкаЦентральнаяБазаНомер;
		НоваяСтрока.ЗаявкаЦентральнаяБазаДата	= Строка.ЗаявкаЦентральнаяБазаДата;
		НоваяСтрока.ОбработкаВыполнена			= Ложь;
		
	КонецЦикла;
	
	ОбработаннаяТаблица=ОбработатьТаблицуИзмененныхСтатусов(ТекСоединениеВИБ,ТаблицаСтатусов);
	
	Если НЕ ОбработаннаяТаблица=Неопределено Тогда
		
		Для Каждого Строка ИЗ ОбработаннаяТаблица Цикл
			
			Если Строка.ОбработкаВыполнена Тогда
				
				НаборЗаписей=РегистрыСведений.СоответствиеЗаявокНаИзменениеНСИ.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ДочерняяБаза.Установить(ДочерняяБаза);
				НаборЗаписей.Отбор.ЗаявкаДочерняяБаза.Установить(Строка.ЗаявкаДочерняяБаза);
				
				НаборЗаписей.Прочитать();
				НаборЗаписей[0].ТребуетсяПередачаСтатуса=Ложь;
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ВыгрузитьСтатусыЗаявокНСИ()

Функция ОбработатьТаблицуИзмененныхСтатусов(ТекСоединениеВИБ,ТаблицаСтатусов)
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаСтатусов",ТаблицаСтатусов);
	
	Если ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") Тогда
						
		Возврат ТекСоединениеВИБ.PutMDMApplicationStatus(Новый ХранилищеЗначения(СтруктураПараметров, Новый СжатиеДанных(9))).Получить();
		
	ИначеЕсли ТипЗнч(ТекСоединениеВИБ) = Тип("Строка") Тогда
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОтвет1СШина(ТекСоединениеВИБ,"PutMDMApplicationStatus",СтруктураПараметров);
		
	Иначе
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.PutMDMApplicationStatus(ТекСоединениеВИБ,СтруктураПараметров);
		
	КонецЕсли;
		
КонецФункции // ОбработатьТаблицуИзмененныхСтатусов()

Процедура ВыгрузитьОшибкиЗаявокНСИ(ДочерняяБаза,ТаблицаОбмена)
	
	ТекСоединениеВИБ = ПодключениеКВИБУХ.ПолучитьСоединение(ДочерняяБаза, 1); 
	
	Если ТекСоединениеВИБ=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИспользоватьWS=(ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") ИЛИ ТипЗнч(ТекСоединениеВИБ)= Тип("Строка"));
	
	Если ИспользоватьWS Тогда
		
		ТаблицаОшибок=Новый ТаблицаЗначений;
		
	Иначе
		
		ТаблицаОшибок=ТекСоединениеВИБ.NewObject("ТаблицаЗначений");
		
	КонецЕсли;
	
	ТаблицаОшибок.Колонки.Добавить("ЗаявкаДочерняяБаза");
	ТаблицаОшибок.Колонки.Добавить("ИнформацияОбОшибке");
	ТаблицаОшибок.Колонки.Добавить("ОбработкаВыполнена");
	
	Для Каждого Строка ИЗ ТаблицаОбмена Цикл
		
		НоваяСтрока=ТаблицаОшибок.Добавить();
		НоваяСтрока.ЗаявкаДочерняяБаза			= Строка.ЗаявкаДочерняяБаза;
		НоваяСтрока.ИнформацияОбОшибке			= Строка.ИнформацияОбОшибке; 
		НоваяСтрока.ОбработкаВыполнена			= Ложь;
		
	КонецЦикла;
	
	ОбработаннаяТаблица=ОбработатьТаблицуОшибокЗаявок(ТекСоединениеВИБ,ТаблицаОшибок);
	
	Если НЕ ОбработаннаяТаблица=Неопределено Тогда
		
		Для Каждого Строка ИЗ ОбработаннаяТаблица Цикл
			
			Если Строка.ОбработкаВыполнена Тогда
				
				НаборЗаписей=РегистрыСведений.СоответствиеЗаявокНаИзменениеНСИ.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ДочерняяБаза.Установить(ДочерняяБаза);
				НаборЗаписей.Отбор.ЗаявкаДочерняяБаза.Установить(Строка.ЗаявкаДочерняяБаза);
				
				НаборЗаписей.Прочитать();
				НаборЗаписей[0].ТребуетсяПередачаСтатуса=Ложь;
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ВыгрузитьОшибкиЗаявокНСИ() 

Функция ОбработатьТаблицуОшибокЗаявок(ТекСоединениеВИБ,ТаблицаОшибок)
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаОшибок",ТаблицаОшибок);
	
	Если ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") Тогда
						
		Возврат ТекСоединениеВИБ.SetMDMApplicationErrorText(Новый ХранилищеЗначения(СтруктураПараметров, Новый СжатиеДанных(9))).Получить();
		
	ИначеЕсли ТипЗнч(ТекСоединениеВИБ) = Тип("Строка") Тогда
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОтвет1СШина(ТекСоединениеВИБ,"SetMDMApplicationErrorText",СтруктураПараметров);
		
	Иначе
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.SetMDMApplicationErrorText(ТекСоединениеВИБ,СтруктураПараметров);
		
	КонецЕсли;
		
КонецФункции // ОбработатьТаблицуИзмененныхСтатусов()

Функция ПодготовитьДанныеКонтроляНСИ(НастройкаСоответствия)
	
	ДанныеСоответствия=ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаСоответствия,"Владелец,ОписаниеОбъектаВИБ,ОписаниеОбъектаТек");
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТекущаяБДРеквизиты.Имя КАК Имя,
	             |	ТекущаяБДРеквизиты.Обязательный КАК Обязательный,
	             |	ТекущаяБДРеквизиты.КонтрольУникальности КАК КонтрольУникальности,
	             |	ТекущаяБДРеквизиты.ИзменениеБезСогласования КАК ИзменениеБезСогласования
	             |ПОМЕСТИТЬ РеквизитыКонтроляТек
	             |ИЗ
	             |	Справочник.СправочникиБД.Реквизиты КАК ТекущаяБДРеквизиты
	             |ГДЕ
	             |	ТекущаяБДРеквизиты.Ссылка = &ОбъектТек
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СправочникиБДРеквизиты.Имя КАК Имя,
	             |	СправочникиБДРеквизиты.Синоним КАК Синоним,
	             |	СправочникиБДРеквизиты.Использование КАК Использование
	             |ПОМЕСТИТЬ РеквизитыОбъектаВИБ
	             |ИЗ
	             |	Справочник.СправочникиБД.Реквизиты КАК СправочникиБДРеквизиты
	             |ГДЕ
	             |	СправочникиБДРеквизиты.Ссылка = &ОбъектВИБ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ТекущаяБДСогласуемыеТЧ.ОписаниеТЧ.Имя КАК ОписаниеТЧИмя
	             |ПОМЕСТИТЬ СогласуемыеТЧТек
	             |ИЗ
	             |	Справочник.СправочникиБД.СогласуемыеТЧ КАК ТекущаяБДСогласуемыеТЧ
	             |ГДЕ
	             |	ТекущаяБДСогласуемыеТЧ.Ссылка = &ОбъектТек
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СоответствиеВнешнимИБСоответствиеРеквизитов.РеквизитОбъектаКонсолидации КАК РеквизитОбъектаТек,
	             |	СоответствиеВнешнимИБСоответствиеРеквизитов.РеквизитОбъектаВнешнейИБ КАК РеквизитОбъектаВИБ,
	             |	РеквизитыОбъектаВИБ.Синоним КАК Синоним,
	             |	РеквизитыОбъектаВИБ.Использование КАК Использование
	             |ПОМЕСТИТЬ СоответствиеРеквизитов
	             |ИЗ
	             |	Справочник.СоответствиеВнешнимИБ.СоответствиеРеквизитов КАК СоответствиеВнешнимИБСоответствиеРеквизитов
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыОбъектаВИБ КАК РеквизитыОбъектаВИБ
	             |		ПО СоответствиеВнешнимИБСоответствиеРеквизитов.РеквизитОбъектаВнешнейИБ = РеквизитыОбъектаВИБ.Имя
	             |ГДЕ
	             |	СоответствиеВнешнимИБСоответствиеРеквизитов.Ссылка = &НастройкаСоответствия
	             |	И СоответствиеВнешнимИБСоответствиеРеквизитов.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияПолейИсточника.ПолеИсходнойТаблицы)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаВИБ.Имя КАК ТабличнаяЧастьВИБ,
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаТек.Имя КАК ТабличнаяЧастьТек
	             |ПОМЕСТИТЬ СоответствиеТЧ
	             |ИЗ
	             |	Справочник.СоответствиеВнешнимИБ.СоответствияСвязанныхОбъектов КАК СоответствиеВнешнимИБСоответствияСвязанныхОбъектов
	             |ГДЕ
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.Ссылка = &НастройкаСоответствия
	             |	И СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаВИБ ССЫЛКА Справочник.ТабличныеЧастиБД
	             |	И СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаТек ССЫЛКА Справочник.ТабличныеЧастиБД
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЕСТЬNULL(СоответствиеРеквизитов.РеквизитОбъектаВИБ, """") КАК Имя,
	             |	ЕСТЬNULL(СоответствиеРеквизитов.Синоним, """") КАК Синоним,
	             |	ЕСТЬNULL(СоответствиеРеквизитов.Использование, ЗНАЧЕНИЕ(Перечисление.ИспользованиеРеквизита.ПустаяСсылка)) КАК Использование,
	             |	РеквизитыКонтроляТек.Обязательный КАК Обязательный,
	             |	РеквизитыКонтроляТек.КонтрольУникальности КАК КонтрольУникальности,
	             |	РеквизитыКонтроляТек.ИзменениеБезСогласования КАК ИзменениеБезСогласования,
	             |	РеквизитыКонтроляТек.Имя КАК ИмяРеквизитаТек
	             |ИЗ
	             |	РеквизитыКонтроляТек КАК РеквизитыКонтроляТек
	             |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеРеквизитов КАК СоответствиеРеквизитов
	             |		ПО РеквизитыКонтроляТек.Имя = СоответствиеРеквизитов.РеквизитОбъектаТек
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЕСТЬNULL(СоответствиеТЧ.ТабличнаяЧастьВИБ, """") КАК ИмяТЧ,
	             |	СогласуемыеТЧТек.ОписаниеТЧИмя КАК ИмяТЧТек
	             |ИЗ
	             |	СогласуемыеТЧТек КАК СогласуемыеТЧТек
	             |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеТЧ КАК СоответствиеТЧ
	             |		ПО СогласуемыеТЧТек.ОписаниеТЧИмя = СоответствиеТЧ.ТабличнаяЧастьТек
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СправочникиБД.Наименование КАК Наименование,
	             |	СправочникиБД.Синоним КАК Синоним,
	             |	СправочникиБД.ИерархическийСправочник КАК ИерархическийСправочник,
	             |	СправочникиБД.ВидИерархии КАК ВидИерархии
	             |ИЗ
	             |	Справочник.СправочникиБД КАК СправочникиБД
	             |ГДЕ
	             |	СправочникиБД.Ссылка = &ОбъектВИБ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СправочникиБДВладельцы.Имя КАК Имя,
	             |	СправочникиБДВладельцы.ТипДанных КАК ТипДанных
	             |ИЗ
	             |	Справочник.СправочникиБД.Владельцы КАК СправочникиБДВладельцы
	             |ГДЕ
	             |	СправочникиБДВладельцы.Ссылка = &ОбъектВИБ";
	
	Запрос.УстановитьПараметр("ОбъектТек",ДанныеСоответствия.ОписаниеОбъектаТек);
	Запрос.УстановитьПараметр("ОбъектВИБ",ДанныеСоответствия.ОписаниеОбъектаВИБ);
	Запрос.УстановитьПараметр("НастройкаСоответствия",НастройкаСоответствия);
	
	Результат=Запрос.ВыполнитьПакет();
	СтруктураСправочника=Новый Структура;
	ДанныеСправочника=Результат[7].Выгрузить()[0];
	
	СтруктураСправочника=Новый Структура;
	СтруктураСправочника.Вставить("Наименование",				ДанныеСправочника.Наименование);
	СтруктураСправочника.Вставить("Синоним",					ДанныеСправочника.Синоним);
	СтруктураСправочника.Вставить("ИерархическийСправочник",	ДанныеСправочника.ИерархическийСправочник);
   	СтруктураСправочника.Вставить("ВидИерархии",				XMLСтрока(ДанныеСправочника.ВидИерархии));

	ТекТаблицаРеквизитов=Новый ТаблицаЗначений;
	ТекТаблицаРеквизитов.Колонки.Добавить("Имя",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(150));
	ТекТаблицаРеквизитов.Колонки.Добавить("Синоним",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(255));
	ТекТаблицаРеквизитов.Колонки.Добавить("Использование",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(255));
	ТекТаблицаРеквизитов.Колонки.Добавить("Обязательный",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТекТаблицаРеквизитов.Колонки.Добавить("КонтрольУникальности",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТекТаблицаРеквизитов.Колонки.Добавить("ИзменениеБезСогласования",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТекТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизитаТек",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(150));
	
	ТаблицаРеквизитов=Результат[5].Выгрузить();
	
	ТекстОшибкиРеквизиты="";
	
	Для Каждого Строка ИЗ ТаблицаРеквизитов Цикл 
		
		Если НЕ ЗначениеЗаполнено(Строка.Имя) Тогда
			
			Если Строка.Обязательный ИЛИ Строка.КонтрольУникальности Тогда
				
				ТекстОшибкиРеквизиты=ТекстОшибкиРеквизиты+Символы.ПС+Строка.ИмяРеквизитаТек;
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
			
		НоваяСтрока=ТекТаблицаРеквизитов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка,,"Использование");
		НоваяСтрока.Использование=XMLСтрока(Строка.Использование);
		
	КонецЦикла;
	
	СтруктураСправочника.Вставить("Реквизиты",					ТекТаблицаРеквизитов);
	СтруктураСправочника.Вставить("СогласуемыеТЧ",				Результат[6].Выгрузить());
	СтруктураСправочника.Вставить("Владельцы",					Результат[8].Выгрузить());
	
	СтруктураСправочника.Вставить("ТипБД",						ДанныеСоответствия.Владелец);
	
	ТекстОшибкиТЧ="";
		
	Для Каждого Строка ИЗ СтруктураСправочника.СогласуемыеТЧ Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.ИмяТЧ) Тогда
			
			ТекстОшибкиТЧ=ТекстОшибкиТЧ+Символы.ПС+Строка.ИмяТЧТек;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ (ПустаяСтрока(ТекстОшибкиРеквизиты) И ПустаяСтрока(ТекстОшибкиТЧ)) Тогда
		
		ТекстСообщения=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Для объекта текущей ИБ %1 не найдено соответствие в объекте %2 типа ИБ %3'"),ДанныеСоответствия.ОписаниеОбъектаТек
		,ДанныеСоответствия.ОписаниеОбъектаВИБ,СтруктураСправочника.ТипБД);
		
		Если Не ПустаяСтрока(ТекстОшибкиРеквизиты) Тогда
			
			ТекстСообщения=ТекстСообщения+Символы.ПС+Нстр("ru = 'Контролируемые реквизиты:'")+ТекстОшибкиРеквизиты;
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстОшибкиТЧ) Тогда
			
			ТекстСообщения=ТекстСообщения+Символы.ПС+Нстр("ru = 'Контролируемые табличные части:'")+ТекстОшибкиТЧ;
			
		КонецЕсли;
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения,,,СтатусСообщения.Внимание);
		
	КонецЕсли;	
	
	Возврат СтруктураСправочника;
		
КонецФункции // ПодготовитьДанныеКонтроляНСИ() 

Процедура ВыгрузитьДанныеКонтроляНСИ(ОписаниеОбъектаТек=Неопределено,ПриЗаписиИзменений=Ложь,ВыполнитьВФоне=Истина,ИспользуемаяИБ=Неопределено) Экспорт

	Запрос=Новый Запрос;
	ТекстЗапроса="ВЫБРАТЬ
	             |	УстановкаПараметровКонтроляНСИ.НастройкаСоответствия КАК НастройкаСоответствия,
	             |	УстановкаПараметровКонтроляНСИ.ИспользуемаяИБ КАК ИспользуемаяИБ,
	             |	УстановкаПараметровКонтроляНСИ.ТипКонтроляНСИ КАК ТипКонтроляНСИ,
				 |	УстановкаПараметровКонтроляНСИ.СогласованиеСвязанныхОбъектов КАК СогласованиеСвязанныхОбъектов,
	             |	УстановкаПараметровКонтроляНСИ.ТипБД.ОбменДаннымиРегламентнымЗаданием КАК ОбменДаннымиРегламентнымЗаданием
	             |ИЗ
	             |	РегистрСведений.УстановкаПараметровКонтроляНСИ КАК УстановкаПараметровКонтроляНСИ
	             |ГДЕ
	             |	&Параметр1
	             |	И &Параметр2
				 |	И &Параметр3
	             |	И НЕ УстановкаПараметровКонтроляНСИ.ЗначениеУстановлено";
	
	Если ПриЗаписиИзменений Тогда
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","НЕ УстановкаПараметровКонтроляНСИ.ТипБД.ОбменДаннымиРегламентнымЗаданием");	
		
	Иначе
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","ИСТИНА");
		
	КонецЕсли;
	
	Если НЕ ОписаниеОбъектаТек=Неопределено Тогда
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр2","УстановкаПараметровКонтроляНСИ.ОписаниеОбъектаТек=&ОписаниеОбъектаТек");
		Запрос.УстановитьПараметр("ОписаниеОбъектаТек",ОписаниеОбъектаТек);
		
	Иначе
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр2","ИСТИНА");
		
	КонецЕсли;
	
	Если НЕ ИспользуемаяИБ=Неопределено Тогда
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр3","УстановкаПараметровКонтроляНСИ.ИспользуемаяИБ=&ИспользуемаяИБ");
		Запрос.УстановитьПараметр("ИспользуемаяИБ",ИспользуемаяИБ);
		
	Иначе
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр3","ИСТИНА");
		
	КонецЕсли;
	
	Запрос.Текст=ТекстЗапроса;
	
	ВыгрузитьНаборДанныхКонтроляНСИ(Запрос.Выполнить().Выгрузить(),ВыполнитьВФоне);
		
КонецПроцедуры // ВыгрузитьДанныеКонтроляНСИ() 

Процедура СоздатьНастройкиПравилКонтроляНСИ(ТипБД,НастройкаСоответствия=Неопределено,КонтролироватьНСИ=Истина) Экспорт

	Запрос=Новый Запрос;
	ТекстЗапроса="ВЫБРАТЬ
	             |	СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ КАК ОписаниеОбъектаВИБ,
	             |	СоответствиеВнешнимИБ.ОписаниеОбъектаТек КАК ОписаниеОбъектаТек,
	             |	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
	             |	СоответствиеВнешнимИБ.Владелец КАК ТипБД
	             |ПОМЕСТИТЬ НастройкиСоответствия
	             |ИЗ
	             |	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	             |ГДЕ
	             |	СоответствиеВнешнимИБ.Владелец = &ТипБД
	             |	И &ПараметрНастройкаСоответствия
	             |	И СоответствиеВнешнимИБ.ОписаниеОбъектаТек ССЫЛКА Справочник.СправочникиБД
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СправочникиБД.Ссылка КАК ОписаниеОбъектаТек,
	             |	СправочникиБД.ТипКонтроляНСИ КАК ТипКонтроляНСИ,
	             |	СправочникиБД.ВидКонтроляНСИ КАК ВидКонтроляНСИ,
	             |	СправочникиБД.Синоним КАК Синоним,
	             |	СправочникиБД.ПоставщикПотребительНСИ КАК ПоставщикПотребительНСИ,
	             |	СправочникиБД.СогласованиеСвязанныхОбъектов КАК СогласованиеСвязанныхОбъектов
	             |ПОМЕСТИТЬ КонтролируемыеСправочники
	             |ИЗ
	             |	Справочник.СправочникиБД КАК СправочникиБД
	             |ГДЕ
	             |	СправочникиБД.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	             |	И НЕ СправочникиБД.ПометкаУдаления
	             |	И СправочникиБД.Контролируемый
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	НастройкиСоответствия.НастройкаСоответствия КАК НастройкаСоответствия,
	             |	КонтролируемыеСправочники.ОписаниеОбъектаТек КАК ОписаниеОбъектаТек,
	             |	КонтролируемыеСправочники.ВидКонтроляНСИ КАК ВидКонтроляНСИ,
	             |	КонтролируемыеСправочники.СогласованиеСвязанныхОбъектов КАК СогласованиеСвязанныхОбъектов,
	             |	КонтролируемыеСправочники.Синоним КАК Синоним,
	             |	ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ
	             |ИЗ
	             |	НастройкиСоответствия КАК НастройкиСоответствия
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеСправочники КАК КонтролируемыеСправочники
	             |		ПО НастройкиСоответствия.ОписаниеОбъектаТек = КонтролируемыеСправочники.ОписаниеОбъектаТек
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	             |		ПО НастройкиСоответствия.ТипБД = ВнешниеИнформационныеБазы.ТипБД";
	
	Если НастройкаСоответствия=Неопределено Тогда
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&ПараметрНастройкаСоответствия","ИСТИНА");
		
	Иначе
		
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&ПараметрНастройкаСоответствия","СоответствиеВнешнимИБ.Ссылка = &НастройкаСоответствия");
		Запрос.УстановитьПараметр("НастройкаСоответствия",НастройкаСоответствия);
		
	КонецЕсли;
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ТипБД",ТипБД);
	
	ОбменДаннымиРегламентнымЗаданием=ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипБД,"ОбменДаннымиРегламентнымЗаданием");
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НаборЗаписей=РегистрыСведений.УстановкаПараметровКонтроляНСИ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОписаниеОбъектаТек.Установить(Результат.ОписаниеОбъектаТек);
		НаборЗаписей.Отбор.ТипБД.Установить(ТипБД);
		НаборЗаписей.Отбор.НастройкаСоответствия.Установить(Результат.НастройкаСоответствия);
		НаборЗаписей.Отбор.ИспользуемаяИБ.Установить(Результат.ИспользуемаяИБ);
		
		НоваяСтрока=НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Результат);
		НоваяСтрока.ТипБД=ТипБД;
		НоваяСтрока.ТипКонтроляНСИ=?(КонтролироватьНСИ,
					Справочники.СправочникиБД.ПолучитьТипКонтроляНСИ(Результат.ВидКонтроляНСИ,Перечисления.ПоставщикПотребительНСИ.ПоставщикПотребитель),
					Перечисления.ТипыКонтроляНСИ.НеКонтролируется);
					
		НоваяСтрока.ПоставщикПотребительНСИ=Перечисления.ПоставщикПотребительНСИ.ПоставщикПотребитель;
		
		НаборЗаписей.Записать(Истина);
		
		Если НЕ ОбменДаннымиРегламентнымЗаданием Тогда
			
			ВыгрузитьДанныеКонтроляНСИ(,Истина,Истина,Результат.ИспользуемаяИБ);
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры // СоздатьНастройкиПравилКонтроляНСИ() 

Функция ПолучитьДанныеКонтроляНСИ(НастройкаСоответствия,КэшНастроекСоответствия)

	СтруктураСправочника=КэшНастроекСоответствия.Получить(НастройкаСоответствия);
	
	Если СтруктураСправочника=Неопределено Тогда
		
		СтруктураСправочника=ПодготовитьДанныеКонтроляНСИ(НастройкаСоответствия);
		
		КэшНастроекСоответствия.Вставить(НастройкаСоответствия,СтруктураСправочника);
		
	КонецЕсли;
	
	Возврат СтруктураСправочника; 	
	
КонецФункции // ПолучитьДанныеКонтроляНСИ() 

Процедура ВыгрузитьНаборДанныхКонтроляНСИ(ТаблицаДанныхКонтроля,ВыполнитьВФоне=Истина) Экспорт

	КэшНастроекСоответствия=Новый Соответствие;
	СтруктураИБ=ПолучитьДанныеПодключенияТекущаяИБ();
	
	Для Каждого Строка ИЗ ТаблицаДанныхКонтроля Цикл
		
		СтруктураСправочника=ПолучитьДанныеКонтроляНСИ(Строка.НастройкаСоответствия,КэшНастроекСоответствия);
		
		СтруктураСправочника.Вставить("ТипКонтроляНСИ",XMLСтрока(Строка.ТипКонтроляНСИ));
		СтруктураСправочника.Вставить("СогласованиеСвязанныхОбъектов",XMLСтрока(Строка.СогласованиеСвязанныхОбъектов));
		СтруктураСправочника.Вставить("Контролируемый",(НЕ Строка.ТипКонтроляНСИ=Перечисления.ТипыКонтроляНСИ.НеКонтролируется));
		
		СтруктураКонтроля=Новый Структура;
		СтруктураКонтроля.Вставить("СтруктураСправочника",СтруктураСправочника); 
		
		СтруктураИБ.Вставить("ОбменДаннымиРегламентнымЗаданием",Строка.ОбменДаннымиРегламентнымЗаданием);	
		СтруктураКонтроля.Вставить("СтруктураИБ",СтруктураИБ);  
		
		СтруктураКонтроля.Вставить("GUIDТекущейИБ",XMLСтрока(Строка.ИспользуемаяИБ));
		
		Если ВыполнитьВФоне Тогда
			
			ОписаниеЗадания=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Выгрузка правил контроля. Настройка сооответствия: %1, внешняя ИБ %2'"),Строка.НастройкаСоответствия,Строка.ИспользуемаяИБ);
			КлючЗадания=Новый УникальныйИдентификатор;
			
			ПараметрыЗадания=Новый Массив;
			ПараметрыЗадания.Добавить(Строка.ИспользуемаяИБ);
			ПараметрыЗадания.Добавить(СтруктураКонтроля);
			ПараметрыЗадания.Добавить(Строка.НастройкаСоответствия);
			
			ФоновыеЗадания.Выполнить("ОбменДаннымиНСИУХ.ВыгрузитьПравилаКонтроля",ПараметрыЗадания,КлючЗадания,ОписаниеЗадания);
			
		Иначе
			
			ВыгрузитьПравилаКонтроля(Строка.ИспользуемаяИБ,СтруктураКонтроля,Строка.НастройкаСоответствия);
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры // ВыгрузитьНаборДанныхКонтроляНСИ() 

Функция ПолучитьДанныеПодключенияТекущаяИБ()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ВнешниеИнформационныеБазы.URIПространстваИмен КАК URIПространстваИмен,
	|	ВнешниеИнформационныеБазы.АутентификацияWindows КАК АутентификацияWindows,
	|	ВнешниеИнформационныеБазы.ИмяWebСервиса КАК ИмяWebСервиса,
	|	ВнешниеИнформационныеБазы.ИмяИБНаСервере КАК ИмяИБНаСервере,
	|	ВнешниеИнформационныеБазы.ИмяСервера КАК ИмяСервера,
	|	ВнешниеИнформационныеБазы.ИспользоватьWS КАК ИспользоватьWS,
	|	ВнешниеИнформационныеБазы.КаталогИБ КАК КаталогИБ,
	|	ВнешниеИнформационныеБазы.Пароль КАК Пароль,
	|	ВнешниеИнформационныеБазы.Пользователь КАК Пользователь,
	|	ВнешниеИнформационныеБазы.ПутьКWebСервису КАК ПутьКWebСервису,
	|	ВнешниеИнформационныеБазы.СтрокаПодключения КАК СтрокаПодключения,
	|	ВнешниеИнформационныеБазы.ТочкаПодключенияWebСервиса КАК ТочкаПодключенияWebСервиса,
	|	ВнешниеИнформационныеБазы.НаименованиеЦентрализованнойБазы КАК Наименование,
	|	ВнешниеИнформационныеБазы.РазмещениеВнешнейИБ КАК РазмещениеВнешнейИБ,
	|	ВнешниеИнформационныеБазы.КодИнформационнойСистемы КАК КодИнформационнойСистемы
	|ИЗ
	|	Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	|ГДЕ
	|	ВнешниеИнформационныеБазы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Справочники.ВнешниеИнформационныеБазы.ТекущаяИБ);
	
	ДанныеИБ=Запрос.Выполнить().Выгрузить()[0];
	
	СтруктураИБ=ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеИБ);
	СтруктураИБ.Вставить("РазмещениеВнешнейИБ",XMLСтрока(СтруктураИБ.РазмещениеВнешнейИБ));
	СтруктураИБ.Вставить("GUIDЦентрализованнойБазы",XMLСтрока(Справочники.ВнешниеИнформационныеБазы.ТекущаяИБ));
	
	Возврат СтруктураИБ;
		
КонецФункции // ПолучитьДанныеПодключенияТекущаяИБ() 

Процедура ВыгрузитьПравилаКонтроля(ИспользуемаяИБ,СтруктураКонтроля,НастройкаСоответствия) Экспорт
	
	ТекСоединениеВИБ=ПодключениеКВИБУХ.ПолучитьСоединение(ИспользуемаяИБ, 1);
	
	Если ТекСоединениеВИБ=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатВыполнения=Истина;
	
	Если ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") Тогда
		
		РезультатВыполнения= ТекСоединениеВИБ.SetUpControlParameters(Новый ХранилищеЗначения(СтруктураКонтроля, Новый СжатиеДанных(9))).Получить();
		
	ИначеЕсли ТипЗнч(ТекСоединениеВИБ) = Тип("Строка") Тогда
	
		РезультатВыполнения= РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОтвет1СШина(ТекСоединениеВИБ,"SetUpControlParameters",СтруктураКонтроля);
		
	Иначе
		
		РезультатВыполнения= РаботаСОбъектамиМетаданныхВнешнийУХ.SetUpControlParameters(ТекСоединениеВИБ,СтруктураКонтроля);
		
	КонецЕсли;
	
	Если РезультатВыполнения=Истина Тогда
		
		НаборЗаписей=РегистрыСведений.УстановкаПараметровКонтроляНСИ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИспользуемаяИБ.Установить(ИспользуемаяИБ);
		НаборЗаписей.Отбор.НастройкаСоответствия.Установить(НастройкаСоответствия);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей[0].ЗначениеУстановлено=Истина;
		НаборЗаписей.Записать();
		
	КонецЕсли;
				
КонецПроцедуры // ВыгрузитьПравилаКонтроля() 

Процедура ВыполнитьОбменДаннымиНСИЦентральнаяИБ()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ДанныеДляОбмена.ДочерняяБаза КАК ДочерняяБаза,
	|	СУММА(ДанныеДляОбмена.ВыгрузитьПравилаКонтроля) КАК ВыгрузитьПравилаКонтроля,
	|	СУММА(ДанныеДляОбмена.ЗагрузитьЗаявки) КАК ЗагрузитьЗаявки,
	|	СУММА(ДанныеДляОбмена.ВыгрузитьСтатусы) КАК ВыгрузитьСтатусы
	|ИЗ
	|	(ВЫБРАТЬ
	|		УстановкаПараметровКонтроляНСИ.ИспользуемаяИБ КАК ДочерняяБаза,
	|		1 КАК ВыгрузитьПравилаКонтроля,
	|		0 КАК ЗагрузитьЗаявки,
	|		0 КАК ВыгрузитьСтатусы
	|	ИЗ
	|		РегистрСведений.УстановкаПараметровКонтроляНСИ КАК УстановкаПараметровКонтроляНСИ
	|	ГДЕ
	|		НЕ УстановкаПараметровКонтроляНСИ.ЗначениеУстановлено
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза,
	|		0,
	|		1,
	|		0
	|	ИЗ
	|		РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
	|	ГДЕ
	|		НЕ СоответствиеЗаявокНаИзменениеНСИ.ОбменВыполнен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СоответствиеЗаявокНаИзменениеНСИ.ДочерняяБаза,
	|		0,
	|		0,
	|		1
	|	ИЗ
	|		РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
	|	ГДЕ
	|		СоответствиеЗаявокНаИзменениеНСИ.ТребуетсяПередачаСтатуса) КАК ДанныеДляОбмена
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляОбмена.ДочерняяБаза
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДанныеДляОбмена.ВыгрузитьПравилаКонтроля) > 0
	|		ИЛИ СУММА(ДанныеДляОбмена.ЗагрузитьЗаявки) > 0
	|		ИЛИ СУММА(ДанныеДляОбмена.ВыгрузитьСтатусы) > 0)";
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		ПараметрыОбмена=Новый Структура;
		ПараметрыОбмена.Вставить("ВыгрузитьПравилаКонтроля",Результат.ВыгрузитьПравилаКонтроля>0);
		ПараметрыОбмена.Вставить("ЗагрузитьЗаявки",			Результат.ЗагрузитьЗаявки>0);
		ПараметрыОбмена.Вставить("ВыгрузитьСтатусы",		Результат.ВыгрузитьСтатусы>0);
		
		ОписаниеЗадания=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Обмен данными контроля НСИ, внешняя ИБ %1'"),Результат.ДочерняяБаза);
		КлючЗадания=Новый УникальныйИдентификатор;
		
		ПараметрыЗадания=Новый Массив;
		ПараметрыЗадания.Добавить(Результат.ДочерняяБаза);
		ПараметрыЗадания.Добавить(ПараметрыОбмена);
		
		ФоновыеЗадания.Выполнить("ОбменДаннымиНСИУХ.ВыполнитьОбменДаннымиНСИИнформационнаяБаза",ПараметрыЗадания,КлючЗадания,ОписаниеЗадания);
			
	КонецЦикла;	
	
КонецПроцедуры // ВыполнитьОбменДаннымиНСИЦентральнаяИБ()

Процедура ВыполнитьОбменДаннымиНСИДочерняяИБ()

	УправлениеНСИ.ВыгрузитьСсылкиЗаявокНаИзменениеНСИ();
	
КонецПроцедуры // ВыполнитьОбменДаннымиНСИДочерняяИБ() 

Процедура ВыполнитьОбменДаннымиКонтроляНСИ() Экспорт
	
	Если Константы.ЭтоЦентрализованнаяБазаНСИ.Получить() Тогда
		
		ВыполнитьОбменДаннымиНСИЦентральнаяИБ();
		
	Иначе
		
		ВыполнитьОбменДаннымиНСИДочерняяИБ();
		
	КонецЕсли;
			
КонецПроцедуры // ВыполнитьОбменДаннымиНСИ()
	
Процедура ВыполнитьОбменДаннымиНСИИнформационнаяБаза(ИнформационнаяБаза,ПараметрыОбмена) Экспорт
	
	Если ПараметрыОбмена.ВыгрузитьПравилаКонтроля Тогда
		
		ВыгрузитьДанныеКонтроляНСИ(,,Ложь,ИнформационнаяБаза);
		
	КонецЕсли;
	
	Если ПараметрыОбмена.ЗагрузитьЗаявки Тогда
		
		ЗагрузитьЗаявкиДочернихКомпаний(ИнформационнаяБаза);
		
	КонецЕсли; 
	
	Если ПараметрыОбмена.ВыгрузитьСтатусы Тогда
		
		ВыгрузитьСтатусыЗаявокДочернихКомпаний(ИнформационнаяБаза);
		
	КонецЕсли;
	
	
КонецПроцедуры // ВыполнитьОбменДаннымиНСИИнформационнаяБаза()

Процедура ВыполнитьОбменНСИПоПараметрам(Ссылка=Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПараметрыОбменаНСИ.Ссылка КАК Ссылка,
	|	ПараметрыОбменаНСИ.НаправлениеОбмена КАК НаправлениеОбмена,
	|	ПараметрыОбменаНСИ.ОписаниеОбъектаМетаданных КАК ОписаниеОбъектаМетаданных,
	|	ПараметрыОбменаНСИ.НастройкаОтбора КАК НастройкаОтбора,
	|	ПараметрыОбменаНСИ.ТолькоИзмененные КАК ТолькоИзмененные,
	|	ПараметрыОбменаНСИ.АдресацияОбменаНСИ.(
	|		АдресОбмена КАК АдресОбмена,
	|		Отбор КАК Отбор
	|	) КАК АдресацияОбменаНСИ,
	|	ПараметрыОбменаНСИ.СпособВыбораИБ КАК СпособВыбораИБ
	|ИЗ
	|	Справочник.ПараметрыОбменаНСИ КАК ПараметрыОбменаНСИ
	|ГДЕ";
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|ПараметрыОбменаНСИ.Ссылка=&Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
	Иначе
		
		Запрос.Текст=Запрос.Текст+"
		|	ПараметрыОбменаНСИ.СпособЗапуска=ЗНАЧЕНИЕ(Перечисление.СпособыЗапускаОбменаНСИ.РегламентноеЗадание)
		|	И НЕ ПараметрыОбменаНСИ.Отключен
		|	И НЕ ПараметрыОбменаНСИ.ПометкаУдаления";
		
	КонецЕсли;
					
	ТаблицаОбмена=Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка ИЗ ТаблицаОбмена Цикл
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			
			ВыполнитьОбменНСИ(Строка);
			
		Иначе
			
			ПараметрыОбмена=ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Строка);
			
			ОписаниеЗадания=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Обмен элементами НСИ по настройке %1'"),Строка.Ссылка);
			КлючЗадания=Новый УникальныйИдентификатор;
			
			ПараметрыЗадания=Новый Массив;
			ПараметрыЗадания.Добавить(ПараметрыОбмена);
			
			ФоновыеЗадания.Выполнить("ОбменДаннымиНСИУХ.ВыполнитьОбменНСИ",ПараметрыЗадания,КлючЗадания,ОписаниеЗадания);
			
		КонецЕсли;
		
	КонецЦикла;	
			
КонецПроцедуры // ВыполнитьОбменПоПараметрам() 

Процедура ВыполнитьОбменНСИ(ПараметрыОбмена) Экспорт

	ПротоколируемыеСобытияУХ.Начать(ПараметрыОбмена.Ссылка);
	
	Если ПараметрыОбмена.НаправлениеОбмена=Перечисления.ВыгрузкаЗагрузка.Выгрузка Тогда
		
		ТаблицаПараметров=Справочники.ПараметрыОбменаНСИ.ПолучитьПараметрыВыгрузкиНСИ(ПараметрыОбмена);
		
		ОбработкаОбмена=Обработки.ОбменНСИ.Создать();
		
		Для Каждого Строка ИЗ ТаблицаПараметров Цикл
			
			НоваяСтрока=ОбработкаОбмена.ПараметрыЭкспортаНСИ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.НастройкаОтбора=ПараметрыОбмена.НастройкаОтбора;
			НоваяСтрока.ТолькоИзмененные=ПараметрыОбмена.ТолькоИзмененные;
			
		КонецЦикла;
		
		ОбработкаОбмена.ВыполнитьВыгрузкуДанных();
			
	Иначе
		
		ТаблицаПараметров=Справочники.ПараметрыОбменаНСИ.ПолучитьПараметрыЗагрузкиНСИ(ПараметрыОбмена);
		
		ОбработкаОбмена=Обработки.ОбменНСИ.Создать();
		
		Для Каждого Строка ИЗ ТаблицаПараметров Цикл
			
			НоваяСтрока=ОбработкаОбмена.ПараметрыИмпортаНСИ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			
		КонецЦикла;
		
		ОбработкаОбмена.ВыполнитьЗагрузкуДанных();
		
	КонецЕсли;
	
	ПротоколОшибок=ПротоколируемыеСобытияУХ.Завершить(Нстр("ru = 'Обмен НСИ'"),,ПараметрыОбмена.Ссылка);		
	ПротоколируемыеСобытияУХ.ЗаписатьПротоколВРегистр(ПараметрыОбмена.Ссылка);				

КонецПроцедуры  // ВыполнитьОбменНСИ()

Процедура ОбработатьОбъектыПоПравилам(НастройкиОбработки) Экспорт
	
	ПериодОбработки=ОбщегоНазначенияУХ.глОтносительныйПериодПоДате(ТекущаяУниверсальнаяДата(),Перечисления.Периодичность.День,0);
	
	Для Каждого СтрокаНастройка ИЗ НастройкиОбработки Цикл
		
		СтруктураПоискаСеанса = Новый Структура;
		СтруктураПоискаСеанса.Вставить("ИспользуемаяИБ",		СтрокаНастройка.ИспользуемаяИБ);
		СтруктураПоискаСеанса.Вставить("ПравилоЗаполнения",		СтрокаНастройка.ПравилоЗаполнения);
		СтруктураПоискаСеанса.Вставить("ОбъектБД",				СтрокаНастройка.ОбъектБД);
		СтруктураПоискаСеанса.Вставить("Организация",			СтрокаНастройка.Организация);
		СтруктураПоискаСеанса.Вставить("Сценарий",				СтрокаНастройка.Сценарий);
		СтруктураПоискаСеанса.Вставить("ОбластьГенерации",		СтрокаНастройка.ОбластьГенерации);
		СтруктураПоискаСеанса.Вставить("ПериодОтчета",			ПериодОбработки);
			
		СтруктураЗаписи = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПоискаСеанса);
		СтруктураЗаписи.Вставить("СеансОбменаДанными",		Справочники.СеансыОбменаДанными.НайтиСоздатьСеансОбменаДанными(СтруктураПоискаСеанса));
		СтруктураЗаписи.Вставить("ПроводитьДокументы",		СтрокаНастройка.ПроводитьДокументы);
		
		ОбработкаОбъект=Обработки.ГенерацияОбъектовБД.Создать();
		ЗаполнитьЗначенияСвойств(ОбработкаОбъект,СтруктураЗаписи);
		ОбработкаОбъект.ОбработатьОбъектыБД();
		
	КонецЦикла;
	
КонецПроцедуры // ОбработатьОбъектыПоПравилам()

 