
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(ТекДанные.ХранимыйФайл) И ЗначениеЗаполнено(ТекДанные.ДатаИзмененияФайла)) Тогда
		
		ОбщегоНазначенияКлиентСерверУХ.СообщитьПользователю(НСтр("ru = 'Не определен файл для открытия!'"));		
		Возврат;
		
	КонецЕсли;
	
	ХранимыеФайлыКлиентУХ.ОткрытьХранимыйФайлДляЧтения(ТекДанные.ХранимыйФайл, ТекДанные.Период);
	
КонецПроцедуры
