
Функция ПолучитьОтношенияКГруппе(ВидОтношенияКГруппе) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГруппыКонтрагентов.Ссылка КАК ОтношениеКГруппе
	|ИЗ
	|	Справочник.ГруппыКонтрагентов КАК ГруппыКонтрагентов
	|ГДЕ
	|	ГруппыКонтрагентов.ВидОтношенияКГруппе = &ВидОтношенияКГруппе";
	Запрос.УстановитьПараметр("ВидОтношенияКГруппе", ВидОтношенияКГруппе);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОтношениеКГруппе");
	
КонецФункции

Функция ПолучитьОтношениеКГруппе(ВидОтношенияКГруппе = Неопределено) Экспорт

	ОтношенияКГруппе = ПолучитьОтношенияКГруппе(ВидОтношенияКГруппе);
	Если ОтношенияКГруппе.Количество() = 0 Тогда
		Возврат Справочники.ГруппыКонтрагентов.ПустаяСсылка();
	Иначе 
		Возврат ОтношенияКГруппе[0];
	КонецЕсли;

КонецФункции

Функция ПолучитьТретьиСтороны() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыКонтрагентов.Ссылка КАК ОтношениеКГруппе
	|ИЗ
	|	Справочник.ГруппыКонтрагентов КАК ГруппыКонтрагентов
	|ГДЕ
	|	ГруппыКонтрагентов.ВидОтношенияКГруппе = ЗНАЧЕНИЕ(Перечисление.ВидыОтношенийКГруппе.ТретьиСтороны)
	|	И НЕ ГруппыКонтрагентов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.ГруппыКонтрагентов.ПустаяСсылка();
		
	Иначе 
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ОтношениеКГруппе;
	
	КонецЕсли;
	
КонецФункции
