////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Разукомплектация ОС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ФормаДокумента

Процедура ОССтоимостьБУПриИзменении(Форма, ТекущиеДанные) Экспорт

	//++ Локализация
	
	// НУ
	СтоимостьНУ_Новая = ?(Форма.СтоимостьБУ <> 0, Форма.СтоимостьНУ * Форма.ЗначенияРеквизитовОСДоИзменения.СтоимостьБУ / Форма.СтоимостьБУ, 0);
	СтоимостьНУ_Новая = Окр(СтоимостьНУ_Новая, Форма.СлужебныеПараметрыФормы.РазрядностьДробнойЧасти); 
		
	Если ТекущиеДанные.СтоимостьНУ = СтоимостьНУ_Новая Тогда
		
		СтоимостьНУ_Новая = ?(Форма.СтоимостьБУ <> 0, Форма.СтоимостьНУ * ТекущиеДанные.СтоимостьБУ / Форма.СтоимостьБУ, 0);
		СтоимостьНУ_Новая = Окр(СтоимостьНУ_Новая, Форма.СлужебныеПараметрыФормы.РазрядностьДробнойЧасти); 
		ТекущиеДанные.СтоимостьНУ = СтоимостьНУ_Новая;
		
	КонецЕсли; 
	
	// ПР
	СтоимостьПР_Новая = ?(Форма.СтоимостьБУ <> 0, Форма.СтоимостьПР * Форма.ЗначенияРеквизитовОСДоИзменения.СтоимостьБУ / Форма.СтоимостьБУ, 0);
	СтоимостьПР_Новая = Окр(СтоимостьПР_Новая, Форма.СлужебныеПараметрыФормы.РазрядностьДробнойЧасти); 
		
	Если ТекущиеДанные.СтоимостьПР = СтоимостьПР_Новая Тогда
		
		СтоимостьПР_Новая = ?(Форма.СтоимостьБУ <> 0, Форма.СтоимостьПР * ТекущиеДанные.СтоимостьБУ / Форма.СтоимостьБУ, 0);
		СтоимостьПР_Новая = Окр(СтоимостьПР_Новая, Форма.СлужебныеПараметрыФормы.РазрядностьДробнойЧасти); 
		ТекущиеДанные.СтоимостьПР = СтоимостьПР_Новая;
		
	КонецЕсли; 
	
	// ВР
	ТекущиеДанные.СтоимостьВР = ТекущиеДанные.СтоимостьБУ - ТекущиеДанные.СтоимостьНУ - ТекущиеДанные.СтоимостьПР;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти