///////////////////////////////////////////////////////////////////////////////////////////////////////
// В модуле реализованы клиент-серверные процедуры и функции, предназначенные для работы с текущими делами EDI
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Определяет имя формы прикладного объекта заказа поставщику
// 
// Возвращаемое значение:
// 	Строка - Полное имя формы прикладного заказа поставщику
Функция ИмяФормыЗаказПоставщику() Экспорт
	
	НастройкиУчета = НастройкиEDI.НастройкиУчета();
	ТипДокумента = НастройкиУчета.СоответствиеДокументовEDIПрикладнымОбъектам[Перечисления.ТипыДокументовEDI.ЗаказПоставщику];
	
	Если ТипДокумента = Неопределено Тогда
		ВызватьИсключение(НСтр("ru = 'Не определен тип прикладного документа ""Заказ поставщику""';
								|en = 'The ""Purchase order"" applied document type is not defined'", 
			ОбщегоНазначения.КодОсновногоЯзыка()));
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДокумента);
	
	Возврат ОбъектМетаданных.ПолноеИмя() + ".ФормаОбъекта";
	
КонецФункции

#КонецОбласти