#Область ПрограммныйИнтерфейс

// Сопоставляет для указанного вида отчета соответствующий ему источник (способ) заполнения.
//
// Параметры:
//  ВидОтчета    - Строка - см. колонку из результата ЗаполнениеФинОтчетностиВБанки.ОписаниеВидовОтчетов()
//  СпособЗаполнения - Строка - принимает значения: ОтчетБРО, СтандартныйОтчет, ВнешнийФайл, ПроизвольныйФайл.
//
Процедура ОпределитьСпособЗаполненияВидаОтчета(ВидОтчета, СпособЗаполнения) Экспорт
	//++ НЕ УТ
	Если Не ЗначениеЗаполнено(ВидОтчета) Или ВидОтчета = "ПроизвольныйФайл" Тогда
		СпособЗаполнения = "ПроизвольныйФайл";
		Возврат;
	КонецЕсли;

	СпособЗаполненияВидаОтчета = ЗаполнениеФинОтчетностиВБанкиКлиентСерверУП.ОпределитьСпособЗаполненияВидаОтчета(ВидОтчета);
	Если ЗначениеЗаполнено(СпособЗаполненияВидаОтчета) Тогда
		СпособЗаполнения = СпособЗаполненияВидаОтчета;
	КонецЕсли;
	//-- НЕ УТ
КонецПроцедуры

// Отображает или скрывает кнопку "Настройка отправки отчетности".
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - должна содержать кнопку СписокНастроитьОтправку.
//
Процедура УстановитьВидимостьКнопкиНастройкиОтправки(Форма) Экспорт
	//++ НЕ УТ
	ЗаполнениеФинОтчетностиВБанкиКлиентСерверУП.УстановитьВидимостьКнопкиНастройкиОтправки(Форма);
	//-- НЕ УТ
КонецПроцедуры

#КонецОбласти
