
#Область СлужебныйПрограммныйИнтерфейс

#Область ВложенныеФормы

Процедура ОбрабткаВложеннойФормы(Знач Форма, Параметры) Экспорт
	
	Если Параметры.Свойство("КоманднаяПанельВложеннойФормы") Тогда
		
		КоманднаяПанельВложеннойФормы 	= Параметры.КоманднаяПанельВложеннойФормы;
		ПараметрыПанели 				= КоманднаяПанельВложеннойФормы.ПараметрыПанели; 
		ДобавленныеКоманды 				= КоманднаяПанельВложеннойФормы.ДобавленныеКоманды;
		
		Если Форма.Элементы.Найти(ПараметрыПанели.Имя) = Неопределено Тогда
			Родитель = Форма.Элементы.Найти(ПараметрыПанели.Родитель);
			ПередЭлементом = Форма.Элементы.Найти(ПараметрыПанели.ПередЭлементом);
			ГруппаПанель = ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, 
									ПараметрыПанели.Имя, 
									ПараметрыПанели.Заголовок, 
									ВидГруппыФормы[ПараметрыПанели.Вид],
									Родитель, 
									ПередЭлементом,
									Новый Структура("РастягиватьПоГоризонтали, ОтображатьЗаголовок", Ложь, Ложь));
		КонецЕсли;
		
		Если Форма.Элементы.Найти(ПараметрыПанели.Имя + "КомандыНавигации") = Неопределено Тогда
			
			ГруппаКоманд = ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, 
									ПараметрыПанели.Имя + "КомандыНавигации",
									"Панель навигации вложенной формы", 
									ВидГруппыФормы.КоманднаяПанель,
									Форма.Элементы[ПараметрыПанели.Имя],,
									Новый Структура("РастягиватьПоГоризонтали", Ложь));
													
			ГруппаКомандКнопок = ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, 
									ПараметрыПанели.Имя + "КомандыНавигацииКнопки",
									"Кнопки панели навигации вложенной формы", 
									ВидГруппыФормы.ГруппаКнопок,
									ГруппаКоманд,,
									Новый Структура("Отображение, РастягиватьПоГоризонтали", 
													ОтображениеГруппыКнопок.Компактное,
													Ложь));
			
			Для Каждого Команда Из ДобавленныеКоманды Цикл
				
				Если Форма.Команды.Найти(Команда.ИмяКоманды) = Неопределено Тогда
					НоваяКоманда = Форма.Команды.Добавить(Команда.ИмяКоманды);
					НоваяКоманда.Действие  = "Подключаемый_Команда";
					НоваяКоманда.Заголовок = Команда.Заголовок;
				КонецЕсли;
				
				Если Форма.Элементы.Найти(Команда.ИмяКоманды) = Неопределено Тогда
					Кнопка = Форма.Элементы.Добавить(Команда.ИмяКоманды, Тип("КнопкаФормы"), ГруппаКомандКнопок);
					Кнопка.ИмяКоманды = Команда.ИмяКоманды;
					Кнопка.Вид = ВидКнопкиФормы[Команда.Вид];
					Кнопка.Заголовок = Команда.Заголовок; 
					Кнопка.Пометка = Команда.Пометка;
				Иначе
					Форма.Элементы[Команда.ИмяКоманды].Заголовок = Команда.Заголовок;	
				КонецЕсли;
				
				Если Форма.ПостоянныеКоманды.НайтиПоЗначению(Команда.ИмяКоманды) = Неопределено Тогда
					Форма.ПостоянныеКоманды.Добавить(Команда.ИмяКоманды, Команда.Действие);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область СКД_Расшифровка

// Функция возвращает значения полей, установленные в отборе расшифровки
//
// Параметры:
//  СхемаКомпоновкиДанных	 - 	СхемаКомпоновкиДанных, Строка - исходная схема компоновки данных 
// 																или ее адрес во временном хранилище.
//  ДанныеРасшифровки		 - 	ДанныеРасшифровкиКомпоновкиДанных, Строка - данные расшифровки 
// 																			или их адрес во временном хранилище
//  Расшифровка				 - 	ИдентификаторРасшифровкиКомпоновкиДанных - идентификатор расшифровки
//  СписокПолей				 - 	Строка - список полей, значения которых необходимо получить, перечисленных через запятую
// 
// Возвращаемое значение:
//  Структура - структура, ключами которой являются имена полей, а значениями - найденные значения отборов. 
// 				Если значение отбора не найдено, либо отбор установлен не с видом сравнения Равно, устанавливается значение Неопределено.
//
Функция ПолучитьЗначенияИзРасшифровки(Знач СхемаКомпоновкиДанных, Знач ДанныеРасшифровки, Знач Расшифровка, Знач СписокПолей) Экспорт
	
	МассивСтрок = СтрРазделить(СписокПолей, ",", Ложь);
	ЗначенияРеквизитов = Новый Структура;
	
	Для Каждого ТекРеквизит Из МассивСтрок Цикл
		ЗначенияРеквизитов.Вставить(СокрЛП(ТекРеквизит));
	КонецЦикла;
	
	Если Расшифровка = Неопределено Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникНастроек);
		НастройкаРасшифровки = ОбработкаРасшифровки.Расшифровать(Расшифровка, Новый ПолеКомпоновкиДанных(СокрЛП(МассивСтрок[0])));
		Для Каждого ТекОтбор Из НастройкаРасшифровки.Отбор.Элементы Цикл
			
			Если НЕ ТекОтбор.Использование ИЛИ ТекОтбор.ВидСравнения <> ВидСравненияКомпоновкиДанных.Равно Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяПоля = Строка(ТекОтбор.ЛевоеЗначение);
			// Может быть реквизит "через точку", в этом случае его игнорируем.
			Если СтрНайти(ИмяПоля, ".") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначенияРеквизитов.Свойство(ИмяПоля) Тогда
				ЗначенияРеквизитов[ИмяПоля] = ТекОтбор.ПравоеЗначение;
			КонецЕсли;
			
		КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
	
КонецФункции

Функция ПолучитьОтборРасшифровки(Знач Расшифровка, Знач ДанныеРасшифровкиВход, ВключатьРесурсы = Ложь) Экспорт
		
	Если ТипЗнч(ДанныеРасшифровкиВход) = Тип("Строка") Тогда		
		ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиВход);
	Иначе 
		ДанныеРасшифровки = ДанныеРасшифровкиВход;
	КонецЕсли;
	
	ОтборРезультат = Новый Соответствие;
		
	Для Каждого ЭлементОтбора Из ПолучитьЭлементыОтбора(ДанныеРасшифровки.Настройки.Отбор) Цикл
		
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если (ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно) 
			Или ((ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии)) Тогда
			ОтборРезультат.Вставить(Строка(ЭлементОтбора.ЛевоеЗначение), ЭлементОтбора.ПравоеЗначение);
		ИначеЕсли ((ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке)
			Или (ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии)) Тогда
			ОтборРезультат.Вставить(Строка(ЭлементОтбора.ЛевоеЗначение), ЭлементОтбора.ПравоеЗначение);
		Иначе 
			
			Отборы = ОтборРезультат.Получить("Отборы");
			Если Отборы = Неопределено Тогда
				Отборы = Новый Массив;
			КонецЕсли;
			Отборы.Добавить(ЭлементОтбора);
			ОтборРезультат.Вставить("Отборы", Отборы);
			
		КонецЕсли;
				
	КонецЦикла;
	
	Для каждого Параметр Из ДанныеРасшифровки.Настройки.ПараметрыДанных.Элементы Цикл
	    Если Параметр.Использование Тогда
			ОтборРезультат.Вставить(Строка(Параметр.Параметр), Параметр.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	МассивПолейРасшифровки = Новый Массив;	
	ДобавитьРодителей(ДанныеРасшифровки.Элементы[Расшифровка], ДанныеРасшифровки, МассивПолейРасшифровки, ВключатьРесурсы);
	ЗаменыПолей = Новый Соответствие;
	Для каждого Поле Из МассивПолейРасшифровки Цикл
		Если Поле.Иерархия И (ЗаменыПолей.Получить(Поле.Поле) <> Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		ОтборРезультат.Вставить(Поле.Поле, Поле.Значение);
		ЗаменыПолей.Вставить(Поле.Поле, Истина);
	КонецЦикла;
	
	Возврат ОтборРезультат;
	
КонецФункции

// Возвращает массив, по которому следует расшифровать отчет
Функция ПолучитьМассивПолейРасшифровки(Знач Расшифровка, Знач ДанныеРасшифровкиВход, ТекущийОтчет = Неопределено, ВключатьРесурсы = Ложь) Экспорт
	
	Если ТипЗнч(ДанныеРасшифровкиВход) = Тип("Строка") Тогда		
		ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиВход);
	Иначе 
		ДанныеРасшифровки = ДанныеРасшифровкиВход;
	КонецЕсли;
	
	МассивПолейРасшифровки = Новый Массив;
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") 
	   И ТипЗнч(Расшифровка) <> Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		Возврат МассивПолейРасшифровки;
	КонецЕсли;
	
	Если ТекущийОтчет = Неопределено Тогда
		ТекущийОтчет = ДанныеРасшифровки;
	КонецЕсли;
	
	// Добавим поля родительских группировок
	ДобавитьРодителей(ДанныеРасшифровки.Элементы[Расшифровка], ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	
	Количество = МассивПолейРасшифровки.Количество();
	Для Индекс = 1 По Количество Цикл
		ОбратныйИндекс = Количество - Индекс;
		Для ИндексВнутри = 0 По ОбратныйИндекс - 1 Цикл
			Если МассивПолейРасшифровки[ОбратныйИндекс].Поле = МассивПолейРасшифровки[ИндексВнутри].Поле Тогда
				МассивПолейРасшифровки.Удалить(ОбратныйИндекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ЭлементОтбора Из ПолучитьЭлементыОтбора(ТекущийОтчет.Настройки.Отбор) Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		МассивПолейРасшифровки.Добавить(ЭлементОтбора);
	КонецЦикла;
	
	Возврат МассивПолейРасшифровки;
	
КонецФункции

Функция ДобавитьРодителей(ЭлементРасшифровки, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы = Ложь)
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Новый ПолеКомпоновкиДанных(Поле.Поле), ТекущийОтчет);
			Если Не ВключатьРесурсы И (ДоступноеПоле = Неопределено Или ДоступноеПоле.Ресурс) Тогда
				Продолжить;
			КонецЕсли;
			МассивПолейРасшифровки.Добавить(Поле);
		КонецЦикла;
	КонецЕсли;
	Для каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДобавитьРодителей(Родитель, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьНастройкиПоРасшифровке(Знач Расшифровка, Знач ДанныеРасшифровки) Экспорт
	
	ПоляРасшифровки = ПолучитьЗначенияИзРасшифровки(, ДанныеРасшифровки, Расшифровка, Ложь);  	
	
КонецФункции

Функция ПолучитьНастройкиПриемникаПоРасшифровке(Знач Расшифровка, Знач ДанныеРасшифровки, Знач ОписаниеОтчетаПриемника, Знач НастройкиИсточник = Неопределено) Экспорт
		
	ЗначенияРасшифровки = ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровки, Неопределено, Ложь);
	
	ОтчетПриемник_Имя = ОписаниеОтчетаПриемника.ИмяОтчета;	
	ОтчетПриемник_Макет = ?(ОписаниеОтчетаПриемника.Свойство("ИмяМакета"), ОписаниеОтчетаПриемника.ИмяМакета, "ОсновнаяСхемаКомпоновкиДанных");
	ОтчетПриемник_ИмяВарианта = ?(ОписаниеОтчетаПриемника.Свойство("ИмяВарианта"), ОписаниеОтчетаПриемника.ИмяВарианта, "Основной");
	
	ВариантНастройки = Отчеты[ОтчетПриемник_Имя].ПолучитьМакет(ОтчетПриемник_Макет).ВариантыНастроек[ОтчетПриемник_ИмяВарианта];
	НастройкиПриемник = ВариантНастройки.Настройки;
	НастройкиПриемник.ДополнительныеСвойства.Вставить("ПредставлениеВарианта", ВариантНастройки.Представление);
	
	Для каждого ЭлементРасшифровки Из ЗначенияРасшифровки Цикл
		
 		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
												НастройкиПриемник.Отбор, 
												ЭлементРасшифровки.ЛевоеЗначение, 
												ЭлементРасшифровки.ПравоеЗначение, 
												ЭлементРасшифровки.ВидСравнения,
												ЭлементРасшифровки.Представление,
												ЭлементРасшифровки.Использование,
												ЭлементРасшифровки.РежимОтображения,
												ЭлементРасшифровки.ИдентификаторРасшифровкиКомпоновкиДанных
											);
											
		Иначе 
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
												НастройкиПриемник.Отбор, 
												ЭлементРасшифровки.Поле, 
												ЭлементРасшифровки.Значение,
												,
												,
												Истина
											);
											
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкиИсточник <> Неопределено Тогда 
		Для каждого Параметр Из НастройкиИсточник.ПараметрыДанных.Элементы Цикл			
			
			Если Параметр.Использование Тогда
				ЗначениеПараметра = НастройкиПриемник.ПараметрыДанных.НайтиЗначениеПараметра(Параметр.Параметр);
				Если ЗначениеПараметра <> Неопределено Тогда
					ЗначениеПараметра.Значение = Параметр.Значение;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат НастройкиПриемник;

КонецФункции

#КонецОбласти

#Область Отчеты

Функция ЯчейкиДляКонтроляИсполнения(АдресДанныеРасшифровки, МассивИдентификаторовРасшифровки) Экспорт
	
	ДанныеРасшифровки = Новый Массив;
	Для Каждого Расшифровка Из МассивИдентификаторовРасшифровки Цикл
		Данные = ПолучитьДанныеРасшифровки(АдресДанныеРасшифровки, Расшифровка);
		Данные.Вставить("ИдентификаторРасшифровки", Расшифровка);
		ДанныеРасшифровки.Добавить(Данные);
	КонецЦикла;
	Возврат ДанныеРасшифровки;
	
КонецФункции

Функция ЯчейкиДляУстановкиЛимитов(АдресДанныеРасшифровки, МассивИдентификаторовРасшифровки, ВидБюджета) Экспорт
	
	ДанныеВыделенныхЯчеек = ДанныеРасшифровкиПолей(АдресДанныеРасшифровки, МассивИдентификаторовРасшифровки);
	
	ЯчейкиДляУстановки = Новый Массив;	
	Для каждого ДанныеЯчейки Из ДанныеВыделенныхЯчеек Цикл		
		ДанныеЯчейки.Вставить("ВидБюджета", ВидБюджета);
		ЯчейкиДляУстановки.Добавить(ДанныеЯчейки);
	КонецЦикла;
	
	Возврат ЯчейкиДляУстановки;
	
КонецФункции

Функция ДанныеРасшифровкиПолей(АдресРасшифровки, МассивИдентификаторовРасшифровки)
	
	МассивДанных = Новый Массив;
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки);
	Для каждого Идентификатор Из МассивИдентификаторовРасшифровки Цикл
		ДанныеПоля = ДанныеРасшифровкиПоля(ДанныеРасшифровки, Идентификатор);
		МассивДанных.Добавить(ДанныеПоля);
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

Функция ДанныеРасшифровкиПоля(ДанныеРасшифровки, ИдентификаторРасшифровки)
		
	СтруктураПолей = Новый Структура;
	
	ЭлементыРасшифровки = ДанныеРасшифровки.Элементы[ИдентификаторРасшифровки];
	Для каждого Элемент Из ЭлементыРасшифровки.ПолучитьПоля() Цикл
		СтруктураПолей.Вставить(Элемент.Поле, Элемент.Значение);
	КонецЦикла;
	
	Возврат СтруктураПолей;
	
КонецФункции

Функция ПолучитьДанныеРасшифровки(АдресДанныеРасшифровки, ИДРасшифровки)
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныеРасшифровки);
	
	Результат = Новый Структура;
	
	ДанныеРасшифровкиПоляРекурсивно(ДанныеРасшифровки, ИДРасшифровки, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура ДанныеРасшифровкиПоляРекурсивно(ДанныеРасшифровки, ИДРасшифровки, Результат)
	
	ЭлементРасшифровки = ДанныеРасшифровки.Элементы[ИДРасшифровки];
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		// Получаем данные поля
		Для каждого Элемент Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Результат.Вставить(Элемент.Поле, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// Получаем данные родителей
	Для Каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДанныеРасшифровкиПоляРекурсивно(ДанныеРасшифровки, Родитель.Идентификатор, Результат);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив элементов отбора или групп элементов отбора
Функция ПолучитьЭлементыОтбора(ЭлементСтруктуры, ТолькоГруппы = Ложь) Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
	
	МассивПолей = Новый Массив;
	
	ДобавитьЭлементыОтбораВМассив(ЭлементСтруктуры.Элементы, МассивПолей, ТолькоГруппы);
	Возврат МассивПолей;
	
КонецФункции

Процедура ДобавитьЭлементыОтбораВМассив(Элементы, МассивПолей, ТолькоГруппы = Ложь)
	
	Для каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Если ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
			ДобавитьЭлементыОтбораВМассив(Элемент.Элементы, МассивПолей, ТолькоГруппы);
		Иначе
			Если Не ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область СКД_ДоступныеЭлементы

Функция ПолучитьДоступноеПоле(Знач Поле, ОбластьПоиска) Экспорт
	
	Возврат ОбластьПоиска.НайтиПоле(Поле);
	
КонецФункции

// Возвращает доступное поле по полю компоновки
Функция ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ПолеКомпоновкиДанных, ОбластьПоиска) Экспорт
	
	Если ТипЗнч(ПолеКомпоновкиДанных) = Тип("Строка") Тогда
		ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
	Иначе
		ПолеПоиска = ПолеКомпоновкиДанных;
	КонецЕсли;
	
	Если ТипЗнч(ОбластьПоиска) = Тип("КомпоновщикНастроекКомпоновкиДанных")
	 ИЛИ ТипЗнч(ОбластьПоиска) = Тип("ДанныеРасшифровкиКомпоновкиДанных")
	 ИЛИ ТипЗнч(ОбластьПоиска) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		Возврат ОбластьПоиска.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеПоиска);
	Иначе
		Возврат ОбластьПоиска.НайтиПоле(ПолеПоиска);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти 
