//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СебестоимостьТоваров);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР.';
									|en = 'Analysis of inventory cost and additional expenses.'");
	
	// Общие.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР  по предприятию,
		|распределенных на себестоимость реализованных товаров.';
		|en = 'Analysis of inventory cost and additional expenses by the enterprise
		|allocated to cost of sold goods.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОперациямБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР  по предприятию в разрезе операций.';
									|en = 'Analysis of inventory cost and additional expenses by enterprise by transactions.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	// По организациям.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по организациям,
		|распределенных на себестоимость реализованных товаров.';
		|en = 'Analyze the inventory cost and additional expenses by companies
		|allocated to cost of sold goods.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОперациямПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по организациям в разрезе операций.';
									|en = 'Analysis of inventory cost and additional expenses by companies by transactions.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаЗакупокОрганизаций");
	ВариантыОтчетовУТПереопределяемый.ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Удалить", "ФинансовыйРезультатИКонтроллинг.СебестоимостьЗапасов");
	ВариантыОтчетовУТПереопределяемый.ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Вставить", "Закупки.Закупки");
	ОписаниеВарианта.Описание = НСтр("ru = 'Помесячные объемы закупок за выбранный период по поставщикам и номенклатуре.
		|Возможен анализ по периодам - квартал, месяц, неделя, день.';
		|en = 'Monthly purchase volume for the selected period by vendors and by items.
		|Analysis is available by the following periods: quarter, month, week, day.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	// По предприятию.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по предприятию,
		|распределенных на себестоимость реализованных товаров.';
		|en = 'Analysis of inventory cost and additional expenses by the enterprise
		|allocated to cost of sold goods.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОперациямПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по предприятию в разрезе операций.';
									|en = 'Analysis of inventory cost and additional expenses by enterprise by transactions.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаЗакупокПредприятия");
	ВариантыОтчетовУТПереопределяемый.ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Удалить", "ФинансовыйРезультатИКонтроллинг.СебестоимостьЗапасов");
	ВариантыОтчетовУТПереопределяемый.ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Вставить", "Закупки.Закупки");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Помесячные объемы закупок за выбранный период по поставщикам и номенклатуре.
		|Возможен анализ по периодам - квартал, месяц, неделя, день.';
		|en = 'Monthly purchase volume for the selected period by vendors and by items.
		|Analysis is available by the following periods: quarter, month, week, day.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьПараметрамиПоУмолчанию(ПараметрыПоУмолчанию) Экспорт
	
	ПараметрыПоУмолчанию.Вставить("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", Константы.ФормироватьВидыЗапасовПоГруппамФинансовогоУчета.Получить());
	ПараметрыПоУмолчанию.Вставить("ИсключаемыеХозОперации", РасчетСебестоимостиПрикладныеАлгоритмы.ХозяйственныеОперацииПеремещений());
	ПараметрыПоУмолчанию.Вставить("ТипыНалогообложенияНДСУчитываетсяВСтоимости", УчетНДСУП.ВидыДеятельностиНДСУчитываетсяВСтоимости());
	
КонецПроцедуры

Функция ТекстЗапросаВременныхТаблиц(РежимОтладкиПоИсточникам = Ложь) Экспорт
	
	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗапросаОтборПоСегментуНоменклатуры());
	ТекстыЗапроса.Добавить(ТекстЗапросаВТСебестоимость());
	ТекстыЗапроса.Добавить(ТекстЗапросаОстаткиИДвижения(РежимОтладкиПоИсточникам));
	ТекстыЗапроса.Добавить(ТекстЗапросаВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат());
	ТекстыЗапроса.Добавить(ТекстЗапросаВТ_ДетализацияИсходныхЗатрат(РежимОтладкиПоИсточникам));
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Если РежимОтладкиПоИсточникам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//РежимОтладки", "");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СебестоимостьТоваров.Организация В (&МассивОрганизаций)", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СебестоимостьТоваровОстатки.Организация В (&МассивОрганизаций)", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДетализацияСебестоимости.Организация В (&МассивОрганизаций)", "ИСТИНА");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыборки() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОстаткиИДвижения.ПериодСекунда КАК ПериодСекунда,
	|	ОстаткиИДвижения.ПериодДень КАК ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя КАК ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада КАК ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал КАК ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие КАК ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод КАК ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиИДвижения.Номенклатура КАК Номенклатура,
	|	(ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА ОстаткиИДвижения.ЕдиницаХранения
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА ОстаткиИДвижения.ЕдиницаДляОтчетов
	|	КОНЕЦ) КАК ЕдиницаИзмеренияОтчета,
	|	ОстаткиИДвижения.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика КАК Характеристика,
	|	ОстаткиИДвижения.Серия КАК Серия,
	|	ОстаткиИДвижения.Склад КАК Склад,
	|	ОстаткиИДвижения.Назначение КАК Назначение,
	|	ОстаткиИДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОстаткиИДвижения.Подразделение КАК Подразделение,
	|	ОстаткиИДвижения.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ОстаткиИДвижения.Организация КАК Организация,
	|	ОстаткиИДвижения.Партия КАК Партия,
	|	ОстаткиИДвижения.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ОстаткиИДвижения.РазделУчета КАК РазделУчета,
	|	ОстаткиИДвижения.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ОстаткиИДвижения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ОстаткиИДвижения.СтатьяДоходов КАК СтатьяДоходов,
	|	ОстаткиИДвижения.СтатьяРасходов КАК СтатьяРасходов,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ОстаткиИДвижения.АналитикаДоходов КАК АналитикаДоходов,
	|	ОстаткиИДвижения.АналитикаРасходов КАК АналитикаРасходов,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов КАК АналитикаДоходовРасходов,
	|	ОстаткиИДвижения.Договор КАК Договор,
	|	ОстаткиИДвижения.Заказ КАК Заказ,
	|	ОстаткиИДвижения.Партнер КАК Партнер,
	|	ОстаткиИДвижения.Контрагент КАК Контрагент,
	|	ОстаткиИДвижения.Соглашение КАК Соглашение,
	|	ОстаткиИДвижения.ТипЗапасов КАК ТипЗапасов,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник КАК ХозяйственнаяОперацияСправочник,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода КАК ХозяйственнаяОперацияПрихода,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода КАК ХозяйственнаяОперацияРасхода,
	|	ОстаткиИДвижения.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	ОстаткиИДвижения.ДатаОпределенияСебестоимости КАК ДатаОпределенияСебестоимости,
	|	(ВЫБОР
	|		КОГДА ОстаткиИДвижения.Документ = НЕОПРЕДЕЛЕНО ТОГДА NULL
	|		ИНАЧЕ ОстаткиИДвижения.Документ КОНЕЦ) КАК Документ,
	|	ОстаткиИДвижения.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ОстаткиИДвижения.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ОстаткиИДвижения.ВесНачальныйОстаток КАК ВесНачальныйОстаток,
	|	ОстаткиИДвижения.ВесКонечныйОстаток КАК ВесКонечныйОстаток,
	|	ОстаткиИДвижения.ОбъемНачальныйОстаток КАК ОбъемНачальныйОстаток,
	|	ОстаткиИДвижения.ОбъемКонечныйОстаток КАК ОбъемКонечныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияНачальныйОстаток КАК СтоимостьПоступленияНачальныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияКонечныйОстаток КАК СтоимостьПоступленияКонечныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыНачальныйОстаток КАК ДопРасходыНачальныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыКонечныйОстаток КАК ДопРасходыКонечныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыНачальныйОстаток КАК ТрудозатратыНачальныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыКонечныйОстаток КАК ТрудозатратыКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеНачальныйОстаток КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеКонечныйОстаток КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеНачальныйОстаток КАК ПостатейныеПеременныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеКонечныйОстаток КАК ПостатейныеПеременныеКонечныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьНачальныйОстаток КАК СебестоимостьНачальныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьКонечныйОстаток КАК СебестоимостьКонечныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетНачальныйОстаток КАК НалоговыйУчетНачальныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетКонечныйОстаток КАК НалоговыйУчетКонечныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаКонечныйОстаток КАК ПостояннаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаНачальныйОстаток КАК ВременнаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаКонечныйОстаток КАК ВременнаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.НДДНачальныйОстаток КАК НДДНачальныйОстаток,
	|	ОстаткиИДвижения.НДДКонечныйОстаток КАК НДДКонечныйОстаток,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяНачальныйОстаток КАК СтоимостьЗабалансоваяНачальныйОстаток,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяКонечныйОстаток КАК СтоимостьЗабалансоваяКонечныйОстаток,
	|	ОстаткиИДвижения.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиИДвижения.КоличествоРасход КАК КоличествоРасход,
	|	ОстаткиИДвижения.ВесПриход КАК ВесПриход,
	|	ОстаткиИДвижения.ВесРасход КАК ВесРасход,
	|	ОстаткиИДвижения.ОбъемПриход КАК ОбъемПриход,
	|	ОстаткиИДвижения.ОбъемРасход КАК ОбъемРасход,
	|	ОстаткиИДвижения.СтоимостьПоступленияПриход КАК СтоимостьПоступленияПриход,
	|	ОстаткиИДвижения.СтоимостьПоступленияРасход КАК СтоимостьПоступленияРасход,
	|	ОстаткиИДвижения.ДопРасходыПриход КАК ДопРасходыПриход,
	|	ОстаткиИДвижения.ДопРасходыРасход КАК ДопРасходыРасход,
	|	ОстаткиИДвижения.ТрудозатратыПриход КАК ТрудозатратыПриход,
	|	ОстаткиИДвижения.ТрудозатратыРасход КАК ТрудозатратыРасход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеПриход КАК ПостатейныеПостоянныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеРасход КАК ПостатейныеПостоянныеРасход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеПриход КАК ПостатейныеПеременныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеРасход КАК ПостатейныеПеременныеРасход,
	|	ОстаткиИДвижения.СебестоимостьПриход КАК СебестоимостьПриход,
	|	ОстаткиИДвижения.СебестоимостьРасход КАК СебестоимостьРасход,
	|	ОстаткиИДвижения.НалоговыйУчетПриход КАК НалоговыйУчетПриход,
	|	ОстаткиИДвижения.НалоговыйУчетРасход КАК НалоговыйУчетРасход,
	|	ОстаткиИДвижения.ПостояннаяРазницаПриход КАК ПостояннаяРазницаПриход,
	|	ОстаткиИДвижения.ПостояннаяРазницаРасход КАК ПостояннаяРазницаРасход,
	|	ОстаткиИДвижения.ВременнаяРазницаПриход КАК ВременнаяРазницаПриход,
	|	ОстаткиИДвижения.ВременнаяРазницаРасход КАК ВременнаяРазницаРасход,
	|	ОстаткиИДвижения.НДДПриход КАК НДДПриход,
	|	ОстаткиИДвижения.НДДРасход КАК НДДРасход,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяПриход КАК СтоимостьЗабалансоваяПриход,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяРасход КАК СтоимостьЗабалансоваяРасход,
	|
	|	NULL КАК СтатьяРасходовИсходная,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка) КАК ВидЦенности,
	|	NULL КАК НоменклатураИсходная,
	|	NULL КАК ХарактеристикаИсходная,
	|	NULL КАК ДокументПоступленияИсходный,
	|
	|	0 КАК ДетализацияСтоимостьПоступленияНачальныйОстаток,
	|	0 КАК ДетализацияСтоимостьПоступленияКонечныйОстаток,
	|	0 КАК ДетализацияДопРасходыНачальныйОстаток,
	|	0 КАК ДетализацияДопРасходыКонечныйОстаток,
	|	0 КАК ДетализацияПостатейныеПостоянныеНачальныйОстаток,
	|	0 КАК ДетализацияПостатейныеПостоянныеКонечныйОстаток,
	|	0 КАК ДетализацияПостатейныеПеременныеНачальныйОстаток,
	|	0 КАК ДетализацияПостатейныеПеременныеКонечныйОстаток,
	|	0 КАК ДетализацияСебестоимостьНачальныйОстаток,
	|	0 КАК ДетализацияСебестоимостьКонечныйОстаток,
	|	0 КАК ДетализацияСтоимостьПоступленияПриход,
	|	0 КАК ДетализацияСтоимостьПоступленияРасход,
	|	0 КАК ДетализацияДопРасходыПриход,
	|	0 КАК ДетализацияДопРасходыРасход,
	|	0 КАК ДетализацияПостатейныеПостоянныеПриход,
	|	0 КАК ДетализацияПостатейныеПостоянныеРасход,
	|	0 КАК ДетализацияПостатейныеПеременныеПриход,
	|	0 КАК ДетализацияПостатейныеПеременныеРасход,
	|	0 КАК ДетализацияСебестоимостьПриход,
	|	0 КАК ДетализацияСебестоимостьРасход
	|{ВЫБРАТЬ
	|	ПериодСекунда,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаИзмеренияОтчета.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	Серия.*,
	|	Склад.*,
	|	Назначение.*,
	|	НаправлениеДеятельности.*,
	|	Подразделение.*,
	|	ВидЗапасов.*,
	|	ГруппаФинансовогоУчета.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	РазделУчета,
	|	ВидДеятельностиНДС,
	|	ХозяйственнаяОперация.*,
	|	ВидЦенности.*,
	|	СтатьяДоходов.*,
	|	СтатьяРасходов.*,
	|	СтатьяДоходовРасходов.*,
	|	АналитикаДоходов.*,
	|	АналитикаРасходов.*,
	|	АналитикаДоходовРасходов.*,
	|	Договор.*,
	|	Заказ.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Соглашение.*,
	|	ТипЗапасов.*,
	|	ХозяйственнаяОперацияСправочник.*,
	|	ХозяйственнаяОперацияПрихода.*,
	|	ХозяйственнаяОперацияРасхода.*,
	|	СпособОпределенияСебестоимости,
	|	ДатаОпределенияСебестоимости,
	|	Документ.*,
	|	КоличествоНачальныйОстаток,
	|	КоличествоКонечныйОстаток,
	|	ВесНачальныйОстаток,
	|	ВесКонечныйОстаток,
	|	ОбъемНачальныйОстаток,
	|	ОбъемКонечныйОстаток,
	|	СтоимостьПоступленияНачальныйОстаток,
	|	СтоимостьПоступленияКонечныйОстаток,
	|	ДопРасходыНачальныйОстаток,
	|	ДопРасходыКонечныйОстаток,
	|	ТрудозатратыНачальныйОстаток,
	|	ТрудозатратыКонечныйОстаток,
	|	ПостатейныеПостоянныеНачальныйОстаток,
	|	ПостатейныеПостоянныеКонечныйОстаток,
	|	ПостатейныеПеременныеНачальныйОстаток,
	|	ПостатейныеПеременныеКонечныйОстаток,
	|	СебестоимостьНачальныйОстаток,
	|	СебестоимостьКонечныйОстаток,
	|	НалоговыйУчетНачальныйОстаток,
	|	НалоговыйУчетКонечныйОстаток,
	|	ПостояннаяРазницаНачальныйОстаток,
	|	ПостояннаяРазницаКонечныйОстаток,
	|	ВременнаяРазницаНачальныйОстаток,
	|	ВременнаяРазницаКонечныйОстаток,
	|	НДДНачальныйОстаток,
	|	НДДКонечныйОстаток,
	|	СтоимостьЗабалансоваяНачальныйОстаток,
	|	СтоимостьЗабалансоваяКонечныйОстаток,
	|	КоличествоПриход,
	|	КоличествоРасход,
	|	ВесПриход,
	|	ВесРасход,
	|	ОбъемПриход,
	|	ОбъемРасход,
	|	СтоимостьПоступленияПриход,
	|	СтоимостьПоступленияРасход,
	|	ДопРасходыПриход,
	|	ДопРасходыРасход,
	|	ТрудозатратыПриход,
	|	ТрудозатратыРасход,
	|	ПостатейныеПостоянныеПриход,
	|	ПостатейныеПостоянныеРасход,
	|	ПостатейныеПеременныеПриход,
	|	ПостатейныеПеременныеРасход,
	|	СебестоимостьПриход,
	|	СебестоимостьРасход,
	|	НалоговыйУчетПриход,
	|	НалоговыйУчетРасход,
	|	ПостояннаяРазницаПриход,
	|	ПостояннаяРазницаРасход,
	|	ВременнаяРазницаПриход,
	|	ВременнаяРазницаРасход,
	|	НДДПриход,
	|	НДДРасход,
	|	СтоимостьЗабалансоваяПриход,
	|	СтоимостьЗабалансоваяРасход,
	|	СтатьяРасходовИсходная.*,
	|	НоменклатураИсходная.*,
	|	ХарактеристикаИсходная.*,
	|	ДокументПоступленияИсходный.*,
	|	ДетализацияСтоимостьПоступленияНачальныйОстаток,
	|	ДетализацияСтоимостьПоступленияКонечныйОстаток,
	|	ДетализацияДопРасходыНачальныйОстаток,
	|	ДетализацияДопРасходыКонечныйОстаток,
	|	ДетализацияПостатейныеПостоянныеНачальныйОстаток,
	|	ДетализацияПостатейныеПостоянныеКонечныйОстаток,
	|	ДетализацияПостатейныеПеременныеНачальныйОстаток,
	|	ДетализацияПостатейныеПеременныеКонечныйОстаток,
	|	ДетализацияСебестоимостьНачальныйОстаток,
	|	ДетализацияСебестоимостьКонечныйОстаток,
	|	ДетализацияСтоимостьПоступленияПриход,
	|	ДетализацияСтоимостьПоступленияРасход,
	|	ДетализацияДопРасходыПриход,
	|	ДетализацияДопРасходыРасход,
	|	ДетализацияПостатейныеПостоянныеПриход,
	|	ДетализацияПостатейныеПостоянныеРасход,
	|	ДетализацияПостатейныеПеременныеПриход,
	|	ДетализацияПостатейныеПеременныеРасход,
	|	ДетализацияСебестоимостьПриход,
	|	ДетализацияСебестоимостьРасход
	|	}
	|ИЗ
	|	ОстаткиИДвижения КАК ОстаткиИДвижения
	|{ГДЕ
	|	ОстаткиИДвижения.ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры.*,
	|	ОстаткиИДвижения.Номенклатура.*,
	|	ОстаткиИДвижения.ЕдиницаХранения.*,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов.*,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика.*,
	|	ОстаткиИДвижения.Серия.*,
	|	ОстаткиИДвижения.Склад.*,
	|	ОстаткиИДвижения.Назначение.*,
	|	ОстаткиИДвижения.НаправлениеДеятельности.*,
	|	ОстаткиИДвижения.Подразделение.*,
	|	ОстаткиИДвижения.ВидЗапасов.*,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета.*,
	|	ОстаткиИДвижения.Организация.*,
	|	ОстаткиИДвижения.Партия.*,
	|	ОстаткиИДвижения.АналитикаУчетаПартий.*,
	|	ОстаткиИДвижения.РазделУчета,
	|	ОстаткиИДвижения.ВидДеятельностиНДС,
	|	ОстаткиИДвижения.ХозяйственнаяОперация.*,
	|	ОстаткиИДвижения.СтатьяДоходов.*,
	|	ОстаткиИДвижения.СтатьяРасходов.*,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов.*,
	|	ОстаткиИДвижения.АналитикаДоходов.*,
	|	ОстаткиИДвижения.АналитикаРасходов.*,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов.*,
	|	ОстаткиИДвижения.Договор.*,
	|	ОстаткиИДвижения.Заказ.*,
	|	ОстаткиИДвижения.Партнер.*,
	|	ОстаткиИДвижения.Контрагент.*,
	|	ОстаткиИДвижения.Соглашение.*,
	|	ОстаткиИДвижения.ТипЗапасов.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода.*,
	|	ОстаткиИДвижения.СпособОпределенияСебестоимости,
	|	ОстаткиИДвижения.ДатаОпределенияСебестоимости,
	|	ОстаткиИДвижения.Документ,
	|	ОстаткиИДвижения.КоличествоНачальныйОстаток,
	|	ОстаткиИДвижения.КоличествоКонечныйОстаток,
	|	ОстаткиИДвижения.ВесНачальныйОстаток,
	|	ОстаткиИДвижения.ВесКонечныйОстаток,
	|	ОстаткиИДвижения.ОбъемНачальныйОстаток,
	|	ОстаткиИДвижения.ОбъемКонечныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияНачальныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияКонечныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыНачальныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыКонечныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыНачальныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеКонечныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьНачальныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьКонечныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетНачальныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетКонечныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.НДДНачальныйОстаток,
	|	ОстаткиИДвижения.НДДКонечныйОстаток,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяНачальныйОстаток,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяКонечныйОстаток,
	|	ОстаткиИДвижения.КоличествоПриход,
	|	ОстаткиИДвижения.КоличествоРасход,
	|	ОстаткиИДвижения.ВесПриход,
	|	ОстаткиИДвижения.ВесРасход,
	|	ОстаткиИДвижения.ОбъемПриход,
	|	ОстаткиИДвижения.ОбъемРасход,
	|	ОстаткиИДвижения.СтоимостьПоступленияПриход,
	|	ОстаткиИДвижения.СтоимостьПоступленияРасход,
	|	ОстаткиИДвижения.ДопРасходыПриход,
	|	ОстаткиИДвижения.ДопРасходыРасход,
	|	ОстаткиИДвижения.ТрудозатратыПриход,
	|	ОстаткиИДвижения.ТрудозатратыРасход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеРасход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеРасход,
	|	ОстаткиИДвижения.СебестоимостьПриход,
	|	ОстаткиИДвижения.СебестоимостьРасход,
	|	ОстаткиИДвижения.НалоговыйУчетПриход,
	|	ОстаткиИДвижения.НалоговыйУчетРасход,
	|	ОстаткиИДвижения.ПостояннаяРазницаПриход,
	|	ОстаткиИДвижения.ПостояннаяРазницаРасход,
	|	ОстаткиИДвижения.ВременнаяРазницаПриход,
	|	ОстаткиИДвижения.ВременнаяРазницаРасход,
	|	ОстаткиИДвижения.НДДПриход,
	|	ОстаткиИДвижения.НДДРасход,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяПриход,
	|	ОстаткиИДвижения.СтоимостьЗабалансоваяРасход
	|	}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодСекунда,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодДень,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодНеделя,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодДекада,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ВТ_ОстаткиИДвижения.ПериодМесяц, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ВТ_ОстаткиИДвижения.ПериодМесяц, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ВТ_ОстаткиИДвижения.ПериодМесяц, ГОД) КАК ПериодГод,
	|	ВТ_ОстаткиИДвижения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВТ_ОстаткиИДвижения.Номенклатура КАК Номенклатура,
	|	(ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА ВТ_ОстаткиИДвижения.ЕдиницаХранения
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА ВТ_ОстаткиИДвижения.ЕдиницаДляОтчетов
	|	КОНЕЦ) КАК ЕдиницаИзмеренияОтчета,
	|	ВТ_ОстаткиИДвижения.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ВТ_ОстаткиИДвижения.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ВТ_ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ВТ_ОстаткиИДвижения.Характеристика КАК Характеристика,
	|	ВТ_ОстаткиИДвижения.Серия КАК Серия,
	|	ВТ_ОстаткиИДвижения.Склад КАК Склад,
	|	ВТ_ОстаткиИДвижения.Назначение КАК Назначение,
	|	ВТ_ОстаткиИДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	NULL КАК Подразделение,
	|	ВТ_ОстаткиИДвижения.ВидЗапасов КАК ВидЗапасов,
	|	ВТ_ОстаткиИДвижения.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВТ_ОстаткиИДвижения.Организация КАК Организация,
	|	ВТ_ОстаткиИДвижения.Партия КАК Партия,
	|	ВТ_ОстаткиИДвижения.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВТ_ОстаткиИДвижения.РазделУчета КАК РазделУчета,
	|	ВТ_ОстаткиИДвижения.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	NULL КАК ХозяйственнаяОперация,
	|	NULL КАК СтатьяДоходов,
	|	NULL КАК СтатьяРасходов,
	|	NULL КАК СтатьяДоходовРасходов,
	|	NULL КАК АналитикаДоходов,
	|	NULL КАК АналитикаРасходов,
	|	NULL КАК АналитикаДоходовРасходов,
	|	NULL КАК Договор,
	|	NULL КАК Заказ,
	|	NULL КАК Партнер,
	|	NULL КАК Контрагент,
	|	NULL КАК Соглашение,
	|	NULL КАК ТипЗапасов,
	|	NULL КАК ХозяйственнаяОперацияСправочник,
	|	NULL КАК ХозяйственнаяОперацияПрихода,
	|	NULL КАК ХозяйственнаяОперацияРасхода,
	|	NULL КАК СпособОпределенияСебестоимости,
	|	NULL КАК ДатаОпределенияСебестоимости,
	|	NULL КАК Документ,
	|	0 КАК КоличествоНачальныйОстаток,
	|	0 КАК КоличествоКонечныйОстаток,
	|	0 КАК ВесНачальныйОстаток,
	|	0 КАК ВесКонечныйОстаток,
	|	0 КАК ОбъемНачальныйОстаток,
	|	0 КАК ОбъемКонечныйОстаток,
	|	0 КАК СтоимостьПоступленияНачальныйОстаток,
	|	0 КАК СтоимостьПоступленияКонечныйОстаток,
	|	0 КАК ДопРасходыНачальныйОстаток,
	|	0 КАК ДопРасходыКонечныйОстаток,
	|	0 КАК ТрудозатратыНачальныйОстаток,
	|	0 КАК ТрудозатратыКонечныйОстаток,
	|	0 КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	0 КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	0 КАК ПостатейныеПеременныеНачальныйОстаток,
	|	0 КАК ПостатейныеПеременныеКонечныйОстаток,
	|	0 КАК СебестоимостьНачальныйОстаток,
	|	0 КАК СебестоимостьКонечныйОстаток,
	|	0 КАК НалоговыйУчетНачальныйОстаток,
	|	0 КАК НалоговыйУчетКонечныйОстаток,
	|	0 КАК ПостояннаяРазницаНачальныйОстаток,
	|	0 КАК ПостояннаяРазницаКонечныйОстаток,
	|	0 КАК ВременнаяРазницаНачальныйОстаток,
	|	0 КАК ВременнаяРазницаКонечныйОстаток,
	|	0 КАК НДДНачальныйОстаток,
	|	0 КАК НДДКонечныйОстаток,
	|	0 КАК СтоимостьЗабалансоваяНачальныйОстаток,
	|	0 КАК СтоимостьЗабалансоваяКонечныйОстаток,
	|	0 КАК КоличествоПриход,
	|	0 КАК КоличествоРасход,
	|	0 КАК ВесПриход,
	|	0 КАК ВесРасход,
	|	0 КАК ОбъемПриход,
	|	0 КАК ОбъемРасход,
	|	0 КАК СтоимостьПоступленияПриход,
	|	0 КАК СтоимостьПоступленияРасход,
	|	0 КАК ДопРасходыПриход,
	|	0 КАК ДопРасходыРасход,
	|	0 КАК ТрудозатратыПриход,
	|	0 КАК ТрудозатратыРасход,
	|	0 КАК ПостатейныеПостоянныеПриход,
	|	0 КАК ПостатейныеПостоянныеРасход,
	|	0 КАК ПостатейныеПеременныеПриход,
	|	0 КАК ПостатейныеПеременныеРасход,
	|	0 КАК СебестоимостьПриход,
	|	0 КАК СебестоимостьРасход,
	|	0 КАК НалоговыйУчетПриход,
	|	0 КАК НалоговыйУчетРасход,
	|	0 КАК ПостояннаяРазницаПриход,
	|	0 КАК ПостояннаяРазницаРасход,
	|	0 КАК ВременнаяРазницаПриход,
	|	0 КАК ВременнаяРазницаРасход,
	|	0 КАК НДДПриход,
	|	0 КАК НДДРасход,
	|	0 КАК СтоимостьЗабалансоваяПриход,
	|	0 КАК СтоимостьЗабалансоваяРасход,
	|
	|	ДетализацияСгруппированная.СтатьяРасходовИсходная КАК СтатьяРасходовИсходная,
	|	ДетализацияСгруппированная.ВидЦенности КАК ВидЦенности,
	|	ДетализацияСгруппированная.НоменклатураИсходная КАК НоменклатураИсходная,
	|	ДетализацияСгруппированная.ХарактеристикаИсходная КАК ХарактеристикаИсходная,
	|	ДетализацияСгруппированная.ДокументПоступленияИсходный КАК ДокументПоступленияИсходный,
	|
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуНаНачало ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало)
	|		* ВТ_ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияСтоимостьПоступленияНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуНаКонец ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец)
	|		* ВТ_ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияСтоимостьПоступленияКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаНачало)
	|		* ВТ_ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияДопРасходыНачальныйОстаток,
	|	ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод
	|		* ВЫБОР КОГДА ВТ_ОстаткиИДвижения.КоличествоПриход = 0 И ВТ_ОстаткиИДвижения.КоличествоРасход = 0
	|			ТОГДА ВТ_ОстаткиИДвижения.КоличествоКонечныйОстаток
	|			ИНАЧЕ 0 
	|		КОНЕЦ +
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаКонец)
	|		* ВТ_ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияДопРасходыКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало)
	|		* ВТ_ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияПостатейныеПостоянныеНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец)
	|		* ВТ_ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияПостатейныеПостоянныеКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало)
	|		* ВТ_ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияПостатейныеПеременныеНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец)
	|		* ВТ_ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияПостатейныеПеременныеКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуНаНачало ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаНачало
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало)
	|		* ВТ_ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияСебестоимостьНачальныйОстаток,
	|	ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод
	|		* ВЫБОР КОГДА ВТ_ОстаткиИДвижения.КоличествоПриход = 0 И ВТ_ОстаткиИДвижения.КоличествоРасход = 0 
	|			ТОГДА ВТ_ОстаткиИДвижения.КоличествоКонечныйОстаток
	|			ИНАЧЕ 0 
	|		КОНЕЦ +
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуНаКонец ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаКонец
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец)
	|		* ВТ_ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияСебестоимостьКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуЗаПериод ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод)
	|		* ВЫБОР КОГДА ВТ_ОстаткиИДвижения.КоличествоПриход = 0 И ВТ_ОстаткиИДвижения.ДопРасходыПриход <> 0
	|			ТОГДА ДетализацияСгруппированная.КоличествоПартии
	|			ИНАЧЕ ВТ_ОстаткиИДвижения.КоличествоПриход КОНЕЦ КАК ДетализацияСтоимостьПоступленияПриход,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуЗаПериод ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод)
	|		* ВТ_ОстаткиИДвижения.КоличествоРасход КАК ДетализацияСтоимостьПоступленияРасход,
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод)
	|		* ВЫБОР КОГДА ВТ_ОстаткиИДвижения.КоличествоПриход = 0 И ВТ_ОстаткиИДвижения.ДопРасходыПриход <> 0
	|			ТОГДА ДетализацияСгруппированная.КоличествоПартии
	|			ИНАЧЕ ВТ_ОстаткиИДвижения.КоличествоПриход КОНЕЦ КАК ДетализацияДопРасходыПриход,
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод)
	|		* ВТ_ОстаткиИДвижения.КоличествоРасход КАК ДетализацияДопРасходыРасход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод)
	|		* ВЫБОР КОГДА ВТ_ОстаткиИДвижения.КоличествоПриход = 0 И ВТ_ОстаткиИДвижения.ДопРасходыПриход <> 0
	|			ТОГДА ДетализацияСгруппированная.КоличествоПартии
	|			ИНАЧЕ ВТ_ОстаткиИДвижения.КоличествоПриход КОНЕЦ КАК ДетализацияПостатейныеПостоянныеПриход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод)
	|		* ВТ_ОстаткиИДвижения.КоличествоРасход КАК ДетализацияПостатейныеПостоянныеРасход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ВЫБОР КОГДА ВТ_ОстаткиИДвижения.КоличествоПриход = 0 И ВТ_ОстаткиИДвижения.ДопРасходыПриход <> 0
	|			ТОГДА ДетализацияСгруппированная.КоличествоПартии
	|			ИНАЧЕ ВТ_ОстаткиИДвижения.КоличествоПриход КОНЕЦ КАК ДетализацияПостатейныеПеременныеПриход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ВТ_ОстаткиИДвижения.КоличествоРасход КАК ДетализацияПостатейныеПеременныеРасход,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуЗаПериод ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ВЫБОР КОГДА ВТ_ОстаткиИДвижения.КоличествоПриход = 0 И ВТ_ОстаткиИДвижения.ДопРасходыПриход <> 0
	|			ТОГДА ДетализацияСгруппированная.КоличествоПартии
	|			ИНАЧЕ ВТ_ОстаткиИДвижения.КоличествоПриход КОНЕЦ КАК ДетализацияСебестоимостьПриход,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницу ИНАЧЕ 0 КОНЕЦ)
	|	+ (ВЫБОР КОГДА ВТ_ОстаткиИДвижения.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДетализацияСгруппированная.ИсходныйНДСНаЕдиницуЗаПериод ИНАЧЕ 0 КОНЕЦ)
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ВТ_ОстаткиИДвижения.КоличествоРасход КАК ДетализацияСебестоимостьРасход
	|ИЗ
	|	ВТ_ДетализацияИсходныхЗатрат КАК ДетализацияСгруппированная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат КАК ВТ_ОстаткиИДвижения
	|		ПО ВТ_ОстаткиИДвижения.Номенклатура = ДетализацияСгруппированная.Номенклатура
	|			И ВТ_ОстаткиИДвижения.Характеристика = ДетализацияСгруппированная.Характеристика
	|			И ВТ_ОстаткиИДвижения.ВидЗапасов = ДетализацияСгруппированная.ВидЗапасов
	|			И ВТ_ОстаткиИДвижения.Организация = ДетализацияСгруппированная.Организация
	|			И ВТ_ОстаткиИДвижения.Партия = ДетализацияСгруппированная.Партия
	|			И ВТ_ОстаткиИДвижения.АналитикаУчетаПартий = ДетализацияСгруппированная.АналитикаУчетаПартий
	|			И (ДетализацияСгруппированная.АналитикаУчетаНоменклатуры = НЕОПРЕДЕЛЕНО
	|				ИЛИ ДетализацияСгруппированная.АналитикаУчетаНоменклатуры = ВТ_ОстаткиИДвижения.АналитикаУчетаНоменклатуры)
	|			И (ДетализацияСгруппированная.ПериодИсходныхЗатрат = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ДетализацияСгруппированная.ПериодИсходныхЗатрат = ВТ_ОстаткиИДвижения.ПериодМесяц)
	|{ГДЕ
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодДень,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодНеделя,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодДекада,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодКвартал,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодПолугодие,
	|	ВТ_ОстаткиИДвижения.ПериодМесяц КАК ПериодГод,
	|	ВТ_ОстаткиИДвижения.АналитикаУчетаНоменклатуры.*,
	|	ВТ_ОстаткиИДвижения.Номенклатура.*,
	|	ВТ_ОстаткиИДвижения.ЕдиницаХранения.*,
	|	ВТ_ОстаткиИДвижения.ЕдиницаДляОтчетов.*,
	|	ВТ_ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов,
	|	ВТ_ОстаткиИДвижения.Характеристика.*,
	|	ВТ_ОстаткиИДвижения.Серия.*,
	|	ВТ_ОстаткиИДвижения.Склад.*,
	|	ВТ_ОстаткиИДвижения.Назначение.*,
	|	ВТ_ОстаткиИДвижения.НаправлениеДеятельности.*,
	|	ВТ_ОстаткиИДвижения.ВидЗапасов.*,
	|	ВТ_ОстаткиИДвижения.ГруппаФинансовогоУчета.*,
	|	ВТ_ОстаткиИДвижения.Организация.*,
	|	ВТ_ОстаткиИДвижения.Партия.*,
	|	ВТ_ОстаткиИДвижения.АналитикаУчетаПартий.*,
	|	ВТ_ОстаткиИДвижения.РазделУчета,
	|	ВТ_ОстаткиИДвижения.ВидДеятельностиНДС,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.НоменклатураИсходная, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))).* КАК НоменклатураИсходная,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.ХарактеристикаИсходная, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))).* КАК ХарактеристикаИсходная,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.ДокументПоступленияИсходный, НЕОПРЕДЕЛЕНО)).* КАК ДокументПоступленияИсходный,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.СтатьяРасходовИсходная, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))).* КАК СтатьяРасходовИсходная}";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаОтборПоСегментуНоменклатуры()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Номенклатура КАК Номенклатура,
	|	Сегменты.Характеристика КАК Характеристика,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуНоменклатуры
	|ПОМЕСТИТЬ ОтборПоСегментуНоменклатуры
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментНоменклатуры,
	|	Сегменты.Номенклатура.* КАК Номенклатура,
	|	Сегменты.Характеристика.* КАК Характеристика}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ИспользуетсяОтборПоСегментуНоменклатуры";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТСебестоимость()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СебестоимостьТоваров.Период КАК ПериодСекунда,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ГОД) КАК ПериодГод,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	АналитикаНоменклатуры.Характеристика КАК Характеристика,
	|	АналитикаНоменклатуры.Серия КАК Серия,
	|	АналитикаНоменклатуры.МестоХранения КАК Склад,
	|	АналитикаНоменклатуры.Назначение КАК Назначение,
	|	АналитикаНоменклатуры.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СебестоимостьТоваров.Подразделение КАК Подразделение,
	|	СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА СебестоимостьТоваров.ВидЗапасов.ГруппаФинансовогоУчета
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС,
	|	СебестоимостьТоваров.ХозяйственнаяОперация,
	|	СебестоимостьТоваров.СтатьяДоходов,
	|	СебестоимостьТоваров.СтатьяРасходовСписания КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА НЕ СебестоимостьТоваров.СтатьяДоходов.Ссылка ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.СтатьяДоходов
	|		КОГДА НЕ СебестоимостьТоваров.СтатьяРасходовСписания.Ссылка ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяДоходовРасходов,
	|	СебестоимостьТоваров.АналитикаДоходов,
	|	СебестоимостьТоваров.АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.АналитикаДоходов) ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.АналитикаДоходов
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.АналитикаРасходов) ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаДоходовРасходов,
	|	ВыручкаИСебестоимостьПродаж.Договор КАК Договор,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК Заказ,
	|	(ВЫБОР
	|		КОГДА НЕ Реестр.Партнер ЕСТЬ NULL ТОГДА Реестр.Партнер
	|		ИНАЧЕ АналитикаПартнеров.Партнер КОНЕЦ) КАК Партнер,
	|	(ВЫБОР
	|		КОГДА НЕ КлючиРеестра.Ключ ЕСТЬ NULL 
	|			И ТИПЗНАЧЕНИЯ(КлючиРеестра.Ключ) = ТИП(Справочник.Контрагенты)
	|			ТОГДА КлючиРеестра.Ключ
	|		ИНАЧЕ АналитикаПартнеров.Контрагент КОНЕЦ) КАК Контрагент,
	|	ВыручкаИСебестоимостьПродаж.Соглашение КАК Соглашение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов КАК ТипЗапасов,
	|	НастройкиХозопераций.Ссылка КАК ХозяйственнаяОперацияСправочник,
	|	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ХозяйственнаяОперацияПрихода,
	|	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ХозяйственнаяОперацияРасхода,
	|	СебестоимостьТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	СебестоимостьТоваров.ДатаОпределенияСебестоимости КАК ДатаОпределенияСебестоимости,
	|	СебестоимостьТоваров.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * СебестоимостьТоваров.Количество КАК КоличествоПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * СебестоимостьТоваров.Количество КАК КоличествоРасход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|	КОНЕЦ КАК СтоимостьПоступленияПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|	КОНЕЦ КАК СтоимостьПоступленияРасход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.ДопРасходы
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ДопРасходыУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ДопРасходыРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.ДопРасходыУпр
	|	КОНЕЦ КАК ДопРасходыПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.ДопРасходы
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ДопРасходыУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ДопРасходыРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.ДопРасходыУпр
	|	КОНЕЦ КАК ДопРасходыРасход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.Трудозатраты
	|		ИНАЧЕ СебестоимостьТоваров.ТрудозатратыУпр
	|	КОНЕЦ КАК ТрудозатратыПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.Трудозатраты
	|		ИНАЧЕ СебестоимостьТоваров.ТрудозатратыУпр
	|	КОНЕЦ КАК ТрудозатратыРасход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|	КОНЕЦ КАК ПостатейныеПостоянныеПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|	КОНЕЦ КАК ПостатейныеПостоянныеРасход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|	КОНЕЦ КАК ПостатейныеПеременныеПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|	КОНЕЦ КАК ПостатейныеПеременныеРасход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеСНДС + СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|	КОНЕЦ КАК СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеСНДС + СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|	КОНЕЦ КАК СебестоимостьРасход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл - СебестоимостьТоваров.ПостояннаяРазница - СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалоговыйУчетПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл - СебестоимостьТоваров.ПостояннаяРазница - СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалоговыйУчетРасход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА СебестоимостьТоваров.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостояннаяРазницаПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА СебестоимостьТоваров.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостояннаяРазницаРасход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазницаПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазницаРасход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьНДД
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДДПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4 И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьНДД
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДДРасход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2 ИЛИ &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьЗабалансоваяПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА 0
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2 ИЛИ &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьЗабалансоваяРасход
	|{ВЫБРАТЬ
	|	ПериодСекунда,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	Серия.*,
	|	Склад.*,
	|	Назначение.*,
	|	НаправлениеДеятельности.*,
	|	Подразделение.*,
	|	ВидЗапасов.*,
	|	ГруппаФинансовогоУчета.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	РазделУчета,
	|	ВидДеятельностиНДС,
	|	ХозяйственнаяОперация.*,
	|	СтатьяДоходов.*,
	|	СтатьяРасходов.*,
	|	СтатьяДоходовРасходов.*,
	|	АналитикаДоходов.*,
	|	АналитикаРасходов.*,
	|	АналитикаДоходовРасходов.*,
	|	Договор.*,
	|	Заказ.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Соглашение.*,
	|	ТипЗапасов.*,
	|	ХозяйственнаяОперацияСправочник.*,
	|	ХозяйственнаяОперацияПрихода.*,
	|	ХозяйственнаяОперацияРасхода.*,
	|	СпособОпределенияСебестоимости,
	|	ДатаОпределенияСебестоимости,
	|	Документ.*,
	|	КоличествоПриход,
	|	КоличествоРасход,
	|	КоэффициентЕдиницыДляОтчетов КАК КоличествоПриход,
	|	КоэффициентЕдиницыДляОтчетов КАК КоличествоРасход,
	|	КоличествоПриход КАК ВесПриход,
	|	КоличествоРасход КАК ВесРасход,
	|	КоличествоПриход КАК ОбъемПриход,
	|	КоличествоРасход КАК ОбъемРасход,
	|	ЕдиницаХранения КАК ВесПриход,
	|	ЕдиницаХранения КАК ВесРасход,
	|	ЕдиницаХранения КАК ОбъемПриход,
	|	ЕдиницаХранения КАК ОбъемРасход,
	|	Номенклатура КАК ВесПриход,
	|	Номенклатура КАК ВесРасход,
	|	Номенклатура КАК ОбъемПриход,
	|	Номенклатура КАК ОбъемРасход,
	|	СтоимостьПоступленияПриход,
	|	СтоимостьПоступленияРасход,
	|	ДопРасходыПриход,
	|	ДопРасходыРасход,
	|	СтоимостьЗабалансоваяПриход,
	|	СтоимостьЗабалансоваяРасход,
	|	ТрудозатратыПриход,
	|	ТрудозатратыРасход,
	|	ПостатейныеПостоянныеПриход,
	|	ПостатейныеПостоянныеРасход,
	|	ПостатейныеПеременныеПриход,
	|	ПостатейныеПеременныеРасход,
	|	СебестоимостьПриход,
	|	СебестоимостьРасход,
	|	НалоговыйУчетПриход,
	|	НалоговыйУчетРасход,
	|	ПостояннаяРазницаПриход,
	|	ПостояннаяРазницаРасход,
	|	ВременнаяРазницаПриход,
	|	ВременнаяРазницаРасход,
	|	НДДПриход,
	|	НДДРасход}
	|
	|ПОМЕСТИТЬ ВТСебестоимость
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО (АналитикаПартий.Ссылка = СебестоимостьТоваров.АналитикаУчетаПартий)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ПО СебестоимостьТоваров.ИдентификаторФинЗаписи = ВыручкаИСебестоимостьПродаж.ИдентификаторФинЗаписи}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПартнеров
	|		ПО СебестоимостьТоваров.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|			И СебестоимостьТоваров.АналитикаУчетаПоПартнерам <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = СебестоимостьТоваров.Регистратор
	|			И НЕ Реестр.ДополнительнаяЗапись
	|			И (СебестоимостьТоваров.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнешнееПоступление)
	// Для возвратов товаров поставщику соединяемся по хоз. операции,
	// т.к. могут формироваться отклонения в стоимости товаров (доходы) с пустой ОперацияУчетаСебестоимости.
	|				ИЛИ СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиРеестраДокументов КАК КлючиРеестра
	|		ПО Реестр.Контрагент = КлючиРеестра.Ссылка
	|		}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозопераций
	|		ПО (НастройкиХозопераций.ХозяйственнаяОперация = СебестоимостьТоваров.ХозяйственнаяОперация)}
	|ГДЕ
	|	СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|	И НЕ (СебестоимостьТоваров.ХозяйственнаяОперация В (&ИсключаемыеХозОперации) И &ИсключатьХозОперации)
	|{ГДЕ
	|	(СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода),
	|	((АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	АналитикаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	АналитикаНоменклатуры.Характеристика.* КАК Характеристика,
	|	АналитикаНоменклатуры.Серия.* КАК Серия,
	|	АналитикаНоменклатуры.МестоХранения.* КАК Склад,
	|	АналитикаНоменклатуры.Назначение.* КАК Назначение,
	|	АналитикаНоменклатуры.Назначение.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|	СебестоимостьТоваров.Подразделение.* КАК Подразделение,
	|	СебестоимостьТоваров.Организация.* КАК Организация,
	|	СебестоимостьТоваров.ВидЗапасов.* КАК ВидЗапасов,
	|	СебестоимостьТоваров.Партия.* КАК Партия,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕНЬ)) КАК ПериодДень,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕКАДА)) КАК ПериодДекада,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ)) КАК ПериодМесяц,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, КВАРТАЛ)) КАК ПериодКвартал,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ГОД)) КАК ПериодГод,
	|	(ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА СебестоимостьТоваров.ВидЗапасов.ГруппаФинансовогоУчета
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ).* КАК ГруппаФинансовогоУчета,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.* КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.АналитикаУчетаПартий.* КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваров.РазделУчета КАК РазделУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	СебестоимостьТоваров.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СебестоимостьТоваров.СтатьяДоходов.* КАК СтатьяДоходов,
	|	СебестоимостьТоваров.СтатьяРасходовСписания.* КАК СтатьяРасходов,
	|	(ВЫБОР
	|		КОГДА НЕ СебестоимостьТоваров.СтатьяДоходов.Ссылка ЕСТЬ NULL
	|		ТОГДА СебестоимостьТоваров.СтатьяДоходов
	|		КОГДА НЕ СебестоимостьТоваров.СтатьяРасходовСписания.Ссылка ЕСТЬ NULL
	|		ТОГДА СебестоимостьТоваров.СтатьяРасходовСписания
	|	КОНЕЦ).* КАК СтатьяДоходовРасходов,
	|	СебестоимостьТоваров.АналитикаДоходов.* КАК АналитикаДоходов,
	|	СебестоимостьТоваров.АналитикаРасходов.* КАК АналитикаРасходов,
	|	(ВЫБОР
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.АналитикаДоходов) ЕСТЬ NULL
	|		ТОГДА СебестоимостьТоваров.АналитикаДоходов
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.АналитикаРасходов) ЕСТЬ NULL
	|		ТОГДА СебестоимостьТоваров.АналитикаРасходов
	|	КОНЕЦ).* КАК АналитикаДоходовРасходов,
	|	ВыручкаИСебестоимостьПродаж.Договор.* КАК Договор,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента.* КАК Заказ,
	|	(ВЫБОР
	|		КОГДА НЕ Реестр.Партнер ЕСТЬ NULL ТОГДА Реестр.Партнер
	|		ИНАЧЕ АналитикаПартнеров.Партнер КОНЕЦ).* КАК Партнер,
	|	(ВЫБОР КОГДА НЕ КлючиРеестра.Ключ ЕСТЬ NULL И ТИПЗНАЧЕНИЯ(КлючиРеестра.Ключ) = ТИП(Справочник.Контрагенты)
	|		ТОГДА КлючиРеестра.Ключ ИНАЧЕ АналитикаПартнеров.Контрагент КОНЕЦ).* КАК Контрагент,
	|	ВыручкаИСебестоимостьПродаж.Соглашение.* КАК Соглашение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов.* КАК ТипЗапасов,
	|	НастройкиХозопераций.Ссылка.* КАК ХозяйственнаяОперацияСправочник,
	|	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ХозяйственнаяОперацияПрихода,
	|	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ХозяйственнаяОперацияРасхода,
	|	СебестоимостьТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	СебестоимостьТоваров.ДатаОпределенияСебестоимости КАК ДатаОпределенияСебестоимости,
	|	СебестоимостьТоваров.Регистратор КАК Документ}";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиИДвижения(РежимОтладкиПоИсточникам)
	
	ТекстыВложенногоЗапроса = Новый Массив;
	
	#Область ИнициализацияВременнойТаблицыОстаткиИДвиженияПредварительная
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	//РежимОтладки""Инициализация"" КАК ИсточникДанных,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодСекунда,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодДень,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНеделя,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодДекада,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодМесяц,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодКвартал,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодПолугодие,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодГод,
	|
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаХранения,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаДляОтчетов,
	|	0 КАК КоэффициентЕдиницыДляОтчетов,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Назначение,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка) КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Партнер,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка) КАК Соглашение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка) КАК ТипЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК ХозяйственнаяОперацияСправочник,
	|	ЛОЖЬ КАК ХозяйственнаяОперацияПрихода,
	|	ЛОЖЬ КАК ХозяйственнаяОперацияРасхода,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиТоваров.ПустаяСсылка) КАК СпособОпределенияСебестоимости,
	|	ДАТАВРЕМЯ(1,1,1,0,0,0) КАК ДатаОпределенияСебестоимости,
	|	НЕОПРЕДЕЛЕНО КАК Документ,
	|	0 КАК КоличествоНачальныйОстаток,
	|	0 КАК КоличествоКонечныйОстаток,
	|	0 КАК СтоимостьПоступленияНачальныйОстаток,
	|	0 КАК СтоимостьПоступленияКонечныйОстаток,
	|	0 КАК ДопРасходыНачальныйОстаток,
	|	0 КАК ДопРасходыКонечныйОстаток,
	|	0 КАК ТрудозатратыНачальныйОстаток,
	|	0 КАК ТрудозатратыКонечныйОстаток,
	|	0 КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	0 КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	0 КАК ПостатейныеПеременныеНачальныйОстаток,
	|	0 КАК ПостатейныеПеременныеКонечныйОстаток,
	|	0 КАК СебестоимостьНачальныйОстаток,
	|	0 КАК СебестоимостьКонечныйОстаток,
	|	0 КАК НалоговыйУчетНачальныйОстаток,
	|	0 КАК НалоговыйУчетКонечныйОстаток,
	|	0 КАК ПостояннаяРазницаНачальныйОстаток,
	|	0 КАК ПостояннаяРазницаКонечныйОстаток,
	|	0 КАК ВременнаяРазницаНачальныйОстаток,
	|	0 КАК ВременнаяРазницаКонечныйОстаток,
	|	0 КАК СтоимостьЗабалансоваяНачальныйОстаток,
	|	0 КАК СтоимостьЗабалансоваяКонечныйОстаток,
	|	0 КАК НДДНачальныйОстаток,
	|	0 КАК НДДКонечныйОстаток,
	|	0 КАК КоличествоПриход,
	|	0 КАК КоличествоРасход,
	|	0 КАК СтоимостьПоступленияПриход,
	|	0 КАК СтоимостьПоступленияРасход,
	|	0 КАК ДопРасходыПриход,
	|	0 КАК ДопРасходыРасход,
	|	0 КАК ТрудозатратыПриход,
	|	0 КАК ТрудозатратыРасход,
	|	0 КАК ПостатейныеПостоянныеПриход,
	|	0 КАК ПостатейныеПостоянныеРасход,
	|	0 КАК ПостатейныеПеременныеПриход,
	|	0 КАК ПостатейныеПеременныеРасход,
	|	0 КАК СебестоимостьПриход,
	|	0 КАК СебестоимостьРасход,
	|	0 КАК НалоговыйУчетПриход,
	|	0 КАК НалоговыйУчетРасход,
	|	0 КАК ПостояннаяРазницаПриход,
	|	0 КАК ПостояннаяРазницаРасход,
	|	0 КАК ВременнаяРазницаПриход,
	|	0 КАК ВременнаяРазницаРасход,
	|	0 КАК СтоимостьЗабалансоваяПриход,
	|	0 КАК СтоимостьЗабалансоваяРасход,
	|	0 КАК НДДПриход,
	|	0 КАК НДДРасход
	|ПОМЕСТИТЬ ОстаткиИДвиженияПредварительная";
	Если РежимОтладкиПоИсточникам Тогда
		ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	#КонецОбласти
	
	#Область Остатки
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	//РежимОтладки""Остатки"" КАК ИсточникДанных,
	|	СебестоимостьТоваровОстатки.ПериодСекунда КАК ПериодСекунда,
	|	СебестоимостьТоваровОстатки.ПериодДень КАК ПериодДень,
	// Заполнение полей Период... должно быть одинаковое во всех подзапросах.
	// Использование выражения НАЧАЛОПЕРИОДА позволяет сформировать поля Период... по одинаковому принципу.
	// Без этого периоды из виртуальной таблицы ОстаткиИОбороты могут отличаться от периодов, полученных через выражения НАЧАЛОПЕРИОДА,
	// что приведет к неправильной группировке по полю Период..., т.к. период полученнй из виртуальной таблицы ОстаткиИОбороты начинается
	// с даты НачалоПериода и будет отличаться от периода, полученного через выражение НАЧАЛОПЕРИОДА, если НачалоПериода не равно началу месяца, 
	// началу недели и т.п.
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодНеделя, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодДекада, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодМесяц, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодКвартал, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодПолугодие, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодГод, ГОД) КАК ПериодГод,
	|
	|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	АналитикаНоменклатуры.Характеристика КАК Характеристика,
	|	АналитикаНоменклатуры.Серия КАК Серия,
	|	АналитикаНоменклатуры.МестоХранения КАК Склад,
	|	АналитикаНоменклатуры.Назначение КАК Назначение,
	|	АналитикаНоменклатуры.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	СебестоимостьТоваровОстатки.ВидЗапасов КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА СебестоимостьТоваровОстатки.ВидЗапасов.ГруппаФинансовогоУчета
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	СебестоимостьТоваровОстатки.Организация КАК Организация,
	|	СебестоимостьТоваровОстатки.Партия КАК Партия,
	|	СебестоимостьТоваровОстатки.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваровОстатки.РазделУчета КАК РазделУчета,
	|	СебестоимостьТоваровОстатки.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка) КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Партнер,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка) КАК Соглашение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка) КАК ТипЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК ХозяйственнаяОперацияСправочник,
	|	ЛОЖЬ КАК ХозяйственнаяОперацияПрихода,
	|	ЛОЖЬ КАК ХозяйственнаяОперацияРасхода,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиТоваров.ПустаяСсылка) КАК СпособОпределенияСебестоимости,
	|	ДАТАВРЕМЯ(1,1,1,0,0,0) КАК ДатаОпределенияСебестоимости,
	|	СебестоимостьТоваровОстатки.Регистратор КАК Документ,
	|	СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглНачальныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|	КОНЕЦ КАК СтоимостьПоступленияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглКонечныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|	КОНЕЦ КАК СтоимостьПоступленияКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыРеглНачальныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток
	|	КОНЕЦ КАК ДопРасходыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыРеглКонечныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток
	|	КОНЕЦ КАК ДопРасходыКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыРеглНачальныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток
	|	КОНЕЦ КАК ТрудозатратыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыРеглКонечныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток
	|	КОНЕЦ КАК ТрудозатратыКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглНачальныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток
	|	КОНЕЦ КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглКонечныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток
	|	КОНЕЦ КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглНачальныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|	КОНЕЦ КАК ПостатейныеПеременныеНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглКонечныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|	КОНЕЦ КАК ПостатейныеПеременныеКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглНачальныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|	КОНЕЦ КАК СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглКонечныйОстаток
	|		КОГДА &ПоПредприятию
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|	КОНЕЦ КАК СебестоимостьКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглНачальныйОстаток - СебестоимостьТоваровОстатки.ПостояннаяРазницаНачальныйОстаток - СебестоимостьТоваровОстатки.ВременнаяРазницаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалоговыйУчетНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглКонечныйОстаток - СебестоимостьТоваровОстатки.ПостояннаяРазницаКонечныйОстаток - СебестоимостьТоваровОстатки.ВременнаяРазницаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалоговыйУчетКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ПостояннаяРазницаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостояннаяРазницаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ПостояннаяРазницаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостояннаяРазницаКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ВременнаяРазницаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазницаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.ВременнаяРазницаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазницаКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2 ИЛИ &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьЗабалансоваяНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2 ИЛИ &ДанныеОтчета = 3
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|		ТОГДА СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьЗабалансоваяКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьНДДНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДДНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьНДДКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДДКонечныйОстаток,
	|	0 КАК КоличествоПриход,
	|	0 КАК КоличествоРасход,
	|	0 КАК СтоимостьПоступленияПриход,
	|	0 КАК СтоимостьПоступленияРасход,
	|	0 КАК ДопРасходыПриход,
	|	0 КАК ДопРасходыРасход,
	|	0 КАК ТрудозатратыПриход,
	|	0 КАК ТрудозатратыРасход,
	|	0 КАК ПостатейныеПостоянныеПриход,
	|	0 КАК ПостатейныеПостоянныеРасход,
	|	0 КАК ПостатейныеПеременныеПриход,
	|	0 КАК ПостатейныеПеременныеРасход,
	|	0 КАК СебестоимостьПриход,
	|	0 КАК СебестоимостьРасход,
	|	0 КАК НалоговыйУчетПриход,
	|	0 КАК НалоговыйУчетРасход,
	|	0 КАК ПостояннаяРазницаПриход,
	|	0 КАК ПостояннаяРазницаРасход,
	|	0 КАК ВременнаяРазницаПриход,
	|	0 КАК ВременнаяРазницаРасход,
	|	0 КАК СтоимостьЗабалансоваяПриход,
	|	0 КАК СтоимостьЗабалансоваяРасход,
	|	0 КАК НДДПриход,
	|	0 КАК НДДРасход
	|{ВЫБРАТЬ
	|	ПериодСекунда,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	Серия.*,
	|	Склад.*,
	|	Назначение.*,
	|	НаправлениеДеятельности.*,
	|	Подразделение.*,
	|	ВидЗапасов.*,
	|	ГруппаФинансовогоУчета.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	РазделУчета,
	|	ВидДеятельностиНДС,
	|	ХозяйственнаяОперация.*,
	|	СтатьяДоходов.*,
	|	СтатьяРасходов.*,
	|	СтатьяДоходовРасходов.*,
	|	АналитикаДоходов.*,
	|	АналитикаРасходов.*,
	|	АналитикаДоходовРасходов.*,
	|	Договор.*,
	|	Заказ.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Соглашение.*,
	|	ТипЗапасов.*,
	|	ХозяйственнаяОперацияСправочник.*,
	|	ХозяйственнаяОперацияПрихода.*,
	|	ХозяйственнаяОперацияРасхода.*,
	|	СпособОпределенияСебестоимости,
	|	ДатаОпределенияСебестоимости,
	|	Документ.*,
	|	КоэффициентЕдиницыДляОтчетов КАК КоличествоНачальныйОстаток,
	|	КоэффициентЕдиницыДляОтчетов КАК КоличествоКонечныйОстаток,
	|	КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	КоличествоНачальныйОстаток КАК ВесНачальныйОстаток,
	|	КоличествоКонечныйОстаток КАК ВесКонечныйОстаток,
	|	КоличествоНачальныйОстаток КАК ОбъемНачальныйОстаток,
	|	КоличествоКонечныйОстаток КАК ОбъемКонечныйОстаток,
	|	ЕдиницаХранения КАК ВесНачальныйОстаток,
	|	ЕдиницаХранения КАК ВесКонечныйОстаток,
	|	ЕдиницаХранения КАК ОбъемНачальныйОстаток,
	|	ЕдиницаХранения КАК ОбъемКонечныйОстаток,
	|	Номенклатура КАК ВесНачальныйОстаток,
	|	Номенклатура КАК ВесКонечныйОстаток,
	|	Номенклатура КАК ОбъемНачальныйОстаток,
	|	Номенклатура КАК ОбъемКонечныйОстаток,
	|	СтоимостьПоступленияНачальныйОстаток,
	|	СтоимостьПоступленияКонечныйОстаток,
	|	ДопРасходыНачальныйОстаток,
	|	ДопРасходыКонечныйОстаток,
	|	ТрудозатратыНачальныйОстаток,
	|	ТрудозатратыКонечныйОстаток,
	|	ПостатейныеПостоянныеНачальныйОстаток,
	|	ПостатейныеПостоянныеКонечныйОстаток,
	|	ПостатейныеПеременныеНачальныйОстаток,
	|	ПостатейныеПеременныеКонечныйОстаток,
	|	СебестоимостьНачальныйОстаток,
	|	СебестоимостьКонечныйОстаток,
	|	НалоговыйУчетНачальныйОстаток,
	|	НалоговыйУчетКонечныйОстаток,
	|	ПостояннаяРазницаНачальныйОстаток,
	|	ПостояннаяРазницаКонечныйОстаток,
	|	ВременнаяРазницаНачальныйОстаток,
	|	ВременнаяРазницаКонечныйОстаток,
	|	СтоимостьЗабалансоваяНачальныйОстаток,
	|	СтоимостьЗабалансоваяКонечныйОстаток,
	|	НДДНачальныйОстаток,
	|	НДДКонечныйОстаток,
	|	КоэффициентЕдиницыДляОтчетов КАК КоличествоПриход,
	|	КоэффициентЕдиницыДляОтчетов КАК КоличествоРасход,
	|	КоличествоПриход КАК КоличествоПриход,
	|	КоличествоРасход КАК КоличествоРасход,
	|	КоличествоПриход КАК ВесПриход,
	|	КоличествоРасход КАК ВесРасход,
	|	КоличествоПриход КАК ОбъемПриход,
	|	КоличествоРасход КАК ОбъемРасход,
	|	ЕдиницаХранения КАК ВесПриход,
	|	ЕдиницаХранения КАК ВесРасход,
	|	ЕдиницаХранения КАК ОбъемПриход,
	|	ЕдиницаХранения КАК ОбъемРасход,
	|	Номенклатура КАК ВесПриход,
	|	Номенклатура КАК ВесРасход,
	|	Номенклатура КАК ОбъемПриход,
	|	Номенклатура КАК ОбъемРасход,
	|	СтоимостьПоступленияПриход,
	|	СтоимостьПоступленияРасход,
	|	ДопРасходыПриход,
	|	ДопРасходыРасход,
	|	ТрудозатратыПриход,
	|	ТрудозатратыРасход,
	|	ПостатейныеПостоянныеПриход,
	|	ПостатейныеПостоянныеРасход,
	|	ПостатейныеПеременныеПриход,
	|	ПостатейныеПеременныеРасход,
	|	СебестоимостьПриход,
	|	СебестоимостьРасход,
	|	НалоговыйУчетПриход,
	|	НалоговыйУчетРасход,
	|	ПостояннаяРазницаПриход,
	|	ПостояннаяРазницаРасход,
	|	ВременнаяРазницаПриход,
	|	ВременнаяРазницаРасход,
	|	СтоимостьЗабалансоваяПриход,
	|	СтоимостьЗабалансоваяРасход,
	|	НДДПриход,
	|	НДДРасход}
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода {(&НачалоПериода)}, 
	|			&КонецПериода {(&КонецПериода)}, 
	|			Авто, , 
	|			{
	|				((АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|					(ВЫБРАТЬ
	|						ОтборПоСегментуНоменклатуры.Номенклатура,
	|						ОтборПоСегментуНоменклатуры.Характеристика
	|					ИЗ
	|						ОтборПоСегментуНоменклатуры
	|					ГДЕ
	|						ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|				(АналитикаУчетаНоменклатуры.Номенклатура).* КАК Номенклатура, 
	|				(АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения).* КАК ЕдиницаИзмерения, 
	|				(АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов).* КАК ЕдиницаДляОтчетов, 
	|				(АналитикаУчетаНоменклатуры.Характеристика).* КАК Характеристика, 
	|				(АналитикаУчетаНоменклатуры.Серия).* КАК Серия, 
	|				(АналитикаУчетаНоменклатуры.МестоХранения).* КАК Склад, 
	|				(АналитикаУчетаНоменклатуры.Назначение).* КАК Назначение, 
	|				(АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности).* КАК НаправлениеДеятельности, 
	|				(Организация).* КАК Организация, 
	|				(ВидЗапасов).* КАК ВидЗапасов,
	|				(Партия).* КАК Партия,
	|				(РазделУчета) КАК РазделУчета,
	|				(ВидДеятельностиНДС) КАК ВидДеятельностиНДС
	|			}
	|	) КАК СебестоимостьТоваровОстатки
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО (АналитикаПартий.Ссылка = СебестоимостьТоваровОстатки.АналитикаУчетаПартий)}
	|ГДЕ
	|	СебестоимостьТоваровОстатки.Организация В (&МассивОрганизаций)
	|{ГДЕ
	|	СебестоимостьТоваровОстатки.ПериодДень КАК ПериодДень,
	|	СебестоимостьТоваровОстатки.ПериодНеделя КАК ПериодНеделя,
	|	СебестоимостьТоваровОстатки.ПериодДекада КАК ПериодДекада,
	|	СебестоимостьТоваровОстатки.ПериодМесяц КАК ПериодМесяц,
	|	СебестоимостьТоваровОстатки.ПериодКвартал КАК ПериодКвартал,
	|	СебестоимостьТоваровОстатки.ПериодПолугодие КАК ПериодПолугодие,
	|	СебестоимостьТоваровОстатки.ПериодГод КАК ПериодГод,
	|	(ВЫБОР
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|				ТОГДА СебестоимостьТоваровОстатки.ВидЗапасов.ГруппаФинансовогоУчета
	|			ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|		КОНЕЦ).* КАК ГруппаФинансовогоУчета}";
	ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область Обороты
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	//РежимОтладки""Обороты"" КАК ИсточникДанных,
	|	СебестоимостьТоваров.ПериодСекунда КАК ПериодСекунда,
	|	СебестоимостьТоваров.ПериодДень КАК ПериодДень,
	|	СебестоимостьТоваров.ПериодНеделя КАК ПериодНеделя,
	|	СебестоимостьТоваров.ПериодДекада КАК ПериодДекада,
	|	СебестоимостьТоваров.ПериодМесяц КАК ПериодМесяц,
	|	СебестоимостьТоваров.ПериодКвартал КАК ПериодКвартал,
	|	СебестоимостьТоваров.ПериодПолугодие КАК ПериодПолугодие,
	|	СебестоимостьТоваров.ПериодГод КАК ПериодГод,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.Номенклатура КАК Номенклатура,
	|	СебестоимостьТоваров.ЕдиницаХранения КАК ЕдиницаХранения,
	|	СебестоимостьТоваров.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	СебестоимостьТоваров.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	СебестоимостьТоваров.Характеристика КАК Характеристика,
	|	СебестоимостьТоваров.Серия КАК Серия,
	|	СебестоимостьТоваров.Склад КАК Склад,
	|	СебестоимостьТоваров.Назначение КАК Назначение,
	|	СебестоимостьТоваров.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СебестоимостьТоваров.Подразделение КАК Подразделение,
	|	СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
	|	СебестоимостьТоваров.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС,
	|	СебестоимостьТоваров.ХозяйственнаяОперация,
	|	СебестоимостьТоваров.СтатьяДоходов,
	|	СебестоимостьТоваров.СтатьяРасходов КАК СтатьяРасходов,
	|	СебестоимостьТоваров.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	СебестоимостьТоваров.АналитикаДоходов,
	|	СебестоимостьТоваров.АналитикаРасходов,
	|	СебестоимостьТоваров.АналитикаДоходовРасходов КАК АналитикаДоходовРасходов,
	|	СебестоимостьТоваров.Договор КАК Договор,
	|	СебестоимостьТоваров.Заказ КАК Заказ,
	|	СебестоимостьТоваров.Партнер КАК Партнер,
	|	СебестоимостьТоваров.Контрагент КАК Контрагент,
	|	СебестоимостьТоваров.Соглашение КАК Соглашение,
	|	СебестоимостьТоваров.ТипЗапасов КАК ТипЗапасов,
	|	СебестоимостьТоваров.ХозяйственнаяОперацияСправочник КАК ХозяйственнаяОперацияСправочник,
	|	СебестоимостьТоваров.ХозяйственнаяОперацияПрихода КАК ХозяйственнаяОперацияПрихода,
	|	СебестоимостьТоваров.ХозяйственнаяОперацияРасхода КАК ХозяйственнаяОперацияРасхода,
	|	СебестоимостьТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	СебестоимостьТоваров.ДатаОпределенияСебестоимости КАК ДатаОпределенияСебестоимости,
	|	СебестоимостьТоваров.Документ КАК Документ,
	|	0 КАК КоличествоНачальныйОстаток,
	|	0 КАК КоличествоКонечныйОстаток,
	|	0 КАК СтоимостьПоступленияНачальныйОстаток,
	|	0 КАК СтоимостьПоступленияКонечныйОстаток,
	|	0 КАК ДопРасходыНачальныйОстаток,
	|	0 КАК ДопРасходыКонечныйОстаток,
	|	0 КАК ТрудозатратыНачальныйОстаток,
	|	0 КАК ТрудозатратыКонечныйОстаток,
	|	0 КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	0 КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	0 КАК ПостатейныеПеременныеНачальныйОстаток,
	|	0 КАК ПостатейныеПеременныеКонечныйОстаток,
	|	0 КАК СебестоимостьНачальныйОстаток,
	|	0 КАК СебестоимостьКонечныйОстаток,
	|	0 КАК НалоговыйУчетНачальныйОстаток,
	|	0 КАК НалоговыйУчетКонечныйОстаток,
	|	0 КАК ПостояннаяРазницаНачальныйОстаток,
	|	0 КАК ПостояннаяРазницаКонечныйОстаток,
	|	0 КАК ВременнаяРазницаНачальныйОстаток,
	|	0 КАК ВременнаяРазницаКонечныйОстаток,
	|	0 КАК СтоимостьЗабалансоваяНачальныйОстаток,
	|	0 КАК СтоимостьЗабалансоваяКонечныйОстаток,
	|	0 КАК НДДНачальныйОстаток,
	|	0 КАК НДДКонечныйОстаток,
	|	СебестоимостьТоваров.КоличествоПриход КАК КоличествоПриход,
	|	СебестоимостьТоваров.КоличествоРасход КАК КоличествоРасход,
	|	СебестоимостьТоваров.СтоимостьПоступленияПриход КАК СтоимостьПоступленияПриход,
	|	СебестоимостьТоваров.СтоимостьПоступленияРасход КАК СтоимостьПоступленияРасход,
	|	СебестоимостьТоваров.ДопРасходыПриход КАК ДопРасходыПриход,
	|	СебестоимостьТоваров.ДопРасходыРасход КАК ДопРасходыРасход,
	|	СебестоимостьТоваров.ТрудозатратыПриход КАК ТрудозатратыПриход,
	|	СебестоимостьТоваров.ТрудозатратыРасход КАК ТрудозатратыРасход,
	|	СебестоимостьТоваров.ПостатейныеПостоянныеПриход КАК ПостатейныеПостоянныеПриход,
	|	СебестоимостьТоваров.ПостатейныеПостоянныеРасход КАК ПостатейныеПостоянныеРасход,
	|	СебестоимостьТоваров.ПостатейныеПеременныеПриход КАК ПостатейныеПеременныеПриход,
	|	СебестоимостьТоваров.ПостатейныеПеременныеРасход КАК ПостатейныеПеременныеРасход,
	|	СебестоимостьТоваров.СебестоимостьПриход КАК СебестоимостьПриход,
	|	СебестоимостьТоваров.СебестоимостьРасход КАК СебестоимостьРасход,
	|	СебестоимостьТоваров.НалоговыйУчетПриход КАК НалоговыйУчетПриход,
	|	СебестоимостьТоваров.НалоговыйУчетРасход КАК НалоговыйУчетРасход,
	|	СебестоимостьТоваров.ПостояннаяРазницаПриход КАК ПостояннаяРазницаПриход,
	|	СебестоимостьТоваров.ПостояннаяРазницаРасход КАК ПостояннаяРазницаРасход,
	|	СебестоимостьТоваров.ВременнаяРазницаПриход КАК ВременнаяРазницаПриход,
	|	СебестоимостьТоваров.ВременнаяРазницаРасход КАК ВременнаяРазницаРасход,
	|	СебестоимостьТоваров.СтоимостьЗабалансоваяПриход КАК СтоимостьЗабалансоваяПриход,
	|	СебестоимостьТоваров.СтоимостьЗабалансоваяРасход КАК СтоимостьЗабалансоваяРасход,
	|	СебестоимостьТоваров.НДДПриход КАК НДДПриход,
	|	СебестоимостьТоваров.НДДРасход КАК НДДРасход
	|ИЗ
	|	ВТСебестоимость КАК СебестоимостьТоваров";
	ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	СтрокаВложенногоЗапроса = СтрСоединить(ТекстыВложенногоЗапроса, 
		ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Ложь));
	
	#Область ПомещениеВИтоговуюВременнуюТаблицу
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиИДвижения.ПериодСекунда КАК ПериодСекунда,
	|	ОстаткиИДвижения.ПериодДень КАК ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя КАК ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада КАК ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал КАК ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие КАК ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод КАК ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиИДвижения.Номенклатура КАК Номенклатура,
	|	ОстаткиИДвижения.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика КАК Характеристика,
	|	ОстаткиИДвижения.Серия КАК Серия,
	|	ОстаткиИДвижения.Склад КАК Склад,
	|	ОстаткиИДвижения.Назначение КАК Назначение,
	|	ОстаткиИДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОстаткиИДвижения.Подразделение КАК Подразделение,
	|	ОстаткиИДвижения.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ОстаткиИДвижения.Организация КАК Организация,
	|	ОстаткиИДвижения.Партия КАК Партия,
	|	ОстаткиИДвижения.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ОстаткиИДвижения.РазделУчета КАК РазделУчета,
	|	ОстаткиИДвижения.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ОстаткиИДвижения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ОстаткиИДвижения.СтатьяДоходов КАК СтатьяДоходов,
	|	ОстаткиИДвижения.СтатьяРасходов КАК СтатьяРасходов,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ОстаткиИДвижения.АналитикаДоходов КАК АналитикаДоходов,
	|	ОстаткиИДвижения.АналитикаРасходов КАК АналитикаРасходов,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов КАК АналитикаДоходовРасходов,
	|	ОстаткиИДвижения.Договор КАК Договор,
	|	ОстаткиИДвижения.Заказ КАК Заказ,
	|	ОстаткиИДвижения.Партнер КАК Партнер,
	|	ОстаткиИДвижения.Контрагент КАК Контрагент,
	|	ОстаткиИДвижения.Соглашение КАК Соглашение,
	|	ОстаткиИДвижения.ТипЗапасов КАК ТипЗапасов,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник КАК ХозяйственнаяОперацияСправочник,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода КАК ХозяйственнаяОперацияПрихода,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода КАК ХозяйственнаяОперацияРасхода,
	|	ОстаткиИДвижения.СпособОпределенияСебестоимости,
	|	ОстаткиИДвижения.ДатаОпределенияСебестоимости,
	|	(ВЫБОР
	|		КОГДА ОстаткиИДвижения.Документ = НЕОПРЕДЕЛЕНО ТОГДА NULL
	|		ИНАЧЕ ОстаткиИДвижения.Документ КОНЕЦ) КАК Документ,
	|	СУММА(ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|		ТОГДА 1
	|		КОГДА &ЕдиницыКоличества = 1 И ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов <> 0
	|		ТОГДА 1 / ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ * ОстаткиИДвижения.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|		ТОГДА 1
	|		КОГДА &ЕдиницыКоличества = 1 И ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов <> 0
	|		ТОГДА 1 / ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ * ОстаткиИДвижения.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.КоличествоНачальныйОстаток * &ТекстЗапросаВесУпаковки) КАК ВесНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.КоличествоКонечныйОстаток * &ТекстЗапросаВесУпаковки) КАК ВесКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.КоличествоНачальныйОстаток * &ТекстЗапросаОбъемУпаковки) КАК ОбъемНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.КоличествоКонечныйОстаток * &ТекстЗапросаОбъемУпаковки) КАК ОбъемКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.СтоимостьПоступленияНачальныйОстаток)КАК СтоимостьПоступленияНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.СтоимостьПоступленияКонечныйОстаток)КАК СтоимостьПоступленияКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.ДопРасходыНачальныйОстаток)КАК ДопРасходыНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.ДопРасходыКонечныйОстаток)КАК ДопРасходыКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.СтоимостьЗабалансоваяНачальныйОстаток)КАК СтоимостьЗабалансоваяНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.СтоимостьЗабалансоваяКонечныйОстаток)КАК СтоимостьЗабалансоваяКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.ТрудозатратыНачальныйОстаток)КАК ТрудозатратыНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.ТрудозатратыКонечныйОстаток)КАК ТрудозатратыКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПостоянныеНачальныйОстаток)КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПостоянныеКонечныйОстаток)КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПеременныеНачальныйОстаток)КАК ПостатейныеПеременныеНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПеременныеКонечныйОстаток)КАК ПостатейныеПеременныеКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.СебестоимостьНачальныйОстаток)КАК СебестоимостьНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.СебестоимостьКонечныйОстаток)КАК СебестоимостьКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.НалоговыйУчетНачальныйОстаток)КАК НалоговыйУчетНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.НалоговыйУчетКонечныйОстаток)КАК НалоговыйУчетКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.ПостояннаяРазницаНачальныйОстаток)КАК ПостояннаяРазницаНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.ПостояннаяРазницаКонечныйОстаток)КАК ПостояннаяРазницаКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.ВременнаяРазницаНачальныйОстаток)КАК ВременнаяРазницаНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.ВременнаяРазницаКонечныйОстаток)КАК ВременнаяРазницаКонечныйОстаток,
	|	СУММА(ОстаткиИДвижения.НДДНачальныйОстаток)КАК НДДНачальныйОстаток,
	|	СУММА(ОстаткиИДвижения.НДДКонечныйОстаток)КАК НДДКонечныйОстаток,
	|	СУММА(ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|		ТОГДА 1
	|		ИНАЧЕ 1 / ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ * ОстаткиИДвижения.КоличествоПриход)КАК КоличествоПриход,
	|	СУММА(ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|		ТОГДА 1
	|		ИНАЧЕ 1 / ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ * ОстаткиИДвижения.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(ОстаткиИДвижения.КоличествоПриход * &ТекстЗапросаВесУпаковки) КАК ВесПриход,
	|	СУММА(ОстаткиИДвижения.КоличествоРасход * &ТекстЗапросаВесУпаковки) КАК ВесРасход,
	|	СУММА(ОстаткиИДвижения.КоличествоПриход * &ТекстЗапросаОбъемУпаковки) КАК ОбъемПриход,
	|	СУММА(ОстаткиИДвижения.КоличествоРасход * &ТекстЗапросаОбъемУпаковки) КАК ОбъемРасход,
	|	СУММА(ОстаткиИДвижения.СтоимостьПоступленияПриход)КАК СтоимостьПоступленияПриход,
	|	СУММА(ОстаткиИДвижения.СтоимостьПоступленияРасход)КАК СтоимостьПоступленияРасход,
	|	СУММА(ОстаткиИДвижения.ДопРасходыПриход)КАК ДопРасходыПриход,
	|	СУММА(ОстаткиИДвижения.ДопРасходыРасход)КАК ДопРасходыРасход,
	|	СУММА(ОстаткиИДвижения.СтоимостьЗабалансоваяПриход)КАК СтоимостьЗабалансоваяПриход,
	|	СУММА(ОстаткиИДвижения.СтоимостьЗабалансоваяРасход)КАК СтоимостьЗабалансоваяРасход,
	|	СУММА(ОстаткиИДвижения.ТрудозатратыПриход)КАК ТрудозатратыПриход,
	|	СУММА(ОстаткиИДвижения.ТрудозатратыРасход)КАК ТрудозатратыРасход,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПостоянныеПриход)КАК ПостатейныеПостоянныеПриход,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПостоянныеРасход)КАК ПостатейныеПостоянныеРасход,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПеременныеПриход)КАК ПостатейныеПеременныеПриход,
	|	СУММА(ОстаткиИДвижения.ПостатейныеПеременныеРасход)КАК ПостатейныеПеременныеРасход,
	|	СУММА(ОстаткиИДвижения.СебестоимостьПриход)КАК СебестоимостьПриход,
	|	СУММА(ОстаткиИДвижения.СебестоимостьРасход)КАК СебестоимостьРасход,
	|	СУММА(ОстаткиИДвижения.НалоговыйУчетПриход)КАК НалоговыйУчетПриход,
	|	СУММА(ОстаткиИДвижения.НалоговыйУчетРасход)КАК НалоговыйУчетРасход,
	|	СУММА(ОстаткиИДвижения.ПостояннаяРазницаПриход)КАК ПостояннаяРазницаПриход,
	|	СУММА(ОстаткиИДвижения.ПостояннаяРазницаРасход)КАК ПостояннаяРазницаРасход,
	|	СУММА(ОстаткиИДвижения.ВременнаяРазницаПриход)КАК ВременнаяРазницаПриход,
	|	СУММА(ОстаткиИДвижения.ВременнаяРазницаРасход)КАК ВременнаяРазницаРасход,
	|	СУММА(ОстаткиИДвижения.НДДПриход)КАК НДДПриход,
	|	СУММА(ОстаткиИДвижения.НДДРасход)КАК НДДРасход
	|{ВЫБРАТЬ
	|	ПериодСекунда,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	Серия.*,
	|	Склад.*,
	|	Назначение.*,
	|	НаправлениеДеятельности.*,
	|	Подразделение.*,
	|	ВидЗапасов.*,
	|	ГруппаФинансовогоУчета.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	РазделУчета,
	|	ВидДеятельностиНДС,
	|	ХозяйственнаяОперация.*,
	|	СтатьяДоходов.*,
	|	СтатьяРасходов.*,
	|	СтатьяДоходовРасходов.*,
	|	АналитикаДоходов.*,
	|	АналитикаРасходов.*,
	|	АналитикаДоходовРасходов.*,
	|	Договор.*,
	|	Заказ.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Соглашение.*,
	|	ТипЗапасов.*,
	|	ХозяйственнаяОперацияСправочник.*,
	|	ХозяйственнаяОперацияПрихода.*,
	|	ХозяйственнаяОперацияРасхода.*,
	|	СпособОпределенияСебестоимости,
	|	ДатаОпределенияСебестоимости,
	|	Документ.*,
	|	КоличествоНачальныйОстаток,
	|	КоличествоКонечныйОстаток,
	|	ВесНачальныйОстаток,
	|	ВесКонечныйОстаток,
	|	ОбъемНачальныйОстаток,
	|	ОбъемКонечныйОстаток,
	|	СтоимостьПоступленияНачальныйОстаток,
	|	СтоимостьПоступленияКонечныйОстаток,
	|	ДопРасходыНачальныйОстаток,
	|	ДопРасходыКонечныйОстаток,
	|	СтоимостьЗабалансоваяНачальныйОстаток,
	|	СтоимостьЗабалансоваяКонечныйОстаток,
	|	ТрудозатратыНачальныйОстаток,
	|	ТрудозатратыКонечныйОстаток,
	|	ПостатейныеПостоянныеНачальныйОстаток,
	|	ПостатейныеПостоянныеКонечныйОстаток,
	|	ПостатейныеПеременныеНачальныйОстаток,
	|	ПостатейныеПеременныеКонечныйОстаток,
	|	СебестоимостьНачальныйОстаток,
	|	СебестоимостьКонечныйОстаток,
	|	НалоговыйУчетНачальныйОстаток,
	|	НалоговыйУчетКонечныйОстаток,
	|	ПостояннаяРазницаНачальныйОстаток,
	|	ПостояннаяРазницаКонечныйОстаток,
	|	ВременнаяРазницаНачальныйОстаток,
	|	ВременнаяРазницаКонечныйОстаток,
	|	НДДНачальныйОстаток,
	|	НДДКонечныйОстаток,
	|	КоличествоПриход,
	|	КоличествоРасход,
	|	ВесПриход,
	|	ВесРасход,
	|	ОбъемПриход,
	|	ОбъемРасход,
	|	СтоимостьПоступленияПриход,
	|	СтоимостьПоступленияРасход,
	|	ДопРасходыПриход,
	|	ДопРасходыРасход,
	|	СтоимостьЗабалансоваяПриход,
	|	СтоимостьЗабалансоваяРасход,
	|	ТрудозатратыПриход,
	|	ТрудозатратыРасход,
	|	ПостатейныеПостоянныеПриход,
	|	ПостатейныеПостоянныеРасход,
	|	ПостатейныеПеременныеПриход,
	|	ПостатейныеПеременныеРасход,
	|	СебестоимостьПриход,
	|	СебестоимостьРасход,
	|	НалоговыйУчетПриход,
	|	НалоговыйУчетРасход,
	|	ПостояннаяРазницаПриход,
	|	ПостояннаяРазницаРасход,
	|	ВременнаяРазницаПриход,
	|	ВременнаяРазницаРасход,
	|	НДДПриход,
	|	НДДРасход}
	|
	|ПОМЕСТИТЬ ОстаткиИДвижения
	|ИЗ
	|	ОстаткиИДвиженияПредварительная КАК ОстаткиИДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИДвижения.ПериодСекунда,
	|	ОстаткиИДвижения.ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры,
	|	ОстаткиИДвижения.Номенклатура,
	|	ОстаткиИДвижения.ЕдиницаХранения,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика,
	|	ОстаткиИДвижения.Серия,
	|	ОстаткиИДвижения.Склад,
	|	ОстаткиИДвижения.Назначение,
	|	ОстаткиИДвижения.НаправлениеДеятельности,
	|	ОстаткиИДвижения.Подразделение,
	|	ОстаткиИДвижения.ВидЗапасов,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета,
	|	ОстаткиИДвижения.Организация,
	|	ОстаткиИДвижения.Партия,
	|	ОстаткиИДвижения.АналитикаУчетаПартий,
	|	ОстаткиИДвижения.РазделУчета,
	|	ОстаткиИДвижения.ВидДеятельностиНДС,
	|	ОстаткиИДвижения.ХозяйственнаяОперация,
	|	ОстаткиИДвижения.СтатьяДоходов,
	|	ОстаткиИДвижения.СтатьяРасходов,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов,
	|	ОстаткиИДвижения.АналитикаДоходов,
	|	ОстаткиИДвижения.АналитикаРасходов,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов,
	|	ОстаткиИДвижения.Договор,
	|	ОстаткиИДвижения.Заказ,
	|	ОстаткиИДвижения.Партнер,
	|	ОстаткиИДвижения.Контрагент,
	|	ОстаткиИДвижения.Соглашение,
	|	ОстаткиИДвижения.ТипЗапасов,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода,
	|	ОстаткиИДвижения.СпособОпределенияСебестоимости,
	|	ОстаткиИДвижения.ДатаОпределенияСебестоимости,
	|	(ВЫБОР
	|		КОГДА ОстаткиИДвижения.Документ = НЕОПРЕДЕЛЕНО ТОГДА NULL
	|		ИНАЧЕ ОстаткиИДвижения.Документ КОНЕЦ) // Документ";
	#КонецОбласти
	
	Если РежимОтладкиПоИсточникам Тогда
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(СтрокаВложенногоЗапроса);
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОстаткиИДвиженияПредварительная", "(" + СтрокаВложенногоЗапроса + ")");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("ОстаткиИДвижения.ЕдиницаХранения", "ОстаткиИДвижения.Номенклатура"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("ОстаткиИДвижения.ЕдиницаХранения", "ОстаткиИДвижения.Номенклатура"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОстаткиИОбороты.ПериодМесяц КАК ПериодМесяц,
	|	ОстаткиИОбороты.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиИОбороты.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиИОбороты.Организация КАК Организация,
	|	ОстаткиИОбороты.Партия КАК Партия,
	|	ОстаткиИОбороты.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ОстаткиИОбороты.РазделУчета КАК РазделУчета,
	|	ОстаткиИОбороты.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ОстаткиИОбороты.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ОстаткиИОбороты.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ОстаткиИОбороты.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ОстаткиИОбороты.Серия КАК Серия,
	|	ОстаткиИОбороты.Склад КАК Склад,
	|	ОстаткиИОбороты.Назначение КАК Назначение,
	|	ОстаткиИОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОстаткиИОбороты.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(ОстаткиИОбороты.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(ОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	СУММА(ОстаткиИОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(ОстаткиИОбороты.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(ОстаткиИОбороты.ДопРасходыПриход) КАК ДопРасходыПриход
	|ПОМЕСТИТЬ ВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат
	|ИЗ
	|	(ВЫБРАТЬ
	|		СебестоимостьТоваровОстатки.Период КАК ПериодМесяц,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваровОстатки.ВидЗапасов КАК ВидЗапасов,
	|		СебестоимостьТоваровОстатки.Организация КАК Организация,
	|		СебестоимостьТоваровОстатки.Партия КАК Партия,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		СебестоимостьТоваровОстатки.РазделУчета КАК РазделУчета,
	|		СебестоимостьТоваровОстатки.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ВЫБОР
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|				ТОГДА СебестоимостьТоваровОстатки.ВидЗапасов.ГруппаФинансовогоУчета
	|			ИНАЧЕ СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|		КОНЕЦ КАК ГруппаФинансовогоУчета,
	|		СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|		СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|		0 КАК КоличествоПриход,
	|		0 КАК КоличествоРасход,
	|		0 КАК ДопРасходыПриход
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|				&НачалоПериода {(&НачалоПериода)},
	|				&КонецПериода {(&КонецПериода)},
	|				Месяц, ,
	|				{
	|					(
	|						(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|						(ВЫБРАТЬ
	|							ОтборПоСегментуНоменклатуры.Номенклатура,
	|							ОтборПоСегментуНоменклатуры.Характеристика
	|						ИЗ
	|							ОтборПоСегментуНоменклатуры
	|						ГДЕ
	|							ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры
	|						)
	|					),
	|					(АналитикаУчетаНоменклатуры.Номенклатура).* КАК Номенклатура,
	|					(АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения).* КАК ЕдиницаИзмерения,
	|					(АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов).* КАК ЕдиницаДляОтчетов,
	|					(АналитикаУчетаНоменклатуры.Характеристика).* КАК Характеристика,
	|					(АналитикаУчетаНоменклатуры.Серия).* КАК Серия,
	|					(АналитикаУчетаНоменклатуры.МестоХранения).* КАК Склад,
	|					(АналитикаУчетаНоменклатуры.Назначение).* КАК Назначение,
	|					(АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности).* КАК НаправлениеДеятельности,
	|					(Организация).* КАК Организация,
	|					(ВидЗапасов).* КАК ВидЗапасов,
	|					(Партия).* КАК Партия,
	|					(РазделУчета) КАК РазделУчета,
	|					(ВидДеятельностиНДС) КАК ВидДеятельностиНДС,
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|					ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) КАК СтатьяДоходов,
	|					ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|					НЕОПРЕДЕЛЕНО КАК СтатьяДоходовРасходов,
	|					НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|					НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|					НЕОПРЕДЕЛЕНО КАК АналитикаДоходовРасходов,
	|					НЕОПРЕДЕЛЕНО КАК Договор,
	|					ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка) КАК Заказ,
	|					ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Партнер,
	|					ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|					ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка) КАК Соглашение,
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка) КАК ТипЗапасов,
	|					ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК ХозяйственнаяОперацияСправочник,
	|					ЛОЖЬ КАК ХозяйственнаяОперацияПрихода,
	|					ЛОЖЬ КАК ХозяйственнаяОперацияРасхода
	|				}
	|				
	|		) КАК СебестоимостьТоваровОстатки
	|ГДЕ
	|	СебестоимостьТоваровОстатки.Организация В (&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.ПериодМесяц,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов,
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.Партия,
	|		СебестоимостьТоваров.АналитикаУчетаПартий,
	|		СебестоимостьТоваров.РазделУчета,
	|		СебестоимостьТоваров.ВидДеятельностиНДС,
	|		СебестоимостьТоваров.Номенклатура,
	|		СебестоимостьТоваров.ЕдиницаХранения,
	|		СебестоимостьТоваров.ЕдиницаДляОтчетов,
	|		СебестоимостьТоваров.КоэффициентЕдиницыДляОтчетов,
	|		СебестоимостьТоваров.Характеристика,
	|		СебестоимостьТоваров.Серия,
	|		СебестоимостьТоваров.Склад,
	|		СебестоимостьТоваров.Назначение,
	|		СебестоимостьТоваров.НаправлениеДеятельности,
	|		СебестоимостьТоваров.ГруппаФинансовогоУчета,
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(СебестоимостьТоваров.КоличествоПриход),
	|		СУММА(СебестоимостьТоваров.КоличествоРасход),
	|		СУММА(ВЫБОР
	|			КОГДА &ДанныеОтчета < 1 ИЛИ &ДанныеОтчета > 4
	|			ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.ДопРасходыПриход
	|		КОНЕЦ)
	|	ИЗ
	|		ВТСебестоимость КАК СебестоимостьТоваров
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СебестоимостьТоваров.ПериодМесяц,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов,
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.Партия,
	|		СебестоимостьТоваров.АналитикаУчетаПартий,
	|		СебестоимостьТоваров.РазделУчета,
	|		СебестоимостьТоваров.ВидДеятельностиНДС,
	|		СебестоимостьТоваров.Номенклатура,
	|		СебестоимостьТоваров.ЕдиницаХранения,
	|		СебестоимостьТоваров.ЕдиницаДляОтчетов,
	|		СебестоимостьТоваров.КоэффициентЕдиницыДляОтчетов,
	|		СебестоимостьТоваров.Характеристика,
	|		СебестоимостьТоваров.Серия,
	|		СебестоимостьТоваров.Склад,
	|		СебестоимостьТоваров.Назначение,
	|		СебестоимостьТоваров.НаправлениеДеятельности,
	|		СебестоимостьТоваров.ГруппаФинансовогоУчета) КАК ОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.ПериодМесяц,
	|	ОстаткиИОбороты.АналитикаУчетаНоменклатуры,
	|	ОстаткиИОбороты.ВидЗапасов,
	|	ОстаткиИОбороты.Организация,
	|	ОстаткиИОбороты.Партия,
	|	ОстаткиИОбороты.АналитикаУчетаПартий,
	|	ОстаткиИОбороты.РазделУчета,
	|	ОстаткиИОбороты.ВидДеятельностиНДС,
	|	ОстаткиИОбороты.Номенклатура,
	|	ОстаткиИОбороты.ЕдиницаХранения,
	|	ОстаткиИОбороты.ЕдиницаДляОтчетов,
	|	ОстаткиИОбороты.КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИОбороты.Характеристика,
	|	ОстаткиИОбороты.Серия,
	|	ОстаткиИОбороты.Склад,
	|	ОстаткиИОбороты.Назначение,
	|	ОстаткиИОбороты.НаправлениеДеятельности,
	|	ОстаткиИОбороты.ГруппаФинансовогоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ВидЗапасов,
	|	Организация,
	|	Партия,
	|	АналитикаУчетаПартий,
	|	ПериодМесяц,
	|	АналитикаУчетаНоменклатуры";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТ_ДетализацияИсходныхЗатрат(РежимОтладкиПоИсточникам)

	ТекстыВложенногоЗапроса = Новый Массив;
	
	#Область ИнициализацияВременнойТаблицыДетализацияИсходныхЗатратПредварительная
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	//РежимОтладки""Инициализация"" КАК ИсточникДанных,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИсходныхЗатрат,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаХранения,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаДляОтчетов,
	|	НЕОПРЕДЕЛЕНО КАК КоэффициентЕдиницыДляОтчетов,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовИсходная,
	|	НЕОПРЕДЕЛЕНО КАК ВидЦенности,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартийДокументаПоступления,
	|	НЕОПРЕДЕЛЕНО КАК НоменклатураИсходная,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаИсходная,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПоступленияИсходный,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	0 КАК ИсходныеДопРасходыНаЕдиницу,
	|	0 КАК ИсходныйНДСНаЕдиницу,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	0 КАК ИсходныйНДСНаЕдиницуНаНачало,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	0 КАК ИсходныйНДСНаЕдиницуНаКонец,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныйНДСНаЕдиницуЗаПериод,
	|	0 КАК КоличествоПартии
	|ПОМЕСТИТЬ ДетализацияИсходныхЗатратПредварительная";
	Если РежимОтладкиПоИсточникам Тогда
		ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	#КонецОбласти
	
	#Область ДетализацияСебестоимостиПартииТоваров
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	//РежимОтладки""ДетализацияСебестоимостиПартииТоваров"" КАК ИсточникДанных,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИсходныхЗатрат,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.Номенклатура КАК Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика КАК Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Организация КАК Организация,
	|	ДетализацияСебестоимости.Партия КАК Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура КАК НоменклатураИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика КАК ХарактеристикаИсходная,
	|	ДетализацияСебестоимости.ДокументПоступления КАК ДокументПоступленияИсходный,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|	КОНЕЦ КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	0 КАК ИсходныеДопРасходыНаЕдиницу,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА ДетализацияСебестоимости.НДСУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА ДетализацияСебестоимости.НДСРегл
	|	КОНЕЦ КАК ИсходныйНДСНаЕдиницу,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	0 КАК ИсходныйНДСНаЕдиницуНаНачало,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	0 КАК ИсходныйНДСНаЕдиницуНаКонец,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныйНДСНаЕдиницуЗаПериод,
	|	0 КАК КоличествоПартии
	|{ВЫБРАТЬ
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	ВидЗапасов.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	СтатьяРасходовИсходная.*,
	|	АналитикаУчетаПартийДокументаПоступления.*,
	|	НоменклатураИсходная.*,
	|	ХарактеристикаИсходная.*,
	|	ДокументПоступленияИсходный.*}
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК ДетализацияСебестоимости
	|ГДЕ
	|	&ВыводитьДетализацию
	|	И ДетализацияСебестоимости.Организация В (&МассивОрганизаций)
	|	И (ДетализацияСебестоимости.Номенклатура, ДетализацияСебестоимости.Характеристика, ДетализацияСебестоимости.ВидЗапасов, ДетализацияСебестоимости.Организация, ДетализацияСебестоимости.Партия, ДетализацияСебестоимости.АналитикаУчетаПартий) В
	|			(ВЫБРАТЬ
	|				ОстаткиИДвижения.Номенклатура,
	|				ОстаткиИДвижения.Характеристика,
	|				ОстаткиИДвижения.ВидЗапасов,
	|				ОстаткиИДвижения.Организация,
	|				ОстаткиИДвижения.Партия,
	|				ОстаткиИДвижения.АналитикаУчетаПартий
	|			ИЗ
	|				ВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат КАК ОстаткиИДвижения)
	|{ГДЕ
	|	ДетализацияСебестоимости.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Партия.* КАК Партия}";
	ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	//РежимОтладки""ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты"" КАК ИсточникДанных,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИсходныхЗатрат,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.Номенклатура КАК Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика КАК Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Организация КАК Организация,
	|	ДетализацияСебестоимости.Партия КАК Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходовИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПартийДокументаПоступления,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НоменклатураИсходная,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаИсходная,
	|	ДетализацияСебестоимости.ДокументПоступления КАК ДокументПоступленияИсходный,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеДопРасходыНаЕдиницу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.НДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.НДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныйНДСНаЕдиницу,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	0 КАК ИсходныйНДСНаЕдиницуНаНачало,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	0 КАК ИсходныйНДСНаЕдиницуНаКонец,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныйНДСНаЕдиницуЗаПериод,
	|	0 КАК КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|ГДЕ
	|	&ВыводитьДетализацию
	|	И ДетализацияСебестоимости.Организация В (&МассивОрганизаций)
	|	И ДетализацияСебестоимости.ПериодРегистрации <= КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И (ДетализацияСебестоимости.Номенклатура, ДетализацияСебестоимости.Характеристика, ДетализацияСебестоимости.ВидЗапасов, ДетализацияСебестоимости.Организация, ДетализацияСебестоимости.Партия, ДетализацияСебестоимости.АналитикаУчетаПартий) В
	|			(ВЫБРАТЬ
	|				ОстаткиИДвижения.Номенклатура,
	|				ОстаткиИДвижения.Характеристика,
	|				ОстаткиИДвижения.ВидЗапасов,
	|				ОстаткиИДвижения.Организация,
	|				ОстаткиИДвижения.Партия,
	|				ОстаткиИДвижения.АналитикаУчетаПартий
	|			ИЗ
	|				ВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат КАК ОстаткиИДвижения)
	|{ГДЕ
	|	((ДетализацияСебестоимости.Номенклатура, ДетализацияСебестоимости.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Партия.* КАК Партия}";
	ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ДетализацияСебестоимостиТоваровПостатейныеЗатраты_НачальныеОстатки
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	//РежимОтладки""ДетализацияСебестоимостиТоваровПостатейныеЗатраты_НачальныеОстатки"" КАК ИсточникДанных,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИсходныхЗатрат,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Организация КАК Организация,
	|	ДетализацияСебестоимости.Партия КАК Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходовИсходная,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура КАК НоменклатураИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика КАК ХарактеристикаИсходная,
	|	ДетализацияСебестоимости.ДокументПоступления КАК ДокументПоступленияИсходный,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	0 КАК ИсходныеДопРасходыНаЕдиницу,
	|	0 КАК ИсходныйНДСНаЕдиницу,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.НДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.НДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныйНДСНаЕдиницуНаНачало,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	0 КАК ИсходныйНДСНаЕдиницуНаКонец,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеНДСНаЕдиницуЗаПериод,
	|	ДетализацияСебестоимости.КоличествоПартии КАК КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|ГДЕ
	|	&ВыводитьДетализацию
	|	И ДетализацияСебестоимости.Организация В (&МассивОрганизаций)
	|	И ДетализацияСебестоимости.Период МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1), МЕСЯЦ)
	|	И (ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика, ДетализацияСебестоимости.ВидЗапасов, ДетализацияСебестоимости.Организация, ДетализацияСебестоимости.Партия, ДетализацияСебестоимости.АналитикаУчетаПартий) В
	|			(ВЫБРАТЬ
	|				ОстаткиИДвижения.Номенклатура,
	|				ОстаткиИДвижения.Характеристика,
	|				ОстаткиИДвижения.ВидЗапасов,
	|				ОстаткиИДвижения.Организация,
	|				ОстаткиИДвижения.Партия,
	|				ОстаткиИДвижения.АналитикаУчетаПартий
	|			ИЗ
	|				ВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат КАК ОстаткиИДвижения)
	|{ГДЕ
	|	((ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Партия.* КАК Партия}";
	ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ДетализацияСебестоимостиТоваровПостатейныеЗатраты_КонечныеОстатки
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	//РежимОтладки""ДетализацияСебестоимостиТоваровПостатейныеЗатраты_КонечныеОстатки"" КАК ИсточникДанных,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИсходныхЗатрат,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Организация КАК Организация,
	|	ДетализацияСебестоимости.Партия КАК Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходовИсходная,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура КАК НоменклатураИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика КАК ХарактеристикаИсходная,
	|	ДетализацияСебестоимости.ДокументПоступления КАК ДокументПоступленияИсходный,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	0 КАК ИсходныеДопРасходыНаЕдиницу,
	|	0 КАК ИсходныйНДСНаЕдиницу,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	0 КАК ИсходныйНДСНаЕдиницуНаНачало,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.НДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.НДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныйНДСНаЕдиницуНаКонец,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныйНДСНаЕдиницуЗаПериод,
	|	ДетализацияСебестоимости.КоличествоПартии КАК КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|ГДЕ
	|	&ВыводитьДетализацию
	|	И ДетализацияСебестоимости.Организация В (&МассивОрганизаций)
	|	И ДетализацияСебестоимости.Период МЕЖДУ НАЧАЛОПЕРИОДА(&КонецПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И (ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика, ДетализацияСебестоимости.ВидЗапасов, ДетализацияСебестоимости.Организация, ДетализацияСебестоимости.Партия, ДетализацияСебестоимости.АналитикаУчетаПартий) В
	|			(ВЫБРАТЬ
	|				ОстаткиИДвижения.Номенклатура,
	|				ОстаткиИДвижения.Характеристика,
	|				ОстаткиИДвижения.ВидЗапасов,
	|				ОстаткиИДвижения.Организация,
	|				ОстаткиИДвижения.Партия,
	|				ОстаткиИДвижения.АналитикаУчетаПартий
	|			ИЗ
	|				ВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат КАК ОстаткиИДвижения)
	|{ГДЕ
	|	((ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Партия.* КАК Партия}";
	ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ДетализацияСебестоимостиТоваровПостатейныеЗатраты_Обороты
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	//РежимОтладки""ДетализацияСебестоимостиТоваровПостатейныеЗатраты_Обороты"" КАК ИсточникДанных,
	|	НАЧАЛОПЕРИОДА(ДетализацияСебестоимости.Период, МЕСЯЦ) КАК ПериодИсходныхЗатрат,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Организация КАК Организация, 
	|	ДетализацияСебестоимости.Партия КАК Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходовИсходная,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура КАК НоменклатураИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика КАК ХарактеристикаИсходная,
	|	ДетализацияСебестоимости.ДокументПоступления КАК ДокументПоступленияИсходный,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	0 КАК ИсходныеДопРасходыНаЕдиницу,
	|	0 КАК ИсходныйНДСНаЕдиницу,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	0 КАК ИсходныйНДСНаЕдиницуНаНачало,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	0 КАК ИсходныйНДСНаЕдиницуНаКонец,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	//++ НЕ УТ
	|					ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|					ИЛИ
	//-- НЕ УТ
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ИЛИ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.НДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.НДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИсходныйНДСНаЕдиницуЗаПериод,
	|	ДетализацияСебестоимости.КоличествоПартии КАК КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|ГДЕ
	|	&ВыводитьДетализацию
	|	И ДетализацияСебестоимости.Организация В (&МассивОрганизаций)
	|	И ДетализацияСебестоимости.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И (ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика, ДетализацияСебестоимости.ВидЗапасов, ДетализацияСебестоимости.Организация, ДетализацияСебестоимости.Партия, ДетализацияСебестоимости.АналитикаУчетаПартий) В
	|			(ВЫБРАТЬ
	|				ОстаткиИДвижения.Номенклатура,
	|				ОстаткиИДвижения.Характеристика,
	|				ОстаткиИДвижения.ВидЗапасов,
	|				ОстаткиИДвижения.Организация,
	|				ОстаткиИДвижения.Партия,
	|				ОстаткиИДвижения.АналитикаУчетаПартий
	|			ИЗ
	|				ВТ_ОстаткиИДвиженияДляОтбораДетализацииИсходныхЗатрат КАК ОстаткиИДвижения)
	|{ГДЕ
	|	((ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Партия.* КАК Партия}";
	ТекстыВложенногоЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	СтрокаВложенногоЗапроса = СтрСоединить(ТекстыВложенногоЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Истина));
	
	#Область ПомещениеВИтоговуюВременнуюТаблицу
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.ПериодИсходныхЗатрат КАК ПериодИсходныхЗатрат,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ВложенныйЗапрос.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ВложенныйЗапрос.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.ВидЗапасов КАК ВидЗапасов,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Партия КАК Партия,
	|	ВложенныйЗапрос.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВложенныйЗапрос.СтатьяРасходовИсходная КАК СтатьяРасходовИсходная,
	|	ВложенныйЗапрос.ВидЦенности КАК ВидЦенности,
	|	ВложенныйЗапрос.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ВложенныйЗапрос.НоменклатураИсходная КАК НоменклатураИсходная,
	|	ВложенныйЗапрос.ХарактеристикаИсходная КАК ХарактеристикаИсходная,
	|	ВложенныйЗапрос.ДокументПоступленияИсходный КАК ДокументПоступленияИсходный,
	|	СУММА(ВложенныйЗапрос.ИсходныеМатериальныеЗатратыНаЕдиницу) КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПостоянныеНаЕдиницу) КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПеременныеНаЕдиницу) КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	СУММА(ВложенныйЗапрос.ИсходныеДопРасходыНаЕдиницу) КАК ИсходныеДопРасходыНаЕдиницу,
	|	СУММА(ВложенныйЗапрос.ИсходныйНДСНаЕдиницу) КАК ИсходныйНДСНаЕдиницу,
	|	СУММА(ВложенныйЗапрос.ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало) КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало) КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало) КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	СУММА(ВложенныйЗапрос.ИсходныеДопРасходыНаЕдиницуНаНачало) КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	СУММА(ВложенныйЗапрос.ИсходныйНДСНаЕдиницуНаНачало) КАК ИсходныйНДСНаЕдиницуНаНачало,
	|	СУММА(ВложенныйЗапрос.ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец) КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец) КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец) КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	СУММА(ВложенныйЗапрос.ИсходныеДопРасходыНаЕдиницуНаКонец) КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	СУММА(ВложенныйЗапрос.ИсходныйНДСНаЕдиницуНаКонец) КАК ИсходныйНДСНаЕдиницуНаКонец,
	|	СУММА(ВложенныйЗапрос.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод) КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод) КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	СУММА(ВложенныйЗапрос.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод) КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	СУММА(ВложенныйЗапрос.ИсходныеДопРасходыНаЕдиницуЗаПериод) КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	СУММА(ВложенныйЗапрос.ИсходныйНДСНаЕдиницуЗаПериод) КАК ИсходныйНДСНаЕдиницуЗаПериод,
	|	СУММА(ВложенныйЗапрос.КоличествоПартии) КАК КоличествоПартии
	|ПОМЕСТИТЬ ВТ_ДетализацияИсходныхЗатрат
	|{ВЫБРАТЬ
	|	ПериодИсходныхЗатрат,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	ВидЗапасов.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	СтатьяРасходовИсходная.*,
	|	ВидЦенности.*,
	|	АналитикаУчетаПартийДокументаПоступления.*,
	|	НоменклатураИсходная.*,
	|	ХарактеристикаИсходная.*,
	|	ДокументПоступленияИсходный.*,
	|	ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	ИсходныеДопРасходыНаЕдиницу,
	|	ИсходныйНДСНаЕдиницу,
	|	ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	ИсходныйНДСНаЕдиницуНаНачало,
	|	ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	ИсходныйНДСНаЕдиницуНаКонец,
	|	ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	ИсходныйНДСНаЕдиницуЗаПериод,
	|	КоличествоПартии}
	|ИЗ
	|	ДетализацияИсходныхЗатратПредварительная КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ЕдиницаХранения,
	|	ВложенныйЗапрос.ЕдиницаДляОтчетов,
	|	ВложенныйЗапрос.ХарактеристикаИсходная,
	|	ВложенныйЗапрос.СтатьяРасходовИсходная,
	|	ВложенныйЗапрос.ВидЦенности,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.ПериодИсходныхЗатрат,
	|	ВложенныйЗапрос.Партия,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ДокументПоступленияИсходный,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.АналитикаУчетаПартийДокументаПоступления,
	|	ВложенныйЗапрос.АналитикаУчетаПартий,
	|	ВложенныйЗапрос.НоменклатураИсходная,
	|	ВложенныйЗапрос.КоэффициентЕдиницыДляОтчетов";
	#КонецОбласти
	
	Если РежимОтладкиПоИсточникам Тогда
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(СтрокаВложенногоЗапроса);
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДетализацияИсходныхЗатратПредварительная", "(" + СтрокаВложенногоЗапроса + ")");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
