//////////////////////////////////////////////////////////////////
// Copyright (c) 21.11.2021 Варгасов Д.О. dovargasov@gmail.com  //
////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс

// Добавляет уведомление в очередь уведомлений.
//
// Параметры:
//  СтруктураУведомлений - Структура - Параметры отправки и список получателей.
//
Процедура ДобавитьУведомления(СтруктураУведомлений) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не СтруктураУведомлений.Свойство("ВыбранныеПолучатели")
		Или Не СтруктураУведомлений.Свойство("МассивУведомлений") Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого Уведомление Из СтруктураУведомлений.МассивУведомлений Цикл
		
		Для Каждого Получатель ИЗ СтруктураУведомлений.ВыбранныеПолучатели Цикл
			
			Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Пользователи") Тогда
				Получатели = Новый Массив;
				Получатели.Добавить(Получатель);
			Иначе //Другой вариант только группа
				Получатели = Получатель.Состав.ВыгрузитьКолонку("Пользователь");
			КонецЕсли; 
			
			Для	Каждого Пользователь Из Получатели Цикл
				
				Запись = РегистрыСведений.ТН_ОчередьУведомлений.СоздатьМенеджерЗаписи();
				
				Запись.Уведомление = Уведомление; 
				Запись.Получатель = Пользователь;
				Запись.Отправитель = ?(СтруктураУведомлений.Свойство("Отправитель"), СтруктураУведомлений.Отправитель, Уведомление.Автор);
				Запись.ДатаОтправки = ТекущаяДатаСеанса();
				Запись.СрокУведомления = Уведомление.СрокУведомления;
				
				Запись.Записать(); 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;          
	
КонецПроцедуры  

Процедура Прочитано(Уведомление, Пользователь) Экспорт     
	
	НаборЗаписей = РегистрыСведений.ТН_ОчередьУведомлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Уведомление.Установить(Уведомление);
	НаборЗаписей.Отбор.Получатель.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ДатаПрочтения = ТекущаяДатаСеанса();
			Запись.Прочитано = Истина;
		КонецЦикла; 
		
		НаборЗаписей.Записать(Истина);   
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ТН_ОчередьУведомлений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Уведомление.Установить(Уведомление);
		НаборЗаписей.Отбор.Получатель.Установить(Справочники.Пользователи.ПустаяСсылка());
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() <> 0 Тогда
	
			Для Каждого ЗаписьПустойПользователь Из НаборЗаписей Цикл
				
				Запись = РегистрыСведений.ТН_ОчередьУведомлений.СоздатьМенеджерЗаписи();			
				ЗаполнитьЗначенияСвойств(Запись, ЗаписьПустойПользователь);				
				Запись.Получатель = Пользователи.ТекущийПользователь();
				Запись.ДатаПрочтения = ТекущаяДатаСеанса();
				Запись.Прочитано = Истина;
				Запись.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СписокУведомленийПользователя(Пользователь, Все = Ложь) Экспорт
	
	МассивУведомлений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТН_ОчередьУведомлений.Уведомление КАК Уведомление,
		|	МАКСИМУМ(ТН_ОчередьУведомлений.Прочитано) КАК Прочитано
		|ИЗ
		|	РегистрСведений.ТН_ОчередьУведомлений КАК ТН_ОчередьУведомлений
		|ГДЕ
		|	ТН_ОчередьУведомлений.Получатель В(&Получатели)
		|	И (ТН_ОчередьУведомлений.СрокУведомления >= &СрокУведомления
		|			ИЛИ ТН_ОчередьУведомлений.СрокУведомления = ДАТАВРЕМЯ(1, 1, 1))
		|
		|СГРУППИРОВАТЬ ПО
		|	ТН_ОчередьУведомлений.Уведомление
		|
		|ИМЕЮЩИЕ
		|	(НЕ МАКСИМУМ(ТН_ОчередьУведомлений.Прочитано)
		|		ИЛИ &Все)";
	
	Получатели = Новый Массив;
	Получатели.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Получатели.Добавить(Пользователь);
	
	Запрос.УстановитьПараметр("Получатели", Получатели);
	Запрос.УстановитьПараметр("Все", Все);
	Запрос.УстановитьПараметр("СрокУведомления", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивУведомлений.Добавить(Выборка.Уведомление);
	КонецЦикла;
	
	Возврат МассивУведомлений;

КонецФункции	

#КонецОбласти
