
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Уровень = Константы.УровеньКонтроляПравилНоменклатуры.Получить();
	
	МассивТипов = Новый Массив;
	
	Если Уровень = Перечисления.УровниКонтроляПравилНоменклатуры.ОКПД2 Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.КлассификаторОКПД2"));
		ТекстНадписи = НСтр("ru='ОКПД2'");
	ИначеЕсли Уровень = Перечисления.УровниКонтроляПравилНоменклатуры.ТоварнаяКатегорияНоменклатура Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
		МассивТипов.Добавить(Тип("СправочникСсылка.ТоварныеКатегории"));
		ТекстНадписи = НСтр("ru='Номенклатура / Товарная категория'");
	КонецЕсли;
	
	Элементы.УровеньКонтроляНоменклатуры.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	Элементы.УровеньКонтроляНоменклатуры.Заголовок = ТекстНадписи;
	
КонецПроцедуры
