
&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения(); 	
    ЗаписатьЗамечание();
	
	Закрыть();   
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СсылкаНаДокумент") Тогда		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СсылкаНаДокумент); 
		СсылкаНаДокумент = Параметры.СсылкаНаДокумент; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗамечание() 
	
	ОбъектЗамечания = СсылкаНаДокумент.ПолучитьОбъект();
	ОбъектЗамечания.тн_ЗамечаниеКДокументу = тн_ЗамечаниеКДокументу; 
	ПроверкаДатЗапретаОтключена = ДатыЗапретаИзменения.ПроверкаДатЗапретаОтключена();
    ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Истина); 
	// НАЧАЛО Юдина (Гутарова) Екатерина 28.05.2024 Выполнение задач №000049669 
	ОбъектЗамечания.ОбменДанными.Загрузка = Истина; 
	// КОНЕЦ Юдина (Гутарова) Екатерина 28.05.2024 Выполнение задач №000049669
	Попытка 
		// НАЧАЛО Юдина Екатерина 31.10.2024 Выполнение задач №000051422
		////НАЧАЛО Блинова М.А. 14.10.2024 Выполнение задач №000051095	
		//	ОбъектЗамечания.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);  
		//	//КОНЕЦ Блинова М.А. 14.10.2024 Выполнение задач №000051095     
		ОбъектЗамечания.ДополнительныеСвойства.Вставить("ОтключитьВсеПроверки", Истина);  
		// КОНЕЦ Юдина Екатерина 31.10.2024 Выполнение задач №000051422
		ОбъектЗамечания.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(ПроверкаДатЗапретаОтключена);
		ВызватьИсключение;
	КонецПопытки;
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(ПроверкаДатЗапретаОтключена);
	
КонецПроцедуры	