
&НаСервере
Функция СоздатьШаблоныНаСервере(СторноСсылка)
	
	ТекстСообщения = "";
	//сначала найдем шаблоны по которым был отражен сторнируемый документ		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МСФО.Регистратор.ШаблонКорректировки КАК РегистраторШаблонКорректировки,
		|	МСФО.Регистратор КАК Регистратор,
		|	МСФО.СчетДт КАК СчетДт,
		|	МСФО.СчетКт КАК СчетКт,
		|	ТрансформационнаяКорректировкаПроводки.ШаблонПроводки КАК ШаблонПроводки
		|ПОМЕСТИТЬ ВТ_Предварительная
		|ИЗ
		|	РегистрБухгалтерии.МСФО КАК МСФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТрансформационнаяКорректировка.Проводки КАК ТрансформационнаяКорректировкаПроводки
		|		ПО МСФО.Регистратор = ТрансформационнаяКорректировкаПроводки.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(МСФО.Регистратор) = ТИП(Документ.ТрансформационнаяКорректировка)
		|	И МСФО.Регистратор.ИсходныйДокумент = &ИсходныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Предварительная.РегистраторШаблонКорректировки КАК РегистраторШаблонКорректировки,
		|	ВТ_Предварительная.Регистратор КАК Регистратор,
		|	ВТ_Предварительная.ШаблонПроводки КАК ШаблонПроводки,
		|	ВЫРАЗИТЬ(ВТ_Предварительная.ШаблонПроводки.ТекстОтбора КАК Строка(1024)) КАК ШаблонПроводкиТекстОтбора,
		|	ВЫРАЗИТЬ(ВТ_Предварительная.ШаблонПроводки.ТекстОтбораРегистратор КАК Строка(1024)) КАК ШаблонПроводкиТекстОтбораРегистратор,
		|	ВТ_Предварительная.ШаблонПроводки.СчетДт КАК ШаблонПроводкиСчетДт,
		|	ВТ_Предварительная.ШаблонПроводки.СчетКт КАК ШаблонПроводкиСчетКт,
		|	ВТ_Предварительная.ШаблонПроводки.РегистрБД КАК ШаблонПроводкиРегистрБД
		|ИЗ
		|	ВТ_Предварительная КАК ВТ_Предварительная";
	
	Запрос.УстановитьПараметр("ИсходныйДокумент", СторноСсылка.СторнируемыйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗШаблонов = РезультатЗапроса.Выгрузить();
	Для Каждого Шаблон из ТЗШаблонов Цикл
		// меняем под Сторно отборы   
		Если Шаблон.ШаблонПроводкиТекстОтбора <> "" Тогда
			 Шаблон.ШаблонПроводкиТекстОтбора = СтрЗаменить(Шаблон.ШаблонПроводкиТекстОтбора, "Регистратор.", "Регистратор.СторнируемыйДокумент."); 
		КонецЕсли; 
		Если Шаблон.ШаблонПроводкиТекстОтбораРегистратор <> "" Тогда
			 Шаблон.ШаблонПроводкиТекстОтбораРегистратор = СтрЗаменить(Шаблон.ШаблонПроводкиТекстОтбораРегистратор, "Регистратор.", "Регистратор.СторнируемыйДокумент.");
		КонецЕсли; 
	КонецЦикла;
	
	//теперь поищем нет ли таких шаблонов уже существующих для Сторно
	ЗапросШаблоновСторно = Новый Запрос; 
	ЗапросШаблоновСторно.Текст = 
	 "ВЫБРАТЬ
	 |	ТЗШаблонов.РегистраторШаблонКорректировки КАК РегистраторШаблонКорректировки,
	 |	ТЗШаблонов.ШаблонПроводки КАК ШаблонПроводки,
	 |  ВЫРАЗИТЬ(ТЗШаблонов.ШаблонПроводкиТекстОтбора КАК Строка(1024)) КАК ШаблонПроводкиТекстОтбора,
	 |  ВЫРАЗИТЬ(ТЗШаблонов.ШаблонПроводкиТекстОтбораРегистратор КАК Строка(1024)) КАК ШаблонПроводкиТекстОтбораРегистратор,
	 |	ТЗШаблонов.ШаблонПроводкиСчетДт КАК ШаблонПроводкиСчетДт,
	 |	ТЗШаблонов.ШаблонПроводкиСчетКт КАК ШаблонПроводкиСчетКт, 
	 |	ТЗШаблонов.ШаблонПроводкиРегистрБД КАК ШаблонПроводкиРегистрБД
	 |ПОМЕСТИТЬ ВТ_ШаблоныДляПоиска
	 |ИЗ
	 |	&ТЗШаблонов КАК ТЗШаблонов
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ШаблоныПроводок.СчетДт КАК СчетДт,
	 |	ШаблоныПроводок.СчетКт КАК СчетКт,
	 |	ШаблоныПроводок.РегистрБД КАК РегистрБД,
	 |	ШаблоныПроводок.СчетДтИсточник КАК СчетДтИсточник,
	 |	ШаблоныПроводок.СчетКтИсточник КАК СчетКтИсточник, 
	 |  ВЫРАЗИТЬ(ШаблоныПроводок.ТекстОтбора КАК Строка(1024)) КАК ТекстОтбора,
	 |  ВЫРАЗИТЬ(ШаблоныПроводок.ТекстОтбораРегистратор КАК Строка(1024)) КАК ТекстОтбораРегистратор,
	 |	ШаблоныПроводок.Наименование КАК Наименование 
	 |ПОМЕСТИТЬ ВТ_СуществующиеШаблоныСторно
	 |ИЗ
	 |	Справочник.ШаблоныПроводок КАК ШаблоныПроводок
	 |ГДЕ
	 |	ШаблоныПроводок.Владелец = &Владелец
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_ШаблоныДляПоиска.РегистраторШаблонКорректировки КАК РегистраторШаблонКорректировки,
	 |	ВТ_ШаблоныДляПоиска.ШаблонПроводки КАК ШаблонПроводки,
	 |	ВТ_ШаблоныДляПоиска.ШаблонПроводкиТекстОтбора КАК ШаблонПроводкиТекстОтбора,
	 |	ВТ_ШаблоныДляПоиска.ШаблонПроводкиТекстОтбораРегистратор КАК ШаблонПроводкиТекстОтбораРегистратор,
	 |	ВТ_ШаблоныДляПоиска.ШаблонПроводкиСчетДт КАК ШаблонПроводкиСчетДт,
	 |	ВТ_ШаблоныДляПоиска.ШаблонПроводкиСчетКт КАК ШаблонПроводкиСчетКт, 
	 |	ВТ_ШаблоныДляПоиска.ШаблонПроводкиРегистрБД КАК ШаблонПроводкиРегистрБД,
	 |	ЕСТЬNULL(СуществующиеШаблоныПроводок.Наименование, """") КАК НаименованиеШаблонаСторно
	 |ИЗ
	 |	ВТ_ШаблоныДляПоиска КАК ВТ_ШаблоныДляПоиска
	 |				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуществующиеШаблоныСторно КАК СуществующиеШаблоныПроводок
	 |		ПО ВТ_ШаблоныДляПоиска.ШаблонПроводкиТекстОтбора = СуществующиеШаблоныПроводок.ТекстОтбора
	 |			И ВТ_ШаблоныДляПоиска.ШаблонПроводкиСчетДт = СуществующиеШаблоныПроводок.СчетДт
	 |			И ВТ_ШаблоныДляПоиска.ШаблонПроводкиСчетКт = СуществующиеШаблоныПроводок.СчетКт
	 |			И ВТ_ШаблоныДляПоиска.ШаблонПроводкиРегистрБД = СуществующиеШаблоныПроводок.РегистрБД
	 |			И ВТ_ШаблоныДляПоиска.ШаблонПроводкиТекстОтбораРегистратор = СуществующиеШаблоныПроводок.ТекстОтбораРегистратор";
	 
	ВладелецШаблонаСторно = Справочники.ШаблоныТрансформационныхКорректировок.НайтиПоНаименованию("УУ_Сторно");
	ЗапросШаблоновСторно.УстановитьПараметр("Владелец", ВладелецШаблонаСторно);
	ЗапросШаблоновСторно.УстановитьПараметр("ТЗШаблонов", ТЗШаблонов);

	РезультатЗапросаСторно = ЗапросШаблоновСторно.Выполнить();
	ВыборкаРезультатаЗапроса = РезультатЗапросаСторно.Выбрать();
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл     
		Если ВыборкаРезультатаЗапроса.НаименованиеШаблонаСторно = "" Тогда
			//создаем новый шаблон для Сторно 
			//но сначала проверим, делает ли вообще Сторно движения в регистре создаваемого нами шаблона
			МожноСоздаватьШаблон = Истина;
			Если ВыборкаРезультатаЗапроса.ШаблонПроводкиРегистрБД = Неопределено ИЛИ Не СтрНайти(ВыборкаРезультатаЗапроса.ШаблонПроводкиРегистрБД.Регистраторы, "Документ.Сторно") Тогда
				 МожноСоздаватьШаблон = Ложь;
			КонецЕсли;
			Если МожноСоздаватьШаблон Тогда
				НовыйШаблон = ВыборкаРезультатаЗапроса.ШаблонПроводки.Скопировать();
				//меняем нужные поля на сторно
				НовыйШаблон.Владелец = ВладелецШаблонаСторно; 
				НовыйШаблон.ТекстОтбора            = ВыборкаРезультатаЗапроса.ШаблонПроводкиТекстОтбора;
				НовыйШаблон.ТекстОтбораРегистратор = ВыборкаРезультатаЗапроса.ШаблонПроводкиТекстОтбораРегистратор;
				НовыйШаблон.ПредставлениеОтбора = СтрЗаменить(НовыйШаблон.ПредставлениеОтбора, "Регистратор.", "Регистратор.СторнируемыйДокумент.");
				Для Каждого	СтрокаТаблицыПараметровОтбора Из НовыйШаблон.ТаблицаПараметровОтбораБД Цикл  
					СтрокаТаблицыПараметровОтбора.ПолеБД = СтрЗаменить(СтрокаТаблицыПараметровОтбора.ПолеБД, "Регистратор.", "Регистратор.СторнируемыйДокумент.");
				КонецЦикла;
				Для Каждого	СтрокаУточнения Из НовыйШаблон.УточненияСпособовОпределения Цикл  
					СтрокаУточнения.ПолеБД = СтрЗаменить(СтрокаУточнения.ПолеБД, "Регистратор.", "Регистратор.СторнируемыйДокумент.");
				КонецЦикла;    
				Для Каждого	СтрокаПравил Из НовыйШаблон.ПравилаИспользованияПолейЗапроса Цикл  
					СтрокаПравил.Поле = СтрЗаменить(СтрокаПравил.Поле, "Регистратор.", "Регистратор.СторнируемыйДокумент.");
				КонецЦикла;

				Попытка
					НовыйШаблон.Записать(); 
					ТекстСообщения = ТекстСообщения + СтрШаблон(" Записан шаблон проводки %1 для документа Сторно исходного шаблона проводки %2",
					                            НовыйШаблон.Ссылка,
					                            ВыборкаРезультатаЗапроса.ШаблонПроводки); 
				Исключение
					ТекстСообщения = ТекстСообщения + СтрШаблон(" Не удалось записать шаблон проводки для документа Сторно исходного шаблона проводки %1",
					                            ВыборкаРезультатаЗапроса.ШаблонПроводки); 
				КонецПопытки; 
			КонецЕсли;							
		КонецЕсли;	
	КонецЦикла;
	
    Возврат ТекстСообщения; 
	
КонецФункции  

&НаКлиенте
Процедура СоздатьШаблоны(Команда)
	ТекстСообщения = СоздатьШаблоныНаСервере(Объект.Сторно);  
	ТекстСообщения = ?(ТекстСообщения = "", "Для существующих шаблонов проводок исходного документа уже существуют шаблоны проводок Сторно", ТекстСообщения);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры 

