
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВидыДокументовПлана.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДокументыБД");
	Объект.ВидыДокументовФакта.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДокументыБД");
	
	ИсточникПараметров = Новый Соответствие;
	ИсточникПараметров.Вставить("Отбор.Владелец", Справочники.ТипыБазДанных.ТекущаяИБ);
	ПараметрыВыбора = МСФОКлиентСерверУХ.ПолучитьПараметрыВыбора(ИсточникПараметров);
	
	Элементы.ВидыДокументовПлана.ПараметрыВыбора = ПараметрыВыбора;
	Элементы.ВидыДокументовФакта.ПараметрыВыбора = ПараметрыВыбора;
	
	//см. ПриЗагрузкеДанныхИзНастроекНаСервере
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ПодготовитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбновитьСписки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОбновитьСписки()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Сценарий.Пустая() Тогда
		ПодготовитьФорму();//Форма не настроена, например при первом открытии нет сохраненных настроек
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	Элементы.ФормаНастройки.Пометка = Не Элементы.ФормаНастройки.Пометка;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления(Команда)
	
	Элементы.ФормаНачисления.Пометка = Не Элементы.ФормаНачисления.Пометка;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Факт(Команда)
	
	Элементы.ФормаФакт.Пометка = Не Элементы.ФормаФакт.Пометка;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставления(Команда)
	
	Элементы.ФормаСопоставления.Пометка = Не Элементы.ФормаСопоставления.Пометка;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКорректировки(Команда)
	СформироватьКорректировкиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьОтборыПоРеквизиту(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	УстановитьОтборыПоРеквизиту(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПериодСценарияПриИзменении(Элемент)
	УстановитьОтборыПоРеквизиту(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьОтборыПоРеквизиту(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	УстановитьОтборыПоРеквизиту(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	УстановитьОтборыПоРеквизиту(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВидыДокументовПланаПриИзменении(Элемент)
	ПодготовитьЗапросПлана();
КонецПроцедуры

&НаКлиенте
Процедура ВидыДокументовФактаПриИзменении(Элемент)
	ПодготовитьЗапросФакта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ДокументыПланПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДокументыПлан.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ЗначениеОтбор = Неопределено;
	Иначе
		ЗначениеОтбор = ТекДанные.Ссылка;
	КонецЕсли;
	
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(Сопоставление, "ДокументПлан",  ЗначениеОтбор, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеПлан = Элементы.ДокументыПлан.ТекущиеДанные;
	Если (ТекДанныеПлан = Неопределено) Или ТекДанныеПлан.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
		
	ОстатокПланаДляСопоставления = ТекДанныеПлан.Сумма - ТекДанныеПлан.СуммаФакт;
	Если (ОстатокПланаДляСопоставления <= 0) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСопоставления(ТекДанныеПлан.Ссылка, ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если Строка = Неопределено Тогда //можно перетаскивать только "на строку" плана
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ЗаписатьСопоставления(Строка, ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеПослеУдаления(Элемент)

	ОбновитьСписки();

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции_ПодготовкаТекстовЗапросов

&НаСервере
Процедура ПодготовитьЗапросПлана()
	
	ТекОписаниеИБ = Неопределено;
	ОписанияИБ = ОписаниеДокументовИБ(Объект.ВидыДокументовПлана.ВыгрузитьЗначения());
	
	ДокументыСписка = Новый Массив;
	Для Каждого СтрокаТаб Из Объект.ВидыДокументовПлана Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаб.Значение.Наименование) 
			Или Не ОписанияИБ.Свойство(СтрокаТаб.Значение.Наименование, ТекОписаниеИБ) Тогда
			Продолжить;
		КонецЕсли;
		
		ПервыйЗапрос = (ДокументыСписка.Количество() = 0);
		ТекстЗапроса = ТекстЗапроса_ШаблонПлан(ПервыйЗапрос);
		Доступен = ДоработатьТекстЗапросаПоДокументу(ТекстЗапроса, ТекОписаниеИБ);
		
		Если Доступен Тогда
			ДокументыСписка.Добавить(ТекстЗапроса);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ВидыДокументовПлана.Количество() = 0 Тогда
		ДокументыСписка.Добавить(ТекстЗапроса_ШаблонПлан(Истина));
	КонецЕсли;
	
	ТекстПлан = Новый Массив();
	ТекстПлан.Добавить(СтрСоединить(ДокументыСписка, " ОБЪЕДИНИТЬ ВСЕ "));
	ТекстПлан.Добавить(ТекстЗапроса_Сопоставления());
	ТекстПлан.Добавить(ТекстЗапроса_ТаблицаПлан());

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ТекстЗапроса = СтрСоединить(ТекстПлан, ОбщегоНазначенияУХВызовСервера.ТекстРазделителяЗапросовПакета());
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ДокументыПлан, СвойстваСписка);

	Если Элементы.ДокументыПлан.Видимость Тогда
		Элементы.ДокументыПлан.Обновить();
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьЗапросФакта()
	
	ТекОписаниеИБ = Неопределено;
	ОписанияИБ = ОписаниеДокументовИБ(Объект.ВидыДокументовФакта.ВыгрузитьЗначения());
	
	ДокументыСписка = Новый Массив;
	Для Каждого СтрокаТаб Из Объект.ВидыДокументовФакта Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаб.Значение)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТаб.Значение.Наименование) 
			Или Не ОписанияИБ.Свойство(СтрокаТаб.Значение.Наименование, ТекОписаниеИБ) Тогда
			Продолжить;
		КонецЕсли;
		
		ПервыйЗапрос = (ДокументыСписка.Количество() = 0);
		ТекстЗапроса = ТекстЗапроса_ШаблонФакт(ПервыйЗапрос);
		Доступен = ДоработатьТекстЗапросаПоДокументу(ТекстЗапроса, ТекОписаниеИБ);
		
		Если Доступен Тогда
			ДокументыСписка.Добавить(ТекстЗапроса);
		КонецЕсли;
		
	КонецЦикла;

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ТекстЗапроса = СтрСоединить(ДокументыСписка, " ОБЪЕДИНИТЬ ВСЕ ");
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ДокументыФакт, СвойстваСписка);

	Если Элементы.ДокументыФакт.Видимость Тогда
		Элементы.ДокументыФакт.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеДокументовИБ(Документы)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументыБД.Наименование КАК Наименование,
	|	ДокументыБД.РеквизитКонтрагент КАК Контрагент,
	|	ДокументыБД.РеквизитДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыБД.РеквизитСуммыДокумента КАК Сумма
	|ИЗ
	|	Справочник.ДокументыБД КАК ДокументыБД
	|ГДЕ
	|	НЕ ДокументыБД.ПометкаУдаления
	|	И ДокументыБД.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	|	И ДокументыБД.Ссылка В(&Документы)");

	Запрос.УстановитьПараметр("Документы", Документы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СокрЛП(Выборка.Наименование), ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ТекстЗапроса_ШаблонФакт(ПервыйЗапрос = Ложь)

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Итоги.СуммаФакт, 0) КАК СуммаФакт,
	|	т.Ссылка КАК Ссылка,
	|	т.Проведен КАК Проведен,
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	(ТИПЗНАЧЕНИЯ(т.Ссылка)) КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА т.ПометкаУдаления
	|			ТОГДА 3
	|		КОГДА НЕ т.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КартинкаСтроки,
	|	т.Организация КАК Организация,
	|	т.Сумма КАК Сумма,
	|	ЕСТЬNULL(т.ПериодСценария, &Сценарий) КАК ПериодСценария,
	|	ЕСТЬNULL(т.Контрагент, &Контрагент) КАК Контрагент,
	|	ЕСТЬNULL(т.ДоговорКонтрагента, &ДоговорКонтрагента) КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.НачислениеОперацийМСФО КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			с.ДокументФакт КАК СсылкаФакт,
	|			СУММА(с.СуммаФакт) КАК СуммаФакт
	|		ИЗ
	|			РегистрСведений.СопоставлениеПланФактОперацийНачисленияМСФО КАК с
	|		
	|		СГРУППИРОВАТЬ ПО
	|			с.ДокументФакт) КАК Итоги
	|		ПО т.Ссылка = Итоги.СсылкаФакт
	|ГДЕ
	|	НЕ т.ПометкаУдаления";
	
	Если ПервыйЗапрос <> Истина Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапроса_ШаблонПлан(ПервыйЗапрос = Ложь)

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА т.ПометкаУдаления
	|			ТОГДА 3
	|		КОГДА НЕ т.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КартинкаСтроки,
	|	т.Сумма КАК СуммаПлан,
	|	ЕСТЬNULL(т.ПериодСценария, &Сценарий) КАК ПериодСценария,
	|	ЕСТЬNULL(т.Контрагент, &Контрагент) КАК Контрагент,
	|	ЕСТЬNULL(т.ДоговорКонтрагента, &ДоговорКонтрагента) КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ втДокументыПлана
	|ИЗ
	|	Документ.НачислениеОперацийМСФО КАК т
	|ГДЕ
	|	т.СторнироватьАвтоматически = ЛОЖЬ
	|{ГДЕ
	|	т.Организация.* КАК Организация,
	|	т.Сценарий.* КАК Сценарий,
	|	т.Дата КАК Дата}";
	
	Если ПервыйЗапрос <> Истина Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ втДокументыПлана", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Функция ТекстЗапроса_Сопоставления()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	т.ДокументПлан КАК СсылкаПлан,
	|	СУММА(т.СуммаФакт) КАК СуммаФакт,
	|	МАКСИМУМ(т.Корректировка) КАК Корректировка,
	|	СУММА(ВЫБОР
	|			КОГДА т.Корректировка = ЗНАЧЕНИЕ(Документ.ТрансформационнаяКорректировка.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА т.Корректировка = ЗНАЧЕНИЕ(Документ.ОперацияМСФО.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА т.Корректировка = 0
	|				ТОГДА 0
	|			ИНАЧЕ т.СуммаФакт
	|		КОНЕЦ) КАК СуммаФактТК
	|ПОМЕСТИТЬ втСопоставления
	|ИЗ
	|	РегистрСведений.СопоставлениеПланФактОперацийНачисленияМСФО КАК т
	|ГДЕ
	|	т.ДокументПлан В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				втДокументыПлана КАК т)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СсылкаПлан";
	
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Функция ТекстЗапроса_ТаблицаПлан()
	
	Возврат
	"ВЫБРАТЬ
	|	ТИПЗНАЧЕНИЯ(п.Ссылка) КАК ТипДокумента,
	|	п.Ссылка КАК Ссылка,
	|	п.Ссылка.Номер КАК Номер,
	|	п.Ссылка.Дата КАК Дата,
	|	п.КартинкаСтроки КАК КартинкаСтроки,
	|	п.Ссылка.Проведен КАК Проведен,
	|	п.Ссылка.Организация КАК Организация,
	|	п.Ссылка.Сценарий КАК Сценарий,
	|	п.Контрагент КАК Контрагент,
	|	п.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	п.СуммаПлан КАК Сумма,
	|	п.ПериодСценария КАК ПериодСценария,
	|	ЕСТЬNULL(с.СуммаФактТК, 0) КАК СуммаФакт,
	|	ЕСТЬNULL(с.СуммаФактТК, 0) < п.СуммаПлан КАК ТребуетсяФормированиеТК,
	|	с.Корректировка КАК Корректировка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(с.СуммаФактТК, 0) = п.СуммаПлан
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Закрыт
	|ИЗ
	|	втДокументыПлана КАК п
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСопоставления КАК с
	|		ПО п.Ссылка = с.СсылкаПлан";

КонецФункции

&НаСервере
Функция ДоработатьТекстЗапросаПоДокументу(ТекстЗапроса, ОписаниеДокументаИБ)
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ОписаниеДокументаИБ.Наименование);
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли НЕ ПравоДоступа("Просмотр", МетаданныеДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Процессор = Новый Структура("Метаданные, ТекстЗапроса, ИменаИБ", МетаданныеДокумента, ТекстЗапроса, ОписаниеДокументаИБ);
	
	ЗаменитьРеквизит(Процессор, "Контрагент",			"Контрагент");
	ЗаменитьРеквизит(Процессор, "ДоговорКонтрагента",	"ДоговорКонтрагента");
	ЗаменитьРеквизит(Процессор, "Сумма", 				"Сумма, СуммаДокумента, СуммаОперации");
	ЗаменитьРеквизит(Процессор, "ПериодСценария",		"ПериодСценария, ПериодОтчета");
	ЗаменитьРеквизит(Процессор, "Сценарий",				"Сценарий", "(&Сценарий)");
	ЗаменитьРеквизит(Процессор, "СторнироватьАвтоматически", "СторнироватьАвтоматически", "ЛОЖЬ");
	
	ТекстЗапроса = СтрЗаменить(Процессор.ТекстЗапроса, "НачислениеОперацийМСФО", ОписаниеДокументаИБ.Наименование);	
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаменитьРеквизит(Процессор, ИмяПриемник = "Сумма", ИменаИсточники = "Сумма, СуммаДокумента", ВыражениеПоУмолчанию = "NULL")
	
	ПрефиксПоиска = "т."; // @query-part
	ИмяИсточник = ИмяДляДокумента(ИмяПриемник, Процессор.ИменаИБ, ИменаИсточники, Процессор.Метаданные);
	ИмяИсточник = ?(ИмяИсточник = Неопределено, ВыражениеПоУмолчанию, ПрефиксПоиска + ИмяИсточник);
	
	Процессор.ТекстЗапроса = СтрЗаменить(Процессор.ТекстЗапроса, ПрефиксПоиска + ИмяПриемник, ИмяИсточник);

КонецПроцедуры

&НаСервере
Функция ИмяДляДокумента(ИмяПриемник, ИменаИБ, ИменаИсточники, ОбъектМД)
	
	Если ИменаИБ.Свойство(ИмяПриемник) И ЗначениеЗаполнено(ИменаИБ[ИмяПриемник]) Тогда
		Возврат ИменаИБ[ИмяПриемник];
	КонецЕсли;
	
	ИменаРеквизитов = СтрРазделить(ИменаИсточники, ", ");
	
	Для каждого ПолеЗамены Из ИменаРеквизитов Цикл
		Если ОбъектМД.Реквизиты.Найти(СокрЛП(ПолеЗамены)) <> Неопределено Тогда
			Возврат СокрЛП(ПолеЗамены);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ПодготовитьФорму()
	
	ПланыПоУмолчанию = Новый СписокЗначений;
	ПланыПоУмолчанию.ЗагрузитьЗначения(Обработки.СопоставлениеПланФактОперацийМСФО.ДокументыПланаПоУмолчанию());
	
	ФактПоУмолчанию = Новый СписокЗначений;
	ФактПоУмолчанию.ЗагрузитьЗначения(Обработки.СопоставлениеПланФактОперацийМСФО.ДокументыФактаПоУмолчанию());
	
	МСФОКлиентСерверУХ.УстановитьНезаполненноеЗначение(Объект.ВидыДокументовПлана, 	ПланыПоУмолчанию);
	МСФОКлиентСерверУХ.УстановитьНезаполненноеЗначение(Объект.ВидыДокументовФакта, 	ФактПоУмолчанию);	
	МСФОКлиентСерверУХ.УстановитьНезаполненноеЗначение(Объект.Сценарий, 			Константы.СценарийМСФО.Получить());
	МСФОКлиентСерверУХ.УстановитьНезаполненноеЗначение(Объект.Организация, 			ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	МСФОКлиентСерверУХ.УстановитьНезаполненноеЗначение(Объект.ПериодНачисления, 	Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйГод));
	МСФОКлиентСерверУХ.УстановитьНезаполненноеЗначение(Объект.ПериодСценария,		Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод));
	
	ПодготовитьЗапросПлана();
	ПодготовитьЗапросФакта();
	
	УстановитьОтборыПоРеквизиту("Сценарий", 			Ложь);
	УстановитьОтборыПоРеквизиту("Организация", 			Ложь);
	УстановитьОтборыПоРеквизиту("ПериодНачисления", 	Ложь);
	УстановитьОтборыПоРеквизиту("ПериодСценария", 		Ложь);
	УстановитьОтборыПоРеквизиту("Контрагент", 			Ложь);
	УстановитьОтборыПоРеквизиту("ДоговорКонтрагента", 	Ложь);
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ГруппаОтборы.Видимость 		= Элементы.ФормаНастройки.Пометка;
	Элементы.ГруппаДокументыПлан.Видимость 	= Элементы.ФормаНачисления.Пометка;
	Элементы.ГруппаПраваяПанель.Видимость 	= Элементы.ФормаФакт.Пометка;
	Элементы.ГруппаСопоставление.Видимость 	= Элементы.ФормаСопоставления.Пометка;

	ДоговорНеЗаполнен = Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента);
	
	Элементы.ДокументыПланКонтрагент.Видимость = Объект.Контрагент.Пустая() И ДоговорНеЗаполнен;
	Элементы.ДокументыФактКонтрагент.Видимость = Объект.Контрагент.Пустая() И ДоговорНеЗаполнен;
	
	Элементы.ДокументыПланДоговорКонтрагента.Видимость = ДоговорНеЗаполнен;
	Элементы.ДокументыФактДоговорКонтрагента.Видимость = ДоговорНеЗаполнен;	

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоРеквизиту(ИмяРеквизита, УправлениеФормой = Истина)
	
	ТекЗначение = Объект[ИмяРеквизита];
	
	Если (ИмяРеквизита = "ПериодНачисления") Тогда
		
		УстановитьОтборПериода(ДокументыПлан, "Дата", ТекЗначение);
		Возврат;
		
	ИначеЕсли (ИмяРеквизита = "ПериодСценария") Тогда
		
		УстановитьОтборПериода(ДокументыФакт, "Дата", ТекЗначение);		
		Возврат;
		
	КонецЕсли;
	
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(ДокументыПлан, ИмяРеквизита,  ТекЗначение, ЗначениеЗаполнено(ТекЗначение));
	
	Если ИмяРеквизита <> "Сценарий" Тогда
		ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(ДокументыФакт, ИмяРеквизита,  ТекЗначение, ЗначениеЗаполнено(ТекЗначение));
	КонецЕсли;
	
	Если ИмяРеквизита = "Организация" Тогда
		ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(ДокументыФакт, ИмяРеквизита,  ТекЗначение, ЗначениеЗаполнено(ТекЗначение));
		ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(Сопоставление, ИмяРеквизита,  ТекЗначение, ЗначениеЗаполнено(ТекЗначение));
	КонецЕсли;
	
	//Если у документов отсутствует реквизит - то в отбор дб подставлено значение
	ТиповыеОтчетыУХ.УстановитьПараметр(ДокументыПлан.КомпоновщикНастроек.Настройки, ИмяРеквизита, ТекЗначение);
	ТиповыеОтчетыУХ.УстановитьПараметр(ДокументыФакт.КомпоновщикНастроек.Настройки, ИмяРеквизита, ТекЗначение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПериода(РеквизитСписок, ИмяРеквизита, ТекЗначение)
	
	ОтборыСписковКлиентСерверУХ.УдалитьЭлементОтбораСписка(РеквизитСписок, ИмяРеквизита);
	
	Если ЗначениеЗаполнено(ТекЗначение.ДатаНачала) Тогда
		
		ОтборыСписковКлиентСерверУХ.УстановитьЭлементОтбораСписка(
				РеквизитСписок, 
				ИмяРеквизита, 
				ТекЗначение.ДатаНачала, 
				ВидСравненияКомпоновкиДанных.БольшеИлиРавно
			);
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЗначение.ДатаОкончания) Тогда
		
		ОтборыСписковКлиентСерверУХ.УстановитьЭлементОтбораСписка(
				РеквизитСписок, 
				ИмяРеквизита, 
				ТекЗначение.ДатаОкончания, 
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно
			);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСопоставления(СсылкаПлан, ДокументыФакта)
	
	ТекОписаниеИБ = Неопределено;
	ПроверятьСумму = Ложь;
	
	СуммаПлан = 0;
	ОстатокСопоставления = 0;
	
	ДокументыИБ = Объект.ВидыДокументовФакта.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыИБ, Объект.ВидыДокументовПлана.ВыгрузитьЗначения());
	
	ОписанияИБ = ОписаниеДокументовИБ(ДокументыИБ);
	
	ОбъектМетаданные = СсылкаПлан.Метаданные();
	
	ИменаИсточники = "Сумма, СуммаДокумента, СуммаОперации";
	
	ИмяПриемникПлан = ИмяДляДокумента("Сумма", ОписанияИБ[ОбъектМетаданные.Имя], ИменаИсточники, ОбъектМетаданные);
	Если ЗначениеЗаполнено(ИмяПриемникПлан) Тогда
		ПроверятьСумму = Истина;
		СуммаПлан = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаПлан, ИмяПриемникПлан);
		ОстатокСопоставления = СуммаПлан - СопоставленоПоНачислению(СсылкаПлан);//уже сопоставлено
	КонецЕсли;
	
	Для каждого СтрокаФакт Из ДокументыФакта Цикл
		
		ДокументФакта = ?(ТипЗнч(СтрокаФакт) = Тип("Структура"), СтрокаФакт.Ссылка, СтрокаФакт);
		
		Если НЕ ЗначениеЗаполнено(ДокументФакта) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяПриемникПлан) 
			И ((СуммаПлан > 0 И ОстатокСопоставления <= 0)
				ИЛИ (СуммаПлан < 0 И ОстатокСопоставления >= 0)) Тогда
				
			ТекстСообщения = НСтр("ru = 'Для документ факта <%1> не создано сопоставление, т.к. Сумма документа плана <%2> вся сопоставлена'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщения, ДокументФакта, СсылкаПлан));
			
			Продолжить;
			
		КонецЕсли;
		
		СуммаФакт = 0;
		
		ОбъектМетаданные = ДокументФакта.Метаданные();
		ИмяПриемникФакт = ИмяДляДокумента("Сумма", ОписанияИБ[ОбъектМетаданные.Имя], ИменаИсточники, ОбъектМетаданные);
		Если ЗначениеЗаполнено(ИмяПриемникФакт) Тогда
			СуммаФакт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументФакта, ИмяПриемникФакт);
		КонецЕсли;
		
		ТекСопоставление = Мин(СуммаФакт, ОстатокСопоставления);
		ОстатокСопоставления = ОстатокСопоставления - ТекСопоставление;
			
		МенеджерЗаписи = РегистрыСведений.СопоставлениеПланФактОперацийНачисленияМСФО.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Организация 		= СсылкаПлан.Организация;
		МенеджерЗаписи.ДокументПлан 	= СсылкаПлан;
		
		МенеджерЗаписи.ДокументФакт 	= ДокументФакта;
		МенеджерЗаписи.СуммаФакт 		= ТекСопоставление;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	ОбновитьСписки();
	
КонецПроцедуры

&НаСервере
Функция СопоставленоПоНачислению(ДокументПлан)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕстьNULL(СУММА(т.СуммаФакт), 0) КАК СуммаФакт
	|ИЗ
	|	РегистрСведений.СопоставлениеПланФактОперацийНачисленияМСФО КАК т
	|ГДЕ
	|	т.ДокументПлан = &ДокументПлан");
	Запрос.УстановитьПараметр("ДокументПлан", ДокументПлан);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().Получить(0).СуммаФакт;

КонецФункции

&НаСервере
Процедура СформироватьКорректировкиНаСервере()
	
	РеквизитФормыВЗначение("Объект").СформироватьКорректировки();

	ОбновитьСписки();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписки()
	
	Если Элементы.Сопоставление.Видимость Тогда
		Элементы.Сопоставление.Обновить();
	КонецЕсли;
	Если Элементы.ДокументыПлан.Видимость Тогда
		Элементы.ДокументыПлан.Обновить();
	КонецЕсли;
	Если Элементы.ДокументыФакт.Видимость Тогда
		Элементы.ДокументыФакт.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыФактВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти
