
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, Имя) Экспорт

	Если Не ИТК_РедакторКода.ИспользуетсяMonaco() Тогда
		Возврат;	
	КонецЕсли;
	
	УстановитьПризнакИспользованияOneDebugger(Форма, Имя);
		
	Если ИТК_ИнтеграцияOneDebuggerКлиентСервер.ИспользуетсяOneDebugger(Форма, Имя) Тогда
		ПодключитьOneDebuggerНаСервере(Форма, Имя);	
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьВидимостьНастройкиПодключения(Форма) Экспорт

	Если ИТК_ИнтеграцияOneDebuggerПовтИсп.УстановленOneDebugger() Тогда  
		
		Форма.Элементы.ОбщиеРедакторПодключитьOneDebugger.Видимость = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПризнакИспользованияOneDebugger(Форма, Имя)
	
	ИмяРеквизита         = Имя + ИТК_ИнтеграцияOneDebuggerКлиентСервер.ПостфиксРеквизитаПризнакИспользованияOneDebugger();
	НовыйРеквизит        = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Булево"));	
	ДобавляемыеРеквизиты = Новый Массив;	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);		
	
	Если ИТК_ИнтеграцияOneDebuggerПовтИсп.УстановленOneDebugger() Тогда
		Настройки           = ИТК_Настройки.Загрузить();
		Форма[ИмяРеквизита] = Настройки["РедакторПодключитьOneDebugger"];		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключитьOneDebuggerНаСервере(Форма, Имя)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("Контекст") <> Неопределено Тогда
		Элементы.Контекст.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти("ВыполнитьКод") <> Неопределено Тогда
		Элементы.ВыполнитьКод.Видимость = Ложь;
	КонецЕсли;

	Если Элементы.Найти("ПанельРезультатаСтраницы") <> Неопределено Тогда
		Элементы.ПанельРезультатаСтраницы.Видимость = Ложь;	
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПолеHTML",                                 Имя);
	ДополнительныеПараметры.Вставить("ОтображениеКомандРаботыСФайлом",           Ложь);
	ДополнительныеПараметры.Вставить("ИспользоватьКонтекстноеМенюРедактора",     Ложь);
	ДополнительныеПараметры.Вставить("ИспользоватьИнициализациюOneDebugger",     Ложь);
	ДополнительныеПараметры.Вставить("ОбрабатыватьСобытияРедактораВOneDebugger", Ложь);
	
	ОбщийМодуль = Вычислить("dbgИнтерфейс");		
	ОбщийМодуль.ПриСозданииНаСервере(Форма, ДополнительныеПараметры); 
		
КонецПроцедуры

#КонецОбласти
