
#Область ПрограммныйИнтерфейс

//Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
Функция ПолучитьНДСИзСтроки(СтрокаНДС) Экспорт
	
	Если СтрокаНДС = "БезНДС" Тогда
		Возврат Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	ЧислоНДС = СтрЗаменить(СтрокаНДС, "НДС", "");
	// НАЧАЛО Борисенко Игорь 29.07.2022 Выполнение задач №000042100: вместо "0%" подбирает "БезНДС"
	//НДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",ТолькоЦифры(ЧислоНДС));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЧислоНДС", ТолькоЦифры(ЧислоНДС));
	Запрос.УстановитьПараметр("ЕстьСлеш", СтрНайти(СтрокаНДС, "/") > 0);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = &ЧислоНДС
	|	И СтавкиНДС.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|	И ВЫБОР
	|			КОГДА &ЕстьСлеш
	|				ТОГДА СТРНАЙТИ(СтавкиНДС.Наименование, ""/"") > 0
	|			ИНАЧЕ СТРНАЙТИ(СтавкиНДС.Наименование, ""/"") = 0
	|		КОНЕЦ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НДС = Выборка.Ссылка;
	Иначе
		НДС = Неопределено;
	КонецЕсли;
	
	// КОНЕЦ Борисенко Игорь 29.07.2022 Выполнение задач №000042100
	Если ЗначениеЗаполнено(НДС) Тогда
		Возврат НДС;
	Иначе
		Возврат Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
КонецФункции

// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
Функция ОбработатьФорматЯчеекДата_в_Excel(Адрес) Экспорт

	Возврат ВыполнитьОбработкуФорматаЯчеекДата_в_Excel(Адрес);
	
КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция ДатаВходитВПериод(ПроверяемаяДата, ДатаНачала, ДатаОкончания) Экспорт 
	
	РезультатПроверки = Истина;
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Если ПроверяемаяДата < НачалоДня(ДатаНачала) Тогда
			РезультатПроверки = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Если ПроверяемаяДата > КонецДня(ДатаОкончания) Тогда
			РезультатПроверки = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат РезультатПроверки; 
	
КонецФункции 

// Юдина Екатерина 03.04.2026 Выполнение задач №000057268
//
Функция ПреобразоватьМассивВТаблицуЗначений(МассивДанных) Экспорт
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		Если ТаблицаДанных.Колонки.Количество() = 0 Тогда
			Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
				ТаблицаДанных.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
			НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаДанных;   
	
КонецФункции

#КонецОбласти

// НАЧАЛО Ситалов Дмитрий 16.03.2023 Выполнение задач №000044812
#Область ПодпискиНаСобытия

// Ситалов Дмитрий 16.03.2023 Выполнение задач №000044812
// очистка движений, если в документе установлен признак тн_НеОтражатьВРегУчете
Процедура тн_ПередЗаписьюДвиженийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// проверка наличия регистатора
	ИсточникМетаданные = Источник.Метаданные();
	Если Не (ОбщегоНазначения.ЭтоРегистрНакопления(ИсточникМетаданные)
		Или ОбщегоНазначения.ЭтоРегистрСведений(ИсточникМетаданные) 
			И ИсточникМетаданные.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору)
	Тогда
		Возврат;
	КонецЕсли;
	
	ТипыДокументовДляПроверки = Новый Массив;
	ТипыДокументовДляПроверки.Добавить(Тип("ДокументСсылка.ВзаимозачетЗадолженности"));
	ТипыДокументовДляПроверки.Добавить(Тип("ДокументСсылка.КорректировкаЗадолженности"));
	
	Регистратор = Источник.Отбор.Регистратор.Значение;
	Если ТипыДокументовДляПроверки.Найти(ТипЗнч(Регистратор)) <> Неопределено Тогда
		
		тн_НеОтражатьВРегУчете = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "тн_НеОтражатьВРегУчете");
		Если тн_НеОтражатьВРегУчете = Истина Тогда
			Источник.Очистить();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

// НАЧАЛО Белоконенко Денис 14.09.2023 Выполнение задач №000046864
Процедура ЗаполнитьНалогообложениеНДСДляОтчетовПередЗаписью(Источник, Отказ, Замещение) Экспорт
	// Реквизит заполняем даже в режиме обмена, чтобы учесть возможное обновление или интеграционную загрузку
	
	МетаданныеОбъекта = Источник.Метаданные();
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НалогообложениеНДС", МетаданныеОбъекта) Тогда	
    	Источник.тн_НалогообложениеНДС = Источник.НалогообложениеНДС;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗакупкаПодДеятельность", МетаданныеОбъекта) Тогда
		Источник.тн_НалогообложениеНДС = Источник.ЗакупкаПодДеятельность;	
	КонецЕсли;
	
	// НАЧАЛО Иванов ВЮ (Код-Эксперт) 16.04.2025 Выполнение задач №000053434
	ЗаполнитьРеквизит_тн_НалогообложениеНДС(Источник, Отказ, Замещение);
	// КОНЕЦ Иванов ВЮ (Код-Эксперт) 16.04.2025 Выполнение задач №000053434
	
КонецПроцедуры

// Иванов ВЮ (Код-Эксперт) 16.04.2025 Выполнение задач №000053434
Процедура ЗаполнитьРеквизит_тн_НалогообложениеНДС(Источник, Отказ, Замещение)
	
	//НАЧАЛО Сафиуллина З.Р. 09.09.2025 Выполнение задач №000055076
	Если Источник.ОбменДанными.Загрузка = Ложь Тогда
		Возврат;
	КонецЕсли;
	//КОНЕЦ Сафиуллина З.Р. 09.09.2025 Выполнение задач №000055076
	
	МетаданныеОбъекта = Источник.Метаданные();
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураПолученный") Тогда
		
		// Значение реквизита усланавливаем из договора контрагента, из "НалогообложениеНДС" или "ЗакупкаПодДеятельность":
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеОбъекта)
			И ЗначениеЗаполнено(Источник.Договор)
			И НЕ Источник.Договор.ПолучитьОбъект() = Неопределено Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник.Договор, "НалогообложениеНДС") Тогда
				Источник.тн_НалогообложениеНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Договор, "НалогообложениеНДС");
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник.Договор, "ЗакупкаПодДеятельность") Тогда
				Источник.тн_НалогообложениеНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Договор, "ЗакупкаПодДеятельность");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Блинова М.А. 23.11.2023 Выполнение задач №000047251
Процедура тн_ЗаписатьДобавленныеДокументыПоСтаройАрхитектуреВзаиморасчетов(Источник, Отказ, Замещение) Экспорт   
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// проверка наличия регистатора
	ИсточникМетаданные = Источник.Метаданные();
	Если Не ОбщегоНазначения.ЭтоРегистрНакопления(ИсточникМетаданные)	Тогда
		Возврат;
	КонецЕсли;
	
   СтараяАрхитектураВзаиморасчетов = Константы.НеНоваяАрхитектураВзаиморасчетов.Получить(); 
   НоваяАрхитектураВзаиморасчетов = Константы.НоваяАрхитектураВзаиморасчетов.Получить();
   Если НоваяАрхитектураВзаиморасчетов И НЕ СтараяАрхитектураВзаиморасчетов  Тогда
	   Возврат;
   КонецЕсли;
   
   ДобавляемыйДокумент = Источник.Отбор.Регистратор;
   НаборЗаписей = РегистрыСведений.тн_ДобавленныеДокументыПоСтаройАрхитектуреВзаиморасчетов.СоздатьНаборЗаписей();
   НаборЗаписей.Отбор.ДокументВзаиморасчетов.Установить(ДобавляемыйДокумент.Значение);
   НаборЗаписей.Прочитать();
   Если НаборЗаписей.Количество() = 0 Тогда
	    НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДокументВзаиморасчетов = ДобавляемыйДокумент.Значение;
   КонецЕсли;
  НаборЗаписей.Записать();
   
КонецПроцедуры	

#КонецОбласти
// КОНЕЦ Ситалов Дмитрий 16.03.2023 Выполнение задач №000044812

#Область СлужебныеПроцедурыИФункции

//Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
Функция ТолькоЦифры(Строка)
	
	НоваяСтрока = "";
	
	Для сч = 1 по СтрДлина(Строка) Цикл
		А = Прав(Лев(Строка,сч),1);
		Если СтрНайти("0123456789",А,НаправлениеПоиска.СНачала,1,1) > 0 Тогда
			НоваяСтрока = НоваяСтрока + А;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(НоваяСтрока = "",0,Число(НоваяСтрока));
	
КонецФункции

// Османов Нагим 26.04.2022 Выполнение задач №000041051
//
//Описание функции.
//
// Параметры
//  ФизическоеЛицо  – СправочникСсылка.ФизическиеЛица – физическое лицо, по которому
//                 необходимо получить подразделение
//  Организация  – СправочникСсылка.Организации – Организация, в которой ищется сотрудник по физическому лицу
//                 Если Неопределено, то подставляется организация по умолчанию
//
// Возвращаемое значение:
//   Подразделение - СправочникСсылка.СтруктураПредприятия
//
Функция ПолучитьПодразделениеПоФизическомуЛицу(ФизическоеЛицо, Организация = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	НайденноеПодразделение = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.тнПодразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И (ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация = &Организация
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация)";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			НайденноеПодразделение = Выборка.Подразделение;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НайденноеПодразделение;
	
КонецФункции // ПолучитьПодразделениеПоФизическомуЛицу()

// Белоконенко Денис 25.07.2022 Выполнение задач №000042024
Функция ПолучитьПользователяПоНомеруЕКСФизЛица(НомерЕКС) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО Пользователи.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	ФизическиеЛица.тн_ЕКС = &НомерЕКС";
	
	Запрос.УстановитьПараметр("НомерЕКС", НомерЕКС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;	
КонецФункции

// Гутарова Екатерина 23.11.2022 Выполнение задач №000043427
//
// Получает данные по физическому лицу из регистра "Текущие кадровые данные сотрудников".
//
// Параметры:
//  ФизическоеЛицо  – СправочникСсылка.ФизическиеЛица – физическое лицо, по которому
//                 необходимо получить данные
//  Организация  – СправочникСсылка.Организации – Организация, в которой ищется сотрудник по физическому лицу
//                 Если Неопределено, то подставляется организация по умолчанию 
//  Ключ  – Строка – Необходимые к получению данные из регистра "Текущие кадровые данные сотрудников".
//  Например: "Организация, Подразделение"
//
// Возвращаемое значение:
//   РезультатСтруктура - Структура
//
Функция ПолучитьДанныеФизЛица(ФизическоеЛицо, Организация = Неопределено, Ключ = "ТекущаяДолжность") Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	РезультатСтруктура = Новый Структура(Ключ,);    
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо
	|	И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, Выборка);	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатСтруктура;
	
КонецФункции 

// Гутарова Екатерина 10.10.2023 Выполнение задач №000047113
//
Функция ЭтоТабличныйОбъект(ИмяОбъектаМетаданных) Экспорт
	
	МассивТабличныхОбъектов = Новый Массив;
	МассивТабличныхОбъектов.Добавить("РегистрСведений");
	МассивТабличныхОбъектов.Добавить("РегистрНакопления");
	МассивТабличныхОбъектов.Добавить("РегистрБухгалтерии");
	МассивТабличныхОбъектов.Добавить("РегистрРасчета");
	
	ТипОбъектаМетаданных = Лев(ИмяОбъектаМетаданных, СтрНайти(ИмяОбъектаМетаданных, ".") - 1);
	
	Возврат Не МассивТабличныхОбъектов.Найти(ТипОбъектаМетаданных) = Неопределено;
	
КонецФункции    

// Гутарова Екатерина 10.10.2023 Выполнение задач №000047113
//
Функция ПолучитьМассивПолейБлокировокТабличногоОбъекта(ИмяОбъектаМетаданных) Экспорт
	
	МассивПолейБлокировок = Новый Массив;    
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданных);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат МассивПолейБлокировок;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) Тогда 
		МассивПолейБлокировок = ПолучитьМассивПолейБлокировокРегистраСведений(МетаданныеОбъекта);
	Иначе
		МассивПолейБлокировок = ПолучитьМассивПолейБлокировокПодчиненныхРегистров(МетаданныеОбъекта);			
	КонецЕсли;  
	
	Возврат МассивПолейБлокировок;
	
КонецФункции       

// Гутарова Екатерина 10.10.2023 Выполнение задач №000047113
//
Функция ПолучитьМассивПолейБлокировокРегистраСведений(МетаданныеОбъекта)
	
	МассивПолейБлокировок = Новый Массив;
	
	Если МетаданныеОбъекта.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		МассивПолейБлокировок.Добавить("Регистратор");	
		Возврат МассивПолейБлокировок;
	КонецЕсли;
	
	Если Не МетаданныеОбъекта.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический 
		И МетаданныеОбъекта.ОсновнойОтборПоПериоду Тогда
		МассивПолейБлокировок.Добавить("Период");	
	КонецЕсли;                                   
	
	Для Каждого ИзмерениеРегистра Из МетаданныеОбъекта.Измерения Цикл
		
		Если ИзмерениеРегистра.ОсновнойОтбор Тогда
			МассивПолейБлокировок.Добавить(ИзмерениеРегистра.Имя);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивПолейБлокировок;
	
КонецФункции

// Гутарова Екатерина 10.10.2023 Выполнение задач №000047113
//
Функция ПолучитьМассивПолейБлокировокПодчиненныхРегистров(МетаданныеОбъекта)
	
	МассивПолейБлокировок = Новый Массив;
	МассивПолейБлокировок.Добавить("Регистратор");	

	Возврат МассивПолейБлокировок;
	
КонецФункции

//Блинова М.А. 27.11.2023 Выполнение задач №000047564
Функция КонтактнаяИнформацияЛоготипаОрганизации(Дата) Экспорт
	
	СтрокаКонтактнойИнформации = "ООО «ТехноНИКОЛЬ – Строительные Системы»" + Символы.ПС + 
								"129110, Россия, Москва, улица Гиляровского, дом 47, строение 5" + Символы.ПС +
								"тел.: +7 495 925 57 75, факс: +7 495 925 81 55, www.tn.ru, info@tn.ru";
	
	Если Дата >= '20180323' Тогда
		СтрокаКонтактнойИнформации = "ООО «ТехноНИКОЛЬ – Строительные Системы»" + Символы.ПС + 
								"129110, Россия, город Москва, улица Гиляровского, дом 47, строение 5, этаж 5, помещение I, комната 13" + Символы.ПС +
								"тел.: +7 495 925 57 75, факс: +7 495 925 81 55, www.tn.ru, info@tn.ru";
	КонецЕсли;
		
	Возврат СтрокаКонтактнойИнформации; 
	
КонецФункции

//Блинова М.А. 27.11.2023 Выполнение задач №000047564
Функция ПолучитьРуководителяПодразделенияОрганизации(ПодразделениеОрганизации, ДатаДокумента) Экспорт
	
	ДанныеРуководителя = Новый Структура();
	РегистрацияВФНС = Справочники.ПодразделенияОрганизаций.РегистрацияВНалоговомОргане(ПодразделениеОрганизации, ДатаДокумента);
	
	Если НЕ РегистрацияВФНС = Неопределено Тогда 
		ДанныеРуководителяВФНС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РегистрацияВФНС, "Представитель, УполномоченноеЛицоПредставителя, ДокументПредставителя"); 
		Если НЕ ЗначениеЗаполнено(ДанныеРуководителяВФНС.Представитель) Тогда
			ДанныеРуководителя.Вставить("Руководитель", Справочники.ФизическиеЛица.ПустаяСсылка());
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке("Для подразделения организации не указан руководитель.");
		ИначеЕсли ТипЗнч(ДанныеРуководителяВФНС.Представитель) = Тип("СправочникСсылка.ФизическиеЛица") 
			Или НЕ ЗначениеЗаполнено(ДанныеРуководителяВФНС.УполномоченноеЛицоПредставителя) Тогда
			
			ДанныеРуководителя.Вставить("Руководитель", ДанныеРуководителяВФНС.Представитель);
		ИначеЕсли ТипЗнч(ДанныеРуководителяВФНС.Представитель) = Тип("СправочникСсылка.Контрагенты") Тогда
			ДанныеРуководителя.Вставить("Руководитель", ДанныеРуководителяВФНС.УполномоченноеЛицоПредставителя);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеРуководителяВФНС.ДокументПредставителя) Тогда 
			ДанныеРуководителя.Вставить("Должность",	"");
			ДанныеРуководителя.Вставить("Доверенность", "");
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке("Для подразделения организации не указаны должность руководителя и данные доверенности.");
		Иначе
			ДанныеДоверенности = ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(ДанныеРуководителяВФНС.ДокументПредставителя, Символы.ПС);
			
			Если ДанныеДоверенности.Количество() = 1 Тогда 
				ДанныеРуководителя.Вставить("Доверенность", ДанныеДоверенности[0]);
				ДанныеРуководителя.Вставить("Должность",	"");
				
				ОбщегоНазначенияУХ.СообщитьОбОшибке("Для подразделения организации не указана должность руководителя");
			ИначеЕсли ДанныеДоверенности.Количество() > 1 Тогда 
				ДанныеРуководителя.Вставить("Доверенность", ДанныеДоверенности[0]);
				ДанныеРуководителя.Вставить("Должность",	ДанныеДоверенности[1]);
			КонецЕсли;
		КонецЕсли;
		
		Возврат ДанныеРуководителя;
	Иначе 
		ДанныеРуководителя.Вставить("Руководитель", Справочники.ФизическиеЛица.ПустаяСсылка());
		ОбщегоНазначенияУХ.СообщитьОбОшибке("В документе не указано подразделение организации, невозможно найти данные для руководителя и доверенности");
		Возврат ДанныеРуководителя;
	КонецЕсли;
	
КонецФункции

// Белоконенко Денис 07.05.2026 Выполнение задач №000057385: + Организация
//// Гутарова Екатерина 10.01.2024 Выполнение задач №000048065 
////
//Функция ПроверитьДатуЗапрета(ДатаДляПроверки) Экспорт
Функция ПроверитьДатуЗапрета(ДатаДляПроверки, Организация) Экспорт

	
	ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	СтрокаДляПроверки = ДанныеДляПроверки.Добавить();
	СтрокаДляПроверки.Дата = ДатаДляПроверки;
	// НАЧАЛО Белоконенко Денис 07.05.2026 Выполнение задач №000057385
	СтрокаДляПроверки.Объект = Организация; 
	СтрокаДляПроверки.Раздел = "ФинансовыйКонтур";
	// КОНЕЦ Белоконенко Денис 07.05.2026 Выполнение задач №000057385
	Возврат ДатыЗапретаИзмененияСлужебный.НайденЗапретИзмененияДанных(ДанныеДляПроверки, "", "", Неопределено);
	
КонецФункции

// Гутарова Екатерина 10.01.2024 Выполнение задач №000048065 
//
Процедура ПриСозданииНаСервереКонтрольОплаты(Элементы, Команды, Группа, Дата, ДобавитьПолеОтветственный = Ложь) Экспорт	
	
    НовыйЭлементФормы 				= Элементы.Вставить("тн_ОсновнойДокументОплаты", Тип("ПолеФормы"), Группа);
	НовыйЭлементФормы.ПутьКДанным	= "Объект.тн_ОсновнойДокументОплаты";
	НовыйЭлементФормы.Заголовок		= "Основной документ оплаты";
	НовыйЭлементФормы.Вид			= ВидПоляФормы.ПолеВвода;  
	
	Если ДобавитьПолеОтветственный Тогда
		
		НовыйЭлементФормы 				= Элементы.Вставить("тн_ОтветственныйСотрудник", Тип("ПолеФормы"), Группа);
		НовыйЭлементФормы.ПутьКДанным	= "Объект.тн_ОтветственныйСотрудник";
		НовыйЭлементФормы.Заголовок		= "Ответственный сотрудник";
		НовыйЭлементФормы.Вид			= ВидПоляФормы.ПолеВвода;   	
		
	КонецЕсли;
			
	Команда = Команды.Добавить("ИзменитьРеквизитыБезПерепроведения"); 
	Команда.Заголовок = "Изменить реквизиты без перепроведения";
	Команда.Действие  = "КомандаИзменитьРеквизитыБезПерепроведения"; 
	
	КнопкаФормы = Элементы.Добавить(
	"КнопкаИзменитьРеквизитыБезПерепроведения", 
	Тип("КнопкаФормы"),             
	Элементы.ФормаКоманднаяПанель);                   
	
	КнопкаФормы.ИмяКоманды = "ИзменитьРеквизитыБезПерепроведения"; 
	КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели; 
		
КонецПроцедуры

// Белоконенко Денис 28.02.2024 Выполнение задач №000048653
Функция ПолучитьПоследнийАвансовыйСФ(Документ) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданныйАванс") Тогда
		ДокументОснование = Документ.ДокументОснование;
	Иначе
		ДокументОснование = Документ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СчетФактураВыданныйАванс.Ссылка.НомерИсправления КАК НомерИсправления,
		|	СчетФактураВыданныйАванс.ДокументОснование КАК ДокументОснование,
		|	СчетФактураВыданныйАванс.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданныйАванс КАК СчетФактураВыданныйАванс
		|ГДЕ
		|	СчетФактураВыданныйАванс.ДокументОснование = &ДокументОснование
		|	И СчетФактураВыданныйАванс.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерИсправления УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.СчетФактураВыданныйАванс.ПустаяСсылка(); 
	КонецЕсли;
	
КонецФункции

//Качикина 02.07.2024 Выполнение задач №000049962
Процедура ЗаписатьДокументВСписокДокументовДляОбработкиПоСхемам(ДокументСсылка,СхемаФормированияДокументов) Экспорт
	
	Если ЗначениеЗаполнено(СхемаФормированияДокументов) Тогда  
		СтруктураДанныхРегистра =Новый Структура;
		СтруктураДанныхРегистра.Вставить("СхемаФормированияДокументов",СхемаФормированияДокументов);
		РегистрыСведений.тн_СписокДокументовДляОбработкиПоСхемам.ЗаписатьДокументВСписокДокументовДляОбработкиПоСхемам(ДокументСсылка,СтруктураДанныхРегистра);	
	КонецЕсли;
	
КонецПроцедуры

//Качикина 04.10.2024 Выполнение задач №000050874
Процедура ПометитьНаУдалениеДокументСозданныйПоСхеме(ДокументСсылка,СхемаФормированияДокументов) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	тн_РезультатыАвтоматическогоФормированияДокументов.СформированныйДокумент КАК СформированныйДокумент
	               |ИЗ
	               |	РегистрСведений.тн_РезультатыАвтоматическогоФормированияДокументов КАК тн_РезультатыАвтоматическогоФормированияДокументов
	               |ГДЕ
	               |	тн_РезультатыАвтоматическогоФормированияДокументов.ДокументИнициатор = &ДокументИнициатор";
	Запрос.УстановитьПараметр("ДокументИнициатор",ДокументСсылка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		СформированныйДокумент = Результат.СформированныйДокумент; 
		Если ЗначениеЗаполнено(СформированныйДокумент) И НЕ СформированныйДокумент.ПометкаУдаления Тогда
			Попытка
				СформированныйДокументОбъект = СформированныйДокумент.ПолучитьОбъект(); 
				СформированныйДокументОбъект.УстановитьПометкуУдаления(Истина);
			Исключение 
				стрОписание = "Не удалось пометить на удаление документ "+ Строка(СформированныйДокумент)
								+" (документ инициатор "+Строка(ДокументСсылка)
								+", схема формирования документов "+Строка(СхемаФормированияДокументов)+")";
				ЗаписьЖурналаРегистрации("Создание документов по схемам формирования документов", УровеньЖурналаРегистрации.Ошибка, , , стрОписание);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Юдина (Гутарова) Екатерина 23.08.2024 Выполнение задач №000050605 
//
Функция НайтиНаибольшуюНаименьшуюДатуМассива(Массив, ИскатьНаибольшуюДату = Ложь) Экспорт 
	
	Если Массив.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	ИскомаяДата = Массив[0].Дата;
	Для Каждого Элемент Из Массив Цикл  
		Если Не ИскатьНаибольшуюДату Тогда
			Если Элемент.Дата < ИскомаяДата Тогда
				ИскомаяДата = Элемент.Дата;
			КонецЕсли;
		Иначе   
			Если Элемент.Дата > ИскомаяДата Тогда
				ИскомаяДата = Элемент.Дата;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат ИскомаяДата;
	
КонецФункции   

// Юдина (Гутарова) Екатерина 25.09.2024 Выполнение задач №000050931
//
Процедура ВывестиКолонкуСНомерамиСчетов(ТабДок, КодСтроки, КодКолонки, СтрокаНачала) Экспорт 
	
	ТабДок.ВставитьОбласть(ТабДок.Область(КодКолонки), ТабДок.Область(КодКолонки), 
	ТипСмещенияТабличногоДокумента.ПоГоризонтали);	  
	
	ТабДок.Область(КодСтроки + КодКолонки).Текст = "Номер счета";   
	ТабДок.Область(КодСтроки + КодКолонки).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ТабДок.Область(КодКолонки).ШиринаКолонки = 8;
	
	Для НомерСтроки = СтрокаНачала По ТабДок.ВысотаТаблицы Цикл    
		
		ТекстПоиска = ТабДок.Область("R"+ СтрЗаменить(НомерСтроки, Символы.НПП, "") + КодКолонки).Текст;   
		
		СтрокаОтчета = Справочники.СтрокиОтчетов.НайтиПоНаименованию(ТекстПоиска, Истина);
		
		Если ЗначениеЗаполнено(СтрокаОтчета) Тогда 
			
			НачалоКода = СтрНайти(СтрокаОтчета.Код, "_");
			КонецКода = СтрНайти(СтрокаОтчета.Код, "_", , , 2);  
			Код = Сред(СтрокаОтчета.Код, НачалоКода + 1, ?(ЗначениеЗаполнено(КонецКода), КонецКода - (НачалоКода + 1), СтрДлина(СтрокаОтчета.Код)));
			
			Если Не ЕстьЦифрыВСтроке(Код) Тогда
				Код = ""; 
			КонецЕсли;        		
			
			ТабДок.Область("R"+ СтрЗаменить(НомерСтроки, Символы.НПП, "") + КодКолонки).Текст = Код;   
		Иначе
			ТабДок.Область("R"+ СтрЗаменить(НомерСтроки, Символы.НПП, "") + КодКолонки).Текст = "";   
		КонецЕсли;
		
	КонецЦикла;  
	
КонецПроцедуры 
 
// Юдина (Гутарова) Екатерина 25.09.2024 Выполнение задач №000050931
//
Функция ЕстьЦифрыВСтроке(Строка) Экспорт
	
	СтрокаБезЦифр = СтрСоединить(СтрРазделить(Строка, "0123456789", Ложь), "");
	Возврат СтрДлина(Строка) <> СтрДлина(СтрокаБезЦифр);
	
КонецФункции

//~ Сафиуллина З.Р. 22.07.2025 Выполнение задач №000054357: + Параметр ЭлементРодитель
////Качикина 07.10.2024 Выполнение задач №000051011
//Процедура ДобавитьКнопкуИКомандуНаФорму(Элементы, Команды, ИмяКоманды, Заголовок) Экспорт
Процедура ДобавитьКнопкуИКомандуНаФорму(Элементы, Команды, ИмяКоманды, Заголовок, ЭлементРодитель = Неопределено) Экспорт
	 
	Команда			  = Команды.Добавить(ИмяКоманды); 
	Команда.Заголовок = Заголовок;
	Команда.Действие  = "Команда"+ИмяКоманды; 
	
	//НАЧАЛО Сафиуллина З.Р. 22.07.2025 Выполнение задач №000054357
	//КнопкаФормы				= Элементы.Добавить("Кнопка"+ИмяКоманды, Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	Если ЭлементРодитель = Неопределено Тогда
		ЭлементРодитель = Элементы.ФормаКоманднаяПанель;
	КонецЕсли;
	КнопкаФормы				= Элементы.Добавить("Кнопка" + ИмяКоманды, Тип("КнопкаФормы"), ЭлементРодитель);
	//КОНЕЦ Сафиуллина З.Р. 22.07.2025 Выполнение задач №000054357
	КнопкаФормы.ИмяКоманды	= ИмяКоманды; 
	КнопкаФормы.Вид			= ВидКнопкиФормы.КнопкаКоманднойПанели;
	 
КонецПроцедуры

// Юдина (Гутарова) Екатерина 25.10.2024 Выполнение задач №000051320
//
Процедура ПометитьНаУдалениеДокументРеклассификации(ТребуетсяРеклассификацияРасходов, РеклассификацияРасходов, Отказ) Экспорт
	
	Если Не Отказ 
		И Не ТребуетсяРеклассификацияРасходов
		И ЗначениеЗаполнено(ТребуетсяРеклассификацияРасходов) 
		И ОбщегоНазначения.СсылкаСуществует(РеклассификацияРасходов) Тогда 
		ОбъектРеклассификация = РеклассификацияРасходов.ПолучитьОбъект();	
		Если ОбъектРеклассификация.Проведен Тогда
			ОбъектРеклассификация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		ОбъектРеклассификация.ПометкаУдаления = Истина;
		ОбъектРеклассификация.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	 
КонецПроцедуры

//Блинова М.А. 15.11.2024 Выполнение задач №000051645
Процедура ЗаполнитьКонтрагентаВПартнере() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Ссылка,
		|	Контрагенты.Партнер КАК Партнер
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Ссылка КАК Ссылка,
		|	ВременнаяТаблица.Партнер КАК Партнер
		|ПОМЕСТИТЬ ВТ_КоличествоБольшеОдного
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|ГДЕ
		|	ВременнаяТаблица.Ссылка > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоБольшеОдного.Партнер КАК Партнер,
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ИсключаемыеКонтрагенты
		|ИЗ
		|	ВТ_КоличествоБольшеОдного КАК ВТ_КоличествоБольшеОдного
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ВТ_КоличествоБольшеОдного.Партнер = Контрагенты.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Партнер КАК Партнер
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсключаемыеКонтрагенты КАК ВТ_ИсключаемыеКонтрагенты
		|		ПО (ВТ_ИсключаемыеКонтрагенты.Ссылка = Контрагенты.Ссылка)
		|ГДЕ
		|	Контрагенты.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|	И ВТ_ИсключаемыеКонтрагенты.Ссылка ЕСТЬ NULL
		|	И Контрагенты.Партнер.тн_Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Попытка
			ПартнерСсылка = ВыборкаДетальныеЗаписи.Партнер;
			ПартнерОбъект = ПартнерСсылка.ПолучитьОбъект();
			ПартнерОбъект.тн_Контрагент = ВыборкаДетальныеЗаписи.Ссылка;
			ПартнерОбъект.Записать();	
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры 

//Сафиуллина З.Р. 02.12.2024 Выполнение задач №000051888
//
Процедура ПроизвестиЗаменуСубконтоПоВидамНалогов(ДатаНачала, ДатаОкончания) Экспорт
	
	Статистика = Новый Структура("КОбработке, Обработано, КоличествоОшибок", 0, 0, 0);
	СоответствиеСчетов = Новый Соответствие;
	СоответствиеТипаВидуНалога = Новый Соответствие;
	
	Для Каждого ТипНалога Из Перечисления.УдалитьТипыНалогов Цикл
		ИмяПредопрЭлемента = "Справочник.ВидыНалоговВзносов." + тн_Интеграция_УПП.ИмяЗначенияПеречисленияПоСсылке(ТипНалога);
		ВидНалога = ОбщегоНазначения.ПредопределенныйЭлемент(ИмяПредопрЭлемента);
		СоответствиеТипаВидуНалога.Вставить(ТипНалога, ВидНалога);
	КонецЦикла;
	
	СоответствиеТипаВидуНалога.Вставить(Перечисления.УдалитьТипыНалогов.ПустаяСсылка(), Справочники.ВидыНалоговВзносов.ПустаяСсылка());
	
	Запрос = Новый Запрос;   
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МСФОВидыСубконто.Ссылка КАК Счет
		|ИЗ
		|	ПланСчетов.МСФО.ВидыСубконто КАК МСФОВидыСубконто
		|ГДЕ
		|	МСФОВидыСубконто.ВидСубконто = &ВидСубконто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МСФОСубконто.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрБухгалтерии.МСФО.Субконто КАК МСФОСубконто
		|ГДЕ
		|	МСФОСубконто.Вид = &ВидСубконто
		|	И МСФОСубконто.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ МСФОСубконто.Значение ССЫЛКА Справочник.ВидыНалоговВзносов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоКоду("ТипыНалого");
	Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);  
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И МСФОСубконто.Период МЕЖДУ &НачалоПериода И &КонецПериода", "");
	КонецЕсли;
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет(); 
	
	ВыборкаСчетов = РезультатыЗапросов[0].Выбрать();
	Пока ВыборкаСчетов.Следующий() Цикл
		СоответствиеСчетов.Вставить(ВыборкаСчетов.Счет, Истина);
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[1].Выбрать();
	
	Статистика.КОбработке = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл  
		
		НаборЗаписей = РегистрыБухгалтерии.МСФО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если СоответствиеСчетов.Получить(Запись.СчетДт) = Истина Тогда
				Запись.СубконтоДт[ВидСубконто] =  СоответствиеТипаВидуНалога.Получить(Запись.СубконтоДт[ВидСубконто]); 
			КонецЕсли;
			Если СоответствиеСчетов.Получить(Запись.СчетКт) = Истина Тогда
				Запись.СубконтоКт[ВидСубконто] =  СоответствиеТипаВидуНалога.Получить(Запись.СубконтоКт[ВидСубконто]);
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			Статистика.Обработано = Статистика.Обработано + 1;
			
		Исключение
			ЗаписьЖурналаРегистрации("Изменение субконто ""Типы налогов"" в проводках МСФО",
				УровеньЖурналаРегистрации.Ошибка,,,
				"Ошибка при записи проводок упр.учета документа " + Выборка.Регистратор + " : " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Статистика.КоличествоОшибок = Статистика.КоличествоОшибок + 1;
		КонецПопытки;
		
		ВсегоОбработано = Статистика.Обработано + Статистика.КоличествоОшибок;
		Если ВсегоОбработано % 50 = 0 Тогда
			ДлительныеОперации.СообщитьПрогресс(Окр(ВсегоОбработано / Статистика.КОбработке * 100, 1), Строка(Выборка.Регистратор));
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстСообщения = СтрШаблон("Обработано %1 документов из %2, ошибок %3", Статистика.Обработано, Статистика.КОбработке, Статистика.КоличествоОшибок);
    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры   //ПроизвестиЗаменуСубконтоПоВидамНалогов()

// Чекордина Ирина 12.08.2025 Выполнение задач №000054723
Функция ПреобразоватьТаблицуПоГруппамЦФО(ЗначенияПоказателей, ВерсияРегламента, ИмяЗаменяемойАналитики) Экспорт
	
	Если ТипЗнч(ВерсияРегламента) <> Тип("СправочникСсылка.ВерсииРегламентовПодготовкиОтчетности")
		Или ТипЗнч(ИмяЗаменяемойАналитики) <> Тип("Строка")
		Или ЗначенияПоказателей.Колонки.Найти(ИмяЗаменяемойАналитики) = Неопределено Тогда
		Возврат ЗначенияПоказателей;
	КонецЕсли;
		
	СоответствиеГруппЦФО = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.ОрганизационнаяЕдиница КАК ЦФО,
		|	ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.ОрганизационнаяЕдиницаРодитель КАК ГруппаЦФО
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.ВерсииРегламентовПодготовкиОтчетности.СтруктураГруппы КАК ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы
		|ГДЕ
		|	ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.Ссылка = &ВерсияРегламента
		|	И ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.ОрганизационнаяЕдиницаРодитель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ЦФО КАК ЦФО,
		|	ВТ.ГруппаЦФО КАК ГруппаЦФО
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ1
		|		ПО ВТ.ГруппаЦФО = ВТ1.ЦФО
		|ГДЕ
		|	НЕ ВТ.ЦФО В
		|				(ВЫБРАТЬ
		|					ВТ.ГруппаЦФО
		|				ИЗ
		|					ВТ КАК ВТ)";
	
	Запрос.УстановитьПараметр("ВерсияРегламента", ВерсияРегламента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначенияПоказателей;
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеГруппЦФО.Вставить(Выборка.ЦФО, Выборка.ГруппаЦФО);
	КонецЦикла;
	
    тЗначенияПоказателей = ЗначенияПоказателей.Скопировать();
	
	Для Каждого Элемент Из СоответствиеГруппЦФО Цикл
		
		НайденныеСтроки = тЗначенияПоказателей.НайтиСтроки(Новый Структура(ИмяЗаменяемойАналитики, Элемент.Ключ));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого Стр Из НайденныеСтроки Цикл
				Стр[ИмяЗаменяемойАналитики] = Элемент.Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	КолонкиДляСвертки = "";
	КолонкиСуммирования = "";
	Для Каждого Колонка Из тЗначенияПоказателей.Колонки Цикл
		Если Колонка.Имя <> "Значение" И Колонка.Имя <> "ЗначениеВалюта" Тогда
			КолонкиДляСвертки = КолонкиДляСвертки + ?(ЗначениеЗаполнено(КолонкиДляСвертки), ", ", "") + Колонка.Имя;
		Иначе
			КолонкиСуммирования = КолонкиСуммирования + ?(ЗначениеЗаполнено(КолонкиСуммирования), ", ", "") + Колонка.Имя;
		КонецЕсли;
	КонецЦикла;
	
	тЗначенияПоказателей.Свернуть(КолонкиДляСвертки, КолонкиСуммирования);
	               
	Возврат тЗначенияПоказателей;
	
КонецФункции

//Сафиуллина З.Р. 19.12.2025 Выполнение задач №000056192
//
Функция ИспользоватьТиповойФункционалПоВозвратуБилетовЗакрытогоПериода() Экспорт
	
	Возврат Константы.тн_ИспользоватьТиповойФункционалПоВозвратуБилетовЗакрытогоПериода.Получить();
	
КонецФункции  //ИспользоватьТиповойФункционалПоВозвратуБилетовЗакрытогоПериода()

// Чекордина Ирина 02.02.2026 Выполнение задач №000056374
Функция ПолучитьИерархиюЭлементаСправочника(Ссылка) Экспорт

	ПолноеИмяСправочника = Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Справочник.Ссылка КАК Ссылка
		|ИЗ
		|	&Таблица КАК Справочник
		|ГДЕ
		|	Справочник.Ссылка В ИЕРАРХИИ(&Ссылка)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Таблица", ПолноеИмяСправочника);
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецФункции

//Сафиуллина З.Р. 05.02.2026 Выполнение задач №000056642
//
Процедура СвернутьТабличнуюЧасть(ТекОбъект, ИмяТЧ, МассивИменРесурсов) Экспорт
	
	МетаданныеТЧ = ТекОбъект.Метаданные().ТабличныеЧасти.Найти(ИмяТЧ);
	
	Если МетаданныеТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГруппировки = "";
	СтрокаСуммирования = "";
	
	Для Каждого РеквизитТЧ Из МетаданныеТЧ.Реквизиты Цикл
		
		ИмяРеквизита = РеквизитТЧ.Имя;
		
		Если МассивИменРесурсов.Найти(ИмяРеквизита) <> Неопределено Тогда
			СтрокаСуммирования = СтрокаСуммирования + ?(ПустаяСтрока(СтрокаСуммирования), "", ",") + ИмяРеквизита;
		Иначе
			СтрокаГруппировки = СтрокаГруппировки + ?(ПустаяСтрока(СтрокаГруппировки), "", ",") + ИмяРеквизита;
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ = ТекОбъект[ИмяТЧ].Выгрузить();
	ТЗ.Свернуть(СтрокаГруппировки, СтрокаСуммирования);
	ТекОбъект[ИмяТЧ].Загрузить(ТЗ);
	
КонецПроцедуры //СвернутьТабличнуюЧасть()

//Качикина 05.03.2026 Выполнение задач №000056633     
//процедура блокирует все элементы формы кроме СписокРеквизитовИсключений
Процедура ДоступностьЭлементовФормыИсключаяРеквизиты(ЭлементыФормы, СписокРеквизитовИсключений) Экспорт 

	ОбщийСписокИсключений = Новый СписокЗначений; 
	ОбщийСписокИсключений.Добавить("ФормаПровести");
	ОбщийСписокИсключений.Добавить("ФормаПровестиИЗакрыть");
	ОбщийСписокИсключений.Добавить("ФормаЗаписать");  
	ОбщийСписокИсключений.Добавить("КнопкаИзменитьРеквизитыБезПерепроведения"); 
	ОбщийСписокИсключений.Добавить("ФормаОбработкаОтражениеДокументовВРеглУчетеПроводкиРеглУчета");
	ОбщийСписокИсключений.Добавить("ФормаОбщаяКомандаПоказатьИсториюТрансляции");    
	Для Каждого ЭлСЗ Из СписокРеквизитовИсключений Цикл
		ОбщийСписокИсключений.Добавить(ЭлСЗ.Значение);		
	КонецЦикла;
		 	 	
	Для Каждого ТекЭлемент Из ЭлементыФормы Цикл
		
		ТипЗначенияЭлемента = ТипЗнч(ТекЭлемент);
		Если  ТипЗначенияЭлемента = Тип("ДекорацияФормы")
			Или ТипЗначенияЭлемента = Тип("ГруппаФормы")
			Или ТипЗначенияЭлемента = Тип("ТаблицаФормы") Тогда
			Продолжить;
		КонецЕсли;  
		
		РодительИмя = ТекЭлемент.Родитель.Имя; 
		Если Не ТипЗнч(ТекЭлемент.Родитель) = Тип("ФормаКлиентскогоПриложения") 
			И (СтрНайти(РодительИмя, "ПодменюПечать") <> 0
			Или СтрНайти(РодительИмя, "ПоказатьВСписке") <> 0
			Или СтрНайти(РодительИмя, "ПодменюОтчеты") <> 0
			Или СтрНайти(РодительИмя, "ПодменюСоздатьНаОсновании") <> 0) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщийСписокИсключений.НайтиПоЗначению(ТекЭлемент.Имя) = Неопределено Тогда
			//блокируем
			Попытка
				ТекЭлемент.ТолькоПросмотр = Истина;
			Исключение
				ТекЭлемент.Доступность = Ложь;
			КонецПопытки;	    
		Иначе  
			//устанавливаем доступность
			Попытка
				ТекЭлемент.ТолькоПросмотр = Ложь;
			Исключение
				ТекЭлемент.Доступность = Истина;
			КонецПопытки;    	
		КонецЕсли;    
		
	КонецЦикла; 
	
КонецПроцедуры

// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
#Область ФорматЯчеекДата_в_Excel

// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
Функция ВыполнитьОбработкуФорматаЯчеекДата_в_Excel(Адрес)
	
	Результат = Новый Структура("Адрес, Ошибка", "", "");
	
	Попытка
		
		//Получаем исходный файл с клиента
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		ПутьКФайлуСервер = ПолучитьИмяВременногоФайла("xml"); 
		ДвоичныеДанные.Записать(ПутьКФайлуСервер);

		//Распоковываем ZipФайл
		ПапкаOpenXML = РаспоковатьZipФайл(ПутьКФайлуСервер);

		// НАЧАЛО Белоконенко Денис 20.10.2025 Выполнение задач №000055268
		////Добавляем стиль с форматом "dd (ddd)"
		//ИндексXfs = 0;
		//ОбработкаХМЛ(ПапкаOpenXML+"\xl\styles.xml","styles",ИндексXfs);
		//
		////Связываем ясейки с нужным стилем (форматом) и преобразовываем их содержание
		//ОбработкаХМЛ(ПапкаOpenXML + "\xl\worksheets\sheet1.xml","sheet1",ИндексXfs);
		
		//Собираем все форматы из файла
		СписокФорматов = СобратьФорматыИзФайла(ПапкаOpenXML);
		
		//Создаем стили для каждого уникального формата
		СоответствиеФорматов = Новый Соответствие;
		ОбработкаХМЛ(ПапкаOpenXML+"\xl\styles.xml","styles", СоответствиеФорматов, СписокФорматов);
		
		//Связываем ячейки с нужными стилями и преобразовываем их содержание
		ОбработкаХМЛ(ПапкаOpenXML + "\xl\worksheets\sheet1.xml","sheet1", СоответствиеФорматов, СписокФорматов);
		// КОНЕЦ Белоконенко Денис 20.10.2025 Выполнение задач №000055268
		
		//Упаковываем обратно в ZipФайл
		СохранитьZip(ПутьКФайлуСервер, ПапкаOpenXML);
			
		УдалитьФайлы(ПапкаOpenXML);
		
		//Возвращаем измененный файл на клиента
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуСервер);
		Результат.Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
	Исключение
		Результат.Ошибка = ОписаниеОшибки();
        // НАЧАЛО Белоконенко Денис 10.12.2025 Выполнение задач №000056102
		ИмяСобытия = "Выгрузка плана в файл";
		Уровень = УровеньЖурналаРегистрации.Ошибка;
		Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, Уровень,,,Комментарий);
		// КОНЕЦ Белоконенко Денис 10.12.2025 Выполнение задач №000056102
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Чекордина Ирина 15.08.2025 Выполнение задач №000054725: +Экспорт
//// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
//Функция РаспоковатьZipФайл(ПутьКФайлуСервер)
Функция РаспоковатьZipФайл(ПутьКФайлуСервер) Экспорт	
	
	//СоздатьКаталогOpenXML
	ИмяВременногоКаталога = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременногоКаталога);       
	ПапкаOpenXML = ИмяВременногоКаталога + ПолучитьРазделительПути();
	
	ЧтениеZIP = Новый ЧтениеZipФайла;
	ЧтениеZIP.Открыть(ПутьКФайлуСервер);
	ЧтениеZIP.ИзвлечьВсе(ПапкаOpenXML);
	ЧтениеZIP.Закрыть();
	
	Возврат ПапкаOpenXML;
	
КонецФункции

// Чекордина Ирина 15.08.2025 Выполнение задач №000054725: +Экспорт
//// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
//Процедура СохранитьZip(ПутьКФайлуСервер, ПапкаOpenXML)
Процедура СохранитьZip(ПутьКФайлуСервер, ПапкаOpenXML) Экспорт
	
	ЗаписьZIP = Новый ЗаписьZipФайла();
	ЗаписьZIP.Открыть(ПутьКФайлуСервер);
	ЗаписьZIP.Добавить(ПапкаOpenXML+"\*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);		
	ЗаписьZIP.Записать();
		
КонецПроцедуры

// Белоконенко Денис 20.10.2025 Выполнение задач №000055268
//// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
//Процедура ОбработкаХМЛ(ПолныйПуть, Тип, ИндексXfs)
Процедура ОбработкаХМЛ(ПолныйПуть, Тип, СоответствиеФорматов, СписокФорматов = Неопределено) 
	
	ОбъектXML 		= Новый ЧтениеXML;
    ОбъектXML.ОткрытьФайл(ПолныйПуть);
    ПостроительDOM 	= Новый ПостроительDOM;
    ДокументDOM = ПостроительDOM.Прочитать(ОбъектXML);
    ОбъектXML.Закрыть();
	
	Если Тип = "styles" Тогда
		
		// НАЧАЛО Белоконенко Денис 20.10.2025 Выполнение задач №000055268
		////cellXfs: добавляем новый стиль и узнаем его индекс
		//Узел = ДокументDOM.ПолучитьЭлементыПоИмени("cellXfs")[0];
		//ИндексXfs = Узел.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла;
		//Узел.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла = XMLСтрока(Число(ИндексXfs) + 1);
		//
		//НовыйЭлемент = ДокументDOM.СоздатьЭлемент("xf");
		//НовыйЭлемент.УстановитьАтрибут("numFmtId", Строка(ИндексXfs)); //<-- в этот стиль подключим формат "dd (ddd)"
		//Для Каждого Атр Из Узел.ПоследнийДочерний.Атрибуты Цикл
		//	Если Атр.Имя = "borderId" Тогда
		//		НовыйЭлемент.УстановитьАтрибут("borderId", Атр.Значение);
		//	ИначеЕсли Атр.Имя = "fillId" Тогда
		//		НовыйЭлемент.УстановитьАтрибут("fillId", Атр.Значение);
		//	ИначеЕсли Атр.Имя = "fontId" Тогда	
		//		НовыйЭлемент.УстановитьАтрибут("fontId", Атр.Значение);
		//	ИначеЕсли Атр.Имя = "applyNumberFormat" Тогда	
		//		НовыйЭлемент.УстановитьАтрибут("applyNumberFormat", Атр.Значение);	
		//	ИначеЕсли Атр.Имя = "xfId" Тогда	
		//		НовыйЭлемент.УстановитьАтрибут("xfId", Атр.Значение);	
		//	ИначеЕсли Атр.Имя = "applyBorder" Тогда
		//		НовыйЭлемент.УстановитьАтрибут("applyBorder", Атр.Значение);
		//	КонецЕсли;	
		//КонецЦикла;	
		//Узел.ДобавитьДочерний(НовыйЭлемент);

		////numFmts: присваиваем формат добавленному стилю
		//Узел = ДокументDOM.ПолучитьЭлементыПоИмени("numFmts")[0];
		//ИндексFmts = Узел.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла;
		//Узел.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла = XMLСтрока(Число(ИндексFmts) + 1);

		//НовыйЭлемент = ДокументDOM.СоздатьЭлемент("numFmt");
		//НовыйЭлемент.УстановитьАтрибут("numFmtId", Строка(ИндексXfs));
		//НовыйЭлемент.УстановитьАтрибут("formatCode", "dd (ddd)"); //"dd (ddd)"

		//Узел.ДобавитьДочерний(НовыйЭлемент);
		
		//cellXfs: добавляем новые стили для каждого формата
		Узел = ДокументDOM.ПолучитьЭлементыПоИмени("cellXfs")[0];
		ТекущийИндекс = Узел.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла;
		НачальныйИндекс = Число(ТекущийИндекс);
		
		//numFmts: добавляем форматы
		УзелNumFmts = ДокументDOM.ПолучитьЭлементыПоИмени("numFmts")[0];
		ИндексFmts = УзелNumFmts.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла;
		
		Индекс = НачальныйИндекс;
		Для Каждого Формат Из СписокФорматов Цикл
			
			ИндексСтрокой = Строка(Формат(Индекс, "ЧГ=0"));
			
			//Создаем новый numFmt
			НовыйNumFmt = ДокументDOM.СоздатьЭлемент("numFmt");
			НовыйNumFmt.УстановитьАтрибут("numFmtId", ИндексСтрокой);
			НовыйNumFmt.УстановитьАтрибут("formatCode", Формат);
			УзелNumFmts.ДобавитьДочерний(НовыйNumFmt);
			
			//Создаем новый xf (стиль)
			НовыйЭлемент = ДокументDOM.СоздатьЭлемент("xf");
			НовыйЭлемент.УстановитьАтрибут("numFmtId", Строка(Индекс));
			
			//Копируем атрибуты из последнего существующего стиля
			Если Узел.ДочерниеУзлы.Количество() > 0 Тогда
				ПоследнийСтиль = Узел.ПоследнийДочерний;
				Для Каждого Атр Из ПоследнийСтиль.Атрибуты Цикл
					Если Атр.Имя = "borderId" Тогда
						НовыйЭлемент.УстановитьАтрибут("borderId", Атр.Значение);
					ИначеЕсли Атр.Имя = "fillId" Тогда
						НовыйЭлемент.УстановитьАтрибут("fillId", Атр.Значение);
					ИначеЕсли Атр.Имя = "fontId" Тогда    
						НовыйЭлемент.УстановитьАтрибут("fontId", Атр.Значение);
					ИначеЕсли Атр.Имя = "applyNumberFormat" Тогда      
						НовыйЭлемент.УстановитьАтрибут("applyNumberFormat", Атр.Значение); 
					ИначеЕсли Атр.Имя = "xfId" Тогда         
						НовыйЭлемент.УстановитьАтрибут("xfId", Атр.Значение);       
					ИначеЕсли Атр.Имя = "applyBorder" Тогда
						НовыйЭлемент.УстановитьАтрибут("applyBorder", Атр.Значение);
					КонецЕсли;       
				КонецЦикла;
			КонецЕсли;
			
			Узел.ДобавитьДочерний(НовыйЭлемент);
			
			//Сохраняем соответствие формат -> индекс стиля
			СоответствиеФорматов.Вставить(Формат, ИндексСтрокой);
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		//Обновляем счетчики
		УзелNumFmts.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла = XMLСтрока(Число(ИндексFmts) + СписокФорматов.Количество());
		Узел.Атрибуты.ПолучитьИменованныйЭлемент("count").ЗначениеУзла = XMLСтрока(Число(ТекущийИндекс) + СписокФорматов.Количество());
		// КОНЕЦ Белоконенко Денис 20.10.2025 Выполнение задач №000055268		
		
	ИначеЕсли Тип = "sheet1" Тогда
		
		//Связываем ясейки с нужным стилем (форматом) и преобразовываем их содержание
		
		ОбъектXML2   	= Новый ЧтениеXML;
	    ОбъектXML2.ОткрытьФайл(СтрЗаменить(ПолныйПуть,"worksheets\sheet1","sharedStrings"));
	    ПостроительDOM2 = Новый ПостроительDOM;
	    ДокументDOM2 = ПостроительDOM2.Прочитать(ОбъектXML2);
	    ОбъектXML2.Закрыть();
		
		Элементы_si = ДокументDOM2.ПолучитьЭлементыПоИмени("si");
		Элементы_row = ДокументDOM.ПолучитьЭлементыПоИмени("row");	
		Для Каждого row Из Элементы_row Цикл
			Для Каждого col Из row.ДочерниеУзлы Цикл
				Попытка
					Элемент_si = Элементы_si[Число(col.ПервыйДочерний.ТекстовоеСодержимое)];
					Если СтрНайти(НРег(Элемент_si.ТекстовоеСодержимое), "формат") > 0 Тогда
						// НАЧАЛО Белоконенко Денис 20.10.2025 Выполнение задач №000055268
						Формат = ПолучитьФорматИзСтроки(Элемент_si.ТекстовоеСодержимое);
						// КОНЕЦ Белоконенко Денис 20.10.2025 Выполнение задач №000055268						
						ВырезатьФорматИзСтроки(Элемент_si);
						
						//Преобразуем строковое представление даты (формат "Общий") в число
						Попытка
							col.ПервыйДочерний.ТекстовоеСодержимое = XMLСтрока(ПоучитьЧислоЕксель(Дата(Элементы_si[Число(col.ПервыйДочерний.ТекстовоеСодержимое)].ТекстовоеСодержимое+ " 00:00:00")));
							col.Атрибуты.УдалитьИменованныйЭлемент("t");
						Исключение
						КонецПопытки;
						
						//Назначаем стиль с требуемым форматом
						// НАЧАЛО Белоконенко Денис 20.10.2025 Выполнение задач №000055268
						//col.Атрибуты.ПолучитьИменованныйЭлемент("s").ЗначениеУзла=ИндексXfs; 
						ЗначениеИндексаФормата = СоответствиеФорматов.Получить(Формат);
						Если ЗначениеИндексаФормата <> Неопределено Тогда
														
							col.Атрибуты.ПолучитьИменованныйЭлемент("s").ЗначениеУзла = ЗначениеИндексаФормата;
							
						КонецЕсли;
						// КОНЕЦ Белоконенко Денис 20.10.2025 Выполнение задач №000055268
						
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;	
		КонецЦикла;		
	КонецЕсли;	
	
	//Запаковывам обратно в ZIP-файл --> получаем *.xmls документ
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПолныйПуть);
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
Процедура ВырезатьФорматИзСтроки(Элемент_si)
	
	Текст = Элемент_si.ТекстовоеСодержимое;
	позФормат = СтрНайти(НРег(Текст), "формат") - 1;
	Если позФормат > 0 Тогда
		Элемент_si.ТекстовоеСодержимое = СокрЛП(Лев(Текст, позФормат));
	КонецЕсли;
	
КонецПроцедуры

// Белоконенко Денис 20.10.2025 Выполнение задач №000055268
Функция ПолучитьФорматИзСтроки(Текст)
	
	позФормат = СтрНайти(НРег(Текст), "формат");
	
	ТекстПослеФормат = "";
	
	Если позФормат > 0 Тогда
			
		//Вырезаем часть после слова "формат"
		ТекстПослеФормат = Сред(Текст, позФормат + 6); // +6 = длина "формат"
		ТекстПослеФормат = СокрЛП(ТекстПослеФормат);
	КонецЕсли;	
	
	Возврат ТекстПослеФормат;
	
КонецФункции

// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
Функция ПоучитьЧислоЕксель(Дата)
	
	Возврат ((Дата-'19000101000000')/86400) + 2;
	
КонецФункции	

// Белоконенко Денис 20.10.2025 Выполнение задач №000055268
Функция СобратьФорматыИзФайла(ПапкаOpenXML)
	
	СписокФорматов = Новый Массив;
	
	//Читаем sharedStrings чтобы найти все форматы
	ПолныйПуть = ПапкаOpenXML + "\xl\sharedStrings.xml";
		
	ОбъектXML = Новый ЧтениеXML;
	ОбъектXML.ОткрытьФайл(ПолныйПуть);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ОбъектXML);
	ОбъектXML.Закрыть();
	
	Элементы_si = ДокументDOM.ПолучитьЭлементыПоИмени("si");
	
	Для Каждого Элемент_si Из Элементы_si Цикл
		
		Формат = ПолучитьФорматИзСтроки(Элемент_si.ТекстовоеСодержимое);
					
		//Добавляем в список, если формат не пустой
		Если Формат <> "" Тогда
			СписокФорматов.Добавить(Формат);
		КонецЕсли;
					
	КонецЦикла;
	
	СписокФорматов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокФорматов);
	
	Возврат СписокФорматов;
	
КонецФункции

//Блинова М.А. 23.11.2025 Выполнение задач №000055915
Функция СделатьЗапросРазрешенным(Текст) Экспорт
	
	НовыйТекст = Текст;

    ПозицияНайти = Найти(нРег(НовыйТекст), "разрешенные");
    Пока ПозицияНайти > 0 Цикл
        //удаляем найденные разрешенные
        НовыйТекст = Лев(НовыйТекст, ПозицияНайти - 1) + Сред(НовыйТекст, ПозицияНайти + 11);
        
        ПозицияНайти = Найти(нРег(НовыйТекст), "разрешенные");
    КонецЦикла;
		
	ПозицияВыбрать = Найти(нРег(НовыйТекст), "выбрать");
		
	Если ПозицияВыбрать > 0 Тогда
		ЗаменяющаяСтрока = Лев(НовыйТекст, ПозицияВыбрать + СтрДлина("выбрать") - 1) + " Разрешенные" + Сред(НовыйТекст, ПозицияВыбрать + СтрДлина("выбрать"));
		Возврат ЗаменяющаяСтрока;
	Иначе
		Возврат Текст;
	КонецЕсли;
	
КонецФункции
// Борисенко Игорь 16.04.2025 Выполнение задач №000053436
#КонецОбласти

// Юдина Екатерина 17.06.2025 Выполнение задач №000054100
#Область УчетЭкспортногоНДС 

// Юдина Екатерина 17.06.2025 Выполнение задач №000054100
//                
Процедура ОбновитьСписокКодовВидаОперации(Период, СписокВыбора) Экспорт
	
	СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КодыВидаОперацийОтгрузкиСрезПоследних.Код КАК Код,
	               |	КодыВидаОперацийОтгрузкиСрезПоследних.ВидОперации КАК ВидОперации,
	               |	КодыВидаОперацийОтгрузкиСрезПоследних.Описание КАК Описание,
	               |	ВЫБОР
	               |		КОГДА КодыВидаОперацийОтгрузкиСрезПоследних.Сырьевой
	               |			ТОГДА ""Сырьевой товар""
	               |		ИНАЧЕ ""Несырьевой товар""
	               |	КОНЕЦ КАК ВидТовара
	               |ИЗ
	               |	РегистрСведений.тн_КодыВидаОперацийОтгрузки.СрезПоследних(&Период, ) КАК КодыВидаОперацийОтгрузкиСрезПоследних";
    Запрос.УстановитьПараметр("Период", Период);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокВыбора.Добавить(Выборка.Код, Выборка.Код + " - (" + Строка(Выборка.ВидОперации) +", " + Выборка.ВидТовара + " ) " + Выборка.Описание);	
		
	КонецЦикла;	
			
КонецПроцедуры

// Юдина Екатерина 17.06.2025 Выполнение задач №000054100
//  
Функция ПрименяетсяОпределениеКодаОперацииПоРСКодыВидаОперацийОтгрузки(Организация, Период) Экспорт
	
	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату(
		"НастройкиУчетаНДС",
		Организация,
		Период,
		Ложь);
		
	Результат = Не ПараметрыУчетнойПолитики = Неопределено И ПараметрыУчетнойПолитики.тн_ОпределятьКодыОперацииПоРСКодыВидаОперацийОтгрузки;

	Возврат Результат;

КонецФункции

// Юдина Екатерина 17.06.2025 Выполнение задач №000054100
//  
Функция ЗаполнитьКодВидаОперацииОтгрузки(Организация, СписокДокументов) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписокДокументов.Ссылка КАК Документ,
	               |	СписокДокументов.Дата КАК Дата,
	               |	СписокДокументов.Номенклатура КАК Номенклатура,
	               |	СписокДокументов.Контрагент КАК Контрагент,
	               |	СписокДокументов.Договор КАК Договор,
	               |	СписокДокументов.Сумма КАК Сумма,
	               |	СписокДокументов.ПометкаВыделения КАК ПометкаВыделения,
	               |	СписокДокументов.ИдентификаторСтроки КАК ИдентификаторСтроки
	               |ПОМЕСТИТЬ втСписокДокументовПредварительно
	               |ИЗ
	               |	&СписокДокументов КАК СписокДокументов
	               |ГДЕ
	               |	СписокДокументов.ПометкаВыделения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СписокДокументов.Документ КАК Документ,
	               |	СписокДокументов.Дата КАК Дата,
	               |	ВЫРАЗИТЬ(СписокДокументов.Контрагент КАК Справочник.Контрагенты).СтранаРегистрации КАК СтранаРегистрации,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(СписокДокументов.Договор КАК Справочник.ДоговорыКонтрагентов).тн_ОтгрузкаВСвободнуюТаможеннуюЗону
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.тн_ВидыОперацийОтгрузки.СвободнаяТаможеннаяЗона)
	               |		КОГДА ВЫРАЗИТЬ(СписокДокументов.Договор КАК Справочник.ДоговорыКонтрагентов).тн_ОтгрузкаВСтрануНеЕАЭС  
				   |		    ИЛИ НЕ ВЫРАЗИТЬ(СписокДокументов.Контрагент КАК Справочник.Контрагенты).СтранаРегистрации.УчастникЕАЭС
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.тн_ВидыОперацийОтгрузки.ЭкспортЗаПределыЕАЭС)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВЫРАЗИТЬ(СписокДокументов.Контрагент КАК Справочник.Контрагенты).СтранаРегистрации.УчастникЕАЭС
	               |					ТОГДА ЗНАЧЕНИЕ(Перечисление.тн_ВидыОперацийОтгрузки.ЭкспортВСтраныЕАЭС)
	               |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.тн_ВидыОперацийОтгрузки.ПустаяСсылка)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ВидОперации,
	               |	СписокДокументов.Номенклатура КАК Номенклатура,
	               |	СписокДокументов.Контрагент КАК Контрагент,
	               |	СписокДокументов.Договор КАК Договор,
	               |	СписокДокументов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(СписокДокументов.Номенклатура КАК Справочник.Номенклатура).КодТНВЭД.СырьевойТовар, ЛОЖЬ) КАК Сырьевой,
	               |	СписокДокументов.ПометкаВыделения КАК ПометкаВыделения,
	               |	СписокДокументов.Сумма КАК Сумма
	               |ПОМЕСТИТЬ втСписокДокументов
	               |ИЗ
	               |	втСписокДокументовПредварительно КАК СписокДокументов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НАЧАЛОПЕРИОДА(втСписокДокументов.Дата, ДЕНЬ) КАК Дата
	               |ПОМЕСТИТЬ вт_ДатыПродаж
	               |ИЗ
	               |	втСписокДокументов КАК втСписокДокументов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(тн_Оффшоры.Период) КАК Период,
	               |	тн_Оффшоры.Страна КАК Страна,
	               |	вт_ДатыПродаж.Дата КАК Дата
	               |ПОМЕСТИТЬ вт_ДатыОффшоров
	               |ИЗ
	               |	РегистрСведений.тн_Оффшоры КАК тн_Оффшоры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ДатыПродаж КАК вт_ДатыПродаж
	               |		ПО тн_Оффшоры.Период <= вт_ДатыПродаж.Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	тн_Оффшоры.Страна,
	               |	вт_ДатыПродаж.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(ВзаимозависимыеЛица.Период) КАК Период,
	               |	ВзаимозависимыеЛица.Контрагент КАК Контрагент,
	               |	вт_ДатыПродаж.Дата КАК Дата
	               |ПОМЕСТИТЬ вт_ДатыВзаимозависимыхЛиц
	               |ИЗ
	               |	РегистрСведений.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ДатыПродаж КАК вт_ДатыПродаж
	               |		ПО ВзаимозависимыеЛица.Период <= вт_ДатыПродаж.Дата
	               |			И (ВзаимозависимыеЛица.Организация = &Организация)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаимозависимыеЛица.Контрагент,
	               |	вт_ДатыПродаж.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(тн_КодыВидаОперацийОтгрузки.Период) КАК Период,
	               |	тн_КодыВидаОперацийОтгрузки.ВидОперации КАК ВидОперации,
	               |	тн_КодыВидаОперацийОтгрузки.Оффшор КАК Оффшор,
	               |	тн_КодыВидаОперацийОтгрузки.Сырьевой КАК Сырьевой,
	               |	тн_КодыВидаОперацийОтгрузки.Взаимозависимость КАК Взаимозависимость,
	               |	вт_ДатыПродаж.Дата КАК Дата
	               |ПОМЕСТИТЬ вт_ДатыКодыВидаОперацийОтгрузки
	               |ИЗ
	               |	РегистрСведений.тн_КодыВидаОперацийОтгрузки КАК тн_КодыВидаОперацийОтгрузки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ДатыПродаж КАК вт_ДатыПродаж
	               |		ПО тн_КодыВидаОперацийОтгрузки.Период <= вт_ДатыПродаж.Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	тн_КодыВидаОперацийОтгрузки.ВидОперации,
	               |	тн_КодыВидаОперацийОтгрузки.Оффшор,
	               |	тн_КодыВидаОперацийОтгрузки.Сырьевой,
	               |	тн_КодыВидаОперацийОтгрузки.Взаимозависимость,
	               |	вт_ДатыПродаж.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втСписокДокументов.Документ КАК Документ,
	               |	втСписокДокументов.Дата КАК Дата,
	               |	втСписокДокументов.Номенклатура КАК Номенклатура,
	               |	втСписокДокументов.Контрагент КАК Контрагент,
	               |	втСписокДокументов.Договор КАК Договор,
	               |	втСписокДокументов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	втСписокДокументов.ВидОперации КАК ВидОперации,
	               |	втСписокДокументов.Сырьевой КАК Сырьевой,
	               |	ЕСТЬNULL(ВзаимозависимыеЛица.ТипВзаимозависимости, ЛОЖЬ) В (&МассивТипВзаимозависимости) КАК Взаимозависимость,
	               |	ЕСТЬNULL(тн_Оффшоры.Оффшор, ЛОЖЬ) КАК Оффшор,
	               |	втСписокДокументов.ПометкаВыделения КАК ПометкаВыделения,
	               |	втСписокДокументов.Сумма КАК Сумма
	               |ПОМЕСТИТЬ втПодготовленныйСписокДокументов
	               |ИЗ
	               |	втСписокДокументов КАК втСписокДокументов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ДатыОффшоров КАК вт_ДатыОффшоров
	               |		ПО втСписокДокументов.СтранаРегистрации = вт_ДатыОффшоров.Страна
	               |			И (НАЧАЛОПЕРИОДА(втСписокДокументов.Дата, ДЕНЬ) = вт_ДатыОффшоров.Дата)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.тн_Оффшоры КАК тн_Оффшоры
	               |		ПО втСписокДокументов.СтранаРегистрации = тн_Оффшоры.Страна
	               |			И (вт_ДатыОффшоров.Период = тн_Оффшоры.Период)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ДатыВзаимозависимыхЛиц КАК вт_ДатыВзаимозависимыхЛиц
	               |		ПО втСписокДокументов.Контрагент = вт_ДатыВзаимозависимыхЛиц.Контрагент
	               |			И (НАЧАЛОПЕРИОДА(втСписокДокументов.Дата, ДЕНЬ) = вт_ДатыВзаимозависимыхЛиц.Дата)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	               |		ПО (ВзаимозависимыеЛица.Организация = &Организация)
	               |			И втСписокДокументов.Контрагент = ВзаимозависимыеЛица.Контрагент
	               |			И (вт_ДатыВзаимозависимыхЛиц.Период = ВзаимозависимыеЛица.Период)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втПодготовленныйСписокДокументов.Документ КАК Ссылка,
	               |	втПодготовленныйСписокДокументов.Номенклатура КАК Номенклатура,
	               |	втПодготовленныйСписокДокументов.Контрагент КАК Контрагент,
	               |	втПодготовленныйСписокДокументов.Договор КАК Договор,
	               |	втПодготовленныйСписокДокументов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ЕСТЬNULL(тн_КодыВидаОперацийОтгрузки.Код, """") КАК тн_КодВидаОперации,
	               |	втПодготовленныйСписокДокументов.Дата КАК Дата,
	               |	втПодготовленныйСписокДокументов.ПометкаВыделения КАК ПометкаВыделения,
	               |	втПодготовленныйСписокДокументов.Сумма КАК Сумма
	               |ИЗ
	               |	втПодготовленныйСписокДокументов КАК втПодготовленныйСписокДокументов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ДатыКодыВидаОперацийОтгрузки КАК вт_ДатыКодыВидаОперацийОтгрузки
	               |		ПО втПодготовленныйСписокДокументов.ВидОперации = вт_ДатыКодыВидаОперацийОтгрузки.ВидОперации
	               |			И втПодготовленныйСписокДокументов.Оффшор = вт_ДатыКодыВидаОперацийОтгрузки.Оффшор
	               |			И втПодготовленныйСписокДокументов.Сырьевой = вт_ДатыКодыВидаОперацийОтгрузки.Сырьевой
	               |			И втПодготовленныйСписокДокументов.Взаимозависимость = вт_ДатыКодыВидаОперацийОтгрузки.Взаимозависимость
	               |			И (НАЧАЛОПЕРИОДА(втПодготовленныйСписокДокументов.Дата, ДЕНЬ) = вт_ДатыКодыВидаОперацийОтгрузки.Дата)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.тн_КодыВидаОперацийОтгрузки КАК тн_КодыВидаОперацийОтгрузки
	               |		ПО (тн_КодыВидаОперацийОтгрузки.ВидОперации = вт_ДатыКодыВидаОперацийОтгрузки.ВидОперации)
	               |			И (тн_КодыВидаОперацийОтгрузки.Оффшор = вт_ДатыКодыВидаОперацийОтгрузки.Оффшор)
	               |			И (тн_КодыВидаОперацийОтгрузки.Сырьевой = вт_ДатыКодыВидаОперацийОтгрузки.Сырьевой)
	               |			И (тн_КодыВидаОперацийОтгрузки.Взаимозависимость = вт_ДатыКодыВидаОперацийОтгрузки.Взаимозависимость)
	               |			И (вт_ДатыКодыВидаОперацийОтгрузки.Период = тн_КодыВидаОперацийОтгрузки.Период)";
	
	масТипВзаимозависимости = Новый Массив;
	масТипВзаимозависимости.Добавить(Перечисления.ТипыВзаимозависимости.ВзаимозависимыПоКодексу);
	масТипВзаимозависимости.Добавить(Перечисления.ТипыВзаимозависимости.СамостоятельноеПризнаниеВзаимозависимости);
	масТипВзаимозависимости.Добавить(Перечисления.ТипыВзаимозависимости.ВзаимозависимостьПоРешениюСуда);
	
	Запрос.УстановитьПараметр("МассивТипВзаимозависимости", масТипВзаимозависимости); 
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Юдина Екатерина 17.06.2025 Выполнение задач №000054100
#КонецОбласти

#КонецОбласти

#Область НалогообложениеДляОтчетов

// НАЧАЛО Белоконенко Денис 14.09.2023 Выполнение задач №000046864
Процедура ПриСозданииНаСервереНалогообложениеНДСДляОтчетов(Элементы, Группа) Экспорт	
	НовыйЭлементФормы 				= Элементы.Добавить("тн_НалогообложениеНДС", Тип("ПолеФормы"), Группа);
	НовыйЭлементФормы.ПутьКДанным	= "Объект.тн_НалогообложениеНДС";
	НовыйЭлементФормы.Заголовок		= "Налогообложение НДС (для отчетов)";
	НовыйЭлементФормы.Вид			= ВидПоляФормы.ПолеВвода;	
КонецПроцедуры
	
#КонецОбласти 

// Юдина Екатерина 04.12.2025 Выполнение задач №000056034
#Область ОбъектыЦБ

// Юдина Екатерина 04.12.2025 Выполнение задач №000056034
//
Функция ЯвляетсяОбъектомЦБ(Ссылка) Экспорт
	
	МетаданныеСправочника = Ссылка.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("тн_ЯвляетсяОбъектомЦБ", МетаданныеСправочника) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "тн_ЯвляетсяОбъектомЦБ") = Истина; 
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ЯвляетсяОбъектомЦБ", МетаданныеСправочника) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЯвляетсяОбъектомЦБ") = Истина; 
	Иначе
		Возврат Ложь;
	КонецЕсли;  
	
КонецФункции

// Юдина Екатерина 04.12.2025 Выполнение задач №000056034
//
// Процедура устанавливает доступность элементов формы для федеральных элементов справочника   
//
Процедура ДоступностьЭлементовФормы(Форма, Ссылка, ОсновнойРеквизитФормы = "Объект") Экспорт
		
	Если ЯвляетсяОбъектомЦБ(Ссылка) Тогда
		
		Запрос = Новый Запрос;                         
		ИмяОбъектаМетаданных = Ссылка.Метаданные().Имя;
		Запрос.УстановитьПараметр("ИмяОбъектовМетаданных", "Справочник." + ИмяОбъектаМетаданных);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравилаИнтеграционнойСхемыРеквизитыСхем.ИмяТаблицы КАК ИмяТаблицы,
		|	ПравилаИнтеграционнойСхемыРеквизитыСхем.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	Справочник.тн_ПравилаИнтеграционнойСхемы КАК ПравилаИнтеграционнойСхемы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тн_ПравилаИнтеграционнойСхемы.РеквизитыСхем КАК ПравилаИнтеграционнойСхемыРеквизитыСхем
		|		ПО ПравилаИнтеграционнойСхемы.Ссылка = ПравилаИнтеграционнойСхемыРеквизитыСхем.Ссылка
		|ГДЕ
		|	ПравилаИнтеграционнойСхемы.ИмяОбъектовМетаданных = &ИмяОбъектовМетаданных
		|	И НЕ ПравилаИнтеграционнойСхемыРеквизитыСхем.РазрешенаПравка
		|	И НЕ ПравилаИнтеграционнойСхемы.ПометкаУдаления";
				
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			Элементы = Форма.Элементы;
			
			ТаблицаСоответствийРеквизитовФормыиРеквизитовОбъектов = Новый ТаблицаЗначений;
			ТаблицаСоответствийРеквизитовФормыиРеквизитовОбъектов.Колонки.Добавить("ИмяРеквизитаФормы");
			ТаблицаСоответствийРеквизитовФормыиРеквизитовОбъектов.Колонки.Добавить("ИмяРеквизитаОбъекта");
						
			Для Каждого Элемент Из Элементы Цикл
				
				Если ТипЗнч(Элемент) = Тип("ПолеФормы") 
					И ЗначениеЗаполнено(Элемент.ПутьКДанным) Тогда
					НоваяСтрокаТЗ = ТаблицаСоответствийРеквизитовФормыиРеквизитовОбъектов.Добавить();
					НоваяСтрокаТЗ.ИмяРеквизитаФормы = Элемент.Имя;
					НоваяСтрокаТЗ.ИмяРеквизитаОбъекта = Элемент.ПутьКДанным;
				КонецЕсли;
				
			КонецЦикла; 
			
			ПрефиксПутиКДанным = ОсновнойРеквизитФормы + ?(ЗначениеЗаполнено(ОсновнойРеквизитФормы),".","");
			
			Результат = РезультатЗапроса.Выбрать();
			
			Пока Результат.Следующий() Цикл
				
				// Проверяем реквизиты объекта
				Отбор = Новый Структура;    				
				Отбор.Вставить("ИмяРеквизитаОбъекта", ПрефиксПутиКДанным + Результат.ИмяРеквизита);
				
				НайденныеСтрокиСоответствий = ТаблицаСоответствийРеквизитовФормыиРеквизитовОбъектов.НайтиСтроки(Отбор);
				
				Для Каждого Строка Из НайденныеСтрокиСоответствий Цикл 
					
					Попытка
						Элементы[Строка.ИмяРеквизитаФормы].ТолькоПросмотр = Истина;
					Исключение
						Элементы[Строка.ИмяРеквизитаФормы].Доступность = Ложь;
					КонецПопытки;
					
				КонецЦикла;
				
				// Проверяем реквизиты формы
				Отбор = Новый Структура;    				
				Отбор.Вставить("ИмяРеквизитаОбъекта", Результат.ИмяРеквизита);
				
				НайденныеСтрокиСоответствий = ТаблицаСоответствийРеквизитовФормыиРеквизитовОбъектов.НайтиСтроки(Отбор);
				
				Для Каждого Строка Из НайденныеСтрокиСоответствий Цикл 
					
					Попытка
						Элементы[Строка.ИмяРеквизитаФормы].ТолькоПросмотр = Истина;
					Исключение
						Элементы[Строка.ИмяРеквизитаФормы].Доступность = Ложь;
					КонецПопытки;
					
				КонецЦикла; 
				
				// Проверяем реквизиты формы  
				Если ОсновнойРеквизитФормы <> "Объект" Тогда   
					
					Отбор = Новый Структура;    				
					Отбор.Вставить("ИмяРеквизитаОбъекта", ОсновнойРеквизитФормы + Результат.ИмяРеквизита);
					
					НайденныеСтрокиСоответствий = ТаблицаСоответствийРеквизитовФормыиРеквизитовОбъектов.НайтиСтроки(Отбор);
					
					Для Каждого Строка Из НайденныеСтрокиСоответствий Цикл 
						
						Попытка
							Элементы[Строка.ИмяРеквизитаФормы].ТолькоПросмотр = Истина;
						Исключение
							Элементы[Строка.ИмяРеквизитаФормы].Доступность = Ложь;
						КонецПопытки;
						
					КонецЦикла;  
					
				КонецЕсли;
			
			КонецЦикла;	
			
		КонецЕсли;  
		
	КонецЕсли;    
	
	// НАЧАЛО Юдина Екатерина 03.03.2026 Выполнение задач №000056915
	ИмяРеквизитаЯвляетсяОбъектомЦБ = "";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("тн_ЯвляетсяОбъектомЦБ", Ссылка.Метаданные()) Тогда
		ИмяРеквизитаЯвляетсяОбъектомЦБ = "тн_ЯвляетсяОбъектомЦБ";
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("тн_ЯвляетсяОбъектомЦБ", Ссылка.Метаданные()) Тогда 
		ИмяРеквизитаЯвляетсяОбъектомЦБ = "ЯвляетсяОбъектомЦБ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяРеквизитаЯвляетсяОбъектомЦБ) Тогда
		Попытка
			Форма.Элементы[ИмяРеквизитаЯвляетсяОбъектомЦБ].ТолькоПросмотр = Истина; 
		Исключение
		КонецПопытки;
	КонецЕсли;	
    // КОНЕЦ Юдина Екатерина 03.03.2026 Выполнение задач №000056915
	
КонецПроцедуры

// Юдина Екатерина 04.12.2025 Выполнение задач №000056034
#КонецОбласти 

//Князева Анна 23.06.2025 Выполнение задач №000054185
#Область ОбновлениеНезависимыхРегистровСведений

&НаСервере
//Князева Анна 23.06.2025 Выполнение задач №000054185  
// Перезаполняет наборы записей исправленными данными и записывает их.
// Запись выполняется построчно.
//
// Параметры:
// МенеджерРегистра - Регистр<Сведений,...>Менеджер.<Имя> - менеджер переписываемого регистра
// ТаблицаЗаполнения - таблица значений, поля должны соответствовать полям записи заполняемого регистра;
// обязательно должны присутствовать все измерения и поле Период для периодических регистров
// ТекстЗаголовка - строка, начало сообщения, выводимого в строке состояния
//
// Возвращаемое значение:
// Нет
//
Процедура ПереписатьНаборыЗаписейНезависимогоРегистраИзТаблицы(МенеджерРегистра, ТаблицаЗаполнения, ТекстСообщения, Режим) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ВсегоЗаписей = ТаблицаЗаполнения.Количество();
		Номер = 1;
		Состояние(ТекстСообщения + ": обработано 0 из " + ВсегоЗаписей);
	#КонецЕсли
	
	
	Для Каждого СтрокаЗаполнения Из ТаблицаЗаполнения Цикл
		
		НаборЗаписей = МенеджерРегистра.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
			ЭлементОтбора.Установить(СтрокаЗаполнения[ЭлементОтбора.Имя])
		КонецЦикла;
		
		ЕСли Режим <> "Удаление" Тогда
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаЗаполнения);
		КонецЕСли;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если Номер % 30 = 0 Тогда
				Состояние(ТекстСообщения + ": обработано " + Номер + " из " + ВсегоЗаписей);
			КонецЕсли;
			Номер = Номер + 1;
		#КонецЕсли
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Состояние(ТекстСообщения + ": обработано " + ВсегоЗаписей + " из " + ВсегоЗаписей);
	#КонецЕсли
	
КонецПроцедуры

//Князева Анна 23.06.2025 Выполнение задач №000054185 
//
&НаСервере
Процедура ПереписатьНаборыЗаписейНезависимогоРегистра(МенеджерРегистра, Запрос, ТекстЗаголовка, Режим) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТекстСообщения = ТекстЗаголовка;
		Состояние(ТекстСообщения + ": подготовка данных ...");
	#КонецЕсли 
	
	ПереписатьНаборыЗаписейНезависимогоРегистраИзТаблицы(МенеджерРегистра, Запрос.Выполнить().Выгрузить(), ТекстЗаголовка, Режим)
	
КонецПроцедуры

//Князева Анна 23.06.2025 Выполнение задач №000054185
#КонецОбласти

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
#Область Подключаемый_ПриказНаКомиссию

#Область ПриказНаКомиссию_Встраивание 

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425 
//
// Выполняет настройку формы при создании на сервере:
// добавляет реквизиты, элементы управления и страницу с составом комиссии
//
// Параметры:
//	Форма        	- ФормаКлиентскогоПриложения - Форма, в которую добавляются элементы,
//	ЭлементГруппы 	- ГруппаФормы  - Родительская группа, в которую помещается поле ввода приказа,
//	ЭлементСтраница - ГруппаФормы  - Страница, на которую следует поместить таблицу комиссии.
//					  Если не указана, создается новая группа страниц
//
Процедура ПриказНаКомиссиюПриСозданииНаСервере(Форма, ЭлементГруппы, ЭлементСтраница = Неопределено) Экспорт
	
	// Инициализация переменных
	СтруктураИмен = ПриказНаКомиссиюПолучитьИменаРеквизитов();
	
	ИмяРеквизита = СтруктураИмен.ИмяРеквизита;
	ИмяТЧ = СтруктураИмен.ИмяТЧ;
	ИмяСтраницаТЧ = СтруктураИмен.ИмяСтраницаТЧ;
	
	Элементы = Форма.Элементы; 
	Объект = Форма.Объект;
	
	ТаблицаКомиссии = ПриказНаКомиссиюПолучитьТаблицу(Объект[ИмяРеквизита]);
	КолСтрокТаблицы = ТаблицаКомиссии.Количество();
	
	// Создание реквизитов формы для хранения таблицы комиссии
	ДобавляемыеРеквизиты = Новый Массив;
		
	РеквизитФормы = Новый РеквизитФормы(ИмяТЧ, Новый ОписаниеТипов("ТаблицаЗначений"));	
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы); 
	
	Для Каждого Колонка Из ТаблицаКомиссии.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		
		РеквизитФормы = Новый РеквизитФормы(ИмяКолонки, Колонка.ТипЗначения, ИмяТЧ, Колонка.Заголовок); 
			
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);	
	КонецЦикла;
			
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);		
	Форма[ИмяТЧ].Загрузить(ТаблицаКомиссии);
	
	// Элементы шапки формы
	Если Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
		ПолеФормы 						= Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ЭлементГруппы);
		ПолеФормы.Вид 					= ВидПоляФормы.ПолеВвода;
		ПолеФормы.МаксимальнаяШирина 	= 28;
		ПолеФормы.Заголовок 			= "Приказ на комиссию";
		ПолеФормы.ПутьКДанным 			= СтрШаблон("Объект.%1", ИмяРеквизита);
		ПолеФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииПриказНаКомиссию");
	КонецЕсли;
	
	// Формирование структуры страниц (вкладок) формы
	Если ЭлементСтраница = Неопределено Тогда 
		// Создадим контейнер для вкладок
		Страницы 				= Элементы.Добавить("тн_Страницы", Тип("ГруппаФормы"), Форма); 
		Страницы.Вид 			= ВидГруппыФормы.Страницы; 
		
		// Вкладка "Основное"
		СтраницаФормы 			= Элементы.Добавить("тн_СтраницаОсновное", Тип("ГруппаФормы"), Страницы);
		СтраницаФормы.Заголовок = "Основное";
		СтраницаФормы.Вид 		= ВидГруппыФормы.Страница;
		
		// Перенесем все корневые элементы формы на новую вкладку "Основное"
		ПриказНаКомиссиюПеренестиЭлементыНаСтраницу(Форма, Элементы, СтраницаФормы); 
		
		СтраницаРасположения 	= Страницы;
	Иначе
		СтраницаРасположения 	= ЭлементСтраница; 
	КонецЕсли;
	
	// Создание страницы для ТЧ о сведениях о комиссии
	Если Элементы.Найти(ИмяСтраницаТЧ) = Неопределено Тогда
		СтраницаФормы 			= Элементы.Добавить(ИмяСтраницаТЧ, Тип("ГруппаФормы"), СтраницаРасположения);
		СтраницаФормы.Заголовок = ПриказНаКомиссиюПолучитьЗаголовокСтраницы(КолСтрокТаблицы);
		СтраницаФормы.Вид 		= ВидГруппыФормы.Страница; 				
	КонецЕсли;
	
	// Элементы ТЧ 
	Если Элементы.Найти(ИмяТЧ) = Неопределено Тогда	
		
		ЭлементТаблица 						= Элементы.Добавить(ИмяТЧ, Тип("ТаблицаФормы"), Элементы[ИмяСтраницаТЧ]);
		ЭлементТаблица.ПутьКДанным			= ИмяТЧ;
		ЭлементТаблица.ТолькоПросмотр		= Истина;
		
		Для Каждого Колонка Из ТаблицаКомиссии.Колонки Цикл
			ИмяКолонки = Колонка.Имя;
			
			ЭлементКолонка				= Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ЭлементТаблица);  
			ЭлементКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
			ЭлементКолонка.ПутьКДанным 	= СтрШаблон("%1.%2", ИмяТЧ, ИмяКолонки);
			ЭлементКолонка.Заголовок	= Колонка.Заголовок;  
		КонецЦикла;
						
	КонецЕсли;
	
КонецПроцедуры

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
Процедура ПриИзмененииПриказНаКомиссиюНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы; 
	Объект = Форма.Объект;	
	
	СтруктураИмен 	= ПриказНаКомиссиюПолучитьИменаРеквизитов();		
	ТаблицаКомиссии = ПриказНаКомиссиюПолучитьТаблицу(Объект[СтруктураИмен.ИмяРеквизита]);
	КолСтрокТаблицы = ТаблицаКомиссии.Количество();
	
	Форма[СтруктураИмен.ИмяТЧ].Загрузить(ТаблицаКомиссии);
	
	Если Элементы.Найти(СтруктураИмен.ИмяСтраницаТЧ) <> Неопределено Тогда		
		Элементы[СтруктураИмен.ИмяСтраницаТЧ].Заголовок	= ПриказНаКомиссиюПолучитьЗаголовокСтраницы(КолСтрокТаблицы);
	КонецЕсли;  
	
КонецПроцедуры 

#КонецОбласти  

#Область ПриказНаКомиссию_Печать

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
//
// Формирует и выводит блок подписей членов комиссии в табличный документ.
// Выводит председателя комиссии, членов комиссии, а также пустые строки для подписей в соответствии с минимальным количеством
//
// Параметры:
//	Приказ - ДокументСсылка.тн_ПриказНаКомиссиюПоИнвентаризации - Ссылка на документ приказа
//	ТабличныйДокумент - ТабличныйДокумент - Табличный документ, в который выводится печатная форма.
//	ОбластьПодпись - ОбластьЯчеекТабличногоДокумента - Область макета для вывода подписи одного лица.
//	ДопПараметры - Структура - Необязательный. Содержит дополнительные настройки:
//					- ПредседательКомиссии - Строка - Заголовок для председателя.
//					- НеВыводитьЗаголовокЧленыКомиссии - Булево - Признак скрытия заголовка "Члены комиссии".
//					- МинКоличествоПодписей - Число - Минимальное количество строк подписей (по умолчанию 3).
//					- СоответствияПараметров - Структура - Соответствие имен параметров макета.
//
Процедура ПриказНаКомиссиюВыводЧленовКомиссииНаПечать(Приказ, ТабличныйДокумент, ОбластьПодпись, ДопПараметры = Неопределено) Экспорт
	
	ЕстьДопНастройки = ТипЗнч(ДопПараметры) = Тип("Структура");
	
	// Варианты заголовков разделов с подписями печатной формы	
	ЗаголовокРазделаПодписей = Новый Структура();
	Если ЕстьДопНастройки И ДопПараметры.Свойство("ПредседательКомиссии") Тогда
		ЗаголовокРазделаПодписей.Вставить("ПредседательКомиссии", ДопПараметры.ПредседательКомиссии);
	Иначе
		ЗаголовокРазделаПодписей.Вставить("ПредседательКомиссии", НСтр("ru = 'Председатель комиссии';
			|en = 'Commission chairperson'")); 
	КонецЕсли;
	
	Если ЕстьДопНастройки И ДопПараметры.Свойство("НеВыводитьЗаголовокЧленыКомиссии") Тогда 
		ЗаголовокРазделаПодписей.Вставить("ЧленыКомиссии",		  "");
	Иначе
		ЗаголовокРазделаПодписей.Вставить("ЧленыКомиссии",        НСтр("ru = 'Члены комиссии';
			|en = 'Commission members'"));	
	КонецЕсли;
	
	МинКоличествоПодписей = 3; // По умолчанию
	Если ЕстьДопНастройки И ДопПараметры.Свойство("МинКоличествоПодписей") Тогда
		МинКоличествоПодписей = ДопПараметры.МинКоличествоПодписей;
	КонецЕсли;  
	
	// Имена параметров области
	СоответствияПараметров = Новый Структура;
	СоответствияПараметров.Вставить("ФИО", "РасшифровкаПодписи");
	СоответствияПараметров.Вставить("Должность", "Должность");
	СоответствияПараметров.Вставить("ЗаголовокРазделаПодписей", "ЗаголовокРазделаПодписей");
	
	Если ЕстьДопНастройки И ДопПараметры.Свойство("СоответствияПараметров") Тогда
		Для Каждого Параметр Из ДопПараметры.СоответствияПараметров	Цикл
			СоответствияПараметров[Параметр.Ключ] = Параметр.Значение;		
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧленыПриказаНаКомиссию.ФИО.Представление КАК ФИО,
	|	ЧленыПриказаНаКомиссию.Должность.Представление КАК Должность,
	|	ЧленыПриказаНаКомиссию.СтепеньЧленства = ЗНАЧЕНИЕ(Перечисление.тн_СтепеньЧленстваВКомиссии.Председатель) КАК Председатель
	|ИЗ
	|	Документ.тн_ПриказНаКомиссиюПоИнвентаризации.ЧленыКомиссии КАК ЧленыПриказаНаКомиссию
	|ГДЕ
	|	ЧленыПриказаНаКомиссию.Ссылка = &Приказ";
	
	Запрос.УстановитьПараметр("Приказ", Приказ);
	
	ТаблицаИнвентаризационнаяКомиссия = Запрос.Выполнить().Выгрузить();
	
	// Выведем подпись председателя инвентаризационной комиссии		
	ПредседательКомиссии = ТаблицаИнвентаризационнаяКомиссия.Найти(Истина, "Председатель");
	
	Если ПредседательКомиссии <> Неопределено И ПредседательКомиссии.Председатель Тогда
				
		ОбластьПодпись.Параметры[СоответствияПараметров.ЗаголовокРазделаПодписей] 	= ЗаголовокРазделаПодписей.ПредседательКомиссии;
		ОбластьПодпись.Параметры[СоответствияПараметров.Должность]                	= ПредседательКомиссии.Должность;
		ОбластьПодпись.Параметры[СоответствияПараметров.ФИО]       					= ПредседательКомиссии.ФИО;
		
	Иначе
		
		ОбластьПодпись.Параметры[СоответствияПараметров.ЗаголовокРазделаПодписей] 	= ЗаголовокРазделаПодписей.ПредседательКомиссии;
		ОбластьПодпись.Параметры[СоответствияПараметров.Должность]                	= "";
		ОбластьПодпись.Параметры[СоответствияПараметров.ФИО]       					= "";
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодпись);
	
	// Выведем подписи членов комиссии
	ВыводитьЗаголовок = Истина;
	
	КоличествоЧленовКомиссии = 0;
	
	// Сначала выведем членов комиссии из выборки
	Для каждого ЧленКомиссии Из ТаблицаИнвентаризационнаяКомиссия Цикл
		
		Если ЧленКомиссии.Председатель Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ОбластьПодпись) Тогда
			
			// Выведем разрыв страницы
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
		КонецЕсли;
		
		КоличествоЧленовКомиссии = КоличествоЧленовКомиссии + 1;
		
		ОбластьПодпись.Параметры[СоответствияПараметров.ЗаголовокРазделаПодписей] 	= ?(ВыводитьЗаголовок, ЗаголовокРазделаПодписей.ЧленыКомиссии, "");
		ОбластьПодпись.Параметры[СоответствияПараметров.Должность]                	= ЧленКомиссии.Должность;
		ОбластьПодпись.Параметры[СоответствияПараметров.ФИО]       					= ЧленКомиссии.ФИО;
		
		ТабличныйДокумент.Вывести(ОбластьПодпись);
		
		ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
		
	КонецЦикла;
	
	// Затем выведем пустые места для подписей, как в форме, утвержденной Госкомстатом.
	Если КоличествоЧленовКомиссии < МинКоличествоПодписей Тогда
		
		Если НЕ ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ОбластьПодпись) Тогда
			
			// Выведем разрыв страницы
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
		КонецЕсли;
		
		Для Итератор = КоличествоЧленовКомиссии + 1 По МинКоличествоПодписей Цикл
			
			ОбластьПодпись.Параметры[СоответствияПараметров.ЗаголовокРазделаПодписей] 	= ?(ВыводитьЗаголовок, ЗаголовокРазделаПодписей.ЧленыКомиссии, "");
			ОбластьПодпись.Параметры[СоответствияПараметров.Должность]                	= "";
			ОбластьПодпись.Параметры[СоответствияПараметров.ФИО]       					= "";
			
			ТабличныйДокумент.Вывести(ОбластьПодпись);
			
			ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
			
		КонецЦикла;
		
	КонецЕсли; 
		
КонецПроцедуры

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425 
//
// Определяет, требуется ли печать приказа на комиссию для указанного документа.
//
// Параметры:
//	СсылкаДок - ДокументСсылка - Ссылка на документ.
//
// Возвращаемое значение:
//	Структура:
//	 - ТребуетсяПечать - Булево - Истина, если приказ заполнен.
//	 - Приказ - ДокументСсылка.тн_ПриказНаКомиссиюПоИнвентаризации - Ссылка на приказ.
//
Функция ТребуетсяПечатьСПриказа(СсылкаДок) Экспорт	
	
	ИменаРеквизитов = ПриказНаКомиссиюПолучитьИменаРеквизитов();
	Приказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДок, ИменаРеквизитов.ИмяРеквизита);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТребуетсяПечать", ЗначениеЗаполнено(Приказ));
	СтруктураВозврата.Вставить("Приказ", Приказ);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область ПриказНаКомиссию_СлужебныеПроцедурыФункции
  
// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
Функция ПриказНаКомиссиюПолучитьЗаголовокСтраницы(КолСтрокТаблицы)
	Если КолСтрокТаблицы = 0 Тогда
		ЗаголовокСтраницы = "Инвентаризационная комиссия по приказу";
	Иначе
		ЗаголовокСтраницы = СтрШаблон("Инвентаризационная комиссия по приказу (%1)", КолСтрокТаблицы);
	КонецЕсли; 
	
	Возврат ЗаголовокСтраницы; 
КонецФункции

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
Функция ПриказНаКомиссиюПолучитьТаблицу(ПриказНаКомиссию)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧленыКомиссии.ФИО КАК ФИО,
		|	ЧленыКомиссии.СтепеньЧленства КАК СтепеньЧленства,
		|	ЧленыКомиссии.Должность КАК Должность
		|ИЗ
		|	Документ.тн_ПриказНаКомиссиюПоИнвентаризации.ЧленыКомиссии КАК ЧленыКомиссии
		|ГДЕ
		|	ЧленыКомиссии.Ссылка = &ПриказНаКомиссию";
	
	Запрос.УстановитьПараметр("ПриказНаКомиссию", ПриказНаКомиссию);
	
	ТаблицаКомиссии = Запрос.Выполнить().Выгрузить();
	
	Колонка = ТаблицаКомиссии.Колонки.Найти("СтепеньЧленства");
	Если Колонка <> Неопределено Тогда
		Колонка.Заголовок = "Степень членства";
	КонецЕсли;
	
	Возврат ТаблицаКомиссии;
	
КонецФункции

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
Функция ПриказНаКомиссиюПолучитьИменаРеквизитов() Экспорт
	
	СтруктураИмен = Новый Структура();
	СтруктураИмен.Вставить("ИмяРеквизита", "тн_ПриказНаКомиссиюПоИнвентаризации");
	СтруктураИмен.Вставить("ИмяТЧ", "тн_СведенияПриказаНаКомиссию"); 
	СтруктураИмен.Вставить("ИмяСтраницаТЧ", "тн_СтраницаСведенияПриказаНаКомиссию");
	
	Возврат СтруктураИмен;
	
КонецФункции   

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
Процедура ПриказНаКомиссиюПеренестиЭлементыНаСтраницу(Форма, Элементы, СтраницаФормы)
	
	// 1. Создаем массив для безопасного перебора
	МассивЭлементов = Новый Массив;
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ЭлементФормы.Родитель = Форма Тогда // Только те, что в корне формы
			МассивЭлементов.Добавить(ЭлементФормы);
		КонецЕсли;
	КонецЦикла;   
	
	// 2. Переносим Элементы на новую страницу
	Для Каждого ЭлементФормы Из МассивЭлементов Цикл 
		ПропускЭлемента = ЭлементФормы.Имя = "тн_Страницы" Или
			ЭлементФормы.Имя = "тн_СтраницаОсновное";			
		
		Если ПропускЭлемента Тогда
			Продолжить;		
		КонецЕсли;     
		
		// Меняем родителя
		ОбщегоНазначенияБЭД.ПереместитьЭлемент(Элементы, ЭлементФормы.Имя, СтраницаФормы.Имя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Белоконенко Денис 28.01.2026 Выполнение задач №000056425
#КонецОбласти