//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПринятыеВПереработку2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движения товаров, принятых в переработку, по операциям.
									|Сколько было принято, произведено, израсходовано, передано, списано, выкуплено?
									|Сколько необходимо списать, выкупить?
									|По каким позициям необходимо оформить отчеты давальцу?';
									|en = 'Analyze transfers of goods received for subcontracting by operations.
									|Check how many goods were received, produced, spent, transferred, adjusted, and redeemed.
									|Check how many goods you need to adjust and redeem.
									|Specify items to register ""Consumption reports — Subcontracting services delivered"".'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПринятыеВПереработку");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движения товаров, принятых в переработку, по операциям.
									|Сколько было принято, произведено, израсходовано, передано, списано, выкуплено?
									|Сколько необходимо списать, выкупить?
									|По каким позициям необходимо оформить отчеты давальцу?';
									|en = 'Analyze transfers of goods received for subcontracting by operations.
									|Check how many goods were received, produced, spent, transferred, adjusted, and redeemed.
									|Check how many goods you need to adjust and redeem.
									|Specify items to register ""Consumption reports — Subcontracting services delivered"".'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
