  
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодготовитьФормуНаСервере(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда	
		ПодготовитьФормуНаСервере(ЭтаФорма);	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	КэшируемыеЗначения.Вставить("КлючевыеСубконто",	МСФОКлиентСерверУХ.КлючевыеСубконтоСчета(Объект.Счет));
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПодготовитьФормуНаСервере(Форма)
	
	Форма.КэшируемыеЗначения = Новый Структура;	
	Форма.КэшируемыеЗначения.Вставить("ИменаСубконто", 		Справочники.ФиксированныеСчетаУчетаБД.ПолучитьИменаСубконто());	
	Форма.КэшируемыеЗначения.Вставить("КлючевыеСубконто",	МСФОКлиентСерверУХ.КлючевыеСубконтоСчета(Форма.Объект.Счет));
	
	ПараметрыВыбораИсточник = Новый Массив;
	ПараметрыВыбораИсточник.Добавить(Новый ПараметрВыбора("Владелец", Форма.Объект.ПланСчетовБД));
	ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораИсточник);	
	
	Для каждого ИмяСчета Из Форма.КэшируемыеЗначения.ИменаСубконто Цикл
		Форма.Элементы[ИмяСчета.Ключ].ПараметрыВыбора = ПараметрыВыбора;
		МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(Форма, ИмяСчета.Ключ);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
