//////////////////////////////////////////////////////////////////
// Copyright (c) 21.11.2021 Варгасов Д.О. dovargasov@gmail.com  //
////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс

Процедура ПроверитьПоказатьУведомления() Экспорт 
		
	ПодключитьОбработчикОжидания("ПроверитьУведомления", 20, Истина);
	
КонецПроцедуры  

Процедура ОткрытьУведмоление(Уведомление) Экспорт
		
	СписокУведомлений = Новый Массив;   
	СписокУведомлений.Добавить(Уведомление);
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("СписокУведомлений", СписокУведомлений);
	
	ОткрытьФорму("ОбщаяФорма.ТН_ФормаУведомлений", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

Процедура ОбработатьПараметрЗапуска() Экспорт

	#Если НЕ ВебКлиент Тогда
		
	ПозицияПараметраУведомления = СтрНайти(ПараметрЗапуска, "addNotification");
	Если ПозицияПараметраУведомления > 0 Тогда
		
		НачальнаяПозиция = СтрНайти(ПараметрЗапуска, "##",, ПозицияПараметраУведомления) + 2;
		КонечнаяПозиция = СтрНайти(ПараметрЗапуска, "##",, НачальнаяПозиция);
		
		ЗначениеПараметра = "";
		Если НачальнаяПозиция <> 0 И КонечнаяПозиция <> 0 Тогда
			ЗначениеПараметра = Сред(ПараметрЗапуска, НачальнаяПозиция, КонечнаяПозиция - НачальнаяПозиция);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, "¶", Символы.ПС);
		
		Попытка
			Данные = ДесериализоватьJSON(ЗначениеПараметра);
		Исключение
			Данные = Новый Структура;
		КонецПопытки;
		
		ТекстУведомления = "";
		СрокУведомления = Дата(1,1,1);
		
		Если Данные.Свойство("Текст") Тогда
			ТекстУведомления = Данные["Текст"];
		КонецЕсли;
		Если Данные.Свойство("Срок")Тогда
			СрокУведомления = XMLЗначение(Тип("Дата"), Данные["Срок"]);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстУведомления) Тогда				
			ТН_РаботаСУведомлениями.СоздатьИДобавитьУведомление(ТекстУведомления, СрокУведомления);								
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

#Если НЕ ВебКлиент Тогда
	
Функция ДесериализоватьJSON(Значение)
     
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);

   	Возврат ПрочитатьJSON(ЧтениеJSON);
		
КонецФункции

#КонецЕсли

#КонецОбласти