
#Область СлужебныйПрограммныйИнтерфейс


#Область СтандартныеПодсистемы

#Область Команды
	
Процедура ДобавитьКомандыСозданияНаОсновании(Менеджер, КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Если Менеджер = Документы.ОперативныйПлан 
		ИЛИ Менеджер = Документы.Резервирование Тогда
		// ЗНО
		Команда = ОперативноеПланированиеКонтроль.ДобавитьКоманду_ЗаявкуНаОплату(КомандыСозданияНаОсновании);
		Если Команда <> неопределено Тогда
			Команда.Порядок = 30;
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
				Команда,
				"ВидБюджета",
				ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств);
		КонецЕсли;
		
		// ОПДС
		Команда = ОперативноеПланированиеКонтроль.ДобавитьКоманду_ОжидаемуюОплату(КомандыСозданияНаОсновании);
		Если Команда <> неопределено Тогда
			Команда.Порядок = 40;
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
				Команда,
				"ВидБюджета",
				ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств);
		КонецЕсли;
		
		// Заявка на расход
		Команда = ОперативноеПланированиеКонтроль.ДобавитьКоманду_ЗаявкуНаРасход(КомандыСозданияНаОсновании);
		Если Команда <> неопределено Тогда
			Команда.Порядок = 30;
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
				Команда,
				"ВидБюджета",
				ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов);
		КонецЕсли;
		
		// Планируемый доход
		Команда = ОперативноеПланированиеКонтроль.ДобавитьКоманду_ПланируемыйДоход(КомандыСозданияНаОсновании);
		Если Команда <> неопределено Тогда
			Команда.Порядок = 40;
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
				Команда,
				"ВидБюджета",
				ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#Область ОбменПолный

// Процедура-обработчик события "ПередЗаписью" ссылочных типов данных (кроме документов) для механизма регистрации объектов на узлах.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события, кроме типа ДокументОбъект
//  Отказ          - Булево - флаг отказа от выполнения обработчика.
// 
Процедура ОбменДаннымиПолныйПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытияУТУП.ОбменДаннымиПолныйПередЗаписью(Источник, Отказ);
КонецПроцедуры

// Процедура-обработчик события "ПередЗаписью" документов для механизма регистрации объектов на узлах.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - ДокументОбъект - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика.
// 
Процедура ОбменДаннымиПолныйПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытияУТУП.ОбменДаннымиПолныйПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

// Процедура-обработчик события "ПередЗаписью" константы для механизма регистрации объектов на узлах.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - КонстантаМенеджерЗначения - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика.
// 
Процедура ОбменДаннымиПолныйПередЗаписьюКонстанты(Источник, Отказ) Экспорт
	ОбменДаннымиСобытияУТУП.ОбменДаннымиПолныйПередЗаписьюКонстанты(Источник, Отказ);
КонецПроцедуры

// Процедура-обработчик события "ПередЗаписью" регистров для механизма регистрации объектов на узлах.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - НаборЗаписейРегистра - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика
//  Замещение      - Булево - признак замещения существующего набора записей.
// 
Процедура ОбменДаннымиПолныйПередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытияУТУП.ОбменДаннымиПолныйПередЗаписьюРегистра(Источник, Отказ, Замещение);
КонецПроцедуры

// Процедура-обработчик события "ПередУдалением" ссылочных типов данных для механизма регистрации объектов на узлах.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика.
// 
Процедура ОбменДаннымиПолныйПередУдалением(Источник, Отказ) Экспорт

	ОбменДаннымиСобытияУТУП.ОбменДаннымиПолныйПередУдалением(Источник, Отказ);

КонецПроцедуры

#КонецОбласти 

Функция ПлатежиДоговораПоГрафику(Договор) Экспорт

	Если Не ЗначениеЗаполнено(Договор) Или ТипЗнч(Договор) <> Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ИспользоватьГрафикРасчетов");

КонецФункции

Функция ПараметрыЦентрализованныхЗакупок() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Использовать", Истина);
	Результат.Вставить("Периодичность", Константы.ПериодичностьЦентрализованныхЗакупок.Получить());
	Результат.Вставить("ИспользоватьХарактеристикиНоменклатуры", ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры"));
	Возврат Результат;
КонецФункции

#Область ОМ_ОбщегоНазначенияУХ

Функция глОтносительныйПериодПоДате(ДатаНачала, Периодичность, Смещение, ТихийРежим = Ложь, Реструктурировать = Истина) Экспорт
	Возврат КэшируемыеПроцедурыУХ.глОтносительныйПериодПоДате(ДатаНачала, Периодичность, Смещение, ТихийРежим, Реструктурировать);
КонецФункции

#КонецОбласти 

#Область ОМ_УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ

Функция ХарактеристикиИспользуются(Номенклатура) Экспорт
	Возврат УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ХарактеристикиИспользуются(Номенклатура);
КонецФункции


#КонецОбласти 

#Область ОМ_ДоговорыКонтрагентовВстраиваниеУХ

Процедура УстановитьНедоступныеВидыДоговоров(Исключения) Экспорт

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	Если Не ИспользоватьДоговорыСКлиентами Тогда
		
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СПокупателем);
		
	КонецЕсли;
	Если НЕ ИспользоватьДоговорыСКлиентами Или Не ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах") Тогда
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СКомиссионером);
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СКомиссионеромНаЗакупку);
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоИзДавальческогоСырья") Тогда
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СДавальцем);
	КонецЕсли;
	
	ИспользоватьДоговорыСПоставщиками = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками");
	
	Если Не ИспользоватьДоговорыСПоставщиками Тогда
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СПоставщиком);
	КонецЕсли;
	
	Если Не ИспользоватьДоговорыСПоставщиками Или Не ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриЗакупках") Тогда
		
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СКомитентом);
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СКомитентомНаЗакупку);
		
	КонецЕсли;
	Если Не ИспользоватьДоговорыСПоставщиками Или Не ПолучитьФункциональнуюОпцию("ИспользоватьИмпортныеЗакупки") Тогда
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.Импорт);
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ВвозИзЕАЭС);
	КонецЕсли;
	Если Не ИспользоватьДоговорыСПоставщиками Или Не  ПолучитьФункциональнуюОпцию("ИспользоватьОтветственноеХранениеВПроцессеЗакупки") Тогда
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СПоклажедателем);
	КонецЕсли;
		
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоНаСтороне") Тогда
		Исключения.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.СПереработчиком);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

Функция ДоговорСПорядкомРасчетов(Договор) Экспорт
	
	Возврат ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями");
	
КонецФункции

Функция ВестиРасчетыПоЗаказам(Договор) Экспорт
	
	Если НЕ ДоговорСПорядкомРасчетов(Договор) Тогда
		Возврат Ложь;
	КонецЕсли;
 
	ПорядокРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокРасчетов");
	Возврат ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным 
		ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
	
КонецФункции

#Область ОМ_ДоговорыСКонтрагентами

Функция ПараметрыРасчетовДоговоров(Договоры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокДоговоров", 	Договоры);
	Запрос.УстановитьПараметр("Рубли", 				ОбщегоНазначенияПовтИспУХ.ПолучитьВалютуРегламентированногоУчета());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.ОсновнаяВалютаПлатежей КАК ВалютаПлатежа, 
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов <> ДоговорыКонтрагентов.ОсновнаяВалютаПлатежей
	|				И ДоговорыКонтрагентов.ОсновнаяВалютаПлатежей = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов <> ДоговорыКонтрагентов.ОсновнаяВалютаПлатежей
	|				И ДоговорыКонтрагентов.ОсновнаяВалютаПлатежей <> ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВУсловныхЕдиницахВалюта
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов,
	|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка В(&СписокДоговоров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|ГДЕ
	|	ДоговорыКредитовИДепозитов.Ссылка В(&СписокДоговоров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыМеждуОрганизациями.Ссылка,
	|	ДоговорыМеждуОрганизациями.ВалютаВзаиморасчетов,
	|	ДоговорыМеждуОрганизациями.ВалютаВзаиморасчетов,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями
	|ГДЕ
	|	ДоговорыМеждуОрганизациями.Ссылка В(&СписокДоговоров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыАренды.Ссылка,
	|	ДоговорыАренды.ВалютаВзаиморасчетов,
	|	ДоговорыАренды.ВалютаВзаиморасчетов,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ДоговорыАренды КАК ДоговорыАренды
	|ГДЕ
	|	ДоговорыАренды.Ссылка В(&СписокДоговоров)";
	Результат = Запрос.Выполнить();
	
	СвойстваДоговоров = Новый Соответствие;
	
	Реквизиты = "ВалютаВзаиморасчетов, ВалютаПлатежа, РасчетыВУсловныхЕдиницах, РасчетыВУсловныхЕдиницахВалюта";
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Данные = Новый Структура(Реквизиты);
		ЗаполнитьЗначенияСвойств(Данные, Выборка);
		СвойстваДоговоров.Вставить(Выборка.Ссылка, Данные);
	КонецЦикла;
	
	Возврат СвойстваДоговоров;
	
КонецФункции

// Функция возвращает по договору: СтатьяБюджета, Аналитика1..6, ЦФО, Проект, ВалютаВзаиморасчетов, ВалютаОплаты,
// РасчетыВУЕ, РасчетыВУЕВалюта
Функция ПолучитьПараметрыПланированияПоДоговору(Договор, ЭтоБДДС) Экспорт

	ТипДоговора = ТипЗнч(Договор);

	Если Договор = Неопределено Тогда
		Возврат Новый Структура;
	КонецЕсли;
   
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("ВалютаВзаиморасчетов");
	ИменаРеквизитов.Вставить("ВалютаПлатежа");
	Если ТипДоговора = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ИменаРеквизитов.ВалютаПлатежа = "ОсновнаяВалютаПлатежей";
		ИменаРеквизитов.Вставить("ЦФО", "ОсновнойЦФО");
		ИменаРеквизитов.Вставить("Проект", "ОсновнойПроект");
		Если ЭтоБДДС Тогда
			ИменаРеквизитов.Вставить("СтатьяБюджета", "СтатьяДвиженияДенежныхСредств");
			ИменаРеквизитов.Вставить("Аналитика1", "АналитикаБДДС1");
			ИменаРеквизитов.Вставить("Аналитика2", "АналитикаБДДС2");
			ИменаРеквизитов.Вставить("Аналитика3", "АналитикаБДДС3");
			ИменаРеквизитов.Вставить("Аналитика4", "АналитикаБДДС4");
			ИменаРеквизитов.Вставить("Аналитика5", "АналитикаБДДС5");
			ИменаРеквизитов.Вставить("Аналитика6", "АналитикаБДДС6");
		Иначе
			ИменаРеквизитов.Вставить("СтатьяБюджета", "ОсновнаяСтатьяИсполнение");
			ИменаРеквизитов.Вставить("Аналитика1", "АналитикаИсполнение1");
			ИменаРеквизитов.Вставить("Аналитика2", "АналитикаИсполнение2");
			ИменаРеквизитов.Вставить("Аналитика3", "АналитикаИсполнение3");
			ИменаРеквизитов.Вставить("Аналитика4", "АналитикаИсполнение4");
			ИменаРеквизитов.Вставить("Аналитика5", "АналитикаИсполнение5");
			ИменаРеквизитов.Вставить("Аналитика6", "АналитикаИсполнение6");
		КонецЕсли;
	Иначе
		ИменаРеквизитов.ВалютаПлатежа = "ВалютаВзаиморасчетов";
	КонецЕсли;
	
	СвойстваДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, ИменаРеквизитов);
	
	Рубли = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	СвойстваДоговора.Вставить("РасчетыВУсловныхЕдиницах", 
		СвойстваДоговора.ВалютаВзаиморасчетов <> Рубли И СвойстваДоговора.ВалютаПлатежа = Рубли);
	СвойстваДоговора.Вставить("РасчетыВУсловныхЕдиницахВалюта", 
		СвойстваДоговора.ВалютаВзаиморасчетов <> Рубли И СвойстваДоговора.ВалютаПлатежа <> Рубли
		И СвойстваДоговора.ВалютаВзаиморасчетов <> СвойстваДоговора.ВалютаПлатежа);
		
	Если ТипДоговора <> Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		СвойстваДоговора.Вставить("ЦФО",			КэшируемыеПроцедурыОПК.ПустойЦФО());
		СвойстваДоговора.Вставить("Проект",			КэшируемыеПроцедурыОПК.ПустойПроект());
		СвойстваДоговора.Вставить("СтатьяБюджета",	неопределено);
		СвойстваДоговора.Вставить("Аналитика1", 	неопределено);
		СвойстваДоговора.Вставить("Аналитика2", 	неопределено);
		СвойстваДоговора.Вставить("Аналитика3", 	неопределено);
		СвойстваДоговора.Вставить("Аналитика4", 	неопределено);
		СвойстваДоговора.Вставить("Аналитика5", 	неопределено);
		СвойстваДоговора.Вставить("Аналитика6", 	неопределено);
	КонецЕсли;
		
	Возврат СвойстваДоговора;
	
КонецФункции

#КонецОбласти 

#Область ОМ_УправлениеСвойствамиОПК

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт

КонецПроцедуры    

#КонецОбласти 

Функция ПодстановкиДляЗапросаНоменклатура(ИмяПодстановки, ИмяПоляНоменлатура) Экспорт
	
	Если ИмяПодстановки = "ХарактеристикиИспользуются" Тогда
		ШаблонПодстановки = 
		"	ВЫБОР
		|		КОГДА %1.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		КОГДА %1.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
		
		Возврат СтрШаблон(ШаблонПодстановки, ИмяПоляНоменлатура);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестное имя подстановки'");
	КонецЕсли;
	
КонецФункции

Функция ПодстановкиДляЗапроса_Организация(ИмяПодстановки, ИмяПоляОрганизация) Экспорт
	
	Если ИмяПодстановки = "ЮрЛица" Тогда
		ШаблонПодстановки = 
		"	%1.ИспользоватьВРегламентированномУчете = ИСТИНА ИЛИ (%1.ИностранныйНалоговыйРезидент = ИСТИНА И %1.ИностраннаяСтруктураБезОбразованияЮрЛица = ИСТИНА) ИЛИ %1.ИностранныйНалоговыйРезидент = ИСТИНА";
		
		Возврат СтрШаблон(ШаблонПодстановки, ИмяПоляОрганизация);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестное имя подстановки'");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЕдиницыИзмеренияНоменклатуры(Номенклатура) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Коэффициент
	|ИЗ               
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмеренияПриемник,
	|	ЕдиницыИзмеренияНоменклатуры.Коэффициент
	|ИЗ
	|	РегистрСведений.НастройкаЗаменыНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
	|ГДЕ
	|	ЕдиницыИзмеренияНоменклатуры.СпособЗамены = ЗНАЧЕНИЕ(Перечисление.СпособыЗаменыНоменклатуры.ПересчетЕдиницыИзмерения)
	|	И ЕдиницыИзмеренияНоменклатуры.НоменклатураИсточник = &Номенклатура";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьУнификатДляНоменклатуры(Номенклатура, Характеристика) Экспорт
	Возврат РегистрыСведений.НастройкаЗаменыНоменклатуры.ПолучитьУнификатДляНоменклатуры(Номенклатура, Характеристика);
КонецФункции

#Область ВызовПроцедурФункцийУХ


#Область ОФД

Процедура ЗаполнитьОФДПоДокументуДвиженияДС(Объект) Экспорт
	ЗаполнитьОФДПоДокументуДвиженияДС_УХ(Объект);
КонецПроцедуры

Процедура ЗаполнитьОФДПоДокументуДвиженияДС_УХ(Объект)
	
	ИсходныйДокумент = Объект.ИсходныйДокумент;
	ТипИсходныйДокумент = ТипЗнч(ИсходныйДокумент);
	
	ЗаполнитьЗначенияСвойств(Объект, ИсходныйДокумент,,"Номер,Ссылка,Проведен,ПометкаУдаления");
	Объект.НомерИсходногоДокумента = ИсходныйДокумент.Номер;
	Объект.ДатаИсходногоДокумента = ИсходныйДокумент.Дата;
	
	Объект.ОтражатьВоВзаиморасчетах = Истина;
	
	Если Метаданные.ОпределяемыеТипы.СписаниеСРасчетногоСчета.Тип.СодержитТип(ТипИсходныйДокумент)
		ИЛИ ТипИсходныйДокумент = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		
		Объект.ПриходРасход=Перечисления.ВидыДвиженийПриходРасход.Расход;
		Объект.НаправлениеВзаиморасчетов = Перечисления.НаправлениеДвиженияВзаиморасчетов.УвеличениеЗадолженности;
		
	ИначеЕсли Метаданные.ОпределяемыеТипы.ПоступлениеНаРасчетныйСчет.Тип.СодержитТип(ТипИсходныйДокумент)
		ИЛИ ТипИсходныйДокумент = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
		Объект.ПриходРасход=Перечисления.ВидыДвиженийПриходРасход.Приход;
		Объект.НаправлениеВзаиморасчетов = Перечисления.НаправлениеДвиженияВзаиморасчетов.УменьшениеЗадолженности;
		
	КонецЕсли;
	
	МетаданныеИсходногоОбъекта = ИсходныйДокумент.Метаданные();
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КассаОрганизации", МетаданныеИсходногоОбъекта) Тогда
		Объект.БанковскийСчетКасса = ИсходныйДокумент["КассаОрганизации"];
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетОрганизации", МетаданныеИсходногоОбъекта) Тогда
		Объект.БанковскийСчетКасса = ИсходныйДокумент["СчетОрганизации"];
	КонецЕсли;
	
	ЕстьРасшифровкаПлатежа = ДенежныеСредстваВстраиваниеУХ.ЕстьРасшифровкаПлатежаДокументаДДС(
			ИсходныйДокумент,  ИсходныйДокумент.ВидОперации);
	
	Если ЕстьРасшифровкаПлатежа Тогда
		
		Для Каждого Строка Из ИсходныйДокумент.РасшифровкаПлатежа Цикл
			
			НоваяСтрока = Объект.БюджетДвиженияДенежныхСредств.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
				НоваяСтрока["Аналитика" + Сч] = Строка["АналитикаБДДС" + Сч];
			КонецЦикла;
			
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.ДоговорКонтрагента, "ВалютаВзаиморасчетов,ПорядокРасчетов");
			НоваяСтрока.ВалютаВзаиморасчетов = РеквизитыДоговора.ВалютаВзаиморасчетов;
			Если РеквизитыДоговора.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
				НоваяСтрока.ОбъектРасчетов = НоваяСтрока.ДоговорКонтрагента;
			КонецЕсли;
			
			НоваяСтрока.Сумма = Строка.СуммаПлатежа;
			Если НоваяСтрока.СуммаВзаиморасчетов = 0 Тогда
				НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.Сумма;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Объект.БюджетДвиженияДенежныхСредств.Количество() Тогда
		
		НоваяСтрока = Объект.БюджетДвиженияДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходныйДокумент);
		Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
			НоваяСтрока["Аналитика" + Сч] = ИсходныйДокумент["АналитикаБДДС" + Сч];
		КонецЦикла;
		НоваяСтрока.Сумма = ИсходныйДокумент.СуммаДокумента;
		НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.Сумма;
		НоваяСтрока.ВалютаВзаиморасчетов = Объект.ВалютаДокумента;
		
	КонецЕсли;
	
	// Взаиморасчеты
	Если Объект.ОтражатьВоВзаиморасчетах Тогда
		
		Если ЕстьРасшифровкаПлатежа Тогда
		
			РеквизитыДоговоров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
				ИсходныйДокумент.РасшифровкаПлатежа.ВыгрузитьКолонку("ДоговорКонтрагента"),
				"ВалютаВзаиморасчетов,ПорядокРасчетов"
			);
			
			Для Каждого СтрокаРасшифровка Из ИсходныйДокумент.РасшифровкаПлатежа Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаРасшифровка.ДоговорКонтрагента) Тогда
					Продолжить;
				КонецЕсли;
				
				Строка = Объект.Взаиморасчеты.Добавить();
				
				Строка.СтатьяБюджета = СтрокаРасшифровка.СтатьяДвиженияДенежныхСредств;
				Строка.ДоговорКонтрагента = СтрокаРасшифровка.ДоговорКонтрагента;
				Строка.СуммаВзаиморасчетов = СтрокаРасшифровка.СуммаВзаиморасчетов;
				
				РеквизитыДоговора = РеквизитыДоговоров[СтрокаРасшифровка.ДоговорКонтрагента];
				Если РеквизитыДоговора <> неопределено Тогда
					Строка.ВалютаВзаиморасчетов = РеквизитыДоговора.ВалютаВзаиморасчетов;
					Если РеквизитыДоговора.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
						Строка.ОбъектРасчетов = Строка.ДоговорКонтрагента;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоДокументуДвиженияДС() 

#КонецОбласти

#КонецОбласти

#КонецОбласти
