
// Луконин Е.А. 14.01.2020 Выполнение задач №000033749
#Область ОбработчикиСобытийФормы

// Луконин Е.А. 14.01.2020 Выполнение задач №000033749
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ЗначениеЗаполнено(Элемент.ТекущаяСтрока) Тогда
		УстановитьВидимомостьКомандДляЭлемента(Элемент);
	КонецЕсли;
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

#КонецОбласти

// Луконин Е.А. 14.01.2020 Выполнение задач №000033749
#Область СлужебныеПроцедурыИФункции

// Луконин Е.А. 14.01.2020 Выполнение задач №000033749
&НаКлиенте
Процедура УстановитьВидимомостьКомандДляЭлемента(Элемент) Экспорт 
	
	ЭлементыКоманднойПанели = КоманднаяПанель.ПодчиненныеЭлементы;
	КнопкаФедерализовать    = ЭлементыКоманднойПанели.Найти("ФормаСправочникТН_ПрофилиПодключенийФедерализовать");
	КнопкаРасфедерализовать = ЭлементыКоманднойПанели.Найти("ФормаСправочникТН_ПрофилиПодключенийРасфедерализовать");
	
	Если КнопкаФедерализовать = Неопределено Или КнопкаРасфедерализовать = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЯвляетсяОбъектомЦБ = ПолучитьЗначение_ЯвляетсяОбъектомЦБ(Элемент.ТекущаяСтрока);
	Если ЯвляетсяОбъектомЦБ Тогда 
		КнопкаФедерализовать   .Видимость = Ложь;
		КнопкаРасфедерализовать.Видимость = Истина;
	Иначе 
		КнопкаФедерализовать   .Видимость = Истина;
		КнопкаРасфедерализовать.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимомостьКомандДляЭлемента()

// Луконин Е.А. 14.01.2020 Выполнение задач №000033749
&НаСервере
Функция ПолучитьЗначение_ЯвляетсяОбъектомЦБ(Ссылка)
		
	ЯвляетсяОбъектомЦБ = Ссылка.ЯвляетсяОбъектомЦБ;
	
	Возврат ЯвляетсяОбъектомЦБ;
	
КонецФункции // ПолучитьЗначение_ЯвляетсяОбъектомЦБ()	

#КонецОбласти