#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Проверяет возможность установки объекта СсылкаВход в состояние СостояниеВход.
Функция ПроверитьВозможностьУстановкиСостоянияОбъекта(СсылкаВход, СостояниеВход, ДополнительныеПараметры = Неопределено) Экспорт
	
	РезультатФункции = Истина;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ПроверятьСостояниеЭтапа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПроверятьСостояниеЭтапа", Истина);
	Иначе
		ПроверятьСостояниеЭтапа = Истина;
	КонецЕсли;
	
	Если ПроверятьСостояниеЭтапа
		И ОбщегоНазначенияПовтИспУХ.ИспользуетсяМногопериоднаяОтчетность() Тогда
		// Проверим, не участвует ли документ в процессе подготовки отчетности
		Отказ = Ложь;
		Модуль = ОбщегоНазначения.ОбщийМодуль("УправлениеПроцессамиПодготовкиОтчетности");
		Модуль.ПриЗаписиОбъектаПроцессаПодготовкиОтчетности(СсылкаВход, Отказ);
		Если Отказ Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(СсылкаВход) = Тип("ДокументСсылка.НастраиваемыйОтчет") Тогда
	
		// Проверим, что утверждены правила заполнения и бланки отчётов экземпляра отчёта
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
			НСтр("ru = 'Не удалось перевести документ %1 в состояние %2'"),
			СсылкаВход,
			СостояниеВход);

		ВозможноУстановитьСостояние = РасширениеПроцессыИСогласованиеУХ.ВозможноУстановитьСостояние(СсылкаВход, СостояниеВход, ТекстСообщения);
		Если НЕ ВозможноУстановитьСостояние Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверим, что утверждены правила заполнения ракурсов.
	ВозможноУстановитьСостояние = РасширениеПроцессыИСогласованиеУХ.ПроверитьУтверждениеПравилРакурсов(СсылкаВход, СостояниеВход);
	Если НЕ ВозможноУстановитьСостояние Тогда
		РезультатФункции = Ложь;
	КонецЕсли;
	
	// Проверим правильность заполнения строки плана закупок.
	ВозможноУстановитьСостояние = РасширениеПроцессыИСогласованиеУХ.ПроверитьПравильностьЗаполненияСтрокиПланаЗакупок(СсылкаВход, СостояниеВход);
	Если НЕ ВозможноУстановитьСостояние Тогда
		РезультатФункции = Ложь;
	КонецЕсли;
	
	// Проверим заполнение регистрационного номера в Программе закупок.
	ВозможноУстановитьСостояние = РасширениеПроцессыИСогласованиеУХ.ПроверитьПравильностьЗаполненияПрограммыЗакупок(СсылкаВход, СостояниеВход);
	Если НЕ ВозможноУстановитьСостояние Тогда
		РезультатФункции = Ложь;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецЕсли
