#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		
		МодульНастройкаПрав=ОбщегоНазначения.ОбщийМодуль("НастройкаПравДоступаУХ");	
		МодульНастройкаПрав.НастройкиРазвернутыеПриЗаписи(ЭтотОбъект, "ВидыОтчетов");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись ИЗ ЭтотОбъект Цикл
		Если Запись.Организация=Справочники.Организации.ПустаяСсылка() Тогда
			 Сообщить(Нстр("ru = 'Значение поля ""Организация"" не может быть пустым! Проверьте состав группы доступа по организациям'"));
			 Отказ = Истина;
		КонецЕсли;
		
		Если Запись.ВидОтчета=Справочники.ВидыОтчетов.ПустаяСсылка() Тогда
			 Сообщить(Нстр("ru = 'Значение поля ""Вид отчета"" не может быть пустым! Проверьте состав группы доступа по видам отчетов'"));
			 Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

#КонецЕсли