Функция ПолучитьУникальныйКодСтрокиПоМассиву(Наименование, МассивКодовВход) Экспорт
	
	ДлинаКодаСтроки = Метаданные.Справочники.СтрокиОтчетов.ДлинаКода;
	
	КодСтроки = ОбщегоНазначенияУХ.СформироватьКодНаОснованииНаименования(Наименование,ДлинаКодаСтроки);
	
	Если МассивКодовВход.Найти(КодСтроки) = Неопределено Тогда
		
		Возврат КодСтроки;
		
	Иначе
		РезультатФункции = ОбщегоНазначенияКлиентСерверУХ.ПреобразоватьКодВУникальный(КодСтроки, МассивКодовВход, ДлинаКодаСтроки);
		Возврат РезультатФункции;
	КонецЕсли;	
	
КонецФункции // ПолучитьУникальныйКодСтрокиПоМассиву()
