#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ВидБюджета") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан вид бюджета. Выбор периода невозможен.'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ВидБюджета = Параметры.ВидБюджета;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидБюджета", ВидБюджета);
	
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьВыбор(ДанныеВыбора)
	ОповеститьОВыборе(ДанныеВыбора.Период);
КонецПроцедуры

#КонецОбласти
