#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Включен = Ложь;
	НастройкиВарианта.Описание = НСтр("ru = 'Платежные позиции документа.';
										|en = 'Document payment items.'");
КонецПроцедуры

// Для вызова из процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица команд для вывода в подменю. 
//                                      См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений, Неопределено - добавленная команда или Неопределено, если нет прав на просмотр отчета.
//
Функция ДобавитьКомандуПлатежныеПозицииДокумента(КомандыОтчетов) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.ПлатежныеПозицииДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Платежные позиции документа';
										|en = 'Document payment items'");
	Команда.МножественныйВыбор = Ложь;
	Команда.Важность           = "СмТакже";
	Команда.ИмяПараметраФормы  = "Отбор.Документ";
	Команда.КлючВарианта       = "Основной";
	Команда.ТипПараметра       = Метаданные.ОпределяемыеТипы.ДокументыПлатежнойПозиции.Тип;
	Команда.Менеджер           = "Отчет.ПлатежныеПозицииДокумента";
	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.P, Ложь, Истина, Истина);
	
	Возврат Команда;
КонецФункции

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция ОписаниеТипаПараметраКоманды(Знач КомандыОтчетов, Знач Параметры, Знач ДокументыСОтчетомОДвижениях)
//	
//	Если Не Параметры.Свойство("Источники") Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	СтрокиИсточников = Параметры.Источники.Строки;
//	
//	Если ДокументыСОтчетомОДвижениях <> Неопределено Тогда
//		ОтключитьОтчетОтДокументов(КомандыОтчетов);
//		ДокументыСОтчетом = Новый Соответствие;
//		Для каждого ДокументСОтчетом Из ДокументыСОтчетомОДвижениях Цикл
//			ДокументыСОтчетом[ДокументСОтчетом] = Истина;
//		КонецЦикла;	
//	Иначе	
//		ДокументыСОтчетом = Неопределено;
//	КонецЕсли;
//	
//	ТипыДокументовСДвижениями = Новый Массив;
//	Для Каждого СтрокаИсточника Из СтрокиИсточников Цикл
//		
//		ТипСсылкиДанных = СтрокаИсточника.ТипСсылкиДанных;
//		
//		Если ТипЗнч(ТипСсылкиДанных) = Тип("Тип") Тогда
//			ТипыДокументовСДвижениями.Добавить(ТипСсылкиДанных);
//		ИначеЕсли ТипЗнч(ТипСсылкиДанных) = Тип("ОписаниеТипов") Тогда
//			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыДокументовСДвижениями, ТипСсылкиДанных.Типы());
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	ТипыДокументовСДвижениями = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТипыДокументовСДвижениями);
//	
//	Индекс = ТипыДокументовСДвижениями.Количество() - 1;
//	Пока Индекс >= 0 Цикл
//		Если Не ЭтоПодключаемыйТип(ТипыДокументовСДвижениями[Индекс], ДокументыСОтчетом) Тогда
//			ТипыДокументовСДвижениями.Удалить(Индекс);
//		КонецЕсли;
//		Индекс = Индекс - 1;
//	КонецЦикла;	
//	
//	Возврат ?(ТипыДокументовСДвижениями.Количество() > 0, Новый ОписаниеТипов(ТипыДокументовСДвижениями), Неопределено);
//	
//	Возврат Метаданные.ОпределяемыеТипы.ДокументыПлатежнойПозиции.Тип;
//	
//КонецФункции

//Процедура ОтключитьОтчетОтДокументов(КомандыОтчетов)
//	
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Менеджер", "Отчет.ДвиженияДокумента");
//	НайденныеСтроки = КомандыОтчетов.НайтиСтроки(СтруктураПоиска);
//	
//	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
//		КомандыОтчетов.Удалить(НайденнаяСтрока);
//	КонецЦикла;
//	
//КонецПроцедуры

//Функция ЭтоПодключаемыйТип(ПроверяемыйТип, ДокументыСОтчетомОДвижениях)
//	
//	ОбъектМетаданных = Метаданные.НайтиПоТипу(ПроверяемыйТип);
//	Если ОбъектМетаданных = Неопределено Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если ДокументыСОтчетомОДвижениях <> Неопределено И ДокументыСОтчетомОДвижениях[ОбъектМетаданных] = Неопределено Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если Не ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если ОбъектМетаданных.Проведение <> Метаданные.СвойстваОбъектов.Проведение.Разрешить
//		Или ОбъектМетаданных.Движения.Количество() = 0 Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Возврат Истина;
//	
//КонецФункции

#КонецОбласти

#КонецЕсли