
#Область ПрограммныйИнтерфейс


Функция КонфигурацияПоддерживаетХарактеристики() Экспорт
	Возврат Истина;
КонецФункции

Функция ПолучитьИмяСправочникаЕдиницыИзмерения() Экспорт
	Возврат "УпаковкиЕдиницыИзмерения";
КонецФункции

Функция ПолучитьИмяТипаЕдиницыИзмерения() Экспорт
	Возврат "СправочникСсылка." + ПолучитьИмяСправочникаЕдиницыИзмерения();
КонецФункции

Функция ПолучитьТекстПустойЕдиницыИзмерения() Экспорт
	Возврат "Справочники." + ПолучитьИмяСправочникаЕдиницыИзмерения()
		+ ".ПустаяСсылка()";
КонецФункции

Функция ПолучитьИмяРеквизитаДоговора() Экспорт
	Возврат "Договор";
КонецФункции


#КонецОбласти