
#Область ПрограммныйИнтерфейс

#Область ИмпортИзФайла

// Процедура обрабатывает выбор файла пользователем
//
// Параметры:
//  ПараметрыРасчета - Структура - Структура с параметрами расчета
//
Процедура ОбработатьИмпортФайла(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.СпособИмпортирования = 1 Тогда
		
		ПараметрыФормы = Новый Структура("ХранимыйФайл, ВерсияХранимогоФайла, СтруктураОтбора", 
			ПараметрыРасчета.Форма.КэшПараметрыОткрытия.ФайлИмпорта, , ПараметрыРасчета.СтруктураОтбора);
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИзФайлаНаДискеЗавершение", ЭтотОбъект, ПараметрыРасчета);
		ОткрытьФорму("Справочник.ХранимыеФайлыОрганизаций.Форма.ФормаВыбораВерсииФайла",
			ПараметрыФормы, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли ПараметрыРасчета.СпособИмпортирования = 2 Тогда
		
		// Импорт из файла
		Если ЗначениеЗаполнено(ПараметрыРасчета.ПутьКФайлу) Тогда
			
			// Проверка на существование файла
			Файл = Новый Файл(ПараметрыРасчета.ПутьКФайлу);
			Если Не Файл.Существует() Тогда
				ТекстСообщения = НСтр("ru = 'Указано неправильное имя импортируемого файла. Операция отменена.'");
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				Возврат;
			КонецЕсли;
			
			ПараметрыРасчета.Вставить("ИмяФайла", Файл.Имя);
			ПараметрыРасчета.Вставить("ДатаМодификацииУниверсальная", Файл.ПолучитьУниверсальноеВремяИзменения());
			ПараметрыРасчета.Вставить("РазмерФайла", Файл.Размер());
			
			ИнформацияОФайле = Новый Структура("ДатаМодификацииУниверсальная, ИмяФайла, РазмерФайла");;
			ЗаполнитьЗначенияСвойств(ИнформацияОФайле, ПараметрыРасчета);
			
			ИмпортированнаяВерсия = ХранимыеФайлыУХ.ПолучитьВерсиюХранимогоФайла(ИнформацияОФайле, ПараметрыРасчета.Форма.КэшПараметрыОткрытия.ФайлИмпорта);
			Если ИмпортированнаяВерсия = Неопределено Тогда
				
				// Нет ранее загруженного файла
				ПодтверждениеПерезаписьВерсииЗавершение(КодВозвратаДиалога.Да, ПараметрыРасчета);
				
			Иначе
				
				ТекстВопроса = НСтр("ru = 'Версия файла ""%1"" с датой изменения %2 и размером %3 байт
					|	уже была использована для заполнения текущего экземпляра отчета. Продолжить?'");
				ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса,
					ИнформацияОФайле.ИмяФайла, ИнформацияОФайле.ДатаМодификацииУниверсальная, ИнформацияОФайле.РазмерФайла);
					
				Оповещение = Новый ОписаниеОповещения("ПодтверждениеПерезаписьВерсииЗавершение", ЭтотОбъект, ПараметрыРасчета);
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
				
			КонецЕсли;
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Не указан путь к импортируемому файлу. Операция отменена.'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодтверждениеПерезаписьВерсииЗавершение(Результат, ПараметрыРасчета) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПомещениеФайла = Новый ОписаниеОповещения("СчитатьФайлИзХранилища", ЭтотОбъект, ПараметрыРасчета);
	НачатьПомещениеФайлаНаСервер(ОписаниеПомещениеФайла, , , , ПараметрыРасчета.ПутьКФайлу, Новый УникальныйИдентификатор);
	
КонецПроцедуры

Процедура СчитатьФайлИзХранилища(ОписаниеПомещенногоФайла, ПараметрыРасчета) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось выполнить помещение файла в хранилище'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ВерсияХранимогоФайла = Неопределено;
	ХранимыйФайл = Неопределено;
	
	СтруктураФайла = Новый Структура;
	СтруктураФайла.Вставить("АдресВременногоХранилища",	ОписаниеПомещенногоФайла.Адрес);
	СтруктураФайла.Вставить("НаименованиеФайла",		ПараметрыРасчета.ИмяФайла);
	СтруктураФайла.Вставить("ПолноеИмяНаДиске",			ПараметрыРасчета.ПутьКФайлу);
	СтруктураФайла.Вставить("РазмерФайла",				ПараметрыРасчета.РазмерФайла);
	СтруктураФайла.Вставить("ДатаИзмененияФайла",		ПараметрыРасчета.ДатаМодификацииУниверсальная);
	СтруктураФайла.Вставить("СписокЛистов",				Новый СписокЗначений);
	ХранимыйФайлПрисоединенныйФайл = ХранимыеФайлыУХ.ДобавитьХранимыйФайлИлиВерсию_УР(
		ПараметрыРасчета.СтруктураОтбора, СтруктураФайла, , ХранимыйФайл, ВерсияХранимогоФайла);
	
	Если ЗначениеЗаполнено(ХранимыйФайлПрисоединенныйФайл) Тогда
		
		Если СтрНачинаетсяС(ПараметрыРасчета.Форма.ИмяФормы, "Документ.НастраиваемыйОтчет") Тогда
			ХранимыеФайлыУХ.ОбновитьОбъектХранимыйФайл(ХранимыйФайл, ХранимыйФайлПрисоединенныйФайл, ПараметрыРасчета.Форма.Объект.Ссылка);
		КонецЕсли;
		
		ДанныеХранимогоФайла = Новый Структура;
		ДанныеХранимогоФайла.Вставить("ХранимыйФайл", ХранимыйФайл);
		ДанныеХранимогоФайла.Вставить("ВерсияХранимогоФайла", ВерсияХранимогоФайла);
		ДанныеХранимогоФайла.Вставить("ИмяЛиста", Неопределено);
		ДанныеХранимогоФайла.Вставить("Пароль", Неопределено);
		ДанныеХранимогоФайла.Вставить("НуженПароль", Ложь);
		
		СписокЛистов = СтруктураФайла.СписокЛистов;
		
		Если СписокЛистов.Количество() = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'В файле не обнаружены листы для импорта'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		
		ИначеЕсли СписокЛистов.Количество() = 1 И НЕ СписокЛистов[0].Пометка Тогда
			
			ДанныеХранимогоФайла.Вставить("ИмяЛиста", СписокЛистов[0].Значение);
			ЗаполнитьИзФайлаНаДискеЗавершение(ДанныеХранимогоФайла, ПараметрыРасчета);
			
		ИначеЕсли СписокЛистов.Количество() > 0 Тогда
			
			СтруктураПараметровФормы = Новый Структура;
			СтруктураПараметровФормы.Вставить("СписокЛистов", СписокЛистов);
			СтруктураДополнительныхПараметров = Новый Структура;
			СтруктураДополнительныхПараметров.Вставить("ПараметрыРасчета", ПараметрыРасчета);
			СтруктураДополнительныхПараметров.Вставить("ДанныеХранимогоФайла", ДанныеХранимогоФайла);
			ОписаниеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораЛистаИПароля", ЭтотОбъект, СтруктураДополнительныхПараметров);
			ОткрытьФорму("ОбщаяФорма.ФормаВыбораЛистаИПароля", СтруктураПараметровФормы, , , , , ОписаниеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(НСтр("ru = 'Не удалось сохранить импортируемый файл'"), НСтр("ru = 'Импорт из файла'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыбораЛистаИПароля(ДанныеВыбора, СтруктураДополнительныхПараметров) Экспорт
	
	Если ТипЗнч(ДанныеВыбора) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеХранимогоФайла = СтруктураДополнительныхПараметров.ДанныеХранимогоФайла;
	ЗаполнитьЗначенияСвойств(ДанныеХранимогоФайла, ДанныеВыбора);
	
	ЗаполнитьИзФайлаНаДискеЗавершение(ДанныеХранимогоФайла, СтруктураДополнительныхПараметров.ПараметрыРасчета);
	
КонецПроцедуры

Процедура ЗаполнитьИзФайлаНаДискеЗавершение(ДанныеХранимогоФайла, ПараметрыРасчета) Экспорт
	
	Если ДанныеХранимогоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ФормаИсточник = ПараметрыРасчета.Форма;
	ФормаИсточник.КэшПараметрыОткрытия.Вставить("ФайлИмпорта", ДанныеХранимогоФайла.ХранимыйФайл);
	Если СтрНачинаетсяС(ФормаИсточник.ИмяФормы, "Документ.НастраиваемыйОтчет") Тогда
		ФормаИсточник.Объект.ФайлИмпорта = ДанныеХранимогоФайла.ХранимыйФайл;
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("ИмяФайла", Строка(ДанныеХранимогоФайла.ХранимыйФайл));
	ПараметрыРасчета.Вставить("УточнениеСпособаФормированияОтчета", ДанныеХранимогоФайла);
	
	ПараметрыРасчета.Удалить("Форма");
	
	ФормаИсточник.ЗаполнитьЗавершение(ПараметрыРасчета);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

