
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//++ НЕ УТКА
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить(
		"ХозяйственнаяОперация",
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаДавальцу2_5"));
		
	ПараметрыФормы.Вставить(
		"ТипОснованияАктаОРасхождении",
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаДавальцу"));
	
	ОткрытьФорму(
		"Документ.АктОРасхожденияхПослеОтгрузки.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		"ПередачаДавальцу2_5",
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//-- НЕ УТКА
	
	Возврат; // в УТКА обработчик пустой
	
КонецПроцедуры

#КонецОбласти

