#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ НЕ УТКА
	МеханизмыДокумента.Добавить("МеждународныйУчет");
	//-- НЕ УТКА
	МеханизмыДокумента.Добавить("НематериальныеАктивы");
	МеханизмыДокумента.Добавить("РеестрДокументов");
	МеханизмыДокумента.Добавить("СебестоимостьИПартионныйУчет");
	МеханизмыДокумента.Добавить("УчетДоходовРасходов");
	МеханизмыДокумента.Добавить("УчетПрочихАктивовПассивов");
	МеханизмыДокумента.Добавить("ОборотныеРегистрыУправленческогоУчета");
	МеханизмыДокумента.Добавить("ОбесценениеВНА");
	
	АмортизацияНМАЛокализация.ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента);
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура:
//     * Ключ - Строка - Имя таблицы.
//     * Значение - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.АмортизацияНМА2_4") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры);
		
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);

		ТекстЗапросаТаблицаАмортизацияНМА(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаСтоимостьНМА(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаОбесценениеВНА(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПартииПрочихРасходов(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияДоходыРасходыПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры);
		
		АмортизацияНМАЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	ТаблицыДвижений = ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
	Возврат ТаблицыДвижений;
	
КонецФункции

#КонецОбласти

#Область Команды

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Отчеты.СправкаРасчетАмортизацииНМА_МУ.ДобавитьКомандуОтчетаПоДокументуАмортизацииНМА(КомандыОтчетов);
	
	АмортизацияНМАЛокализация.ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры);

КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	АмортизацияНМАЛокализация.ДобавитьКомандыПечати(КомандыПечати);

КонецПроцедуры

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	АмортизацияНМАЛокализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);

КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон(НСтр("ru = 'Амортизация НМА %1 за %2';
									|en = 'The %1 Intangible assets — Amortization charge for %2'"), Данные.Номер, Формат(Данные.Дата, НСтр("ru = 'ДФ=''ММММ гггг''';
																												|en = 'ДФ=''ММММ гггг'''")));
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет расчет амортизации в заданном месяце и записывает его с помощью проведения документа "Амортизация НМА".
//
// Параметры:
//  ИсходныеПараметрыРасчета - см. РасчетАмортизацииНМА.ПараметрыВыполнения
//  
// Возвращаемое значение:
//  Структура - результат расчета:
//  	* КоличествоОбработанныхДанных - Число -
// 		* ЕстьОшибки - Булево - Истина, если есть ошибки 
// 		* ТекстОшибки  - Строка - Текст ошибки
//
Функция РассчитатьАмортизацию(ИсходныеПараметрыРасчета) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ЗакрытиеМесяца.НачислениеАмортизацииНМА");
	
	ПараметрыРасчета = ОбщегоНазначения.СкопироватьРекурсивно(ИсходныеПараметрыРасчета); // РасчетАмортизацииНМА.ПараметрыВыполнения
	ВнеоборотныеАктивыСлужебный.ДополнитьПараметрамиУчетаВнеоборотныхАктивов(ПараметрыРасчета);
	
	Если ПараметрыРасчета.МенеджерВременныхТаблиц = Неопределено Тогда
		ПараметрыРасчета.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ИсходныеПараметрыРасчета.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Попытка
		
		ПодготовитьПараметрыДляРасчетаАмортизации(ПараметрыРасчета);
		ВыполнитьРасчетАмортизации(ПараметрыРасчета);
		
		ЗарегистрироватьОшибкиРасчетаАмортизации(ПараметрыРасчета);
	
		ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(ПараметрыРасчета.МенеджерВременныхТаблиц,, ПараметрыРасчета.ИспользуемыеТаблицы);
		
		ЗаписатьРасчетАмортизации(ПараметрыРасчета);
	
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ПараметрыРасчета.ЕстьОшибки = Истина;
		ПараметрыРасчета.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
			Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииНМА, 
			ПараметрыРасчета.Период, 
			ПараметрыРасчета.ПакетыАмортизации.ВыгрузитьКолонку("Организация"),
			ПараметрыРасчета.ТекстОшибки);
			
	КонецПопытки; 
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ПараметрыРасчета.КоличествоОбработанныхДанных);
	
	РезультатРасчета = Новый Структура;
	РезультатРасчета.Вставить("КоличествоОбработанныхДанных", ПараметрыРасчета.КоличествоОбработанныхДанных);
	РезультатРасчета.Вставить("ЕстьОшибки", ПараметрыРасчета.ЕстьОшибки);
	РезультатРасчета.Вставить("ТекстОшибки", ПараметрыРасчета.ТекстОшибки);
	
	Возврат РезультатРасчета;
	
КонецФункции

// Определяет номер пакета амортизации.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация.
//
// Возвращаемое значение:
//  Число - Номер пакета.
//
Функция НомерПакетаПоУмолчанию(Организация) Экспорт

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат 0;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПакетыАмортизацииНМА.НомерПакета) КАК НомерПакета,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПакетыАмортизацииНМА.НомерПакета), 0) КАК КоличествоНомеров
	|ИЗ
	|	РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
	|ГДЕ
	|	ПакетыАмортизацииНМА.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПакетыАмортизацииНМА.Организация";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НомерПакета = 0;
	Если Выборка.Следующий() Тогда
		Если Выборка.КоличествоНомеров = 1 Тогда
			НомерПакета = Выборка.НомерПакета;
		КонецЕсли; 
	КонецЕсли;

	Возврат НомерПакета;
	
КонецФункции

// Добавляет в список запросов формирование временной таблицы НачисленнаяАмортизация.
//  Используется для универсального начисления амортизации.
//  Созданная временная таблица может использоваться для формирования движений по регистрам.
//
// Параметры:
//  СписокЗапросов - Массив, СписокЗначений - Список запросов.
//  ТекстПодзапроса	- Строка - Текст запроса, содержащий результат расчета амортизации.
//  ПроведениеДокумента - Булево - Истина, если процедура вызывается при проведении документа.
//
Процедура ТекстЗапросаВтНачисленнаяАмортизация(СписокЗапросов, ТекстПодзапроса, ПроведениеДокумента = Ложь) Экспорт
	
	ИмяТаблицы = "НачисленнаяАмортизация";
	
	ТекстЗапроса = АмортизацияНМАЛокализация.ТекстЗапросаВтНачисленнаяАмортизация();
	
	Если ТекстЗапроса = Неопределено Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР 
		|		КОГДА НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
		|	КОНЕЦ КАК ВидВНА,
		|	НачисленнаяАмортизация.ПериодРасчета КАК ПериодРасчета,
		|	НачисленнаяАмортизация.ВидОбъектаУчета КАК ВидОбъектаУчета,
		|	НачисленнаяАмортизация.Организация КАК Организация,
		|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0) КАК НомерПакета,
		|	НачисленнаяАмортизация.Подразделение КАК Подразделение,
		|	НачисленнаяАмортизация.КорПодразделение КАК КорПодразделение,
		|	НачисленнаяАмортизация.НематериальныйАктив КАК НематериальныйАктив,
		|	НачисленнаяАмортизация.ЕГДС КАК ЕГДС,
		|	НачисленнаяАмортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	НачисленнаяАмортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	НачисленнаяАмортизация.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|	НачисленнаяАмортизация.СтатьяРасходов КАК СтатьяРасходов,
		|	НачисленнаяАмортизация.АналитикаРасходов КАК АналитикаРасходов,
		|	ЛОЖЬ КАК ПередаватьРасходыВДругуюОрганизацию,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучательРасходов,
		|	НачисленнаяАмортизация.ЭтоДоначисление КАК ЭтоДоначисление,
		|	НачисленнаяАмортизация.ЭтоДоначислениеБУ КАК ЭтоДоначислениеБУ,
		|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериод) КАК РесурсВыработанныйЗаПрошлыйПериод,
		|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериод) КАК РесурсВыработанныйЗаТекущийПериод,
		|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ) КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
		|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериодБУ) КАК РесурсВыработанныйЗаТекущийПериодБУ,
		|	МАКСИМУМ(НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизации) КАК СтоимостьДляВычисленияАмортизации,
		|	МАКСИМУМ(НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизацииРегл) КАК СтоимостьДляВычисленияАмортизацииРегл,
		|	МАКСИМУМ(НачисленнаяАмортизация.ОстатокОбесцененияРегл) КАК ОстатокОбесцененияРегл,
		|	МАКСИМУМ(НачисленнаяАмортизация.ОстатокОбесцененияУпр) КАК ОстатокОбесцененияУпр,
		|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокУчетаУУ) КАК ПорядокУчетаУУ,
		|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокУчетаБУ) КАК ПорядокУчетаБУ,
		|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокНачисленияАмортизацииУУ) КАК ПорядокНачисленияАмортизацииУУ,
		|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокНачисленияАмортизацииБУ) КАК ПорядокНачисленияАмортизацииБУ,
		|	МАКСИМУМ(НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА) КАК ВариантПроводокПоОбесценениюВНА,
		|
		|	ЛОЖЬ КАК НачислятьИзнос,
		|
		|	&ИдентификаторСтрокиТаблицы КАК ИдентификаторСтроки,
		|
		|	СУММА(НачисленнаяАмортизация.СуммаУУ) КАК СуммаУУ,
		|	СУММА(НачисленнаяАмортизация.СуммаБУ) КАК СуммаБУ,
		|
		|	0 КАК СуммаНУ,
		|	0 КАК СуммаПР,
		|	0 КАК СуммаВР,
		|	0 КАК СуммаЦФ,
		|	0 КАК СуммаНУЦФ,
		|	0 КАК СуммаПРЦФ,
		|	0 КАК СуммаВРЦФ,
		|
		|	СУММА(НачисленнаяАмортизация.ОбесценениеУУ) КАК ОбесценениеУУ,
		|	СУММА(НачисленнаяАмортизация.ОбесценениеБУ) КАК ОбесценениеБУ,
		|	0 КАК ОбесценениеЦФ
		|
		|ПОМЕСТИТЬ НачисленнаяАмортизация
		|
		|ИЗ
		|	&ТекстПодзапроса КАК НачисленнаяАмортизация
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
		|		ПО ПакетыАмортизацииНМА.Организация = НачисленнаяАмортизация.Организация
		|			И ПакетыАмортизацииНМА.НематериальныйАктив = НачисленнаяАмортизация.НематериальныйАктив
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР 
		|		КОГДА НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
		|	КОНЕЦ,
		|	НачисленнаяАмортизация.ПериодРасчета,
		|	НачисленнаяАмортизация.ВидОбъектаУчета,
		|	НачисленнаяАмортизация.Организация,
		|	НачисленнаяАмортизация.ЕГДС,
		|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0),
		|	НачисленнаяАмортизация.Подразделение,
		|	НачисленнаяАмортизация.КорПодразделение,
		|	НачисленнаяАмортизация.ГруппаФинансовогоУчета,
		|	НачисленнаяАмортизация.НаправлениеДеятельности,
		|	НачисленнаяАмортизация.КорНаправлениеДеятельности,
		|	НачисленнаяАмортизация.НематериальныйАктив,
		|	НачисленнаяАмортизация.СтатьяРасходов,
		|	НачисленнаяАмортизация.АналитикаРасходов,
		|	НачисленнаяАмортизация.ЭтоДоначисление,
		|	НачисленнаяАмортизация.ЭтоДоначислениеБУ,
		|	&ГруппировкаИдентификатора";
	
	КонецЕсли; 
	
	Если ПроведениеДокумента Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтрокиТаблицы", "НачисленнаяАмортизация.ИдентификаторСтроки");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаИдентификатора",  "НачисленнаяАмортизация.ИдентификаторСтроки");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтрокиТаблицы", "АВТОНОМЕРЗАПИСИ()");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаИдентификатора",  "ИСТИНА");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПодзапроса", "(" + ТекстПодзапроса + ")");
	
	Если ТипЗнч(СписокЗапросов) = Тип("СписокЗначений") Тогда
		СписокЗапросов.Добавить(ТекстЗапроса, ИмяТаблицы);
	Иначе
		СписокЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт

	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента = "Документ.АмортизацияНМА2_4";
	
	ВЗапросеЕстьИсточник = Истина;
	
	ЗначенияПараметров = ЗначенияПараметровПроведения();
	ПереопределениеРасчетаПараметров = Новый Структура;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "ДанныеДокумента";
		
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.';
								|en = 'In document %ПолноеИмяДокумента%, adaptation of request for generating records of register %ИмяРегистра% is not implemented.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ВЗапросеЕстьИсточник,
										ПереопределениеРасчетаПараметров);
	Иначе	
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ПереопределениеРасчетаПараметров);
	КонецЕсли; 

	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметров;
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)
	
	ПроведениеДокументов.ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры);

	СформироватьТаблицуВтСписокДокументов(Запрос);
	ПолучитьДанныеДокумента(Запрос);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументаРеквизиты.Период КАК Период,
	|	ДанныеДокументаРеквизиты.Номер КАК Номер,
	|	ДанныеДокументаРеквизиты.Организация КАК Организация
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокументаРеквизиты";
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;

	ЗначенияПараметровПроведения = ЗначенияПараметровПроведения(Реквизиты);
	Для каждого КлючИЗначение Из ЗначенияПараметровПроведения Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла; 
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Процедура СформироватьТаблицуВтСписокДокументов(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокДокументов.Ссылка КАК Ссылка,
	|	СписокДокументов.Организация КАК Организация,
	|	СписокДокументов.Дата КАК Период
	|
	|ПОМЕСТИТЬ ВтСписокДокументов
	|
	|ИЗ
	|	Документ.АмортизацияНМА2_4 КАК СписокДокументов
	|
	|ГДЕ
	|	СписокДокументов.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеДокумента(Запрос)
	
	СписокЗапросов = Новый Массив;
	
	#Область ДанныеДокументаРеквизиты
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка           КАК Ссылка,
	|	ДанныеДокумента.Дата             КАК Период,
	|	ДанныеДокумента.Номер            КАК Номер,
	|	ДанныеДокумента.Проведен         КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления  КАК ПометкаУдаления,
	|	ДанныеДокумента.Комментарий      КАК Комментарий,
	|	ДанныеДокумента.Ответственный    КАК Ответственный,
	|	ДанныеДокумента.Организация      КАК Организация,
	|	ДанныеДокумента.НомерПакета      КАК НомерПакета
	|
	|ПОМЕСТИТЬ ДанныеДокументаРеквизиты
	|
	|ИЗ
	|	Документ.АмортизацияНМА2_4 КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка В (
	|		ВЫБРАТЬ
	|			ВтСписокДокументов.Ссылка
	|		ИЗ
	|			ВтСписокДокументов КАК ВтСписокДокументов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ЗначенияПараметровПроведения(Реквизиты = Неопределено)

	ЗначенияПараметровПроведения = Новый Структура;
	ЗначенияПараметровПроведения.Вставить("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.АмортизацияНМА2_4"));
	ЗначенияПараметровПроведения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.АмортизацияНМА);
	ЗначенияПараметровПроведения.Вставить("Настройка_ХО", Справочники.НастройкиХозяйственныхОпераций.АмортизацияНМА);
	ЗначенияПараметровПроведения.Вставить("СтатьяАП_НМА", ПланыВидовХарактеристик.СтатьиАктивовПассивов.УпрБалансНематериальныеАктивы);

	ЗначенияПараметровПроведения.Вставить(
		"ДоначислятьКорректировкуОбесценения", 
		Перечисления.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения);
	
	ЗначенияПараметровПроведения.Вставить(
		"СторнироватьКорректировкуОбесценения", 
		Перечисления.ВариантыПроводокПоОбесценениюВНА.СторнироватьКорректировкуОбесценения);
	
	ЗначенияПараметровПроведения.Вставить(
		"ИспользоватьУчетПрочихДоходовРасходов",
		ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов"));
	
	Если Реквизиты <> Неопределено Тогда
		ЗначенияПараметровПроведения.Вставить("НомерНаПечать", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	КонецЕсли; 
	
	Возврат ЗначенияПараметровПроведения;
	
КонецФункции

Функция ТекстЗапросаТаблицаАмортизацияНМА(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "АмортизацияНМА";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстыЗапросаОбъединение = Новый Массив;
	
	#Область Амортизация // Дт 91 - Кт 04.ам
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)          КАК ВидДвижения,
	|	ДанныеДокумента.Ссылка                          КАК Регистратор,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК НематериальныйАктив,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.СуммаУУ    КАК Амортизация,
	|	НачисленнаяАмортизация.СуммаБУ    КАК АмортизацияРегл,
	|	НачисленнаяАмортизация.СуммаНУ    КАК АмортизацияНУ,
	|	НачисленнаяАмортизация.СуммаПР    КАК АмортизацияПР,
	|	НачисленнаяАмортизация.СуммаВР    КАК АмортизацияВР,
	|	НачисленнаяАмортизация.СуммаЦФ    КАК АмортизацияЦФ,
	|	НачисленнаяАмортизация.СуммаНУЦФ  КАК АмортизацияНУЦФ,
	|	НачисленнаяАмортизация.СуммаПРЦФ  КАК АмортизацияПРЦФ,
	|	НачисленнаяАмортизация.СуммаВРЦФ  КАК АмортизацияВРЦФ,
	|
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	НачисленнаяАмортизация.КорПодразделение              КАК КорПодразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов             КАК КорАналитикаРасходов,
	|
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериодБУ КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	НачисленнаяАмортизация.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	НачисленнаяАмортизация.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|
	|	НачисленнаяАмортизация.ЭтоДоначисление   КАК ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ КАК ЭтоДоначислениеБУ,
	|
	|	НачисленнаяАмортизация.ПорядокУчетаУУ    КАК ПорядокУчетаУУ,
	|	НачисленнаяАмортизация.ПорядокУчетаБУ    КАК ПорядокУчетаБУ,
	|	
	|	НачисленнаяАмортизация.ПорядокНачисленияАмортизацииУУ    КАК ПорядокНачисленияАмортизацииУУ,
	|	НачисленнаяАмортизация.ПорядокНачисленияАмортизацииБУ    КАК ПорядокНачисленияАмортизацииБУ,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.АмортизацияНМАвДругуюОрганизацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.АмортизацияНМА)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.АмортизацияНМАвДругуюОрганизацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.АмортизацияНМА)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)
	|
	|	И (НачисленнаяАмортизация.СуммаУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаНУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаЦФ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаНУЦФ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПРЦФ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВРЦФ <> 0)";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область КорректировкаОбесценения // Дт 02.об - Кт 04.ам
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)          КАК ВидДвижения,
	|	ДанныеДокумента.Ссылка                          КАК Регистратор,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК НематериальныйАктив,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.ОбесценениеУУ            КАК Амортизация,
	|	НачисленнаяАмортизация.ОбесценениеБУ            КАК АмортизацияРегл,
	|	0                                               КАК АмортизацияНУ,
	|	0                                               КАК АмортизацияПР,
	|	НачисленнаяАмортизация.ОбесценениеБУ            КАК АмортизацияВР,
	|	НачисленнаяАмортизация.ОбесценениеЦФ            КАК АмортизацияЦФ,
	|	0                                               КАК АмортизацияНУЦФ,
	|	0                                               КАК АмортизацияПРЦФ,
	|	НачисленнаяАмортизация.ОбесценениеЦФ            КАК АмортизацияВРЦФ,
	|
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	НачисленнаяАмортизация.КорПодразделение              КАК КорПодразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов             КАК КорАналитикаРасходов,
	|
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериодБУ КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	НачисленнаяАмортизация.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	НачисленнаяАмортизация.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|
	|	НачисленнаяАмортизация.ЭтоДоначисление   КАК ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ КАК ЭтоДоначислениеБУ,
	|
	|	НачисленнаяАмортизация.ПорядокУчетаУУ    КАК ПорядокУчетаУУ,
	|	НачисленнаяАмортизация.ПорядокУчетаБУ    КАК ПорядокУчетаБУ,
	|	
	|	НачисленнаяАмортизация.ПорядокНачисленияАмортизацииУУ    КАК ПорядокНачисленияАмортизацииУУ,
	|	НачисленнаяАмортизация.ПорядокНачисленияАмортизацииБУ    КАК ПорядокНачисленияАмортизацииБУ,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаОбесцененияНМА) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КорректировкаОбесцененияНМА) КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)
	|
	|	И НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеЦФ <> 0)
	|";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти

	ТекстЗапроса = СтрСоединить(ТекстыЗапросаОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаСтоимостьНМА(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "СтоимостьНМА";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстыЗапросаОбъединение = Новый Массив;
	
	#Область Амортизация // Дт 91 - Кт 04.ниокр
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)          КАК ВидДвижения,
	|	ДанныеДокумента.Ссылка                          КАК Регистратор,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК НематериальныйАктив,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.СуммаУУ    КАК Стоимость,
	|	НачисленнаяАмортизация.СуммаБУ    КАК СтоимостьРегл,
	|	НачисленнаяАмортизация.СуммаНУ    КАК СтоимостьНУ,
	|	НачисленнаяАмортизация.СуммаПР    КАК СтоимостьПР,
	|	НачисленнаяАмортизация.СуммаВР    КАК СтоимостьВР,
	|	НачисленнаяАмортизация.СуммаЦФ    КАК СтоимостьЦФ,
	|	НачисленнаяАмортизация.СуммаНУЦФ  КАК СтоимостьНУЦФ,
	|	НачисленнаяАмортизация.СуммаПРЦФ  КАК СтоимостьПРЦФ,
	|	НачисленнаяАмортизация.СуммаВРЦФ  КАК СтоимостьВРЦФ,
	|
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	НачисленнаяАмортизация.КорПодразделение              КАК КорПодразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов             КАК КорАналитикаРасходов,
	|
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериодБУ КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	НачисленнаяАмортизация.ЭтоДоначисление    КАК ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ  КАК ЭтоДоначислениеБУ,
	|	НачисленнаяАмортизация.ПорядокУчетаУУ     КАК ПорядокУчетаУУ,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыНИОКРВДругуюОрганизацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыНИОКР)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеНаРасходыНИОКРВДругуюОрганизацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеНаРасходыНИОКР)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|	
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|
	|	И (НачисленнаяАмортизация.СуммаУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаНУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаЦФ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаНУЦФ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПРЦФ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВРЦФ <> 0)";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область КорректировкаОбесценения // Дт 02.об - Кт 04.ниокр
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)          КАК ВидДвижения,
	|	ДанныеДокумента.Ссылка                          КАК Регистратор,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК НематериальныйАктив,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.ОбесценениеУУ            КАК Стоимость,
	|	НачисленнаяАмортизация.ОбесценениеБУ            КАК СтоимостьРегл,
	|	0                                               КАК СтоимостьНУ,
	|	0                                               КАК СтоимостьПР,
	|	НачисленнаяАмортизация.ОбесценениеБУ            КАК СтоимостьВР,
	|	НачисленнаяАмортизация.ОбесценениеЦФ            КАК СтоимостьЦФ,
	|	0                                               КАК СтоимостьНУЦФ,
	|	0                                               КАК СтоимостьПРЦФ,
	|	НачисленнаяАмортизация.ОбесценениеЦФ            КАК СтоимостьВРЦФ,
	|
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	НачисленнаяАмортизация.КорПодразделение              КАК КорПодразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов             КАК КорАналитикаРасходов,
	|
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериодБУ КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	НачисленнаяАмортизация.ЭтоДоначисление    КАК ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ  КАК ЭтоДоначислениеБУ,
	|	НачисленнаяАмортизация.ПорядокУчетаУУ     КАК ПорядокУчетаУУ,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаОбесцененияНМА) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КорректировкаОбесцененияНМА) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеЦФ <> 0)";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти

	ТекстЗапроса = СтрСоединить(ТекстыЗапросаОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ТекстЗапросаТаблицаОбесценениеВНА(ТекстыЗапроса, Регистры)

	ИмяРегистра = "ОбесценениеВНА";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыЗапросаОбъединение = Новый Массив;
	
	#Область СторноОбесценения // Дт 91 - Кт 04.об (сторно)
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)          КАК ВидДвижения,
	|	ДанныеДокумента.Ссылка                          КАК Регистратор,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК ВнеоборотныйАктив,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.ЕГДС                     КАК ЕГДС,
	|	НачисленнаяАмортизация.ИдентификаторСтроки      КАК ИдентификаторФинЗаписи,
	|
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНМАВДругуюОрганизацию)
	|					КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНИОКРВДругуюОрганизацию)
	|				КОНЕЦ
	|		КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНМА)
	|		КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНИОКР)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНМАВДругуюОрганизацию)
	|					КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНИОКРВДругуюОрганизацию)
	|				КОНЕЦ
	|		КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНМА)
	|		КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНИОКР)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации,
	|
	|	-(НачисленнаяАмортизация.ОбесценениеБУ + НачисленнаяАмортизация.ОбесценениеЦФ) КАК ОбесценениеРегл,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК ОбесценениеУпр
	|	
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &СторнироватьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеЦФ <> 0)";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область КорректировкаОбесценения // Дт 04.об - Кт 04.ам
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)          КАК ВидДвижения,
	|	ДанныеДокумента.Ссылка                          КАК Регистратор,
	|	НачисленнаяАмортизация.ПериодРасчета            КАК Период,
	|	НачисленнаяАмортизация.НематериальныйАктив      КАК ВнеоборотныйАктив,
	|	НачисленнаяАмортизация.Организация              КАК Организация,
	|	НачисленнаяАмортизация.Подразделение            КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета   КАК ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.ЕГДС                     КАК ЕГДС,
	|
	|	НачисленнаяАмортизация.ИдентификаторСтроки      КАК ИдентификаторФинЗаписи,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаОбесцененияНМА) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КорректировкаОбесцененияНМА) КАК НастройкаХозяйственнойОперации,
	|
	|	НачисленнаяАмортизация.ОбесценениеБУ + НачисленнаяАмортизация.ОбесценениеЦФ КАК ОбесценениеРегл,
	|	НачисленнаяАмортизация.ОбесценениеУУ КАК ОбесценениеУпр
	|	
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеЦФ <> 0)
	|";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросаОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ДвиженияПоПрочимАктивамПассивам";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	СписокЗапросовОбъединение = Новый Массив;
	
	#Область Амортизация
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                 КАК Период,
	|	НачисленнаяАмортизация.Организация                   КАК Организация,
	|	НачисленнаяАмортизация.Подразделение                 КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                         КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|
	|	НачисленнаяАмортизация.СуммаБУ КАК СуммаРегл,
	|	НачисленнаяАмортизация.СуммаПР КАК ПостояннаяРазница,
	|	НачисленнаяАмортизация.СуммаВР КАК ВременнаяРазница,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаУпр,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаСНДС,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.АмортизацияНМАвДругуюОрганизацию) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (НачисленнаяАмортизация.СуммаБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаУУ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                  КАК Период,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов  КАК Организация,
	|	НачисленнаяАмортизация.КорПодразделение               КАК Подразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.Организация                    КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                          КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	|
	|	НачисленнаяАмортизация.СуммаБУ КАК СуммаРегл,
	|	НачисленнаяАмортизация.СуммаПР КАК ПостояннаяРазница,
	|	НачисленнаяАмортизация.СуммаВР КАК ВременнаяРазница,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаУпр,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаСНДС,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.АмортизацияНМАИзДругойОрганизации) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (НачисленнаяАмортизация.СуммаБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаУУ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                 КАК Период,
	|	НачисленнаяАмортизация.Организация                   КАК Организация,
	|	НачисленнаяАмортизация.Подразделение                 КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                         КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|
	|	НачисленнаяАмортизация.СуммаБУ КАК СуммаРегл,
	|	НачисленнаяАмортизация.СуммаПР КАК ПостояннаяРазница,
	|	НачисленнаяАмортизация.СуммаВР КАК ВременнаяРазница,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаУпр,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаСНДС,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеНаРасходыНИОКРВДругуюОрганизацию) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (НачисленнаяАмортизация.СуммаБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаУУ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                  КАК Период,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов  КАК Организация,
	|	НачисленнаяАмортизация.КорПодразделение               КАК Подразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.Организация                    КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                          КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	|
	|	НачисленнаяАмортизация.СуммаБУ КАК СуммаРегл,
	|	НачисленнаяАмортизация.СуммаПР КАК ПостояннаяРазница,
	|	НачисленнаяАмортизация.СуммаВР КАК ВременнаяРазница,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаУпр,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаСНДС,
	|	НачисленнаяАмортизация.СуммаУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеНаРасходыНИОКРИзДругойОрганизации) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И (НачисленнаяАмортизация.СуммаБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаПР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаВР <> 0
	|		ИЛИ НачисленнаяАмортизация.СуммаУУ <> 0)
	|";
	СписокЗапросовОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СторноОбесценения
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                 КАК Период,
	|	НачисленнаяАмортизация.Организация                   КАК Организация,
	|	НачисленнаяАмортизация.Подразделение                 КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                         КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК ВременнаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаУпр,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаСНДС,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНМАВДругуюОрганизацию) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	И НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &СторнироватьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                  КАК Период,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов  КАК Организация,
	|	НачисленнаяАмортизация.КорПодразделение               КАК Подразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.Организация                    КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                          КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	|
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК ВременнаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаУпр,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаСНДС,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНМАИзДругойОрганизации) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	И НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &СторнироватьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                 КАК Период,
	|	НачисленнаяАмортизация.Организация                   КАК Организация,
	|	НачисленнаяАмортизация.Подразделение                 КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                         КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК ВременнаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаУпр,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаСНДС,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНИОКРВДругуюОрганизацию) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	И НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &СторнироватьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета                  КАК Период,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов  КАК Организация,
	|	НачисленнаяАмортизация.КорПодразделение               КАК Подразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	НачисленнаяАмортизация.Организация                    КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                          КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	|
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеБУ КАК ВременнаяРазница,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаУпр,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаСНДС,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаБезНДС,
	|	
	|	НачисленнаяАмортизация.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноОбесцененияНИОКРИзДругойОрганизации) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|	И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	И НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &СторнироватьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0)
	|";
	СписокЗапросовОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти

	ТекстЗапроса = СтрСоединить(СписокЗапросовОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ТекстЗапросаТаблицаДвиженияДоходыРасходыПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияДоходыРасходыПрочиеАктивыПассивы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыЗапросаОбъединение = Новый Массив;
	
	#Область СторноОбесценения // Дт 91 - Кт 04.об (сторно)
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета КАК Период,
	|	НачисленнаяАмортизация.Организация КАК Организация,
	|
	|	НачисленнаяАмортизация.Подразделение КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяАП_НМА КАК Статья,
	|	НачисленнаяАмортизация.НематериальныйАктив КАК АналитикаАктивовПассивов,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.КорПодразделение КАК КорПодразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов КАК КорСтатья,
	|	НачисленнаяАмортизация.АналитикаРасходов КАК КорАналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК КорГруппаФинансовогоУчета,
	|
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК Сумма,
	|	-НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаУпр,
	|	-(НачисленнаяАмортизация.ОбесценениеБУ + НачисленнаяАмортизация.ОбесценениеЦФ) КАК СуммаРегл,
	|
	|	ВЫБОР 
	|		КОГДА НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию
	|				И НачисленнаяАмортизация.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНМАВДругуюОрганизацию)
	|					КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНИОКРВДругуюОрганизацию)
	|				КОНЕЦ
	|		КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НМА)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНМА)
	|		КОГДА НачисленнаяАмортизация.ВидВНА = ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.НИОКР)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноОбесцененияНИОКР)
	|	КОНЕЦ КАК ХозяйственнаяОперация
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &СторнироватьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеЦФ <> 0)";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область КорректировкаОбесценения // Дт 04.об - Кт 04.ам
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачисленнаяАмортизация.ПериодРасчета КАК Период,
	|	НачисленнаяАмортизация.Организация КАК Организация,
	|
	|	НачисленнаяАмортизация.Подразделение КАК Подразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяАП_НМА КАК Статья,
	|	НачисленнаяАмортизация.НематериальныйАктив КАК АналитикаАктивовПассивов,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.Подразделение КАК КорПодразделение,
	|	НачисленнаяАмортизация.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	&СтатьяАП_НМА КАК КорСтатья,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
	|	НачисленнаяАмортизация.НематериальныйАктив КАК КорАналитикаАктивовПассивов,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета КАК КорГруппаФинансовогоУчета,
	|
	|	НачисленнаяАмортизация.ОбесценениеУУ КАК Сумма,
	|	НачисленнаяАмортизация.ОбесценениеУУ КАК СуммаУпр,
	|	НачисленнаяАмортизация.ОбесценениеБУ + НачисленнаяАмортизация.ОбесценениеЦФ КАК СуммаРегл,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаОбесцененияНМА) КАК ХозяйственнаяОперация
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО НачисленнаяАмортизация.Организация = ДанныеДокумента.Организация
	|			И НачисленнаяАмортизация.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|
	|	И (НачисленнаяАмортизация.ОбесценениеУУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеБУ <> 0
	|		ИЛИ НачисленнаяАмортизация.ОбесценениеЦФ <> 0)";
	ТекстыЗапросаОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросаОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Истина);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ДополнительныеПоля = "";
	
	РасчетСебестоимостиЛокализация.ДобавитьДополнительныеПоляПоНДД(ДополнительныеПоля);
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаПрочиеРасходы(ДополнительныеПоля);
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПартииПрочихРасходов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПартииПрочихРасходов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПартииПрочихРасходов(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                  КАК Ссылка,
	|	ДанныеДокумента.Дата                    КАК ДатаДокументаИБ,
	|	ДанныеДокумента.Номер                   КАК НомерДокументаИБ,
	|	&ИдентификаторМетаданных                КАК ТипСсылки,
	|	ДанныеДокумента.Организация             КАК Организация,
	|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Ответственный           КАК Ответственный,
	|	ДанныеДокумента.Комментарий             КАК Комментарий,
	|	ДанныеДокумента.Проведен                КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления         КАК ПометкаУдаления,
	|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
	|	ДанныеДокумента.Дата                    КАК ДатаПервичногоДокумента,
	|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
	|	ЛОЖЬ                                    КАК СторноИсправление,
	|	НЕОПРЕДЕЛЕНО                            КАК СторнируемыйДокумент,
	|	НЕОПРЕДЕЛЕНО                            КАК ИсправляемыйДокумент,
	|	ДанныеДокумента.Дата                    КАК ДатаОтраженияВУчете,
	|	НЕОПРЕДЕЛЕНО                            КАК Приоритет
	|
	|ИЗ
	|	Документ.АмортизацияНМА2_4 КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтПрочиеРасходы";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ДополнительныеПоля = "";
	
	РасчетСебестоимостиЛокализация.ДобавитьДополнительныеПоляПоНДД(ДополнительныеПоля);
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаВтПрочиеРасходы(ДополнительныеПоля);
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПрочиеРасходы";
	
	ДополнительныеПоля = "";
	
	РасчетСебестоимостиЛокализация.ДобавитьДополнительныеПоляПоНДД(ДополнительныеПоля);
	
	СписокЗапросовОбъединение = Новый Массив;
	
	СписокЗапросовОбъединение.Добавить(РегистрыНакопления.ПрочиеРасходы.ТекстОписаниеВтИсходныеПрочиеРасходы(ДополнительныеПоля));
	СписокЗапросовОбъединение.Добавить(ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаОтражениеНачисленнойАмортизацииВПрочихРасходах(ДополнительныеПоля));
	СписокЗапросовОбъединение.Добавить(ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаОтражениеОбесцененияВПрочихРасходах(ДополнительныеПоля));
	
	ТекстЗапроса = СтрСоединить(СписокЗапросовОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПартииПрочихРасходов(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтПартииПрочихРасходов";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаВтПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПартииПрочихРасходов";
	
	СписокЗапросовОбъединение = Новый Массив;
	СписокЗапросовОбъединение.Добавить(РегистрыНакопления.ПартииПрочихРасходов.ТекстОписаниеВтИсходныеПартииПрочихРасходов());
	СписокЗапросовОбъединение.Добавить(ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаОтражениеНачисленнойАмортизацииВПартияхПрочихРасходов());
	СписокЗапросовОбъединение.Добавить(ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаОтражениеОбесцененияВПартияхПрочихРасходах());
	
	ТекстЗапроса = СтрСоединить(СписокЗапросовОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроведениеПоРеглУчету

Функция ТекстОтраженияВРеглУчете() Экспорт

	Возврат АмортизацияНМАЛокализация.ТекстОтраженияВРеглУчете();

КонецФункции

Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт

	Возврат АмортизацияНМАЛокализация.ТекстЗапросаВТОтраженияВРеглУчете();

КонецФункции

#КонецОбласти

#Область РасчетАмортизации

Процедура ПодготовитьПараметрыДляРасчетаАмортизации(ПараметрыРасчета)

	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("АмортизацияНМА.РассчитатьАмортизацию.ПодготовитьПараметры");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииНМА.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("Дата", КонецМесяца(ПараметрыРасчета.Период));
	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());

	//
	СписокЗапросов = Новый Массив;

	ТекстЗапросаВтДанныеКРасчету(СписокЗапросов);
	ТекстЗапросаСписокВсехНМА(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаСписокОбъектовУчета(СписокЗапросов, ПараметрыРасчета);
	
	ТекстЗапросаПараметрыРасчетаАмортизации(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаПроверкаПараметровРасчета(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаКоличествоПараметровРасчета(СписокЗапросов, ПараметрыРасчета);

	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	КоличествоДанных = Выборка.КоличествоДанных;

	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоДанных);

КонецПроцедуры

Процедура ВыполнитьРасчетАмортизации(ПараметрыРасчета)
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("АмортизацияНМА.РассчитатьАмортизацию.ВыполнитьРасчет");

	АмортизацияНМАЛокализация.ВыполнитьРасчетАмортизации(ПараметрыРасчета);

	ДоначислитьАмортизациюУУЗаПрошлыйМесяц(ПараметрыРасчета);
	ДоначислитьАмортизациюБУЗаПрошлыйМесяц(ПараметрыРасчета);
	
	РассчитатьАмортизациюУУЗаТекущийМесяц(ПараметрыРасчета);
	РассчитатьАмортизациюБУЗаТекущийМесяц(ПараметрыРасчета);
	
	ОбъединитьРезультатыРасчета(ПараметрыРасчета);

	ПроверитьРезультатыРасчета(ПараметрыРасчета);

	ПолучитьКоличествоОбработанныхДанных(ПараметрыРасчета);
	
	ОбщегоНазначенияУТ.ДобавитьИдентификаторыВоВременнуюТаблицу("НачисленнаяАмортизация", ПараметрыРасчета.МенеджерВременныхТаблиц);

	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ПараметрыРасчета.КоличествоОбработанныхДанных);

КонецПроцедуры

Процедура ДоначислитьАмортизациюУУЗаПрошлыйМесяц(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииНМА.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	// Расчет за прошлый месяц до изменения параметров.
	// И получение данных для расчета с учетом изменения параметров.
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаДоначислениеАмортизацииБезИзмененийУУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаДоначислениеАмортизацииВыборкаИзмененийУУ(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	РезультатЗапроса = Запрос.Выполнить();
	
	АмортизацияИзменений = РассчитатьАмортизациюПриИзмененииПараметров(РезультатЗапроса);
	
	// Объединение всех расчетов
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаДоначислениеАмортизацииУУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаДоначислениеАмортизацииУУ_Сгруппированная(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("АмортизацияИзменений_УУ", АмортизацияИзменений);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
КонецПроцедуры

Процедура ДоначислитьАмортизациюБУЗаПрошлыйМесяц(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииНМА.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	// Расчет за прошлый месяц до изменения параметров.
	// И получение данных для расчета с учетом изменения параметров.
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаДоначислениеАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаДоначислениеАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	РезультатЗапроса = Запрос.Выполнить();
	
	АмортизацияИзменений = РассчитатьАмортизациюПриИзмененииПараметров(РезультатЗапроса);
	
	// Объединение всех расчетов
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаДоначислениеАмортизацииБУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаДоначислениеАмортизацииБУ_Сгруппированная(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("АмортизацияИзменений_БУ_МУ", АмортизацияИзменений);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
КонецПроцедуры

Процедура РассчитатьАмортизациюУУЗаТекущийМесяц(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииНМА.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	// Расчет за текущий месяц до изменения параметров
	// И получение данных для расчета с учетом изменения параметров
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаРасчетАмортизацииБезИзмененийУУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаРасчетАмортизацииВыборкаИзмененийУУ(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	АмортизацияИзменений = РассчитатьАмортизациюПриИзмененииПараметров(РезультатЗапроса[РезультатЗапроса.ВГраница()]);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	СписокНМА.ОбесценениеУУ КАК ОбесценениеУУ,
	|	СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокНМА.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр
	|
	|ПОМЕСТИТЬ РасчетАмортизацииСУчетомИзмененийУУ
	|
	|ИЗ
	|	&АмортизацияИзменений_УУ КАК СписокНМА
	|
	|ГДЕ
	|	СписокНМА.ЭтоИзменения";

	Запрос.УстановитьПараметр("АмортизацияИзменений_УУ", АмортизацияИзменений);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РассчитатьАмортизациюБУЗаТекущийМесяц(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииНМА.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	// Расчет за текущий месяц до изменения параметров
	// И получение данных для расчета с учетом изменения параметров
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаРасчетАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаРасчетАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	АмортизацияИзменений = РассчитатьАмортизациюПриИзмененииПараметров(РезультатЗапроса[РезультатЗапроса.ВГраница()]);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл
	|
	|ПОМЕСТИТЬ РасчетАмортизацииСУчетомИзмененийБУ_МУ
	|
	|ИЗ
	|	&АмортизацияИзменений_БУ_МУ КАК СписокНМА
	|ГДЕ
	|	СписокНМА.ЭтоИзменения";

	Запрос.УстановитьПараметр("АмортизацияИзменений_БУ_МУ", АмортизацияИзменений);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОбъединитьРезультатыРасчета(ПараметрыРасчета)
	
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаРасчетАмортизации_УУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаРасчетАмортизации_БУ_МУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаНачисленнаяАмортизация(СписокЗапросов, ПараметрыРасчета);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииНМА.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПроверитьРезультатыРасчета(ПараметрыРасчета)

	АмортизацияНМАЛокализация.ПроверитьРезультатыРасчета(ПараметрыРасчета);

	СписокЗапросов = Новый Массив;
	
	#Область ПроверкаРасчета_УУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.ОбъектУчета КАК ОбъектУчета,
	|	РасчетАмортизации.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходов
	|
	|ПОМЕСТИТЬ ПроверкаРасчета_УУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.НематериальныйАктив КАК ОбъектУчета,
	|
			// НеУказанаСтатьяРасходов
	|		РасчетАмортизации.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК НеУказанаСтатьяРасходов
	|
	|	ИЗ
	|		РасчетАмортизации_УУ КАК РасчетАмортизации
	|
	|	ГДЕ
	|		(РасчетАмортизации.СуммаУУ <> 0
	|			ИЛИ РасчетАмортизации.СуммаБУ <> 0)
	|
	|	) КАК РасчетАмортизации
	|
	|ГДЕ
	|	РасчетАмортизации.НеУказанаСтатьяРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область ПроверкаРасчета_БУ_МУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.ОбъектУчета КАК ОбъектУчета,
	|	РасчетАмортизации.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходов
	|
	|ПОМЕСТИТЬ ПроверкаРасчета_БУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.НематериальныйАктив КАК ОбъектУчета,
	|
			// НеУказанаСтатьяРасходов
	|		РасчетАмортизации.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК НеУказанаСтатьяРасходов
	|
	|	ИЗ
	|		РасчетАмортизации_БУ_МУ КАК РасчетАмортизации
	|
	|	ГДЕ
	|		РасчетАмортизации.СуммаБУ <> 0
	|
	|	) КАК РасчетАмортизации
	|
	|ГДЕ
	|	РасчетАмортизации.НеУказанаСтатьяРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьКоличествоОбработанныхДанных(ПараметрыРасчета)
	
	ТекстЗапроса = ТекстЗапросаКоличествоОбработанныхДанных(ПараметрыРасчета);

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ПараметрыРасчета.КоличествоОбработанныхДанных = Выборка.КоличествоДанных;
	
КонецПроцедуры

// Выполняет расчет амортизации при изменении параметров на дату их изменения.
// 
// Параметры:
// 	РезультатЗапроса - Неопределено, РезультатЗапроса - 
// 	
// Возвращаемое значение:
// 	ТаблицаЗначений - 
Функция РассчитатьАмортизациюПриИзмененииПараметров(РезультатЗапроса) Экспорт

	АмортизацияИзменений = РезультатЗапроса.Выгрузить();
	
	Если АмортизацияИзменений.Количество() = 0 Тогда
		Возврат АмортизацияИзменений;
	КонецЕсли;
	
	АмортизацияИзменений.Сортировать("ЭтоИзменения,Период,Приоритет");
	
	// Хранит параметры расчета, которые использовались при предыдущем расчете.
	ЗначенияПараметровРасчетаИзменений = Новый Соответствие;
	
	Для каждого ДанныеСтроки Из АмортизацияИзменений Цикл
		
		ЗначенияПараметров = ЗначенияПараметровРасчетаИзменений.Получить(ДанныеСтроки.НематериальныйАктив);
		
		Если ЗначенияПараметров = Неопределено Тогда
			
			ЗначенияПараметров = Новый Структура;
			
			// Стоимость и амортизация на дату расчета.
			// Может измениться при переоценке и т.п.
			ЗначенияПараметров.Вставить("СтоимостьУпр", 0);
			ЗначенияПараметров.Вставить("СтоимостьРегл", 0);
			ЗначенияПараметров.Вставить("СтоимостьПР", 0);
			ЗначенияПараметров.Вставить("АмортизацияУпр", 0);
			ЗначенияПараметров.Вставить("АмортизацияРегл", 0);
			ЗначенияПараметров.Вставить("ОбесценениеУпр", 0);
			ЗначенияПараметров.Вставить("ОбесценениеРегл", 0);
			ЗначенияПараметров.Вставить("АмортизацияПР", 0);
			
			// Накопленная амортизация c начала месяца на дату расчета.
			// Используется для прекращения расчета, если она превышает остаточную стоимость.
			ЗначенияПараметров.Вставить("АмортизацияЗаМесяцУпр", 0);  
			ЗначенияПараметров.Вставить("АмортизацияЗаМесяцРегл", 0);
			ЗначенияПараметров.Вставить("АмортизацияЗаМесяцПР", 0);
			
			// Накопленное обесценение c начала месяца на дату расчета.
			// Используется для прекращения расчета, если она превышает остаточную сумму обесценения.
			ЗначенияПараметров.Вставить("ОбесценениеЗаМесяцУпр", 0);  
			ЗначенияПараметров.Вставить("ОбесценениеЗаМесяцРегл", 0);
			
			ЗначенияПараметров.СтоимостьУпр = ДанныеСтроки.Стоимость;
			ЗначенияПараметров.СтоимостьРегл = ДанныеСтроки.СтоимостьРегл;
			ЗначенияПараметров.СтоимостьПР = ДанныеСтроки.СтоимостьПР;

			ЗначенияПараметров.АмортизацияУпр = ДанныеСтроки.Амортизация;
			ЗначенияПараметров.АмортизацияРегл = ДанныеСтроки.АмортизацияРегл;
			ЗначенияПараметров.ОбесценениеУпр = ДанныеСтроки.ОстатокОбесцененияУпр;
			ЗначенияПараметров.ОбесценениеРегл = ДанныеСтроки.ОстатокОбесцененияРегл;
			ЗначенияПараметров.АмортизацияПР = ДанныеСтроки.АмортизацияПР;
			
			ЗначенияПараметровРасчетаИзменений.Вставить(ДанныеСтроки.НематериальныйАктив, ЗначенияПараметров);
			
		КонецЕсли;
		
		Если ДанныеСтроки.ЭтоИзменения Тогда

			Если ТипЗнч(ДанныеСтроки.Регистратор) = Тип("ДокументСсылка.ПереоценкаНМА2_4") Тогда
				
				// Нужно рассчитать остаточную стоимость так как это делает переоценка.
				
				// УУ
				РезультатПереоценки = ВнеоборотныеАктивыСлужебный.РезультатПереоценки(
					ЗначенияПараметров.СтоимостьУпр, 
					ЗначенияПараметров.АмортизацияУпр + ЗначенияПараметров.АмортизацияЗаМесяцУпр, 
					ЗначенияПараметров.ОбесценениеУпр, 
					ДанныеСтроки.СтоимостьИзменение, 
					ДанныеСтроки.МетодПереоценки, 
					ДанныеСтроки.ПереоценкаПоСправедливойСтоимости);
				
				ЗначенияПараметров.СтоимостьУпр = ЗначенияПараметров.СтоимостьУпр + РезультатПереоценки.ИзменениеСтоимости;
				ЗначенияПараметров.АмортизацияУпр = ЗначенияПараметров.АмортизацияУпр + РезультатПереоценки.ИзменениеАмортизации;
				ЗначенияПараметров.ОбесценениеУпр = ЗначенияПараметров.ОбесценениеУпр + РезультатПереоценки.ИзменениеОбесценения;
					
				// БУ
				РезультатПереоценки = ВнеоборотныеАктивыСлужебный.РезультатПереоценки(
					ЗначенияПараметров.СтоимостьРегл, 
					ЗначенияПараметров.АмортизацияРегл + ЗначенияПараметров.АмортизацияЗаМесяцРегл, 
					ЗначенияПараметров.ОбесценениеРегл, 
					ДанныеСтроки.СтоимостьРеглИзменение, 
					ДанныеСтроки.МетодПереоценки, 
					ДанныеСтроки.ПереоценкаПоСправедливойСтоимости);
				
				ЗначенияПараметров.СтоимостьРегл = ЗначенияПараметров.СтоимостьРегл + РезультатПереоценки.ИзменениеСтоимости;
				ЗначенияПараметров.АмортизацияРегл = ЗначенияПараметров.АмортизацияРегл + РезультатПереоценки.ИзменениеАмортизации;
				ЗначенияПараметров.ОбесценениеРегл = ЗначенияПараметров.ОбесценениеРегл + РезультатПереоценки.ИзменениеОбесценения;
				
			ИначеЕсли ТипЗнч(ДанныеСтроки.Регистратор) = Тип("ДокументСсылка.СписаниеНМА2_4") Тогда
				
				Если ДанныеСтроки.НачислятьАмортизацию Тогда
					
					// Частичное списание.
					
					// Уменьшение стоимости на сумму списания.
					ЗначенияПараметров.СтоимостьУпр = ЗначенияПараметров.СтоимостьУпр + ДанныеСтроки.СтоимостьИзменение;
					ЗначенияПараметров.СтоимостьРегл = ЗначенияПараметров.СтоимостьРегл + ДанныеСтроки.СтоимостьРеглИзменение;
					ЗначенияПараметров.СтоимостьПР = ЗначенияПараметров.СтоимостьПР + ДанныеСтроки.СтоимостьПРИзменение;
					
					// Уменьшение амортизации пропорционально списанной стоимости.
					Если ДанныеСтроки.Стоимость <> 0 Тогда
						
						ДоляСписания = ?(ДанныеСтроки.Стоимость <> 0, Окр(-ДанныеСтроки.СтоимостьИзменение / ДанныеСтроки.Стоимость, 16), 1);
						
						ЗначенияПараметров.АмортизацияУпр = 
							ЗначенияПараметров.АмортизацияУпр 
							- ЗначенияПараметров.АмортизацияУпр * ДоляСписания;
							
						ЗначенияПараметров.АмортизацияЗаМесяцУпр = 
							ЗначенияПараметров.АмортизацияЗаМесяцУпр 
							- ЗначенияПараметров.АмортизацияЗаМесяцУпр * ДоляСписания;
							
					КонецЕсли; 
						
					Если ДанныеСтроки.СтоимостьРегл <> 0 Тогда
						
						ДоляСписания = ?(ДанныеСтроки.СтоимостьРегл <> 0, Окр(-ДанныеСтроки.СтоимостьРеглИзменение / ДанныеСтроки.СтоимостьРегл, 16), 1);
						
						ЗначенияПараметров.АмортизацияРегл = 
							ЗначенияПараметров.АмортизацияРегл 
							- ДанныеСтроки.АмортизацияРегл * ДоляСписания;
						
						ЗначенияПараметров.АмортизацияЗаМесяцРегл = 
							ЗначенияПараметров.АмортизацияЗаМесяцРегл 
							- ЗначенияПараметров.АмортизацияЗаМесяцРегл * ДоляСписания;
							
					КонецЕсли; 
					
					Если ДанныеСтроки.СтоимостьПР <> 0 Тогда
						
						ДоляСписания = ?(ДанныеСтроки.СтоимостьПР <> 0, Окр(-ДанныеСтроки.СтоимостьПРИзменение / ДанныеСтроки.СтоимостьПР, 12), 1);
						
						ЗначенияПараметров.АмортизацияПР = 
							ЗначенияПараметров.АмортизацияПР 
							- Окр((ЗначенияПараметров.АмортизацияПР + ЗначенияПараметров.АмортизацияЗаМесяцПР) * ДоляСписания, 2);
						
					КонецЕсли; 
					
				Иначе	
					
					// Полное списание.
					ЗначенияПараметров.СтоимостьУпр = 0;
					ЗначенияПараметров.СтоимостьРегл = 0;
					ЗначенияПараметров.СтоимостьПР = 0;
					ЗначенияПараметров.АмортизацияУпр = 0;
					ЗначенияПараметров.АмортизацияРегл = 0;
					ЗначенияПараметров.ОбесценениеУпр = 0;
					ЗначенияПараметров.ОбесценениеРегл = 0;
					ЗначенияПараметров.АмортизацияПР = 0;
					
				КонецЕсли; 
					
			ИначеЕсли ТипЗнч(ДанныеСтроки.Регистратор) = Тип("ДокументСсылка.КорректировкаСтоимостиИАмортизацииНМА") Тогда
				
				Если ДанныеСтроки.КорректировкаСтоимостиУУ
					ИЛИ ДанныеСтроки.СтоимостьИзменение <> 0 Тогда
					
					ЗначенияПараметров.СтоимостьУпр = ДанныеСтроки.СтоимостьИзменение;
					
				КонецЕсли;
				
				Если ДанныеСтроки.КорректировкаСтоимостиБУ
					ИЛИ ДанныеСтроки.СтоимостьРеглИзменение <> 0 Тогда
					
					ЗначенияПараметров.СтоимостьРегл = ДанныеСтроки.СтоимостьРеглИзменение;
					
				КонецЕсли;

				Если ДанныеСтроки.КорректировкаСтоимостиБУ
					ИЛИ ДанныеСтроки.СтоимостьПРИзменение <> 0 Тогда
					
					ЗначенияПараметров.СтоимостьПР = ДанныеСтроки.СтоимостьПРИзменение;
					
				КонецЕсли;

				Если ДанныеСтроки.КорректировкаАмортизацииУУ
					ИЛИ ДанныеСтроки.АмортизацияИзменение <> 0 Тогда
					
					ЗначенияПараметров.АмортизацияУпр = ДанныеСтроки.АмортизацияИзменение;
					
					ЗначенияПараметров.АмортизацияЗаМесяцУпр = 0;
					
				КонецЕсли;
				
				Если ДанныеСтроки.КорректировкаАмортизацииБУ
					ИЛИ ДанныеСтроки.АмортизацияРеглИзменение <> 0 Тогда
					
					ЗначенияПараметров.АмортизацияРегл = ДанныеСтроки.АмортизацияРеглИзменение;
					
					ЗначенияПараметров.АмортизацияЗаМесяцРегл = 0;
					
				КонецЕсли;
				
				Если ДанныеСтроки.КорректировкаАмортизацииБУ
					ИЛИ ДанныеСтроки.АмортизацияПРИзменение <> 0 Тогда
					
					ЗначенияПараметров.АмортизацияПР = ДанныеСтроки.АмортизацияПРИзменение;
					
					ЗначенияПараметров.АмортизацияЗаМесяцПР = 0;
					
				КонецЕсли;
				
			Иначе
				
				ЗначенияПараметров.СтоимостьУпр  = ЗначенияПараметров.СтоимостьУпр  + ДанныеСтроки.СтоимостьИзменение;
				ЗначенияПараметров.СтоимостьРегл = ЗначенияПараметров.СтоимостьРегл + ДанныеСтроки.СтоимостьРеглИзменение;
				ЗначенияПараметров.СтоимостьПР   = ЗначенияПараметров.СтоимостьПР   + ДанныеСтроки.СтоимостьПРИзменение;
				
			КонецЕсли; 
			
			// Стоимость, которая используется для расчета амортизации.
			ДанныеСтроки.СтоимостьДляВычисленияАмортизации = ЗначенияПараметров.СтоимостьУпр - ЗначенияПараметров.АмортизацияУпр;
			ДанныеСтроки.СтоимостьДляВычисленияАмортизацииРегл = ЗначенияПараметров.СтоимостьРегл - ЗначенияПараметров.АмортизацияРегл;
			
			// Расчет суммы амортизации по формуле.
			
			ОбесценениеУУ = ?(
				ДанныеСтроки.ВариантПроводокПоОбесценениюВНА = Перечисления.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения, 
				ЗначенияПараметров.ОбесценениеУпр, 
				0);
			
			ОбесценениеБУ = ?(
				ДанныеСтроки.ВариантПроводокПоОбесценениюВНА = Перечисления.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения, 
				ЗначенияПараметров.ОбесценениеРегл, 
				0);
			
			ДанныеСтроки.СуммаУУ = РассчитатьСуммуАмортизацииУУ(
										ДанныеСтроки, 
										ДанныеСтроки.СтоимостьДляВычисленияАмортизации, 
										ДанныеСтроки.ЛиквидационнаяСтоимость, 
										ОбесценениеУУ, 
										ЗначенияПараметров.АмортизацияЗаМесяцУпр,
										ВнеоборотныеАктивыСлужебный.МинимальнаяОстаточнаяСтоимостьУпр());
			
			ДанныеСтроки.СуммаБУ = РассчитатьСуммуАмортизацииУУ(
										ДанныеСтроки, 
										ДанныеСтроки.СтоимостьДляВычисленияАмортизацииРегл, 
										ДанныеСтроки.ЛиквидационнаяСтоимостьРегл, 
										ОбесценениеБУ, 
										ЗначенияПараметров.АмортизацияЗаМесяцРегл,
										ВнеоборотныеАктивыСлужебный.МинимальнаяОстаточнаяСтоимостьРегл());
										
			// Расчет суммы обесценения по формуле.
			ДанныеСтроки.ОбесценениеУУ = РассчитатьСуммуОбесценения(
										ДанныеСтроки, 
										ЗначенияПараметров.ОбесценениеУпр,
										ЗначенияПараметров.ОбесценениеЗаМесяцУпр,
										ВнеоборотныеАктивыСлужебный.МинимальнаяОстаточнаяСтоимостьУпр());
			
			ДанныеСтроки.ОбесценениеБУ = РассчитатьСуммуОбесценения(
										ДанныеСтроки, 
										ЗначенияПараметров.ОбесценениеРегл,
										ЗначенияПараметров.ОбесценениеЗаМесяцРегл,
										ВнеоборотныеАктивыСлужебный.МинимальнаяОстаточнаяСтоимостьРегл());
										
			// Расчет ПР
			Если (ЗначенияПараметров.СтоимостьПР - ЗначенияПараметров.АмортизацияПР) = 0
				ИЛИ ДанныеСтроки.СтоимостьДляВычисленияАмортизацииРегл <= 0
				ИЛИ ДанныеСтроки.СуммаБУ = 0 Тогда
					
				ДанныеСтроки.СуммаПР = 0;
				
			ИначеЕсли ДанныеСтроки.СуммаБУ = ДанныеСтроки.СтоимостьДляВычисленияАмортизацииРегл Тогда
				
				ДанныеСтроки.СуммаПР = ЗначенияПараметров.СтоимостьПР - ЗначенияПараметров.АмортизацияПР;
				
			Иначе
				
				КоэффициентАмортизции = 
					Окр((ДанныеСтроки.СуммаБУ - Окр(ДанныеСтроки.СуммаБУ * ДанныеСтроки.КоэффициентЦФБУ, 2) + ДанныеСтроки.ОбесценениеБУ) 
							/ (ЗначенияПараметров.СтоимостьРегл - ЗначенияПараметров.АмортизацияРегл), 12);
				
				ДанныеСтроки.СуммаПР = (ЗначенияПараметров.СтоимостьПР - ЗначенияПараметров.АмортизацияПР) * КоэффициентАмортизции;
						
				ДанныеСтроки.СуммаПР = Окр(ДанныеСтроки.СуммаПР, 2);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Накопленная амортизация за месяц.
		ЗначенияПараметров.АмортизацияЗаМесяцУпр  = ЗначенияПараметров.АмортизацияЗаМесяцУпр  + ДанныеСтроки.СуммаУУ;
		ЗначенияПараметров.АмортизацияЗаМесяцРегл = ЗначенияПараметров.АмортизацияЗаМесяцРегл + ДанныеСтроки.СуммаБУ;
		ЗначенияПараметров.АмортизацияЗаМесяцПР   = ЗначенияПараметров.АмортизацияЗаМесяцПР   + ДанныеСтроки.СуммаПР;
		
		// Накопленное обесценение за месяц.
		ЗначенияПараметров.ОбесценениеЗаМесяцУпр  = ЗначенияПараметров.ОбесценениеЗаМесяцУпр  + ДанныеСтроки.ОбесценениеУУ;
		ЗначенияПараметров.ОбесценениеЗаМесяцРегл = ЗначенияПараметров.ОбесценениеЗаМесяцРегл + ДанныеСтроки.ОбесценениеБУ;
		
	КонецЦикла; 
	
	Возврат АмортизацияИзменений;

КонецФункции

Функция РассчитатьСуммуАмортизацииУУ(ДанныеСтроки, ОстаточнаяСтоимость, ЛиквидационнаяСтоимость, ОстатокОбесценения, НачисленнаяАмортизацияЗаМесяц, МинимальнаяОстаточнаяСтоимость)

	СуммаУУ = 0;
	
	ОстаточнаяСтоимостьПослеНачисленияАмортизации =
		(ОстаточнаяСтоимость
			- НачисленнаяАмортизацияЗаМесяц 
			- ЛиквидационнаяСтоимость);
				
	Если НЕ ДанныеСтроки.НачислятьАмортизацию 
		ИЛИ ОстаточнаяСтоимостьПослеНачисленияАмортизации <= 0
		ИЛИ ДанныеСтроки.РесурсНазначенный <= 0 Тогда
		
		СуммаУУ = 0;
		
	ИначеЕсли (ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод + ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод) >= ДанныеСтроки.РесурсНазначенный Тогда
		
		СуммаУУ = ОстаточнаяСтоимость - ОстатокОбесценения - ЛиквидационнаяСтоимость;
		
	ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Линейный
		ИЛИ ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции
		ИЛИ ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка
			И (ДанныеСтроки.РесурсНазначенный
				- ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод
				- ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод) <= 12 Тогда
		
		СуммаУУ = (ОстаточнаяСтоимость - ЛиквидационнаяСтоимость - ОстатокОбесценения)
					* (ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод)
					/ (ДанныеСтроки.РесурсНазначенный - ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод);
		
	ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка Тогда
		
		СуммаУУ = ОстаточнаяСтоимость
					* ДанныеСтроки.КоэффициентУскорения
					* ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод
					/ (ДанныеСтроки.РесурсНазначенный - ДанныеСтроки.КоэффициентУскорения 
							*(ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод - ДанныеСтроки.ОтработанныхМесяцевПолныхЛет));
	КонецЕсли; 
	
	Если СуммаУУ > ОстаточнаяСтоимостьПослеНачисленияАмортизации
		ИЛИ (ОстаточнаяСтоимостьПослеНачисленияАмортизации - СуммаУУ) < МинимальнаяОстаточнаяСтоимость Тогда
		СуммаУУ = Макс(ОстаточнаяСтоимостьПослеНачисленияАмортизации, 0);
	КонецЕсли; 
	
	Возврат Окр(СуммаУУ, 2);
	
КонецФункции

Функция РассчитатьСуммуОбесценения(ДанныеСтроки, ОстатокОбесценения, НачисленноеОбесценениеЗаМесяц, МинимальнаяОстаточнаяСтоимость)

	СуммаОбесценения = 0;
	
	ОстатокОбесцененияПослеНачисления = ОстатокОбесценения - НачисленноеОбесценениеЗаМесяц;
	
	Если НЕ ДанныеСтроки.НачислятьАмортизацию 
		ИЛИ ОстатокОбесцененияПослеНачисления <= 0
		ИЛИ ОстатокОбесценения <= 0 Тогда
		
		СуммаОбесценения = 0;
		
	ИначеЕсли (ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод + ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод) >= ДанныеСтроки.РесурсНазначенный Тогда
		
		СуммаОбесценения = ОстатокОбесценения;
		
	ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Линейный
		ИЛИ ДанныеСтроки.МетодНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции Тогда
		
		СуммаОбесценения = ОстатокОбесценения
					* (ДанныеСтроки.РесурсВыработанныйЗаТекущийПериод)
					/ (ДанныеСтроки.РесурсНазначенный - ДанныеСтроки.РесурсВыработанныйЗаПрошлыйПериод);
		
	КонецЕсли; 
	
	Если СуммаОбесценения > ОстатокОбесцененияПослеНачисления
		ИЛИ (ОстатокОбесцененияПослеНачисления - СуммаОбесценения) < МинимальнаяОстаточнаяСтоимость Тогда
		СуммаОбесценения = Макс(ОстатокОбесцененияПослеНачисления, 0);
	КонецЕсли; 
	
	Возврат Окр(СуммаОбесценения, 2);
	
КонецФункции

Процедура ЗарегистрироватьОшибкиРасчетаАмортизации(ПараметрыРасчета)

	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("АмортизацияНМА.РассчитатьАмортизацию.ЗарегистрироватьОшибки");

	ПараметрыРасчета.ИспользуемыеТаблицы = ПараметрыРасчета.ИспользуемыеТаблицы + "," + "НомераПакетовСОшибками";
	
	ИспользуемыеВТ = ОбщегоНазначенияУТ.СписокВременныхТаблиц(ПараметрыРасчета.МенеджерВременныхТаблиц);
	ИспользуемыеВТ.Добавить("НомераПакетовСОшибками");

	ТекстЗапроса = АмортизацияНМАЛокализация.ТекстЗапросаЗарегистрироватьОшибкиРасчетаАмортизации(ПараметрыРасчета);
	
	Если ТекстЗапроса = Неопределено Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроверкаПараметровРасчета.Организация КАК Организация,
		|	ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
		|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанОбъемНаработки) КАК НеУказанОбъемНаработки,
		|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовУУ) КАК НеУказанаСтатьяРасходовУУ,
		|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовБУ) КАК НеУказанаСтатьяРасходовБУ
		|
		|ПОМЕСТИТЬ ПроверкаПараметровРасчета
		|
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПроверкаПараметровРасчета.Организация КАК Организация,
		|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
		|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
		|		ЛОЖЬ КАК НеУказанаСтатьяРасходовУУ,
		|		ЛОЖЬ КАК НеУказанаСтатьяРасходовБУ
		|	ИЗ
		|		ПроверкаПараметровРасчета_УУ КАК ПроверкаПараметровРасчета
		|	ГДЕ
		|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПроверкаПараметровРасчета.Организация,
		|		ПроверкаПараметровРасчета.ОбъектУчета,
		|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки,
		|		ЛОЖЬ КАК НеУказанаСтатьяРасходовУУ,
		|		ЛОЖЬ КАК НеУказанаСтатьяРасходовБУ
		|	ИЗ
		|		ПроверкаПараметровРасчета_БУ_МУ КАК ПроверкаПараметровРасчета
		|	ГДЕ
		|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПроверкаРасчета.Организация,
		|		ПроверкаРасчета.ОбъектУчета,
		|		ЛОЖЬ,
		|		ПроверкаРасчета.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходовУУ,
		|		ЛОЖЬ КАК НеУказанаСтатьяРасходовБУ
		|	ИЗ
		|		ПроверкаРасчета_УУ КАК ПроверкаРасчета
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПроверкаРасчета.Организация,
		|		ПроверкаРасчета.ОбъектУчета,
		|		ЛОЖЬ,
		|		ЛОЖЬ КАК НеУказанаСтатьяРасходовУУ,
		|		ПроверкаРасчета.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходовБУ
		|	ИЗ
		|		ПроверкаРасчета_БУ_МУ КАК ПроверкаРасчета
		|
		|	) КАК ПроверкаПараметровРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроверкаПараметровРасчета.ОбъектУчета,
		|	ПроверкаПараметровРасчета.Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ОбъектУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПакетыАмортизации.Организация КАК Организация,
		|	ПакетыАмортизации.НомерПакета КАК НомерПакета
		|
		|ПОМЕСТИТЬ НомераПакетовСОшибками
		|
		|ИЗ
		|	ПроверкаПараметровРасчета КАК ПроверкаПараметровРасчета
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизации
		|			ПО ПакетыАмортизации.Организация = ПроверкаПараметровРасчета.Организация
		|				И ПакетыАмортизации.НематериальныйАктив = ПроверкаПараметровРасчета.ОбъектУчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	НомерПакета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроверкаПараметровРасчета.Организация КАК Организация,
		|	ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
		|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.НематериальныеАктивы).Наименование КАК ОбъектУчетаПредставление,
		|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.НематериальныеАктивы).Код КАК Код,
		|	ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
		|	ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовУУ КАК НеУказанаСтатьяРасходовУУ,
		|	ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовБУ КАК НеУказанаСтатьяРасходовБУ
		|
		|ИЗ
		|	ПроверкаПараметровРасчета КАК ПроверкаПараметровРасчета
		|";
		
	КонецЕсли; 
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокОрганизаций", ПараметрыРасчета.СписокОрганизаций);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ШаблонОбъемНаработки = НСтр("ru = 'Для объекта учета ""%1"" (код %2) не указан предполагаемый объем наработки (продукции, работ).';
								|en = 'Estimated asset activity value (of products, works) is not specified for the ""%1"" accounting object (code %2).'");
	ШаблонНеУказанаСтатьяРасходовУУ = НСтр("ru = 'Для объекта учета ""%1"" (код №%2) в управленческом учете не определена статья расходов отражения амортизации.';
											|en = 'The depreciation recording expense item is not specified for the ""%1"" accounting object (code No. %2) in the management accounting.'");
	ШаблонНеУказанаСтатьяРасходовБУ = НСтр("ru = 'Для объекта учета ""%1"" (код №%2) в бухгалтерском учете не определена статья расходов отражения амортизации.';
											|en = 'The expense item is not specified to record depreciation, for the ""%1"" (code No. %2) accounting object in local accounting.'");
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НеУказанОбъемНаработки Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонОбъемНаработки, Выборка.ОбъектУчетаПредставление, Выборка.Код);
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииНМА, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанаСтатьяРасходовУУ Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонНеУказанаСтатьяРасходовУУ, Выборка.ОбъектУчетаПредставление, Выборка.Код);
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанаСтатьяРасходовБУ Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонНеУказанаСтатьяРасходовБУ, Выборка.ОбъектУчетаПредставление, Выборка.Код);
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 

		АмортизацияНМАЛокализация.ЗарегистрироватьОшибкиРасчетаАмортизации(Выборка, ПараметрыРасчета);
	
	КонецЦикла;
	
	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(ПараметрыРасчета.МенеджерВременныхТаблиц,, ИспользуемыеВТ);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1);
	
КонецПроцедуры

Процедура ЗаписатьРасчетАмортизации(ПараметрыРасчета)

	Если НЕ ПараметрыРасчета.ЗаписатьДанные Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Выборка Из ПараметрыРасчета.ПакетыАмортизации Цикл
			
		НачатьТранзакцию();
	
		Попытка
		
			ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("АмортизацияНМА.РассчитатьАмортизацию.ЗаписатьРасчет");
		
			// Нужно заблокировать документы, чтобы не создать дублей
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.АмортизацияНМА2_4");
			ЭлементБлокировки.УстановитьЗначение("Дата", Новый Диапазон(НачалоМесяца(ПараметрыРасчета.Период),КонецМесяца(ПараметрыРасчета.Период)));
			ЭлементБлокировки.УстановитьЗначение("Организация", Выборка.Организация);
			ЭлементБлокировки.УстановитьЗначение("НомерПакета", Выборка.НомерПакета);
			
			Блокировка.Заблокировать(); 
			
			ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	НачисленнаяАмортизация КАК НачисленнаяАмортизация
			|ГДЕ
			|	НачисленнаяАмортизация.Организация = &Организация
			|	И НачисленнаяАмортизация.НомерПакета = &НомерПакета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	НомераПакетовСОшибками КАК НомераПакетовСОшибками
			|ГДЕ
			|	НомераПакетовСОшибками.Организация = &Организация
			|	И НомераПакетовСОшибками.НомерПакета = &НомерПакета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА РегламентныйДокумент.Проведен = ИСТИНА
			|				ТОГДА РегламентныйДокумент.Ссылка
			|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.АмортизацияНМА2_4.ПустаяСсылка)
			|		КОНЕЦ) КАК СсылкаПроведен,
			|
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА РегламентныйДокумент.Проведен = ЛОЖЬ
			|				ТОГДА РегламентныйДокумент.Ссылка
			|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.АмортизацияНМА2_4.ПустаяСсылка)
			|		КОНЕЦ) КАК СсылкаНеПроведен,
			|
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА РегламентныйДокумент.ПометкаУдаления = ИСТИНА
			|				ТОГДА РегламентныйДокумент.Ссылка
			|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.АмортизацияНМА2_4.ПустаяСсылка)
			|		КОНЕЦ) КАК СсылкаУдален
			|
			|ИЗ
			|	Документ.АмортизацияНМА2_4 КАК РегламентныйДокумент
			|
			|ГДЕ
			|	РегламентныйДокумент.Организация = &Организация
			|	И РегламентныйДокумент.НомерПакета = &НомерПакета
			|	И РегламентныйДокумент.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
			|";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПараметрыРасчета.Период));
			Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПараметрыРасчета.Период));
			Запрос.УстановитьПараметр("Организация", Выборка.Организация);
			Запрос.УстановитьПараметр("НомерПакета", Выборка.НомерПакета);
			
			//@skip-check query-in-loop
			Результат = Запрос.ВыполнитьПакет();
			
			ЕстьНачисленнаяАмортизация = НЕ Результат[Результат.ВГраница()-2].Пустой();
			ЕстьОшибки = НЕ Результат[Результат.ВГраница()-1].Пустой();
			
			ВыборкаДокумент = Результат[Результат.ВГраница()].Выбрать();
			ВыборкаДокумент.Следующий();
			
			Ответственный = Пользователи.ТекущийПользователь();

			Если Выборка.НомерПакета = ПараметрыРасчета.НомерПакета Тогда
				
				// Расчет выполняется из формы документа.
				Если ЗначениеЗаполнено(ПараметрыРасчета.Ссылка) Тогда
					
					ДокументОбъект = ПараметрыРасчета.Ссылка.ПолучитьОбъект(); // ДокументОбъект.АмортизацияНМА2_4
					ДокументОбъект.Комментарий = ПараметрыРасчета.Комментарий;
					Ответственный = ПараметрыРасчета.Ответственный;
					
				Иначе 
					
					ДокументОбъект = ВнеоборотныеАктивыСлужебный.ПолучитьРегламентныйДокумент(
						ВыборкаДокумент.СсылкаПроведен, 
						Неопределено, 
						Неопределено, 
						Документы.АмортизацияНМА2_4);
						
				КонецЕсли;
				
			Иначе	
				
				ДокументОбъект = ВнеоборотныеАктивыСлужебный.ПолучитьРегламентныйДокумент(
					ВыборкаДокумент.СсылкаПроведен, 
					ВыборкаДокумент.СсылкаНеПроведен, 
					ВыборкаДокумент.СсылкаУдален, 
					Документы.АмортизацияНМА2_4);
					
			КонецЕсли; 
			
			Если ЕстьНачисленнаяАмортизация
				ИЛИ ЗначениеЗаполнено(ПараметрыРасчета.Ссылка) Тогда
			
				ДокументОбъект.Дата = КонецМесяца(ПараметрыРасчета.Период);
				ДокументОбъект.НомерПакета = Выборка.НомерПакета;
				ДокументОбъект.Организация = Выборка.Организация;
				ДокументОбъект.Ответственный = Ответственный;
				ДокументОбъект.ПометкаУдаления = Ложь;
				
				ДокументОбъект.ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", ПараметрыРасчета.МенеджерВременныхТаблиц);
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			ИначеЕсли НЕ ДокументОбъект.ПометкаУдаления
				И НЕ ДокументОбъект.ЭтоНовый() Тогда
				
				ДокументОбъект.УстановитьПометкуУдаления(Истина);
				
			КонецЕсли;
			
			ВнеоборотныеАктивыСлужебный.УничтожитьВременныеТаблицыПослеЗаписиРасчетаАмортизации(
				ПараметрыРасчета.МенеджерВременныхТаблиц, ПараметрыРасчета);
		
			Если ПараметрыРасчета.ЗафиксироватьРасчет Тогда

				Если ЕстьОшибки Тогда
					
					// Нужно создать задание с новым номером, т.к. задания со старыми номерами могут быть удалены
					РегистрыСведений.ЗаданияКРасчетуАмортизацииНМА.СоздатьЗаписьРегистра(
						ПараметрыРасчета.Период, Неопределено, Выборка.Организация, Выборка.НомерПакета);
					
				Иначе
					
					ПакетыАмортизации = ПараметрыРасчета.ПакетыАмортизации.Скопировать(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка));
					
					РегистрыСведений.ЗаданияКРасчетуАмортизацииНМА.ЗафиксироватьРасчет(
						ПараметрыРасчета.Период, 
						ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.Организация), 
						ПараметрыРасчета.НомерДоРасчета, 
						ПакетыАмортизации);
				
				КонецЕсли;
				
			КонецЕсли;
	
			ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ПараметрыРасчета.КоличествоОбработанныхДанных);
			
			ЗафиксироватьТранзакцию();
		
		Исключение
		
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			
			ВызватьИсключение ТекстОшибки;
		
		КонецПопытки;
		 
	КонецЦикла; 
	
КонецПроцедуры

#Область ТекстыЗапросовДляРасчетаАмортизации

Процедура ТекстЗапросаВтДанныеКРасчету(СписокЗапросов)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПакетыАмортизации.Организация КАК Организация,
	|	ПакетыАмортизации.НомерПакета КАК НомерПакета
	|
	|ПОМЕСТИТЬ НомераПакетов
	|
	|ИЗ
	|	&ПакетыАмортизации КАК ПакетыАмортизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетыАмортизации.Организация КАК Организация,
	|	ПакетыАмортизации.НематериальныйАктив КАК ОбъектУчета
	|
	|ПОМЕСТИТЬ ОбъектыПакетовАмортизации
	|
	|ИЗ
	|	РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизации
	|
	|ГДЕ
	|	(ПакетыАмортизации.Организация, ПакетыАмортизации.НомерПакета) В 
	|		(ВЫБРАТЬ
	|			НомераПакетов.Организация,
	|			НомераПакетов.НомерПакета
	|		ИЗ
	|			НомераПакетов КАК НомераПакетов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеКРасчету.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ДанныеКРасчету.Организация КАК Справочник.Организации).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеКРасчету.ОбъектУчета КАК ОбъектУчета
	|
	|ПОМЕСТИТЬ ВтДанныеКРасчету
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОбъектыПакетовАмортизации.Организация КАК Организация,
	|		ОбъектыПакетовАмортизации.ОбъектУчета КАК ОбъектУчета
	|	ИЗ
	|		ОбъектыПакетовАмортизации
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеДокумента.Организация,
	|		ТаблицаНМА.НематериальныйАктив
	|	ИЗ
	|		Документ.ПеремещениеНМА2_4 КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеНМА2_4.НМА КАК ТаблицаНМА
	|			ПО (ТаблицаНМА.Ссылка = ДанныеДокумента.Ссылка)
	|
	|	ГДЕ
	|		ДанныеДокумента.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеНМАвПодразделениеВыделенноеНаБаланс)
	|		И ДанныеДокумента.Проведен
	|
	|		И (ДанныеДокумента.ОрганизацияПолучатель, ТаблицаНМА.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ОбъектыПакетовАмортизации.Организация,
	|					ОбъектыПакетовАмортизации.ОбъектУчета
	|				ИЗ
	|					ОбъектыПакетовАмортизации КАК ОбъектыПакетовАмортизации)
	|
	|	) КАК ДанныеКРасчету
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета,
	|	Организация
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаСписокОбъектовУчета(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = АмортизацияНМАЛокализация.ТекстЗапросаСписокОбъектовУчета(ПараметрыРасчета);
	
	Если ТекстЗапроса = Неопределено Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНМА.НачалоМесяца                        КАК НачалоМесяца,
		|	СписокНМА.КонецМесяца                         КАК КонецМесяца,
		|	СписокНМА.Организация                         КАК Организация,
		|	СписокНМА.НематериальныйАктив                 КАК НематериальныйАктив,
		|	СписокНМА.СпособОтраженияАмортизации          КАК СпособОтраженияАмортизации,
		|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0) КАК НомерПакета,
		|
		|	СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
		|
		|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
		|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ
		|
		|ПОМЕСТИТЬ СписокОбъектовУчета
		|
		|ИЗ
		|	СписокОбъектовУчета_УУ КАК СписокНМА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
		|		ПО ПакетыАмортизацииНМА.Организация = СписокНМА.Организация
		|			И ПакетыАмортизацииНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(
		|			&КонецМесяца,
		|			Организация В (ВЫБРАТЬ СписокНМА.ГоловнаяОрганизация ИЗ СписокОбъектовУчета_УУ КАК СписокНМА)) КАК УчетнаяПолитика
		|		ПО УчетнаяПолитика.Организация = СписокНМА.ГоловнаяОрганизация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокНМА.НачалоМесяца                        КАК НачалоМесяца,
		|	СписокНМА.КонецМесяца                         КАК КонецМесяца,
		|	СписокНМА.Организация                         КАК Организация,
		|	СписокНМА.НематериальныйАктив                 КАК НематериальныйАктив,
		|	СписокНМА.СпособОтраженияАмортизации          КАК СпособОтраженияАмортизации,
		|	ЕСТЬNULL(ПакетыАмортизацииНМА.НомерПакета, 0) КАК НомерПакета,
		|
		|	СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
		|
		|	ИСТИНА КАК АмортизацияНачисляетсяПоСтандартамМУ
		|
		|ИЗ
		|	СписокОбъектовУчета_БУ_МУ КАК СписокНМА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
		|		ПО ПакетыАмортизацииНМА.Организация = СписокНМА.Организация
		|			И ПакетыАмортизацииНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НематериальныйАктив,
		|	Организация";
		
	КонецЕсли; 
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаСписокВсехНМА(СписокЗапросов, ПараметрыРасчета)

	#Область ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.ОтражатьВУпрУчете КАК ОтражатьВУпрУчете,
	|	ДанныеДокумента.ОтражатьВРеглУчете КАК ОтражатьВРеглУчете,
	|	ТаблицаОбъектов.НематериальныйАктив КАК ОбъектУчета
	|
	|ПОМЕСТИТЬ ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|
	|ИЗ
	|	Документ.КорректировкаСтоимостиИАмортизацииНМА КАК ДанныеДокумента
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА.НМА КАК ТаблицаОбъектов
	|		ПО ТаблицаОбъектов.Ссылка = ДанныеДокумента.Ссылка
	|
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеДокумента.ВключаетАмортизациюТекущегоМесяца
	|	И ДанныеДокумента.Проведен
	|
	|	И (ДанныеДокумента.Организация, ТаблицаОбъектов.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	АмортизацияНМАЛокализация.ДополнитьТекстЗапросаСписокВсехНМА(СписокЗапросов, ПараметрыРасчета);
	
	#Область СписокОбъектовУчета_Доначисление_УУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьНМА.Организация      КАК Организация,
	|	СтоимостьНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	МИНИМУМ(СтоимостьНМА.Период)  КАК Период
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_Доначисление_УУ
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = СтоимостьНМА.Организация.ГоловнаяОрганизация
	|ГДЕ
	|	СтоимостьНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И СтоимостьНМА.Активность
	|	И СтоимостьНМА.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И СтоимостьНМА.ОтражатьВУпрУчете
	|	И (ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ))
	|
	|	И СтоимостьНМА.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМА))
	|
	|	И (СтоимостьНМА.Организация, СтоимостьНМА.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = СтоимостьНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВУпрУчете)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНМА.Организация,
	|	СтоимостьНМА.НематериальныйАктив
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтоимостьНМА.Стоимость - СтоимостьНМА.ПредварительнаяСтоимость) > 0
	|		ИЛИ &ЭтоМеждународнаяВерсия 
	|			И СУММА(СтоимостьНМА.СтоимостьРегл - СтоимостьНМА.ПредварительнаяСтоимостьРегл) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_Доначисление_БУ_МУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьНМА.Организация      КАК Организация,
	|	СтоимостьНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	МИНИМУМ(СтоимостьНМА.Период)  КАК Период
	|ПОМЕСТИТЬ СписокОбъектовУчета_Доначисление_БУ_МУ
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = СтоимостьНМА.Организация.ГоловнаяОрганизация
	|ГДЕ
	|	СтоимостьНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И СтоимостьНМА.Активность
	|	И СтоимостьНМА.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И СтоимостьНМА.ОтражатьВРеглУчете
	|	И &ЭтоМеждународнаяВерсия
	|	И ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)) = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.Независимый)
	|
	|	И СтоимостьНМА.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМА))
	|
	|	И (СтоимостьНМА.Организация, СтоимостьНМА.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = СтоимостьНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВУпрУчете)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНМА.Организация,
	|	СтоимостьНМА.НематериальныйАктив
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтоимостьНМА.СтоимостьРегл - СтоимостьНМА.ПредварительнаяСтоимостьРегл) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_УУ
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоМесяца                       КАК НачалоМесяца,
	|	&КонецМесяца                        КАК КонецМесяца,
	|	&КонецПредыдущегоМесяца             КАК Период,
	|	&КонецПредыдущегоМесяца             КАК ПериодПараметров,
	|	ЛОЖЬ                                КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.Подразделение КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельности КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМА, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_УУ
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАУУ.СрезПоследних(
	|			&КонецПредыдущегоМесяца,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)) КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|
	|ГДЕ
	|	НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВУпрУчете)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоПредыдущегоМесяца            КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца             КАК КонецМесяца,
	|	&НачалоПредыдущегоМесяца            КАК Период,
	|	&КонецПозапрошлогоМесяца            КАК ПериодПараметров,
	|	ИСТИНА                              КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.Подразделение КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельности КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМА, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАУУ.СрезПоследних(
	|			&КонецПозапрошлогоМесяца,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)) КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|
	|ГДЕ
	|	НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВУпрУчете)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоМесяца                       КАК НачалоМесяца,
	|	&КонецМесяца                        КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК ПериодПараметров,
	|	ЛОЖЬ                                КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.Подразделение КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельности КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМА, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАУУ КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|
	|ГДЕ
	|	ПорядокУчетаНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|
	|	И (ПорядокУчетаНМА.Организация, ПорядокУчетаНМА.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВУпрУчете)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоПредыдущегоМесяца            КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца             КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК ПериодПараметров,
	|	ИСТИНА                              КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходов    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.Подразделение КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельности КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМА, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАУУ КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|ГДЕ
	|	ПорядокУчетаНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И (ПорядокУчетаНМА.Организация, ПорядокУчетаНМА.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВУпрУчете)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив, 
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_БУ_МУ
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоМесяца                       КАК НачалоМесяца,
	|	&КонецМесяца                        КАК КонецМесяца,
	|	&КонецПредыдущегоМесяца             КАК Период,
	|	&КонецПредыдущегоМесяца             КАК ПериодПараметров,
	|	ЛОЖЬ                                КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходовБУ    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходовБУ КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.ПодразделениеБУ КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельностиБУ КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	ИСТИНА АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_БУ_МУ
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАБУ.СрезПоследних(
	|			&КонецПредыдущегоМесяца,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)) КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|
	|ГДЕ 
	|	&ЭтоМеждународнаяВерсия
	|	И ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)) = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.Независимый)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВРеглУчете)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоПредыдущегоМесяца            КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца             КАК КонецМесяца,
	|	&НачалоПредыдущегоМесяца            КАК Период,
	|	&КонецПозапрошлогоМесяца            КАК ПериодПараметров,
	|	ИСТИНА                              КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходовБУ    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходовБУ КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.ПодразделениеБУ     КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельностиБУ КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	ИСТИНА АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАБУ.СрезПоследних(
	|			&КонецПозапрошлогоМесяца,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета_Доначисление_БУ_МУ КАК СписокНМА)) КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|
	|ГДЕ 
	|	&ЭтоМеждународнаяВерсия
	|	И ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)) = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.Независимый)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВРеглУчете)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоМесяца                       КАК НачалоМесяца,
	|	&КонецМесяца                        КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК ПериодПараметров,
	|	ЛОЖЬ                                КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходовБУ    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходовБУ КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.ПодразделениеБУ     КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельностиБУ КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	ИСТИНА АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАБУ КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|ГДЕ
	|	ПорядокУчетаНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И &ЭтоМеждународнаяВерсия
	|	И ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)) = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.Независимый)
	|
	|	И ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И (ПорядокУчетаНМА.Организация, ПорядокУчетаНМА.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВРеглУчете)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                        КАК ПериодНачисления,
	|	&НачалоПредыдущегоМесяца            КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца             КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМА.Период, ДЕНЬ) КАК ПериодПараметров,
	|	ИСТИНА                              КАК ЭтоДоначисление,
	|	ПорядокУчетаНМА.Организация         КАК Организация,
	|	ПорядокУчетаНМА.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ПорядокУчетаНМА.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|
	|	ПорядокУчетаНМА.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаНМА.СтатьяРасходовБУ    КАК СтатьяРасходов,
	|	ПорядокУчетаНМА.АналитикаРасходовБУ КАК АналитикаРасходов,
	|	ПорядокУчетаНМА.ПодразделениеБУ     КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМА.НаправлениеДеятельностиБУ КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМА.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиНМА, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	ИСТИНА АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАБУ КАК ПорядокУчетаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаНМА.Организация.ГоловнаяОрганизация
	|ГДЕ
	|	ПорядокУчетаНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|
	|	И &ЭтоМеждународнаяВерсия
	|	И ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)) = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.Независимый)
	|
	|	И ПорядокУчетаНМА.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И (ПорядокУчетаНМА.Организация, ПорядокУчетаНМА.НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета_Доначисление_БУ_МУ КАК СписокНМА)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаНМА.НематериальныйАктив
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВРеглУчете)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив, 
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_Доначисление_Все
	ТекстЗапроса = АмортизацияНМАЛокализация.ТекстЗапросаСписокОбъектовУчетаДоначислениеВсе();
	Если ТекстЗапроса = Неопределено Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СписокОбъектовУчета.Организация      КАК Организация,
		|	СписокОбъектовУчета.НематериальныйАктив КАК НематериальныйАктив,
		|	СписокОбъектовУчета.Период           КАК Период
		|
		|ПОМЕСТИТЬ СписокОбъектовУчета_Доначисление_Все
		|ИЗ
		|	СписокОбъектовУчета_Доначисление_УУ КАК СписокОбъектовУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписокОбъектовУчета.Организация      КАК Организация,
		|	СписокОбъектовУчета.НематериальныйАктив КАК НематериальныйАктив,
		|	СписокОбъектовУчета.Период           КАК Период
		|
		|ИЗ
		|	СписокОбъектовУчета_Доначисление_БУ_МУ КАК СписокОбъектовУчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НематериальныйАктив,
		|	Организация";
	
	КонецЕсли;
	 
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
КонецПроцедуры

// Получает все необходимые параметры для расчета.
// 
// Параметры:
//  СписокЗапросов - Массив из Строка - Список запросов
//  ПараметрыРасчета - Структура - Параметры расчета
Процедура ТекстЗапросаПараметрыРасчетаАмортизации(СписокЗапросов, ПараметрыРасчета)

	ОбъектУчета = "НематериальныйАктив";
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"МестоУчетаНМА", "", ОбъектУчета, СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПервоначальныеСведенияНМА", "", ОбъектУчета, СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПорядокУчетаНМА", "", ОбъектУчета, СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПорядокУчетаНМАУУ", "", ОбъектУчета, СписокЗапросов);
		
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПорядокУчетаНМАБУ", "", ОбъектУчета, СписокЗапросов);
		
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПараметрыАмортизацииНМАУУ", "", ОбъектУчета, СписокЗапросов);
		
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаПараметрыРасчетаАмортизации(
		"ПараметрыАмортизацииНМАБУ", "", ОбъектУчета, СписокЗапросов);
	
	#Область ДатыПоследнегоИзмененияУУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.НачалоМесяца КАК НачалоМесяца,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НематериальныйАктив КАК НематериальныйАктив,
	|	
	|	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаДокументаПринятияКУчету) КАК ДатаДокументаПринятияКУчету
	|
	|ПОМЕСТИТЬ ДатыПоследнегоИзмененияУУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПараметрыАмортизацииНМАУУ.НачалоМесяца КАК НачалоМесяца,
	|		ПараметрыАмортизацииНМАУУ.Организация КАК Организация,
	|		ПараметрыАмортизацииНМАУУ.НематериальныйАктив КАК НематериальныйАктив,
	|	
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМА, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|				ТОГДА ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения
	|
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ)
	|
	|		КОНЕЦ КАК Дата,
	|
	|		ЕСТЬNULL(ПервоначальныеСведенияНМА.ДокументПринятияКУчетуУУ.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаПринятияКУчету
	|
	|	ИЗ
	|		ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|			ПО (ПервоначальныеСведенияНМА.Организация = ПараметрыАмортизацииНМАУУ.Организация)
	|				И (ПервоначальныеСведенияНМА.НематериальныйАктив = ПараметрыАмортизацииНМАУУ.НематериальныйАктив)
	|				И (ПервоначальныеСведенияНМА.НачалоМесяца = ПараметрыАмортизацииНМАУУ.НачалоМесяца)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&НачалоМесяца) КАК УчетнаяПолитика
	|			ПО УчетнаяПолитика.Организация = ПараметрыАмортизацииНМАУУ.Организация.ГоловнаяОрганизация
	|
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НачалоМесяца,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НачалоМесяца,
	|	Организация,
	|	НематериальныйАктив";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ДатыПоследнегоИзмененияБУ_МУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.НачалоМесяца КАК НачалоМесяца,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НематериальныйАктив КАК НематериальныйАктив,
	|	
	|	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаДокументаПринятияКУчету) КАК ДатаДокументаПринятияКУчету
	|
	|ПОМЕСТИТЬ ДатыПоследнегоИзмененияБУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПараметрыАмортизацииНМАБУ.НачалоМесяца КАК НачалоМесяца,
	|		ПараметрыАмортизацииНМАБУ.Организация КАК Организация,
	|		ПараметрыАмортизацииНМАБУ.НематериальныйАктив КАК НематериальныйАктив,
	|	
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииНМАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|				ТОГДА ПараметрыАмортизацииНМАБУ.ДатаПоследнегоИзменения
	|
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииНМАБУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ)
	|
	|		КОНЕЦ КАК Дата,
	|
	|		ЕСТЬNULL(ПервоначальныеСведенияНМА.ДокументПринятияКУчетуБУ.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаПринятияКУчету
	|
	|	ИЗ
	|		ПараметрыАмортизацииНМАБУ КАК ПараметрыАмортизацииНМАБУ
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|			ПО (ПервоначальныеСведенияНМА.Организация = ПараметрыАмортизацииНМАБУ.Организация)
	|				И (ПервоначальныеСведенияНМА.НематериальныйАктив = ПараметрыАмортизацииНМАБУ.НематериальныйАктив)
	|				И (ПервоначальныеСведенияНМА.НачалоМесяца = ПараметрыАмортизацииНМАБУ.НачалоМесяца)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&НачалоМесяца) КАК УчетнаяПолитика
	|			ПО УчетнаяПолитика.Организация = ПараметрыАмортизацииНМАБУ.Организация.ГоловнаяОрганизация
	|
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НачалоМесяца,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НачалоМесяца,
	|	Организация,
	|	НематериальныйАктив";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СтоимостьНМАНаНачалоМесяца
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца                             КАК НачалоМесяца,
	|	СтоимостьНМА.НематериальныйАктив          КАК НематериальныйАктив,
	|	СтоимостьНМА.СтоимостьОстаток             КАК Стоимость,
	|	СтоимостьНМА.СтоимостьРеглОстаток         КАК СтоимостьРегл,
	|	СтоимостьНМА.СтоимостьНУОстаток           КАК СтоимостьНУ,
	|	СтоимостьНМА.СтоимостьПРОстаток           КАК СтоимостьПР,
	|	СтоимостьНМА.СтоимостьВРОстаток           КАК СтоимостьВР,
	|	СтоимостьНМА.СтоимостьЦФОстаток           КАК СтоимостьЦФ,
	|	СтоимостьНМА.СтоимостьНУЦФОстаток         КАК СтоимостьНУЦФ,
	|	СтоимостьНМА.СтоимостьПРЦФОстаток         КАК СтоимостьПРЦФ,
	|	СтоимостьНМА.СтоимостьВРЦФОстаток         КАК СтоимостьВРЦФ
	|
	|ПОМЕСТИТЬ СтоимостьНМА_НаНачалоМесяца
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА.Остатки(
	|			&КонецПредыдущегоМесяцаГраница,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета КАК СписокНМА)) КАК СтоимостьНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
		
	#Область ПредварительнаяСтоимостьНМА
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца                                     КАК НачалоМесяца,
	|	СтоимостьНМА.НематериальныйАктив                  КАК НематериальныйАктив,
	|
	|	СУММА(СтоимостьНМА.ПредварительнаяСтоимость)      КАК Стоимость,
	|	СУММА(СтоимостьНМА.ПредварительнаяСтоимостьРегл)  КАК СтоимостьРегл,
	|
	|	ВЫБОР
	|		КОГДА СУММА(СтоимостьНМА.ПредварительнаяСтоимостьРегл) <> 0
	|			ТОГДА ВЫРАЗИТЬ(МАКСИМУМ(ЕСТЬNULL(ТаблицаНМА.СуммаЦелевыхСредств, 0)) / СУММА(СтоимостьНМА.ПредварительнаяСтоимостьРегл) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляЦФ
	|
	|ПОМЕСТИТЬ ПредварительнаяСтоимостьНМА
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуНМА2_4 КАК ТаблицаНМА
	|		ПО ТаблицаНМА.Ссылка = СтоимостьНМА.Регистратор
	|
	|ГДЕ
	|	СтоимостьНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И (СтоимостьНМА.ПредварительнаяСтоимость <> 0
	|		ИЛИ СтоимостьНМА.ПредварительнаяСтоимостьРегл <> 0)
	|
	|	И СтоимостьНМА.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМА),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМАпоИнвентаризации))
	|
	|	И СтоимостьНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета КАК СписокНМА)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНМА.НематериальныйАктив	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&НачалоПредыдущегоМесяца              КАК НачалоМесяца,
	|	СтоимостьНМА.НематериальныйАктив      КАК НематериальныйАктив,
	|	ВЫБОР
	|		КОГДА СУММА(СтоимостьНМА.Стоимость - СтоимостьНМА.ПредварительнаяСтоимость) > 0
	|			ТОГДА СУММА(СтоимостьНМА.Стоимость - СтоимостьНМА.ПредварительнаяСтоимость)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА СУММА(СтоимостьНМА.СтоимостьРегл - СтоимостьНМА.ПредварительнаяСтоимостьРегл) > 0
	|			ТОГДА СУММА(СтоимостьНМА.СтоимостьРегл - СтоимостьНМА.ПредварительнаяСтоимостьРегл)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	|	ВЫБОР
	|		КОГДА СУММА(СтоимостьНМА.СтоимостьРегл - СтоимостьНМА.ПредварительнаяСтоимостьРегл) > 0
	|			ТОГДА ВЫРАЗИТЬ(МАКСИМУМ(ЕСТЬNULL(ТаблицаНМА.СуммаЦелевыхСредств, 0)) / СУММА(СтоимостьНМА.СтоимостьРегл) КАК ЧИСЛО (23, 10)) 
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляЦФ
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуНМА2_4 КАК ТаблицаНМА
	|		ПО ТаблицаНМА.Ссылка = СтоимостьНМА.Регистратор
	|
	|ГДЕ
	|	СтоимостьНМА.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|
	|	И СтоимостьНМА.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМА),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМАпоИнвентаризации))
	|
	|	И СтоимостьНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_Доначисление_УУ КАК СписокНМА)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНМА.НематериальныйАктив
	|
	|ИМЕЮЩИЕ 
	|	СУММА(СтоимостьНМА.Стоимость - СтоимостьНМА.ПредварительнаяСтоимость) > 0
	|		ИЛИ СУММА(СтоимостьНМА.СтоимостьРегл - СтоимостьНМА.ПредварительнаяСтоимостьРегл) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив";
		
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область АмортизацияНМАНаНачалоМесяца
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца                           КАК НачалоМесяца,
	|	АмортизацияНМА.Организация              КАК Организация,
	|	АмортизацияНМА.НематериальныйАктив      КАК НематериальныйАктив,
	|	-АмортизацияНМА.АмортизацияОстаток      КАК Амортизация,
	|	-АмортизацияНМА.АмортизацияРеглОстаток  КАК АмортизацияРегл,
	|	-АмортизацияНМА.АмортизацияНУОстаток    КАК АмортизацияНУ,
	|	-АмортизацияНМА.АмортизацияПРОстаток    КАК АмортизацияПР,
	|	-АмортизацияНМА.АмортизацияВРОстаток    КАК АмортизацияВР,
	|	-АмортизацияНМА.АмортизацияЦФОстаток    КАК АмортизацияЦФ,
	|	-АмортизацияНМА.АмортизацияНУЦФОстаток  КАК АмортизацияНУЦФ,
	|	-АмортизацияНМА.АмортизацияПРЦФОстаток  КАК АмортизацияПРЦФ,
	|	-АмортизацияНМА.АмортизацияВРЦФОстаток  КАК АмортизацияВРЦФ
	|
	|ПОМЕСТИТЬ АмортизацияНМА_НаНачалоМесяца
	|
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА.Остатки(
	|			&КонецПредыдущегоМесяцаГраница,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета КАК СписокНМА)) КАК АмортизацияНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
				
	#Область ОбесценениеВНА
	// В расчете амортизации и корректировки обесценения участвуют только те ВНА,
	// по которым ЕГДС на конец месяца расчета амортизации не изменилась.
	// По объектам ВНА, изменившим ЕГДС, происходит восстановление остатка обесценения,
	// которое производится документом, изменившим ЕГДС, и рассчитывается это после 
	// выполнения операции по расчету амортизации.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СоставЕГД_НаКонецМесяцаРасчета.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	СоставЕГД_НаКонецМесяцаРасчета.ЕГДС КАК ЕГДСНаКонецМесяца
	|ПОМЕСТИТЬ ЕГДСВНАНаКонецМесяцаРасчета
	|ИЗ
	|	РегистрСведений.СоставЕГДС.СрезПоследних(
	|		КОНЕЦПЕРИОДА(&НачалоМесяца, МЕСЯЦ), 
	|		(Организация, ВнеоборотныйАктив) В
	|				(ВЫБРАТЬ
	|					СписокНМА.Организация,
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета КАК СписокНМА)
	|		) КАК СоставЕГД_НаКонецМесяцаРасчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВнеоборотныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	ОбесценениеВНА.ВнеоборотныйАктив КАК НематериальныйАктив,
	|
	|	-СУММА(ОбесценениеВНА.ОбесценениеРеглКонечныйОстаток) КАК ОстатокОбесцененияРегл,
	|	-СУММА(ОбесценениеВНА.ОбесценениеУпрКонечныйОстаток) КАК ОстатокОбесцененияУпр,
	|
	|	МАКСИМУМ(ОбесценениеВНА.ЕГДС) КАК ЕГДС,
	|	МАКСИМУМ(ЕСТЬNULL(ЕГДСВНАНаКонецМесяцаРасчета.ЕГДСНаКонецМесяца,
	|		ЗНАЧЕНИЕ(Справочник.ЕдиницыГенерирующиеДенежныеСредства.ПустаяСсылка))) КАК ЕГДСНаКонецМесяца
	|
	|ПОМЕСТИТЬ ОбесценениеВНА_СИзменившимиЕГДС
	|ИЗ
	|	РегистрНакопления.ОбесценениеВНА.ОстаткиИОбороты(
	|		&КонецПредыдущегоМесяцаГраница,
	|		&КонецПредыдущегоМесяцаГраница,,
	|		ДвиженияИГраницыПериода,
	|		(Организация, ВнеоборотныйАктив) В
	|			(ВЫБРАТЬ
	|				СписокНМА.Организация,
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета КАК СписокНМА)) КАК ОбесценениеВНА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕГДСВНАНаКонецМесяцаРасчета КАК ЕГДСВНАНаКонецМесяцаРасчета
	|		ПО ОбесценениеВНА.ВнеоборотныйАктив = ЕГДСВНАНаКонецМесяцаРасчета.ВнеоборотныйАктив
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбесценениеВНА.ВнеоборотныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	ЕГДСНаКонецМесяца,
	|	ЕГДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбесценениеВНА_СИзменившимиЕГДС.НачалоМесяца КАК НачалоМесяца,
	|	ОбесценениеВНА_СИзменившимиЕГДС.НематериальныйАктив КАК НематериальныйАктив,
	|	ОбесценениеВНА_СИзменившимиЕГДС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	ОбесценениеВНА_СИзменившимиЕГДС.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|	ОбесценениеВНА_СИзменившимиЕГДС.ЕГДС КАК ЕГДС
	|ПОМЕСТИТЬ ОбесценениеВНА
	|ИЗ
	|	ОбесценениеВНА_СИзменившимиЕГДС КАК ОбесценениеВНА_СИзменившимиЕГДС
	|ГДЕ
	|	ОбесценениеВНА_СИзменившимиЕГДС.ЕГДСНаКонецМесяца = ОбесценениеВНА_СИзменившимиЕГДС.ЕГДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОбесценениеВНА_СИзменившимиЕГДС";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
				
	#Область ВыработкаНМА
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ВЫБОР
	|		КОГДА ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ <> ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения
	|				И ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ЕСТЬNULL(НАЧАЛОПЕРИОДА(ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения, МЕСЯЦ), ДАТАВРЕМЯ(1,1,1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ КАК ДатаПоследнегоИзмененияУУ,
	|
	|	ВЫБОР
	|		КОГДА ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ <> ПараметрыАмортизацииНМАБУ.ДатаПоследнегоИзменения
	|				И ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ЕСТЬNULL(НАЧАЛОПЕРИОДА(ПараметрыАмортизацииНМАБУ.ДатаПоследнегоИзменения, МЕСЯЦ), ДАТАВРЕМЯ(1,1,1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ КАК ДатаПоследнегоИзмененияБУ,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПринятоКУчетуВПрошломМесяце
	|
	|ПОМЕСТИТЬ СписокНМА_Выработка
	|
	|ИЗ
	|	СписокОбъектовУчета КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = СписокНМА.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
	|		ПО (ПараметрыАмортизацииНМАУУ.Организация = СписокНМА.Организация)
	|			И (ПараметрыАмортизацииНМАУУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАБУ КАК ПараметрыАмортизацииНМАБУ
	|		ПО (ПараметрыАмортизацииНМАБУ.Организация = СписокНМА.Организация)
	|			И (ПараметрыАмортизацииНМАБУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАБУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выработка.НематериальныйАктив КАК НематериальныйАктив,
	|	СУММА(Выработка.ОбъемВыработкиУУ) КАК ОбъемВыработкиУУ,
	|	СУММА(Выработка.ОбъемВыработкиБУ) КАК ОбъемВыработкиБУ
	|
	|ПОМЕСТИТЬ ВыработкаНМА_НаДатуПоследнегоИзменения
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		ЕСТЬNULL(ВыработкаУУ.Количество, 0) КАК ОбъемВыработкиУУ,
	|		0 КАК ОбъемВыработкиБУ
	|
	|	ИЗ
	|		СписокНМА_Выработка КАК СписокНМА
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаНМА КАК ВыработкаУУ
	|			ПО ВыработкаУУ.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|				И ВыработкаУУ.Период < СписокНМА.ДатаПоследнегоИзмененияУУ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		0 КАК ОбъемВыработкиУУ,
	|		ЕСТЬNULL(ВыработкаБУ.Количество, 0) КАК ОбъемВыработкиБУ
	|	ИЗ
	|		СписокНМА_Выработка КАК СписокНМА
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаНМА КАК ВыработкаБУ
	|			ПО ВыработкаБУ.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|				И ВыработкаБУ.Период < СписокНМА.ДатаПоследнегоИзмененияБУ
	|
	|	) КАК Выработка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выработка.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВыработкаНМА.КоличествоОборот КАК ОбъемВыработки
	|
	|ПОМЕСТИТЬ ВыработкаНМА_НаНачалоМесяца
	|
	|ИЗ
	|	РегистрНакопления.ВыработкаНМА.Обороты(
	|		,
	|		&КонецПредыдущегоМесяца,,
	|		НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокНМА_Выработка КАК СписокНМА)) КАК ВыработкаНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВыработкаНМА.КоличествоОборот КАК ОбъемВыработки,
	|	СписокНМА.ПринятоКУчетуВПрошломМесяце КАК ПринятоКУчетуВПрошломМесяце
	|
	|ПОМЕСТИТЬ ВыработкаНМА_НаКонецМесяца
	|
	|ИЗ
	|	РегистрНакопления.ВыработкаНМА.Обороты(
	|		,
	|		&КонецМесяца,,
	|		НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокНМА_Выработка КАК СписокНМА)) КАК ВыработкаНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокНМА_Выработка КАК СписокНМА
	|		ПО (СписокНМА.НематериальныйАктив = ВыработкаНМА.НематериальныйАктив)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНМА.НематериальныйАктив
	|
	|ПОМЕСТИТЬ СписокНМА_ПринятоКУчетуВПрошломМесяце
	|
	|ИЗ
	|	СписокНМА_Выработка КАК СписокНМА
	|ГДЕ
	|	СписокНМА.ПринятоКУчетуВПрошломМесяце
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВыработкаНМА.КоличествоОборот КАК ОбъемВыработки
	|
	|ПОМЕСТИТЬ ВыработкаНМА_НаНачалоПредыдущегоМесяца
	|
	|ИЗ
	|	РегистрНакопления.ВыработкаНМА.Обороты(
	|		,
	|		&КонецПозапрошлогоМесяца,,
	|		НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокНМА_ПринятоКУчетуВПрошломМесяце КАК СписокНМА)) КАК ВыработкаНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	ВыработкаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	СУММА(ВыработкаНМА.ОбъемВыработки) КАК ОбъемВыработки,
	|	СУММА(ВыработкаНМА.ОбъемВыработкиЗаПрошлыйМесяц) КАК ОбъемВыработкиЗаПрошлыйМесяц,
	|	СУММА(ВыработкаНМА.ОбъемВыработкиНаНачалоМесяца) КАК ОбъемВыработкиНаНачалоМесяца,
	|	СУММА(ВыработкаНМА.ОбъемВыработкиНаНачалоПредыдущегоМесяца) КАК ОбъемВыработкиНаНачалоПредыдущегоМесяца
	|
	|ПОМЕСТИТЬ ВыработкаНМА
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыработкаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		-ВыработкаНМА.ОбъемВыработки КАК ОбъемВыработки,
	|		ВыработкаНМА.ОбъемВыработки КАК ОбъемВыработкиЗаПрошлыйМесяц,
	|		ВыработкаНМА.ОбъемВыработки КАК ОбъемВыработкиНаНачалоМесяца,
	|		0 КАК ОбъемВыработкиНаНачалоПредыдущегоМесяца
	|	ИЗ
	|		ВыработкаНМА_НаНачалоМесяца КАК ВыработкаНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыработкаНМА.НематериальныйАктив,
	|		ВыработкаНМА.ОбъемВыработки,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВыработкаНМА_НаКонецМесяца КАК ВыработкаНМА
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыработкаНМА.НематериальныйАктив,
	|		0,
	|		0,
	|		-ВыработкаНМА.ОбъемВыработки,
	|		ВыработкаНМА.ОбъемВыработки
	|	ИЗ
	|		ВыработкаНМА_НаНачалоПредыдущегоМесяца КАК ВыработкаНМА
	|
	|	) КАК ВыработкаНМА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыработкаНМА.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив";
		
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область Изменения_УУ
		
	#Область ИзменениеПараметров
	ТекстЗапроса =
	// ПараметрыАмортизацииНМАУУ
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|
	|	ДанныеРегистра.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ДанныеРегистра.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ДанныеРегистра.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемНаработки,
	|	ДанныеРегистра.КоэффициентУскорения КАК КоэффициентУскорения,
	|	ДанныеРегистра.МетодНачисленияАмортизации,
	|	ДанныеРегистра.ЛиквидационнаяСтоимость,
	|	ДанныеРегистра.ЛиквидационнаяСтоимостьРегл
	|
	|ПОМЕСТИТЬ ПараметрыАмортизацииНМАУУИзменения
	|
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииНМАУУ КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|
	|	ДанныеРегистра.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ДанныеРегистра.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ДанныеРегистра.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемНаработки,
	|	ДанныеРегистра.КоэффициентУскорения КАК КоэффициентУскорения,
	|	ДанныеРегистра.МетодНачисленияАмортизации,
	|	ДанныеРегистра.ЛиквидационнаяСтоимость,
	|	ДанныеРегистра.ЛиквидационнаяСтоимостьРегл
	|
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииНМАУУ КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_УУ КАК Доначисление
	|		ПО ДанныеРегистра.НематериальныйАктив = Доначисление.НематериальныйАктив
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПорядокУчетаНМА
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|
	|	ДанныеРегистра.ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.ОбъемНаработки
	|
	|ПОМЕСТИТЬ ПорядокУчетаНМАИзменения
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМА КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.ОбъемНаработки
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМА КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_УУ КАК Доначисление
	|		ПО ДанныеРегистра.НематериальныйАктив = Доначисление.НематериальныйАктив
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПорядокУчетаНМАУУ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Состояние,
	|	ДанныеРегистра.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	ДанныеРегистра.СпособОтраженияАмортизации,
	|	ДанныеРегистра.СтатьяРасходов,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.ПередаватьРасходыВДругуюОрганизацию,
	|	ДанныеРегистра.ОрганизацияПолучательРасходов
	|
	|ПОМЕСТИТЬ ПорядокУчетаНМАУУИзменения
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАУУ КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
	|
	|	И ДанныеРегистра.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Состояние,
	|	ДанныеРегистра.НачислятьАмортизацию,
	|	ДанныеРегистра.СпособОтраженияАмортизации,
	|	ДанныеРегистра.СтатьяРасходов,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.ПередаватьРасходыВДругуюОрганизацию,
	|	ДанныеРегистра.ОрганизацияПолучательРасходов
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАУУ КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_УУ КАК Доначисление
	|		ПО ДанныеРегистра.НематериальныйАктив = Доначисление.НематериальныйАктив
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// МестоУчетаНМА
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение
	|
	|ПОМЕСТИТЬ МестоУчетаНМАИзменения
	|
	|ИЗ
	|	РегистрСведений.МестоУчетаНМА КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение
	|ИЗ
	|	РегистрСведений.МестоУчетаНМА КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_УУ КАК Доначисление
	|		ПО ДанныеРегистра.НематериальныйАктив = Доначисление.НематериальныйАктив
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПервоначальныеСведенияНМА
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.МетодНачисленияАмортизацииБУ,
	|	ДанныеРегистра.МетодНачисленияАмортизацииНУ
	|
	|ПОМЕСТИТЬ ПервоначальныеСведенияНМАИзменения
	|
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) КАК Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НематериальныйАктив,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.МетодНачисленияАмортизацииБУ,
	|	ДанныеРегистра.МетодНачисленияАмортизацииНУ
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_УУ КАК Доначисление
	|		ПО ДанныеРегистра.НематериальныйАктив = Доначисление.НематериальныйАктив
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеСтоимости
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтоимостьНМА.НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	СтоимостьНМА.Период КАК Период,
	|	СтоимостьНМА.Регистратор КАК Регистратор,
	|	СтоимостьНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СтоимостьНМА.Организация КАК Организация,
	|
	|	СУММА(СтоимостьНМА.Стоимость) КАК Стоимость,
	|	СУММА(СтоимостьНМА.СтоимостьРегл) КАК СтоимостьРегл
	|
	|ПОМЕСТИТЬ СтоимостьНМАИзменения
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачалоМесяца КАК НачалоМесяца,
	|		СтоимостьНМА.Период КАК Период,
	|		СтоимостьНМА.Регистратор КАК Регистратор,
	|		СтоимостьНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СтоимостьНМА.Организация КАК Организация,
	|
	|		СтоимостьНМА.ПредварительнаяСтоимость КАК Стоимость,
	|		СтоимостьНМА.ПредварительнаяСтоимостьРегл КАК СтоимостьРегл
	|	ИЗ
	|		РегистрНакопления.СтоимостьНМА КАК СтоимостьНМА
	|
	|	ГДЕ
	|		СтоимостьНМА.Активность
	|		И СтоимостьНМА.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И СтоимостьНМА.ОтражатьВУпрУчете
	|		И СтоимостьНМА.Регистратор ССЫЛКА Документ.УлучшениеНМА
	|
	|		И СтоимостьНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&НачалоМесяца КАК НачалоМесяца,
	|		СписаниеНМА2_4.Дата КАК Период,
	|		СписаниеНМА2_4.Ссылка КАК Регистратор,
	|		ТаблицаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписаниеНМА2_4.Организация КАК Организация,
	|
	|		-ТаблицаНМА.СуммаСписанияУУ КАК Стоимость,
	|		-ТаблицаНМА.СуммаСписанияБУ КАК СтоимостьРегл
	|	ИЗ
	|		Документ.СписаниеНМА2_4 КАК СписаниеНМА2_4
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4.НМА КАК ТаблицаНМА
	|			ПО (ТаблицаНМА.Ссылка = СписаниеНМА2_4.Ссылка)
	|	ГДЕ
	|		СписаниеНМА2_4.Проведен
	|		И СписаниеНМА2_4.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И СписаниеНМА2_4.ОтражатьВУпрУчете
	|		И СписаниеНМА2_4.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНМАЧастичное)
	|		И ТаблицаНМА.СуммаСписанияУУ <> 0
	|
	|		И ТаблицаНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		ПереоценкаНМА.Дата,
	|		ПереоценкаНМА.Ссылка,
	|		ТаблицаНМА.НематериальныйАктив,
	|		ПереоценкаНМА.Организация,
	|
	|		ТаблицаНМА.СтоимостьУУ,
	|		ТаблицаНМА.СтоимостьБУ
	|	ИЗ
	|		Документ.ПереоценкаНМА2_4 КАК ПереоценкаНМА
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаНМА2_4.НМА КАК ТаблицаНМА
	|			ПО (ТаблицаНМА.Ссылка = ПереоценкаНМА.Ссылка)
	|	ГДЕ
	|		ПереоценкаНМА.Проведен
	|		И ПереоценкаНМА.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ПереоценкаНМА.ОтражатьВУпрУчете
	|		И ТаблицаНМА.СтоимостьУУ <> 0
	|
	|		И ТаблицаНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		Корректировка.Дата,
	|		Корректировка.Ссылка,
	|		ТаблицаНМА.НематериальныйАктив,
	|		Корректировка.Организация,
	|
	|		ТаблицаНМА.СтоимостьУУ,
	|		ТаблицаНМА.СтоимостьБУ
	|	ИЗ
	|		Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА.НМА КАК ТаблицаНМА
	|			ПО (ТаблицаНМА.Ссылка = Корректировка.Ссылка)
	|	ГДЕ
	|		Корректировка.Проведен
	|		И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И Корректировка.ОтражатьВУпрУчете
	|		И ТаблицаНМА.СтоимостьУУ <> 0
	|
	|		И ТаблицаНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_УУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	) КАК СтоимостьНМА
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНМА.НачалоМесяца,
	|	СтоимостьНМА.Период,
	|	СтоимостьНМА.Регистратор,
	|	СтоимостьНМА.НематериальныйАктив,
	|	СтоимостьНМА.Организация
	|
	|ИМЕЮЩИЕ
	|	(СУММА(СтоимостьНМА.Стоимость) <> 0
	|		ИЛИ СУММА(СтоимостьНМА.СтоимостьРегл) <> 0)
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеАмортизации
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	Корректировка.Дата КАК Период,
	|	Корректировка.Ссылка КАК Регистратор,
	|	ТаблицаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	Корректировка.Организация КАК Организация,
	|
	|	ТаблицаНМА.АмортизацияУУ КАК Амортизация,
	|	ТаблицаНМА.АмортизацияБУ КАК АмортизацияРегл
	|
	|ПОМЕСТИТЬ АмортизацияНМАИзменения
	|
	|ИЗ
	|	Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА.НМА КАК ТаблицаНМА
	|		ПО (ТаблицаНМА.Ссылка = Корректировка.Ссылка)
	|
	|ГДЕ
	|	Корректировка.Проведен
	|	И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И Корректировка.ОтражатьВУпрУчете
	|
	|	И ТаблицаНМА.АмортизацияУУ <> 0
	|
	|	И ТаблицаНМА.НематериальныйАктив В
	|		(ВЫБРАТЬ
	|			СписокНМА.НематериальныйАктив
	|		ИЗ
	|			СписокОбъектовУчета_УУ КАК СписокНМА
	|		ГДЕ
	|			СписокНМА.НачалоМесяца = &НачалоМесяца
	|			И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ОбъединениеВсехИзменений
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|	ТаблицаИзменений.Регистратор КАК Регистратор,
	|	МАКСИМУМ(ТаблицаИзменений.Период) КАК Период,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ТаблицаИзменений.Период, МЕСЯЦ, 1), МЕСЯЦ)) КАК НачалоСледующегоМесяца,
	|	ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
	|	ТаблицаИзменений.Организация КАК Организация,
	|	МАКСИМУМ(ПараметрыАмортизацииНМАУУПоследнее.Период) КАК ПараметрыАмортизацииНМАУУПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаНМАИзмененияПоследнее.Период) КАК ПорядокУчетаНМАИзмененияПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаНМАУУИзмененияПоследнее.Период) КАК ПорядокУчетаНМАУУИзмененияПоследнееПериод,
	|	МАКСИМУМ(МестоУчетаНМАИзмененияПоследнее.Период) КАК МестоУчетаНМАИзмененияПоследнееПериод,
	|	МАКСИМУМ(ПервоначальныеСведенияНМАИзмененияПоследнее.Период) КАК ПервоначальныеСведенияНМАИзмененияПоследнееПериод
	|
	|ПОМЕСТИТЬ ТаблицаИзменений
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период КАК Период,
	|		ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
	|		ТаблицаИзменений.Организация КАК Организация
	|	ИЗ
	|		ПараметрыАмортизацииНМАУУИзменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаНМАИзменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаНМАУУИзменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		МестоУчетаНМАИзменения КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПервоначальныеСведенияНМАИзменения КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		СтоимостьНМАИзменения КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		АмортизацияНМАИзменения КАК ТаблицаИзменений
	|
	|	) КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАУУИзменения КАК ПараметрыАмортизацииНМАУУПоследнее
	|		ПО (ПараметрыАмортизацииНМАУУПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииНМАУУПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАУУПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАИзменения КАК ПорядокУчетаНМАИзмененияПоследнее
	|		ПО (ПорядокУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМАИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАУУИзменения КАК ПорядокУчетаНМАУУИзмененияПоследнее
	|		ПО (ПорядокУчетаНМАУУИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМАУУИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМАИзменения КАК МестоУчетаНМАИзмененияПоследнее
	|		ПО (МестоУчетаНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестоУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (МестоУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестоУчетаНМАИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМАИзменения КАК ПервоначальныеСведенияНМАИзмененияПоследнее
	|		ПО (ПервоначальныеСведенияНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПервоначальныеСведенияНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПервоначальныеСведенияНМАИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.НематериальныйАктив,
	|	ТаблицаИзменений.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив,
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	МИНИМУМ(ТаблицаИзмененийСледующее.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийСледующее
	|
	|ИЗ
	|	ТаблицаИзменений КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзменений КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Период > ТаблицаИзменений.Период
	|				ИЛИ ТаблицаИзмененийСледующее.Период = ТаблицаИзменений.Период
	|						И ТаблицаИзмененийСледующее.Регистратор > ТаблицаИзменений.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив,
	|	МИНИМУМ(ТаблицаИзменений.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийВЭтомМесяце
	|
	|ИЗ
	|	ТаблицаИзменений КАК ТаблицаИзменений
	|ГДЕ
	|	(ТаблицаИзменений.НачалоМесяца = &НачалоМесяца)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область Изменения_УУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчету, МЕСЯЦ) = ТаблицаИзменений.НачалоМесяца
	|			ТОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчету, ДЕНЬ)
	|		ИНАЧЕ ТаблицаИзменений.ПериодПараметров 
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	ТаблицаИзменений.Регистратор КАК Регистратор,
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.НачалоМесяца, МЕСЯЦ) КАК КонецМесяца,
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.Период, ДЕНЬ) КАК ДатаИзменений,
	|
	|	ВЫБОР 
	|		КОГДА ТаблицаИзменений.НачалоМесяца = &НачалоПредыдущегоМесяца
	|				И НАЧАЛОПЕРИОДА(ЕСТЬNULL(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, &КонецМесяца), ДЕНЬ) = &НачалоМесяца
	|			ТОГДА &НачалоМесяца 
	|		КОГДА ТаблицаИзменений.НачалоМесяца = &НачалоПредыдущегоМесяца
	|			ТОГДА ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца) 
	|		ИНАЧЕ ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийСледующее.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца) 
	|	КОНЕЦ КАК Период,
	|
	|	РАЗНОСТЬДАТ(ТаблицаИзменений.Период, ЕСТЬNULL(ТаблицаИзмененийСледующее.ПериодСледующее, ТаблицаИзменений.НачалоСледующегоМесяца), ДЕНЬ) КАК СрокДействия,
	|	ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
	|	ТаблицаИзменений.Организация КАК Организация,
	|
	|	ЕСТЬNULL(СтоимостьНМАИзменения.Стоимость, 0) КАК СтоимостьИзменение, // Изменение стоимости документом
	|	ЕСТЬNULL(СтоимостьНМАИзменения.СтоимостьРегл, 0) КАК СтоимостьРеглИзменение, // Изменение стоимости документом
	|	ЕСТЬNULL(АмортизацияНМАИзменения.Амортизация, 0) КАК АмортизацияИзменение, // Изменение амортизации документом
	|	ЕСТЬNULL(АмортизацияНМАИзменения.АмортизацияРегл, 0) КАК АмортизацияРеглИзменение, // Изменение амортизации документом
	|
	|	ПараметрыАмортизацииНМАУУПоследнее.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ПараметрыАмортизацииНМАУУПоследнее.СрокИспользования,
	|	ПараметрыАмортизацииНМАУУПоследнее.ОбъемНаработки,
	|	ПараметрыАмортизацииНМАУУПоследнее.КоэффициентУскорения,
	|	ПараметрыАмортизацииНМАУУПоследнее.МетодНачисленияАмортизации,
	|	ПараметрыАмортизацииНМАУУПоследнее.ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизацииНМАУУПоследнее.ЛиквидационнаяСтоимостьРегл,
	|	ПорядокУчетаНМАИзмененияПоследнее.ГруппаФинансовогоУчета,
	|	ПорядокУчетаНМАИзмененияПоследнее.НаправлениеДеятельности,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.Состояние,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.НачислятьАмортизацию,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.СпособОтраженияАмортизации,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.СтатьяРасходов КАК СтатьяРасходов,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.АналитикаРасходов КАК АналитикаРасходов,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.Подразделение КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.НаправлениеДеятельности КАК НаправлениеДеятельностиРасходов,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМАУУИзмененияПоследнее.ОрганизацияПолучательРасходов,
	|	МестоУчетаНМАИзмененияПоследнее.Подразделение КАК Подразделение
	|
	|ПОМЕСТИТЬ Изменения_УУ
	|
	|ИЗ
	|	ТаблицаИзменений КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийСледующее КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийВЭтомМесяце КАК ТаблицаИзмененийВЭтомМесяце
	|		ПО (ТаблицаИзмененийВЭтомМесяце.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийВЭтомМесяце.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияУУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (ДатыПоследнегоИзменения.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАУУИзменения КАК ПараметрыАмортизацииНМАУУПоследнее
	|		ПО (ПараметрыАмортизацииНМАУУПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииНМАУУПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАУУПоследнее.Период = ТаблицаИзменений.ПараметрыАмортизацииНМАУУПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАИзменения КАК ПорядокУчетаНМАИзмененияПоследнее
	|		ПО (ПорядокУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМАИзмененияПоследнее.Период = ТаблицаИзменений.ПорядокУчетаНМАИзмененияПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАУУИзменения КАК ПорядокУчетаНМАУУИзмененияПоследнее
	|		ПО (ПорядокУчетаНМАУУИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМАУУИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМАУУИзмененияПоследнее.Период = ТаблицаИзменений.ПорядокУчетаНМАУУИзмененияПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМАИзменения КАК МестоУчетаНМАИзмененияПоследнее
	|		ПО (МестоУчетаНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестоУчетаНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (МестоУчетаНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестоУчетаНМАИзмененияПоследнее.Период = ТаблицаИзменений.МестоУчетаНМАИзмененияПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНМАИзменения КАК СтоимостьНМАИзменения
	|		ПО (СтоимостьНМАИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (СтоимостьНМАИзменения.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (СтоимостьНМАИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (СтоимостьНМАИзменения.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНМАИзменения КАК АмортизацияНМАИзменения
	|		ПО (АмортизацияНМАИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (АмортизацияНМАИзменения.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (АмортизацияНМАИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (АмортизацияНМАИзменения.Регистратор = ТаблицаИзменений.Регистратор)
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#КонецОбласти

	#Область Изменения_БУ_МУ
		
	#Область ИзменениеПараметров
	ТекстЗапроса =
	// ПараметрыАмортизацииНМАБУ
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ПараметрыАмортизацииНМАБУ.Период, ДЕНЬ) КАК Период,
	|	ПараметрыАмортизацииНМАБУ.Регистратор,
	|	ПараметрыАмортизацииНМАБУ.НематериальныйАктив,
	|	ПараметрыАмортизацииНМАБУ.Организация,
	|	ПараметрыАмортизацииНМАБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ПараметрыАмортизацииНМАБУ.КоэффициентБУ КАК Коэффициент,
	|	ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость
	|
	|ПОМЕСТИТЬ ПараметрыАмортизацииНМАБУ_МУ_Изменения
	|
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииНМАБУ КАК ПараметрыАмортизацииНМАБУ
	|
	|ГДЕ
	|	&ЭтоМеждународнаяВерсия
	|	И ПараметрыАмортизацииНМАБУ.Активность
	|	И ПараметрыАмортизацииНМАБУ.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И НЕ ПараметрыАмортизацииНМАБУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ПараметрыАмортизацииНМАБУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ПараметрыАмортизацииНМАБУ.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ПараметрыАмортизацииНМАБУ.Период, ДЕНЬ) КАК Период,
	|	ПараметрыАмортизацииНМАБУ.Регистратор,
	|	ПараметрыАмортизацииНМАБУ.НематериальныйАктив,
	|	ПараметрыАмортизацииНМАБУ.Организация,
	|	ПараметрыАмортизацииНМАБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ПараметрыАмортизацииНМАБУ.КоэффициентБУ КАК Коэффициент,
	|	ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииНМАБУ КАК ПараметрыАмортизацииНМАБУ
	|
	|ГДЕ
	|	&ЭтоМеждународнаяВерсия
	|	И ПараметрыАмортизацииНМАБУ.Активность
	|	И ПараметрыАмортизацииНМАБУ.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И НЕ ПараметрыАмортизацииНМАБУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ПараметрыАмортизацииНМАБУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ПараметрыАмортизацииНМАБУ.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_Доначисление_БУ_МУ КАК СписокНМА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМАБУ.Период, ДЕНЬ) КАК Период,
	|	ПорядокУчетаНМАБУ.Регистратор,
	|	ПорядокУчетаНМАБУ.НематериальныйАктив,
	|	ПорядокУчетаНМАБУ.Организация,
	|	ПорядокУчетаНМАБУ.СостояниеБУ,
	|	ПорядокУчетаНМАБУ.НачислятьАмортизациюБУ,
	|	ПорядокУчетаНМАБУ.СпособОтраженияАмортизацииБУ,
	|	ПорядокУчетаНМАБУ.СтатьяРасходовБУ,
	|	ПорядокУчетаНМАБУ.АналитикаРасходовБУ,
	|	ПорядокУчетаНМАБУ.ПодразделениеБУ КАК ПодразделениеБУ,
	|	ПорядокУчетаНМАБУ.НаправлениеДеятельностиБУ КАК НаправлениеДеятельностиБУ,
	|	ПорядокУчетаНМАБУ.ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМАБУ.ОрганизацияПолучательРасходов
	|
	|ПОМЕСТИТЬ ПорядокУчетаНМАБУ_МУ_Изменения
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАБУ КАК ПорядокУчетаНМАБУ
	|
	|ГДЕ
	|	&ЭтоМеждународнаяВерсия
	|	И ПорядокУчетаНМАБУ.Активность
	|	И ПорядокУчетаНМАБУ.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И НЕ ПорядокУчетаНМАБУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ПорядокУчетаНМАБУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ПорядокУчетаНМАБУ.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаНМАБУ.Период, ДЕНЬ) КАК Период,
	|	ПорядокУчетаНМАБУ.Регистратор,
	|	ПорядокУчетаНМАБУ.НематериальныйАктив,
	|	ПорядокУчетаНМАБУ.Организация,
	|	ПорядокУчетаНМАБУ.СостояниеБУ,
	|	ПорядокУчетаНМАБУ.НачислятьАмортизациюБУ,
	|	ПорядокУчетаНМАБУ.СпособОтраженияАмортизацииБУ,
	|	ПорядокУчетаНМАБУ.СтатьяРасходовБУ,
	|	ПорядокУчетаНМАБУ.АналитикаРасходовБУ,
	|	ПорядокУчетаНМАБУ.ПодразделениеБУ КАК ПодразделениеБУ,
	|	ПорядокУчетаНМАБУ.НаправлениеДеятельностиБУ КАК НаправлениеДеятельностиБУ,
	|	ПорядокУчетаНМАБУ.ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМАБУ.ОрганизацияПолучательРасходов
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМАБУ КАК ПорядокУчетаНМАБУ
	|
	|ГДЕ
	|	&ЭтоМеждународнаяВерсия
	|	И ПорядокУчетаНМАБУ.Активность
	|	И ПорядокУчетаНМАБУ.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И НЕ ПорядокУчетаНМАБУ.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|	И НЕ ПорядокУчетаНМАБУ.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И (ПорядокУчетаНМАБУ.Организация, ПорядокУчетаНМАБУ.НематериальныйАктив) В
	|			(ВЫБРАТЬ
	|				СписокНМА.Организация,
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_Доначисление_БУ_МУ КАК СписокНМА)
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеСтоимости
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтоимостьНМА.НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	СтоимостьНМА.Период КАК Период,
	|	СтоимостьНМА.Регистратор КАК Регистратор,
	|	СтоимостьНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СтоимостьНМА.Организация КАК Организация,
	|	СУММА(СтоимостьНМА.СтоимостьРегл) КАК СтоимостьРегл
	|
	|ПОМЕСТИТЬ СтоимостьНМА_ИзмененияБУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачалоМесяца КАК НачалоМесяца,
	|		СписаниеНМА2_4.Дата КАК Период,
	|		СписаниеНМА2_4.Ссылка КАК Регистратор,
	|		ТаблицаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписаниеНМА2_4.Организация КАК Организация,
	|
	|		-ТаблицаНМА.СуммаСписанияБУ КАК СтоимостьРегл
	|	ИЗ
	|		Документ.СписаниеНМА2_4 КАК СписаниеНМА2_4
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4.НМА КАК ТаблицаНМА
	|			ПО (ТаблицаНМА.Ссылка = СписаниеНМА2_4.Ссылка)
	|	ГДЕ
	|		&ЭтоМеждународнаяВерсия
	|		И СписаниеНМА2_4.Проведен
	|		И СписаниеНМА2_4.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И СписаниеНМА2_4.ОтражатьВРеглУчете
	|		И СписаниеНМА2_4.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНМАЧастичное)
	|		И ТаблицаНМА.СуммаСписанияБУ <> 0
	|
	|		И ТаблицаНМА.НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|				ГДЕ
	|					СписокНМА.НачалоМесяца = &НачалоМесяца
	|					И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		ПереоценкаНМА.Дата,
	|		ПереоценкаНМА.Ссылка,
	|		ТаблицаНМА.НематериальныйАктив,
	|		ПереоценкаНМА.Организация,
	|
	|		ТаблицаНМА.СтоимостьБУ
	|	ИЗ
	|		Документ.ПереоценкаНМА2_4 КАК ПереоценкаНМА
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаНМА2_4.НМА КАК ТаблицаНМА
	|			ПО (ТаблицаНМА.Ссылка = ПереоценкаНМА.Ссылка)
	|	ГДЕ
	|		&ЭтоМеждународнаяВерсия
	|		И ПереоценкаНМА.Проведен
	|		И ПереоценкаНМА.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ПереоценкаНМА.ОтражатьВРеглУчете
	|		И ТаблицаНМА.СтоимостьБУ <> 0
	|
	|		И ТаблицаНМА.НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|				ГДЕ
	|					СписокНМА.НачалоМесяца = &НачалоМесяца
	|					И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		Корректировка.Дата,
	|		Корректировка.Ссылка,
	|		ТаблицаНМА.НематериальныйАктив,
	|		Корректировка.Организация,
	|
	|		ТаблицаНМА.СтоимостьБУ
	|	ИЗ
	|		Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА.НМА КАК ТаблицаНМА
	|			ПО (ТаблицаНМА.Ссылка = Корректировка.Ссылка)
	|	ГДЕ
	|		&ЭтоМеждународнаяВерсия
	|		И Корректировка.Проведен
	|		И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И Корректировка.ОтражатьВРеглУчете
	|		И ТаблицаНМА.СтоимостьБУ <> 0
	|
	|		И ТаблицаНМА.НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|				ГДЕ
	|					СписокНМА.НачалоМесяца = &НачалоМесяца
	|					И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	) КАК СтоимостьНМА
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНМА.НачалоМесяца,
	|	СтоимостьНМА.Период,
	|	СтоимостьНМА.Регистратор,
	|	СтоимостьНМА.НематериальныйАктив,
	|	СтоимостьНМА.Организация";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеАмортизации
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	Корректировка.Дата КАК Период,
	|	Корректировка.Ссылка КАК Регистратор,
	|	ТаблицаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	Корректировка.Организация КАК Организация,
	|	ТаблицаНМА.АмортизацияБУ КАК АмортизацияРегл
	|ПОМЕСТИТЬ АмортизацияНМА_ИзмененияБУ_МУ
	|ИЗ
	|	Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА.НМА КАК ТаблицаНМА
	|		ПО (ТаблицаНМА.Ссылка = Корректировка.Ссылка)
	|ГДЕ
	|	&ЭтоМеждународнаяВерсия
	|	И Корректировка.Проведен
	|	И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И Корректировка.ОтражатьВРеглУчете
	|	И ТаблицаНМА.АмортизацияБУ <> 0
	|
	|	И ТаблицаНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|			ГДЕ
	|				СписокНМА.НачалоМесяца = &НачалоМесяца
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ОбъединениеВсехИзменений
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|	ТаблицаИзменений.Регистратор КАК Регистратор,
	|	МАКСИМУМ(ТаблицаИзменений.Период) КАК Период,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ТаблицаИзменений.Период, МЕСЯЦ, 1), МЕСЯЦ)) КАК НачалоСледующегоМесяца,
	|	ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
	|	ТаблицаИзменений.Организация КАК Организация,
	|
	|	МАКСИМУМ(ПараметрыАмортизацииНМАБУ_Последнее.Период) КАК ПараметрыАмортизацииНМАБУ_ПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаНМА_Последнее.Период) КАК ПорядокУчетаНМА_ПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаНМАБУ_Последнее.Период) КАК ПорядокУчетаНМАБУ_ПоследнееПериод,
	|	МАКСИМУМ(МестоУчетаНМА_Последнее.Период) КАК МестоУчетаНМА_ПоследнееПериод,
	|	МАКСИМУМ(ПервоначальныеСведенияНМАИзмененияПоследнее.Период) КАК ПервоначальныеСведенияНМА_ПоследнееПериод
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийБУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период КАК Период,
	|		ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
	|		ТаблицаИзменений.Организация КАК Организация
	|	ИЗ
	|		ПараметрыАмортизацииНМАБУ_МУ_Изменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаНМАИзменения КАК ТаблицаИзменений
	|	ГДЕ
	|		&ЭтоМеждународнаяВерсия
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаНМАБУ_МУ_Изменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		МестоУчетаНМАИзменения КАК ТаблицаИзменений
	|	ГДЕ
	|		&ЭтоМеждународнаяВерсия
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		СтоимостьНМА_ИзмененияБУ_МУ КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.НематериальныйАктив,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		АмортизацияНМА_ИзмененияБУ_МУ КАК ТаблицаИзменений
	|
	|	) КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАБУ_МУ_Изменения КАК ПараметрыАмортизацииНМАБУ_Последнее
	|		ПО (ПараметрыАмортизацииНМАБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииНМАБУ_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАБУ_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАИзменения КАК ПорядокУчетаНМА_Последнее
	|		ПО (ПорядокУчетаНМА_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМА_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаНМА_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМА_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАБУ_МУ_Изменения КАК ПорядокУчетаНМАБУ_Последнее
	|		ПО (ПорядокУчетаНМАБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаНМАБУ_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМАБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМАБУ_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМАИзменения КАК МестоУчетаНМА_Последнее
	|		ПО (МестоУчетаНМА_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестоУчетаНМА_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (МестоУчетаНМА_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестоУчетаНМА_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМАИзменения КАК ПервоначальныеСведенияНМАИзмененияПоследнее
	|		ПО (ПервоначальныеСведенияНМАИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПервоначальныеСведенияНМАИзмененияПоследнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМАИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПервоначальныеСведенияНМАИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.НематериальныйАктив,
	|	ТаблицаИзменений.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив,
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	МИНИМУМ(ТаблицаИзмененийСледующее.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийСледующее_БУ_МУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ_МУ КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзменений КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Период > ТаблицаИзменений.Период
	|				ИЛИ ТаблицаИзмененийСледующее.Период = ТаблицаИзменений.Период
	|						И ТаблицаИзмененийСледующее.Регистратор > ТаблицаИзменений.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив,
	|	МИНИМУМ(ТаблицаИзменений.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийВЭтомМесяце_БУ_МУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ_МУ КАК ТаблицаИзменений
	|
	|ГДЕ
	|	(ТаблицаИзменений.НачалоМесяца = &НачалоМесяца)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.НематериальныйАктив";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область Изменения_БУ_МУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчету, МЕСЯЦ) = ТаблицаИзменений.НачалоМесяца
	|			ТОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчету, ДЕНЬ)
	|		ИНАЧЕ ТаблицаИзменений.ПериодПараметров 
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	ТаблицаИзменений.Регистратор КАК Регистратор,
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.НачалоМесяца, МЕСЯЦ) КАК КонецМесяца,
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.Период, ДЕНЬ) КАК ДатаИзменений,
	|
	|	ВЫБОР 
	|		КОГДА ТаблицаИзменений.НачалоМесяца = &НачалоПредыдущегоМесяца
	|				И НАЧАЛОПЕРИОДА(ЕСТЬNULL(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, &КонецМесяца), ДЕНЬ) = &НачалоМесяца
	|			ТОГДА &НачалоМесяца 
	|		КОГДА ТаблицаИзменений.НачалоМесяца = &НачалоПредыдущегоМесяца
	|			ТОГДА ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца) 
	|		ИНАЧЕ ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийСледующее.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца) 
	|	КОНЕЦ КАК Период,
	|
	|	РАЗНОСТЬДАТ(ТаблицаИзменений.Период, ЕСТЬNULL(ТаблицаИзмененийСледующее.ПериодСледующее, ТаблицаИзменений.НачалоСледующегоМесяца), ДЕНЬ) КАК СрокДействия,
	|	ТаблицаИзменений.НематериальныйАктив КАК НематериальныйАктив,
	|	ТаблицаИзменений.Организация КАК Организация,
	|
	|	ЕСТЬNULL(СтоимостьНМА_Изменения.СтоимостьРегл, 0) КАК СтоимостьРеглИзменение, // Изменение стоимости документом
	|	ЕСТЬNULL(АмортизацияНМА_Изменения.АмортизацияРегл, 0) КАК АмортизацияРеглИзменение, // Изменение амортизации документом
	|
	|	ПервоначальныеСведенияНМА_Последнее.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	ПараметрыАмортизацииНМАБУ_Последнее.СрокИспользования,
	|	ПараметрыАмортизацииНМАБУ_Последнее.Коэффициент,
	|	ПараметрыАмортизацииНМАБУ_Последнее.ЛиквидационнаяСтоимость,
	|
	|	ПорядокУчетаНМА_Последнее.ГруппаФинансовогоУчета,
	|	ПорядокУчетаНМА_Последнее.НаправлениеДеятельности,
	|	ПорядокУчетаНМА_Последнее.ОбъемНаработки,
	|
	|	ПорядокУчетаНМАБУ_Последнее.СостояниеБУ,
	|	ПорядокУчетаНМАБУ_Последнее.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	ПорядокУчетаНМАБУ_Последнее.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизации,
	|	ПорядокУчетаНМАБУ_Последнее.СтатьяРасходовБУ КАК СтатьяРасходов,
	|	ПорядокУчетаНМАБУ_Последнее.АналитикаРасходовБУ КАК АналитикаРасходов,
	|	ПорядокУчетаНМАБУ_Последнее.ПодразделениеБУ КАК ПодразделениеРасходов,
	|	ПорядокУчетаНМАБУ_Последнее.НаправлениеДеятельностиБУ КАК НаправлениеДеятельностиРасходов,
	|	ПорядокУчетаНМАБУ_Последнее.ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаНМАБУ_Последнее.ОрганизацияПолучательРасходов,
	|
	|	МестоУчетаНМА_Последнее.Подразделение
	|
	|ПОМЕСТИТЬ Изменения_БУ_МУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ_МУ КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийСледующее_БУ_МУ КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийВЭтомМесяце_БУ_МУ КАК ТаблицаИзмененийВЭтомМесяце
	|		ПО (ТаблицаИзмененийВЭтомМесяце.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийВЭтомМесяце.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ_МУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (ДатыПоследнегоИзменения.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМАИзменения КАК ПервоначальныеСведенияНМА_Последнее
	|		ПО (ПервоначальныеСведенияНМА_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПервоначальныеСведенияНМА_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПервоначальныеСведенияНМА_Последнее.Период = ТаблицаИзменений.ПервоначальныеСведенияНМА_ПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАБУ_МУ_Изменения КАК ПараметрыАмортизацииНМАБУ_Последнее
	|		ПО (ПараметрыАмортизацииНМАБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииНМАБУ_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАБУ_Последнее.Период = ТаблицаИзменений.ПараметрыАмортизацииНМАБУ_ПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАИзменения КАК ПорядокУчетаНМА_Последнее
	|		ПО (ПорядокУчетаНМА_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМА_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМА_Последнее.Период = ТаблицаИзменений.ПорядокУчетаНМА_ПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАБУ_МУ_Изменения КАК ПорядокУчетаНМАБУ_Последнее
	|		ПО (ПорядокУчетаНМАБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаНМАБУ_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (ПорядокУчетаНМАБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаНМАБУ_Последнее.Период = ТаблицаИзменений.ПорядокУчетаНМАБУ_ПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМАИзменения КАК МестоУчетаНМА_Последнее
	|		ПО (МестоУчетаНМА_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестоУчетаНМА_Последнее.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (МестоУчетаНМА_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестоУчетаНМА_Последнее.Период = ТаблицаИзменений.МестоУчетаНМА_ПоследнееПериод)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНМА_ИзмененияБУ_МУ КАК СтоимостьНМА_Изменения
	|		ПО (СтоимостьНМА_Изменения.Организация = ТаблицаИзменений.Организация)
	|			И (СтоимостьНМА_Изменения.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (СтоимостьНМА_Изменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (СтоимостьНМА_Изменения.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНМА_ИзмененияБУ_МУ КАК АмортизацияНМА_Изменения
	|		ПО (АмортизацияНМА_Изменения.Организация = ТаблицаИзменений.Организация)
	|			И (АмортизацияНМА_Изменения.НематериальныйАктив = ТаблицаИзменений.НематериальныйАктив)
	|			И (АмортизацияНМА_Изменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (АмортизацияНМА_Изменения.Регистратор = ТаблицаИзменений.Регистратор)";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти
	
	#Область ПериодИзменения_УУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Изменения_УУ.НачалоМесяца           КАК НачалоМесяца,
	|	Изменения_УУ.НематериальныйАктив    КАК НематериальныйАктив,
	|	Изменения_УУ.Организация            КАК Организация,
	|	МИНИМУМ(Изменения_УУ.ДатаИзменений) КАК Период
	|ПОМЕСТИТЬ ПериодИзменения_УУ
	|ИЗ
	|	Изменения_УУ КАК Изменения_УУ
	|
	|СГРУППИРОВАТЬ ПО
	|	Изменения_УУ.НачалоМесяца,
	|	Изменения_УУ.НематериальныйАктив,
	|	Изменения_УУ.Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
		
	#Область СписокНМАСПараметрами_УУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА ПериодИзмененияВТекущемМесяце.Период ЕСТЬ NULL
	|			ТОГДА СписокНМА.ПериодНачисления
	|		КОГДА НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, МЕСЯЦ)
	|			ТОГДА ПериодИзмененияВТекущемМесяце.Период
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ, -1)
	|	КОНЕЦ КАК Период,
	|
	|	СписокНМА.ЭтоДоначисление,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.НематериальныйАктив.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Организация,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаНМАНаНачалоМесяца.ГруппаФинансовогоУчета
	|		ИНАЧЕ ПорядокУчетаНМА.ГруппаФинансовогоУчета 
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаНМАНаНачалоМесяца.НаправлениеДеятельности
	|		ИНАЧЕ ПорядокУчетаНМА.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|
	|	СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
	|	КОНЕЦ КАК ПорядокНачисленияАмортизацииУУ,
	|
	// СтоимостьДляВычисленияАмортизации
	|	ВЫБОР 
	|		КОГДА НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьУУ
	|
	|		КОГДА СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)
	|
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	// СтоимостьДляВычисленияАмортизацииРегл
	|	ВЫБОР 
	|		КОГДА НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьБУ
	|
	|		КОГДА СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0)
	|
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.СрокИспользованияДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫБОР 
	|		КОГДА ДатыПоследнегоИзменения.Дата = НАЧАЛОПЕРИОДА(ПериодИзменения_УУ.Период, ДЕНЬ)
	|			ТОГДА 0
	|
	|		КОГДА ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР 
	|					КОГДА НЕ ПериодИзменения_УУ.Период ЕСТЬ NULL
	|						ТОГДА ВЫБОР 
	|								КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|									ТОГДА (РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|									ИНАЧЕ (РАЗНОСТЬДАТ(СписокНМА.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|							КОНЕЦ / ДЕНЬ(СписокНМА.КонецМесяца)
	|					ИНАЧЕ 1
	|				КОНЕЦ * ВЫБОР
	|							КОГДА СписокНМА.ЭтоДоначисление
	|								ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|							КОГДА НЕ СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|									И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|								ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) + ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	|						КОНЕЦ КАК ЧИСЛО(20,8))
	
			// Если расчет выполняется в месяце принятия к учету то ДеньПринятия/ВсегоДнейВМесяце
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|			ТОГДА ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокНМА.КонецМесяца) КАК ЧИСЛО(20,8))
	|	
			// В остальных случаях КоличествоДнейДоПервогоИзмененияПараметров/ВсегоДнейВМесяце
	|		ИНАЧЕ ВЫРАЗИТЬ((РАЗНОСТЬДАТ(СписокНМА.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокНМА.КонецМесяца) КАК ЧИСЛО(20,8))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|				ИЛИ ДатыПоследнегоИзменения.Дата ЕСТЬ NULL
	|
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|
	|		КОГДА ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|
	|			ТОГДА ВЫБОР
	|					КОГДА СписокНМА.ЭтоДоначисление
	|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиНаНачалоПредыдущегоМесяца, 0) КАК ЧИСЛО(20,8))
	|					КОГДА НЕ СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|							И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиНаНачалоМесяца, 0)
	|									- ЕСТЬNULL(ВыработкаНМА_НаДатуПоследнегоИзменения.ОбъемВыработкиУУ, 0) КАК ЧИСЛО(20,8))
	|				КОНЕЦ
	|
			// В следующем месяце после принятия к учету: [кол-во отработанных дней в мес принятия] / [всего дней в мес принятия]
	|		КОГДА КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(СписокНМА.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ)
	|
	|			ТОГДА ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1) 
	|					/ ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ)) КАК ЧИСЛО(20,8))
	
			// В более поздних месяцах: [кол-во отработанных дней в мес принятия] / [всего дней в мес принятия] + [кол-во месяцев после принятия до начала месяца]
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1) 
	|				/ ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ))
	|				+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДатыПоследнегоИзменения.Дата, МЕСЯЦ, 1), МЕСЯЦ), СписокНМА.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(20,8))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) <> ГОД(СписокНМА.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ)
	|				+ 12 * (ГОД(СписокНМА.НачалоМесяца) - Год(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	СписокНМА.НачислятьАмортизацию,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ПодразделениеРасходов <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокНМА.ПодразделениеРасходов 
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА МестоУчетаНМАНаНачалоМесяца.Подразделение
	|		ИНАЧЕ МестоУчетаНМА.Подразделение 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ПодразделениеРасходов <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокНМА.НаправлениеДеятельностиРасходов 
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаНМАНаНачалоМесяца.НаправлениеДеятельности
	|		ИНАЧЕ ПорядокУчетаНМА.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	СписокНМА.СпособОтраженияАмортизации,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов,
	|
	// ОстаточнаяСтоимость
	|	ВЫБОР 
	|		КОГДА СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)
	|
	|	КОНЕЦ КАК ОстаточнаяСтоимость,
	|
	// ОстаточнаяСтоимостьРегл
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииНМАУУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0)
	|
	|	КОНЕЦ КАК ОстаточнаяСтоимостьРегл,
	|
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьУУ КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьБУ КАК ПервоначальнаяСтоимостьРегл,
	|	&ФактическийСрокИспользования КАК ФактическийСрокИспользования,
	|
	|	ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимостьРегл, 0) КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	0 КАК СтоимостьНаНачалоГода,
	|
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииНМАУУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0)
	|	КОНЕЦ КАК Стоимость,
	|
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииНМАУУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0)
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	|	ЕСТЬNULL(АмортизацияНМА.Амортизация, 0) КАК Амортизация,
	|	ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияУпр, 0)  КАК ОстатокОбесцененияУпр,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА МестоУчетаНМАНаНачалоМесяца.Подразделение
	|		ИНАЧЕ МестоУчетаНМА.Подразделение 
	|	КОНЕЦ КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ОбъемВыработки,
	|
	|	ПараметрыАмортизацииНМАУУ.СрокИспользования КАК СрокИспользования,
	|	ПараметрыАмортизацииНМАУУ.КоэффициентУскорения КАК КоэффициентУскорения,
	|	ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации
	|
	|ПОМЕСТИТЬ СписокНМАСПараметрами_УУ
	|
	|ИЗ
	|	СписокОбъектовУчета_УУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_УУ КАК ПериодИзменения_УУ
	|		ПО (ПериодИзменения_УУ.Организация = СписокНМА.Организация)
	|			И (ПериодИзменения_УУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПериодИзменения_УУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_УУ КАК ПериодИзмененияВТекущемМесяце
	|		ПО (ПериодИзмененияВТекущемМесяце.Организация = СписокНМА.Организация)
	|			И (ПериодИзмененияВТекущемМесяце.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПериодИзмененияВТекущемМесяце.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияУУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = СписокНМА.Организация)
	|			И (ДатыПоследнегоИзменения.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПорядокУчетаНМА.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМА КАК ПорядокУчетаНМАНаНачалоМесяца
	|		ПО (ПорядокУчетаНМАНаНачалоМесяца.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМАНаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМАНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (ПорядокУчетаНМАНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНМА
	|		ПО (СтоимостьНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (СтоимостьНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьНМА КАК ПредварительнаяСтоимостьНМА
	|		ПО (ПредварительнаяСтоимостьНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПредварительнаяСтоимостьНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНМА
	|		ПО (АмортизацияНМА.Организация = СписокНМА.Организация)
	|			И (АмортизацияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (АмортизацияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМА КАК МестоУчетаНМА
	|		ПО (МестоУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (МестоУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (МестоУчетаНМА.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМА КАК МестоУчетаНМАНаНачалоМесяца
	|		ПО (МестоУчетаНМАНаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (МестоУчетаНМАНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (МестоУчетаНМАНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = СписокНМА.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПервоначальныеСведенияНМА.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
	|		ПО (ПараметрыАмортизацииНМАУУ.Организация = СписокНМА.Организация)
	|			И (ПараметрыАмортизацииНМАУУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАУУ.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАУУ КАК ПорядокУчетаНМАУУ
	|		ПО (ПорядокУчетаНМАУУ.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМАУУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМАУУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПорядокУчетаНМАУУ.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАУУ КАК ПорядокУчетаНМАУУ_НаНачалоМесяца
	|		ПО (ПорядокУчетаНМАУУ_НаНачалоМесяца.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМАУУ_НаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМАУУ_НаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (ПорядокУчетаНМАУУ_НаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА КАК ВыработкаНМА
	|		ПО (ВыработкаНМА.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА_НаДатуПоследнегоИзменения КАК ВыработкаНМА_НаДатуПоследнегоИзменения
	|		ПО (ВыработкаНМА_НаДатуПоследнегоИзменения.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|ГДЕ
	|	ЕСТЬNULL(ПорядокУчетаНМАУУ.НачислятьАмортизацию, ЛОЖЬ)
	|
	|	И (НЕ СписокНМА.ЭтоДоначисление
	|		ИЛИ СписокНМА.НачалоМесяца = НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ)
	|			И ЕСТЬNULL(ПорядокУчетаНМАУУ_НаНачалоМесяца.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияНМА.НеПринятКУчету)) = ЗНАЧЕНИЕ(Перечисление.СостоянияНМА.ПринятКУчету))
	|";	
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ФактическийСрокИспользования", 
		ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти

	#Область СписокНМАСПараметрами_БУ_МУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА ПериодИзмененияВТекущемМесяце.Период ЕСТЬ NULL
	|			ТОГДА СписокНМА.ПериодНачисления
	|		КОГДА НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, МЕСЯЦ)
	|			ТОГДА ПериодИзмененияВТекущемМесяце.Период
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ, -1)
	|	КОНЕЦ КАК Период,
	|
	|	СписокНМА.ЭтоДоначисление,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Организация,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаНМАНаНачалоМесяца.ГруппаФинансовогоУчета
	|		ИНАЧЕ ПорядокУчетаНМА.ГруппаФинансовогоУчета 
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаНМАНаНачалоМесяца.НаправлениеДеятельности
	|		ИНАЧЕ ПорядокУчетаНМА.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|
	|	ИСТИНА КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
	|	КОНЕЦ КАК ПорядокНачисленияАмортизацииБУ,
	|
	// СтоимостьДляВычисленияАмортизацииРегл
	|	ВЫБОР 
	|		КОГДА СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0)
	|
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииНМАБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНМАБУ.СрокИспользованияДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫБОР 
	|		КОГДА ДатыПоследнегоИзменения.Дата = НАЧАЛОПЕРИОДА(ПериодИзменения_УУ.Период, ДЕНЬ)
	|			ТОГДА 0
	|
	|		КОГДА ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР 
	|					КОГДА НЕ ПериодИзменения_УУ.Период ЕСТЬ NULL
	|						ТОГДА ВЫБОР 
	|								КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|									ТОГДА (РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|									ИНАЧЕ (РАЗНОСТЬДАТ(СписокНМА.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|							КОНЕЦ / ДЕНЬ(СписокНМА.КонецМесяца)
	|					ИНАЧЕ 1
	|				КОНЕЦ * ВЫБОР
	|							КОГДА СписокНМА.ЭтоДоначисление
	|								ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|							КОГДА НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|									И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|								ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) + ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	|						КОНЕЦ КАК ЧИСЛО(20,8))
	
			// Если расчет выполняется в месяце принятия к учету то ДеньПринятия/ВсегоДнейВМесяце
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|			ТОГДА ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокНМА.КонецМесяца) КАК ЧИСЛО(20,8))
	|	
			// В остальных случаях КоличествоДнейДоПервогоИзмененияПараметров/ВсегоДнейВМесяце
	|		ИНАЧЕ ВЫРАЗИТЬ((РАЗНОСТЬДАТ(СписокНМА.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_УУ.Период, ДЕНЬ, -1), СписокНМА.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокНМА.КонецМесяца) КАК ЧИСЛО(20,8))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|				ИЛИ ДатыПоследнегоИзменения.Дата ЕСТЬ NULL
	|
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|
	|		КОГДА ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|
	|			ТОГДА ВЫБОР
	|					КОГДА СписокНМА.ЭтоДоначисление
	|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиНаНачалоПредыдущегоМесяца, 0) КАК ЧИСЛО(20,8))
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиНаНачалоМесяца, 0) 
	|									- ЕСТЬNULL(ВыработкаНМА_НаДатуПоследнегоИзменения.ОбъемВыработкиБУ, 0) КАК ЧИСЛО(20,8))
	|				КОНЕЦ
	|
			// В следующем месяце после принятия к учету: [кол-во отработанных дней в мес принятия] / [всего дней в мес принятия]
	|		КОГДА КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(СписокНМА.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ)
	|
	|			ТОГДА ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1) 
	|					/ ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ)) КАК ЧИСЛО(20,8))
	
			// В более поздних месяцах: [кол-во отработанных дней в мес принятия] / [всего дней в мес принятия] + [кол-во месяцев после принятия до начала месяца]
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1) 
	|				/ ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ))
	|				+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДатыПоследнегоИзменения.Дата, МЕСЯЦ, 1), МЕСЯЦ), СписокНМА.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(20,8))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) <> ГОД(СписокНМА.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ)
	|				+ 12 * (ГОД(СписокНМА.НачалоМесяца) - Год(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	СписокНМА.НачислятьАмортизацию,
	|	СписокНМА.СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ПодразделениеРасходов <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокНМА.ПодразделениеРасходов 
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА МестоУчетаНМАНаНачалоМесяца.Подразделение
	|		ИНАЧЕ МестоУчетаНМА.Подразделение 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ПодразделениеРасходов <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокНМА.НаправлениеДеятельностиРасходов 
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаНМАНаНачалоМесяца.НаправлениеДеятельности
	|		ИНАЧЕ ПорядокУчетаНМА.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	СписокНМА.СпособОтраженияАмортизации,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|
	// ОстаточнаяСтоимостьРегл
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииНМАБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0)
	|
	|	КОНЕЦ КАК ОстаточнаяСтоимостьРегл,
	|
	|	ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьБУ КАК ПервоначальнаяСтоимостьРегл,
	|	&ФактическийСрокИспользования КАК ФактическийСрокИспользования,
	|
	|	ЕСТЬNULL(ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	0 КАК СтоимостьНаНачалоГода,
	|
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииНМАБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И СписокНМА.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокНМА.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0)
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	|	ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.ЭтоДоначисление
	|			ТОГДА МестоУчетаНМАНаНачалоМесяца.Подразделение
	|		ИНАЧЕ МестоУчетаНМА.Подразделение 
	|	КОНЕЦ КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ОбъемВыработки,
	|
	|	ПараметрыАмортизацииНМАБУ.СрокПолезногоИспользованияБУ КАК СрокИспользования,
	|	ПараметрыАмортизацииНМАБУ.КоэффициентБУ КАК КоэффициентУскорения,
	|	ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации
	|
	|ПОМЕСТИТЬ СписокНМАСПараметрами_БУ_МУ
	|
	|ИЗ
	|	СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_УУ КАК ПериодИзменения_УУ
	|		ПО (ПериодИзменения_УУ.Организация = СписокНМА.Организация)
	|			И (ПериодИзменения_УУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПериодИзменения_УУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_УУ КАК ПериодИзмененияВТекущемМесяце
	|		ПО (ПериодИзмененияВТекущемМесяце.Организация = СписокНМА.Организация)
	|			И (ПериодИзмененияВТекущемМесяце.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПериодИзмененияВТекущемМесяце.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ_МУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = СписокНМА.Организация)
	|			И (ДатыПоследнегоИзменения.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПорядокУчетаНМА.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМА КАК ПорядокУчетаНМАНаНачалоМесяца
	|		ПО (ПорядокУчетаНМАНаНачалоМесяца.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМАНаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМАНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (ПорядокУчетаНМАНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНМА
	|		ПО (СтоимостьНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (СтоимостьНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьНМА КАК ПредварительнаяСтоимостьНМА
	|		ПО (ПредварительнаяСтоимостьНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПредварительнаяСтоимостьНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНМА
	|		ПО (АмортизацияНМА.Организация = СписокНМА.Организация)
	|			И (АмортизацияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (АмортизацияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = СписокНМА.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМА КАК МестоУчетаНМА
	|		ПО (МестоУчетаНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (МестоУчетаНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (МестоУчетаНМА.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМА КАК МестоУчетаНМАНаНачалоМесяца
	|		ПО (МестоУчетаНМАНаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (МестоУчетаНМАНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (МестоУчетаНМАНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = СписокНМА.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПервоначальныеСведенияНМА.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАБУ КАК ПараметрыАмортизацииНМАБУ
	|		ПО (ПараметрыАмортизацииНМАБУ.Организация = СписокНМА.Организация)
	|			И (ПараметрыАмортизацииНМАБУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАБУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАБУ.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАБУ КАК ПорядокУчетаНМАБУ
	|		ПО (ПорядокУчетаНМАБУ.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМАБУ.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМАБУ.НачалоМесяца = СписокНМА.НачалоМесяца)
	|			И (ПорядокУчетаНМАБУ.ПериодПараметров = СписокНМА.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМАБУ КАК ПорядокУчетаНМАБУ_НаНачалоМесяца
	|		ПО (ПорядокУчетаНМАБУ_НаНачалоМесяца.Организация = СписокНМА.Организация)
	|			И (ПорядокУчетаНМАБУ_НаНачалоМесяца.НематериальныйАктив = СписокНМА.НематериальныйАктив)
	|			И (ПорядокУчетаНМАБУ_НаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (ПорядокУчетаНМАБУ_НаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА КАК ВыработкаНМА
	|		ПО (ВыработкаНМА.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА_НаДатуПоследнегоИзменения КАК ВыработкаНМА_НаДатуПоследнегоИзменения
	|		ПО (ВыработкаНМА_НаДатуПоследнегоИзменения.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|ГДЕ
	|	ЕСТЬNULL(ПорядокУчетаНМАБУ.НачислятьАмортизациюБУ, ЛОЖЬ)
	|
	|	И (НЕ СписокНМА.ЭтоДоначисление
	|		ИЛИ СписокНМА.НачалоМесяца = НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ, МЕСЯЦ)
	|			И ЕСТЬNULL(ПорядокУчетаНМАБУ_НаНачалоМесяца.СостояниеБУ, ЗНАЧЕНИЕ(Перечисление.СостоянияНМА.НеПринятКУчету)) = ЗНАЧЕНИЕ(Перечисление.СостоянияНМА.ПринятКУчету))
	|";	
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ФактическийСрокИспользования", 
		ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокНМАСИзмененнымиПараметрами_УУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Изменения_УУ.Период,
	|	Изменения_УУ.Регистратор,
	|	Изменения_УУ.НематериальныйАктив КАК НематериальныйАктив,
	|	(Изменения_УУ.НачалоМесяца = &НачалоПредыдущегоМесяца) КАК ЭтоДоначисление,
	|	ВЫРАЗИТЬ(Изменения_УУ.НематериальныйАктив КАК Справочник.НематериальныеАктивы).ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	Изменения_УУ.Организация,
	|
	|	ЕСТЬNULL(Изменения_УУ.ГруппаФинансовогоУчета,  ПорядокУчетаНМА.ГруппаФинансовогоУчета)  КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(Изменения_УУ.НаправлениеДеятельности, ПорядокУчетаНМА.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|
	|	СписокНМА.МетодПереоценки КАК МетодПереоценки,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(Изменения_УУ.ОбъемНаработки, ПорядокУчетаНМА.ОбъемНаработки)
	|		ИНАЧЕ ЕСТЬNULL(Изменения_УУ.СрокИспользования, ПараметрыАмортизацииНМАУУ.СрокИспользованияДляВычисленияАмортизации)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫРАЗИТЬ(ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	|		ИНАЧЕ 1
	|	КОНЕЦ * Изменения_УУ.СрокДействия / ДЕНЬ(Изменения_УУ.КонецМесяца) КАК ЧИСЛО(20, 8)) КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_УУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_УУ.НачалоМесяца
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|	
	|		КОГДА ЕСТЬNULL(Изменения_УУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения) ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|
	|		КОГДА ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА Изменения_УУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиНаНачалоПредыдущегоМесяца, 0) КАК ЧИСЛО(20,8))
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаНМА.ОбъемВыработкиНаНачалоМесяца, 0)
	|									- ЕСТЬNULL(ВыработкаНМА_НаДатуПоследнегоИзменения.ОбъемВыработкиУУ, 0) КАК ЧИСЛО(20,8))
	|				КОНЕЦ
	|
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ЕСТЬNULL(Изменения_УУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения), КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_УУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения), МЕСЯЦ), ДЕНЬ) + 1) / ДЕНЬ(КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_УУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения), МЕСЯЦ))
	|			+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(Изменения_УУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииНМАУУ.ДатаПоследнегоИзменения), МЕСЯЦ, 1), МЕСЯЦ), Изменения_УУ.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(20,8))
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	// ОтработанныхМесяцевПолныхЛет
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) <> ГОД(Изменения_УУ.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ)
	|				+ 12 * (ГОД(Изменения_УУ.НачалоМесяца) - Год(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	ЕСТЬNULL(Изменения_УУ.НачислятьАмортизацию, ЕСТЬNULL(СписокНМА.НачислятьАмортизацию, ЛОЖЬ)) КАК НачислятьАмортизацию,
	|	ЕСТЬNULL(Изменения_УУ.СтатьяРасходов, СписокНМА.СтатьяРасходов) КАК СтатьяРасходов,
	|	ЕСТЬNULL(Изменения_УУ.АналитикаРасходов, СписокНМА.АналитикаРасходов) КАК АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Изменения_УУ.ПодразделениеРасходов, СписокНМА.ПодразделениеРасходов) <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Изменения_УУ.ПодразделениеРасходов, СписокНМА.ПодразделениеРасходов) 
	|		ИНАЧЕ ЕСТЬNULL(Изменения_УУ.Подразделение, МестоУчетаНМА.Подразделение) 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Изменения_УУ.ПодразделениеРасходов, СписокНМА.ПодразделениеРасходов) <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Изменения_УУ.НаправлениеДеятельностиРасходов, СписокНМА.НаправлениеДеятельностиРасходов) 
	|		ИНАЧЕ ЕСТЬNULL(Изменения_УУ.НаправлениеДеятельности, ПорядокУчетаНМА.НаправлениеДеятельности) 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	ЕСТЬNULL(Изменения_УУ.СпособОтраженияАмортизации, СписокНМА.СпособОтраженияАмортизации) КАК СпособОтраженияАмортизации,
	|	ЕСТЬNULL(Изменения_УУ.ПередаватьРасходыВДругуюОрганизацию, ЕСТЬNULL(СписокНМА.ПередаватьРасходыВДругуюОрганизацию, ЛОЖЬ)) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(Изменения_УУ.ОрганизацияПолучательРасходов, СписокНМА.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	// ОстаточнаяСтоимость
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_УУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)
	|	КОНЕЦ КАК ОстаточнаяСтоимость,	
	|
	// ОстаточнаяСтоимостьРегл
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_УУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0)
	|	КОНЕЦ КАК ОстаточнаяСтоимостьРегл,	
	|
	|	0 КАК СтоимостьНаНачалоГода,
	|
	// Стоимость
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_УУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|		КОГДА Изменения_УУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0)
	|	КОНЕЦ КАК Стоимость,
	|
	// СтоимостьРегл
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_УУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|		КОГДА Изменения_УУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0)
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	|	ЕСТЬNULL(АмортизацияНМА.Амортизация, 0) КАК Амортизация,
	|	ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияУпр, 0) КАК ОстатокОбесцененияУпр,
	|
	|	Изменения_УУ.СтоимостьИзменение КАК СтоимостьИзменение,
	|	Изменения_УУ.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	Изменения_УУ.АмортизацияИзменение КАК АмортизацияИзменение,
	|	Изменения_УУ.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|
	|	ЕСТЬNULL(Изменения_УУ.Подразделение, МестоУчетаНМА.Подразделение) КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ОбъемВыработки,
	|
	|	ЕСТЬNULL(Изменения_УУ.СрокИспользования, ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.СрокИспользования, 0)) КАК СрокИспользования,
	|	ЕСТЬNULL(Изменения_УУ.КоэффициентУскорения, ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.КоэффициентУскорения, 0)) КАК КоэффициентУскорения,
	|	ЕСТЬNULL(Изменения_УУ.ЛиквидационнаяСтоимость, ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимость, 0)) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(Изменения_УУ.ЛиквидационнаяСтоимостьРегл, ЕСТЬNULL(ПараметрыАмортизацииНМАУУ.ЛиквидационнаяСтоимостьРегл, 0)) КАК ЛиквидационнаяСтоимостьРегл,
	|	ЕСТЬNULL(Изменения_УУ.МетодНачисленияАмортизации, ПараметрыАмортизацииНМАУУ.МетодНачисленияАмортизации) КАК МетодНачисленияАмортизации
	|
	|ПОМЕСТИТЬ СписокНМАСИзмененнымиПараметрами_УУ
	|
	|ИЗ
	|	Изменения_УУ КАК Изменения_УУ
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОбъектовУчета_УУ КАК СписокНМА
	|		ПО (СписокНМА.Организация = Изменения_УУ.Организация)
	|			И (СписокНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (СписокНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|			И (ПорядокУчетаНМА.ПериодПараметров = Изменения_УУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНМА
	|		ПО (СтоимостьНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (СтоимостьНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьНМА КАК ПредварительнаяСтоимостьНМА
	|		ПО (ПредварительнаяСтоимостьНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПредварительнаяСтоимостьНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНМА
	|		ПО (АмортизацияНМА.Организация = Изменения_УУ.Организация)
	|			И (АмортизацияНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (АмортизацияНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМА КАК МестоУчетаНМА
	|		ПО (МестоУчетаНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (МестоУчетаНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|			И (МестоУчетаНМА.ПериодПараметров = Изменения_УУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = Изменения_УУ.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|			И (ПервоначальныеСведенияНМА.ПериодПараметров = Изменения_УУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАУУ КАК ПараметрыАмортизацииНМАУУ
	|		ПО (ПараметрыАмортизацииНМАУУ.Организация = Изменения_УУ.Организация)
	|			И (ПараметрыАмортизацииНМАУУ.НематериальныйАктив = Изменения_УУ.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАУУ.НачалоМесяца = Изменения_УУ.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАУУ.ПериодПараметров = Изменения_УУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА КАК ВыработкаНМА
	|		ПО (ВыработкаНМА.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА_НаДатуПоследнегоИзменения КАК ВыработкаНМА_НаДатуПоследнегоИзменения
	|		ПО (ВыработкаНМА_НаДатуПоследнегоИзменения.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтоДоначисление,
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокНМАСИзмененнымиПараметрами_БУ_МУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Изменения_БУ_МУ.Период,
	|	Изменения_БУ_МУ.Регистратор,
	|	Изменения_БУ_МУ.НематериальныйАктив КАК НематериальныйАктив,
	|	(Изменения_БУ_МУ.НачалоМесяца = &НачалоПредыдущегоМесяца) КАК ЭтоДоначисление,
	|	ВЫРАЗИТЬ(Изменения_БУ_МУ.НематериальныйАктив КАК Справочник.НематериальныеАктивы).ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	Изменения_БУ_МУ.Организация,
	|
	|	СписокНМА.МетодПереоценки КАК МетодПереоценки,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(Изменения_БУ_МУ.ГруппаФинансовогоУчета,  ПорядокУчетаНМА.ГруппаФинансовогоУчета)  КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(Изменения_БУ_МУ.НаправлениеДеятельности, ПорядокУчетаНМА.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(Изменения_БУ_МУ.ОбъемНаработки, ПорядокУчетаНМА.ОбъемНаработки)
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ_МУ.СрокИспользования, ПараметрыАмортизацииНМАБУ.СрокПолезногоИспользованияБУ)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫРАЗИТЬ(ВЫБОР 
	|		КОГДА ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0)
	|		ИНАЧЕ 1
	|	КОНЕЦ * Изменения_БУ_МУ.СрокДействия / ДЕНЬ(Изменения_БУ_МУ.КонецМесяца) КАК ЧИСЛО(20, 8)) КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫРАЗИТЬ(ВЫБОР 
	|		КОГДА ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ, МЕСЯЦ) = Изменения_БУ_МУ.НачалоМесяца
	|			ТОГДА 0
	|		КОГДА ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) - ЕСТЬNULL(ВыработкаНМА_НаДатуПоследнегоИзменения.ОбъемВыработкиБУ, 0)
	// 		Расшифровка формулы: [Кол-во отработанных дней в мес. принятия] / [всего дней в мес.принятия] + [кол-во мес. после принятия до начала месяца расчета].
	|		ИНАЧЕ
	|			(РАЗНОСТЬДАТ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ, КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ, МЕСЯЦ), ДЕНЬ) + 1) / ДЕНЬ(КОНЕЦПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ, МЕСЯЦ))
	|			+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ, МЕСЯЦ, 1), МЕСЯЦ), Изменения_БУ_МУ.КонецМесяца, МЕСЯЦ)
	|	КОНЕЦ КАК ЧИСЛО(20,8)) КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	// ОтработанныхМесяцевПолныхЛет
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ) <> ГОД(Изменения_БУ_МУ.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ)
	|				+ 12 * (ГОД(Изменения_БУ_МУ.НачалоМесяца) - Год(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	ЕСТЬNULL(Изменения_БУ_МУ.НачислятьАмортизацию, ЕСТЬNULL(СписокНМА.НачислятьАмортизацию, ЛОЖЬ)) КАК НачислятьАмортизацию,
	|	ЕСТЬNULL(Изменения_БУ_МУ.СтатьяРасходов, СписокНМА.СтатьяРасходов) КАК СтатьяРасходов,
	|	ЕСТЬNULL(Изменения_БУ_МУ.АналитикаРасходов, СписокНМА.АналитикаРасходов) КАК АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Изменения_БУ_МУ.ПодразделениеРасходов, СписокНМА.ПодразделениеРасходов) <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Изменения_БУ_МУ.ПодразделениеРасходов, СписокНМА.ПодразделениеРасходов) 
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ_МУ.Подразделение, МестоУчетаНМА.Подразделение) 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Изменения_БУ_МУ.ПодразделениеРасходов, СписокНМА.ПодразделениеРасходов) <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Изменения_БУ_МУ.НаправлениеДеятельностиРасходов, СписокНМА.НаправлениеДеятельностиРасходов) 
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ_МУ.НаправлениеДеятельности, ПорядокУчетаНМА.НаправлениеДеятельности) 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	ЕСТЬNULL(Изменения_БУ_МУ.СпособОтраженияАмортизации, СписокНМА.СпособОтраженияАмортизации) КАК СпособОтраженияАмортизации,
	|	ЕСТЬNULL(Изменения_БУ_МУ.ПередаватьРасходыВДругуюОрганизацию, ЕСТЬNULL(СписокНМА.ПередаватьРасходыВДругуюОрганизацию, ЛОЖЬ)) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(Изменения_БУ_МУ.ОрганизацияПолучательРасходов, СписокНМА.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	// ОстаточнаяСтоимость
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_БУ_МУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)
	|	КОНЕЦ - ВЫБОР 
	|				КОГДА НЕ Изменения_БУ_МУ.ЛиквидационнаяСтоимость ЕСТЬ NULL
	|					ТОГДА Изменения_БУ_МУ.ЛиквидационнаяСтоимость
	|				КОГДА НЕ ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость ЕСТЬ NULL
	|					ТОГДА ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОстаточнаяСтоимость,	
	|
	// ОстаточнаяСтоимостьРегл
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_БУ_МУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0)
	|	КОНЕЦ - ВЫБОР 
	|				КОГДА НЕ Изменения_БУ_МУ.ЛиквидационнаяСтоимость ЕСТЬ NULL
	|					ТОГДА Изменения_БУ_МУ.ЛиквидационнаяСтоимость
	|				КОГДА НЕ ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость ЕСТЬ NULL
	|					ТОГДА ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОстаточнаяСтоимостьРегл,	
	|
	|	0 КАК СтоимостьНаНачалоГода,
	|
	// СтоимостьРегл
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ, МЕСЯЦ) = Изменения_БУ_МУ.НачалоМесяца
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьНМА.СтоимостьРегл, 0)
	|		КОГДА Изменения_БУ_МУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0)
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	|	ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|
	|	Изменения_БУ_МУ.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	Изменения_БУ_МУ.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|
	|	ЕСТЬNULL(Изменения_БУ_МУ.Подразделение, МестоУчетаНМА.Подразделение) КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ОбъемВыработки,
	|
	|	ЕСТЬNULL(Изменения_БУ_МУ.СрокИспользования, ЕСТЬNULL(ПараметрыАмортизацииНМАБУ.СрокПолезногоИспользованияБУ, 0)) КАК СрокИспользования,
	|	ЕСТЬNULL(Изменения_БУ_МУ.Коэффициент, ЕСТЬNULL(ПараметрыАмортизацииНМАБУ.КоэффициентБУ, 0)) КАК КоэффициентУскорения,
	|	ЕСТЬNULL(Изменения_БУ_МУ.ЛиквидационнаяСтоимость, ЕСТЬNULL(ПараметрыАмортизацииНМАБУ.ЛиквидационнаяСтоимость, 0)) КАК ЛиквидационнаяСтоимостьРегл,
	|	ЕСТЬNULL(Изменения_БУ_МУ.МетодНачисленияАмортизации, ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ) КАК МетодНачисленияАмортизации
	|
	|ПОМЕСТИТЬ СписокНМАСИзмененнымиПараметрами_БУ_МУ
	|
	|ИЗ
	|	Изменения_БУ_МУ КАК Изменения_БУ_МУ
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОбъектовУчета_БУ_МУ КАК СписокНМА
	|		ПО (СписокНМА.Организация = Изменения_БУ_МУ.Организация)
	|			И (СписокНМА.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (СписокНМА.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаНМА КАК ПорядокУчетаНМА
	|		ПО (ПорядокУчетаНМА.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (ПорядокУчетаНМА.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|			И (ПорядокУчетаНМА.ПериодПараметров = Изменения_БУ_МУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНМА
	|		ПО (СтоимостьНМА.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (СтоимостьНМА.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьНМА КАК ПредварительнаяСтоимостьНМА
	|		ПО (ПредварительнаяСтоимостьНМА.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (ПредварительнаяСтоимостьНМА.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНМА
	|		ПО (АмортизацияНМА.Организация = Изменения_БУ_МУ.Организация)
	|			И (АмортизацияНМА.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (АмортизацияНМА.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестоУчетаНМА КАК МестоУчетаНМА
	|		ПО (МестоУчетаНМА.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (МестоУчетаНМА.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|			И (МестоУчетаНМА.ПериодПараметров = Изменения_БУ_МУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНМА КАК ПервоначальныеСведенияНМА
	|		ПО (ПервоначальныеСведенияНМА.Организация = Изменения_БУ_МУ.Организация)
	|			И (ПервоначальныеСведенияНМА.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНМА.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|			И (ПервоначальныеСведенияНМА.ПериодПараметров = Изменения_БУ_МУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНМАБУ КАК ПараметрыАмортизацииНМАБУ
	|		ПО (ПараметрыАмортизацииНМАБУ.Организация = Изменения_БУ_МУ.Организация)
	|			И (ПараметрыАмортизацииНМАБУ.НематериальныйАктив = Изменения_БУ_МУ.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНМАБУ.НачалоМесяца = Изменения_БУ_МУ.НачалоМесяца)
	|			И (ПараметрыАмортизацииНМАБУ.ПериодПараметров = Изменения_БУ_МУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА КАК ВыработкаНМА
	|		ПО (ВыработкаНМА.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА_НаДатуПоследнегоИзменения КАК ВыработкаНМА_НаДатуПоследнегоИзменения
	|		ПО (ВыработкаНМА_НаДатуПоследнегоИзменения.НематериальныйАктив = ПорядокУчетаНМА.НематериальныйАктив)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтоДоначисление,
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СпособыОтраженияАмортизации
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокВсехНМА.СпособОтраженияАмортизации КАК Ссылка
	|ПОМЕСТИТЬ втСпособыОтраженияАмортизации
	|ИЗ
	|	СписокОбъектовУчета КАК СписокВсехНМА
	|ГДЕ
	|	НЕ СписокВсехНМА.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Изменения_УУ.СпособОтраженияАмортизации
	|ИЗ
	|	Изменения_УУ КАК Изменения_УУ
	|ГДЕ
	|	НЕ Изменения_УУ.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Изменения_БУ_МУ.СпособОтраженияАмортизации
	|ИЗ 
	|	Изменения_БУ_МУ КАК Изменения_БУ_МУ
	|ГДЕ 
	|	НЕ Изменения_БУ_МУ.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАмортизация.Ссылка                               КАК СпособОтраженияАмортизации,
	|	ТаблицаАмортизация.СтатьяРасходов                       КАК СтатьяРасходов,
	|	ТаблицаАмортизация.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ТаблицаАмортизация.Подразделение                        КАК Подразделение,
	|	ТаблицаАмортизация.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ТаблицаАмортизация.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета КАК ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета,
	|	ТаблицаАмортизация.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТаблицаАмортизация.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|	ТаблицаАмортизация.Коэффициент                          КАК База,
	|	ТаблицаАмортизация.СуммаКоэффициентовПредыдущихСтрок    КАК БазаНакопленная,
	|	ТаблицаАмортизация.Ссылка.СуммаКоэффициентовАмортизации КАК СуммаБазы
	|ПОМЕСТИТЬ СпособыОтраженияАмортизации
	|ИЗ
	|	Документ.ИзменениеПараметровНМА2_4.Амортизация КАК ТаблицаАмортизация
	|ГДЕ
	|	ТаблицаАмортизация.Ссылка В (ВЫБРАТЬ СпособыОтраженияАмортизации.Ссылка ИЗ втСпособыОтраженияАмортизации КАК СпособыОтраженияАмортизации)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОтраженияАмортизации";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	АмортизацияНМАЛокализация.ДополнитьТекстЗапросаПараметрыРасчетаАмортизации(СписокЗапросов, ПараметрыРасчета);
	
КонецПроцедуры

Процедура ТекстЗапросаПроверкаПараметровРасчета(СписокЗапросов, ПараметрыРасчета)

	#Область ПроверкаПараметровРасчета_УУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.НематериальныйАктив КАК ОбъектУчета,
	|	СписокНМА.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчета_УУ
	|
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
			// НеУказанОбъемНаработки
	|	 	СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			И СписокНМА.РесурсНазначенный = 0 КАК НеУказанОбъемНаработки
	|
	|	ИЗ
	|		СписокНМАСПараметрами_УУ КАК СписокНМА
	|
	|	ГДЕ
	|		СписокНМА.НачислятьАмортизацию
	|		И СписокНМА.ОстаточнаяСтоимость > 0
	|
	|	) КАК СписокНМА
	|
	|ГДЕ
	|	СписокНМА.НеУказанОбъемНаработки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПроверкаПараметровРасчета_БУ_МУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.НематериальныйАктив КАК ОбъектУчета,
	|	СписокНМА.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчета_БУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
			// НеУказанОбъемНаработки
	|		 СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			И СписокНМА.РесурсНазначенный = 0 КАК НеУказанОбъемНаработки
	|
	|	ИЗ
	|		СписокНМАСПараметрами_БУ_МУ КАК СписокНМА
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизации КАК СпособыОтраженияАмортизации
	|			ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = СписокНМА.СпособОтраженияАмортизации)
	|
	|	ГДЕ
	|		СписокНМА.НачислятьАмортизацию
	|		И СписокНМА.ОстаточнаяСтоимостьРегл > 0
	|
	|	) КАК СписокНМА
	|
	|ГДЕ
	|	СписокНМА.НеУказанОбъемНаработки
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПроверкаПараметровРасчетаИзменения_УУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.НематериальныйАктив КАК ОбъектУчета,
	|	СписокНМА.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчетаИзменения_УУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
			// НеУказанОбъемНаработки
	|		 СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			И СписокНМА.РесурсНазначенный = 0 КАК НеУказанОбъемНаработки
	|
	|	ИЗ
	|		СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА
	|
	|	ГДЕ
	|		СписокНМА.НачислятьАмортизацию
	|		И СписокНМА.ОстаточнаяСтоимость > 0
	|
	|	) КАК СписокНМА
	| 
	|ГДЕ
	|	СписокНМА.НеУказанОбъемНаработки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область ПроверкаПараметровРасчетаИзменения_БУ_МУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.НематериальныйАктив КАК ОбъектУчета,
	|	СписокНМА.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчетаИзменения_БУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
			// НеУказанОбъемНаработки
	|		 СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			И СписокНМА.РесурсНазначенный = 0 КАК НеУказанОбъемНаработки
	|
	|	ИЗ
	|		СписокНМАСИзмененнымиПараметрами_БУ_МУ КАК СписокНМА
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизации КАК СпособыОтраженияАмортизации
	|			ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = СписокНМА.СпособОтраженияАмортизации)
	|
	|	ГДЕ
	|		СписокНМА.НачислятьАмортизацию 
	|		И СписокНМА.ОстаточнаяСтоимостьРегл > 0
	|
	|	) КАК СписокНМА
	|
	|ГДЕ
	|	СписокНМА.НеУказанОбъемНаработки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	АмортизацияНМАЛокализация.ДополнитьТекстЗапросаПроверкаПараметровРасчета(СписокЗапросов, ПараметрыРасчета);
	
КонецПроцедуры

Процедура ТекстЗапросаКоличествоПараметровРасчета(СписокЗапросов, ПараметрыРасчета)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СписокОбъектовУчета.НематериальныйАктив), 0) КАК КоличествоДанных
	|ИЗ
	|	СписокОбъектовУчета КАК СписокОбъектовУчета
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииБезИзмененийУУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СписокНМА.Стоимость КАК Стоимость,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокНМА.Амортизация КАК Амортизация,
	|	СписокНМА.АмортизацияРегл КАК АмортизацияРегл,
	|	СписокНМА.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокНМА.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл КАК ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - (&СуммаАмортизацииУУ)) > СписокНМА.ЛиквидационнаяСтоимость
	|			ТОГДА &СуммаАмортизацииУУ
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - СписокНМА.ЛиквидационнаяСтоимость) > 0
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимость - СписокНМА.ЛиквидационнаяСтоимость)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - (&СуммаАмортизацииБУ)) > СписокНМА.ЛиквидационнаяСтоимостьРегл
	|			ТОГДА &СуммаАмортизацииБУ
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл) > 0
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииБезИзмененийУУ
	|
	|ИЗ
	|	СписокНМАСПараметрами_УУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_УУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|
	|ГДЕ
	|	СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииУУ();
	ПараметрыТекстаЗапроса.ТекстСтоимость = "СписокНМА.Стоимость";
	ПараметрыТекстаЗапроса.ТекстАмортизация = "СписокНМА.Амортизация";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокНМА.ОстаточнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстПервоначальнаяСтоимость = "СписокНМА.ПервоначальнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "0";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "0";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "0";

	ТекстСуммаАмортизацииУУ = ТекстЗапросаСуммаАмортизацииУУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииУУ", ТекстСуммаАмортизацииУУ);
		
	//
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииУУ();
	ПараметрыТекстаЗапроса.ТекстСтоимость = "СписокНМА.СтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстАмортизация = "СписокНМА.АмортизацияРегл";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокНМА.ОстаточнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстПервоначальнаяСтоимость = "СписокНМА.ПервоначальнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "0";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "0";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "0";
	
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииУУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокНМА.АмортизацияРегл КАК АмортизацияРегл,
	|	СписокНМА.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл КАК ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - (&СуммаАмортизацииБУ)) > СписокНМА.ЛиквидационнаяСтоимостьРегл
	|			ТОГДА &СуммаАмортизацииБУ
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл) > 0
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииБезИзмененийБУ_МУ
	|
	|ИЗ
	|	СписокНМАСПараметрами_БУ_МУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_БУ_МУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|
	|ГДЕ
	|	СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииУУ();
	ПараметрыТекстаЗапроса.ТекстСтоимость = "СписокНМА.СтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстАмортизация = "СписокНМА.АмортизацияРегл";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокНМА.ОстаточнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстПервоначальнаяСтоимость = "СписокНМА.ПервоначальнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "0";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "0";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "0";
	
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииУУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииВыборкаИзмененийУУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	&НачалоМесяца КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код КАК НематериальныйАктивКод,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	СписокНМА.ОстаточнаяСтоимость,
	|	СписокНМА.ОстаточнаяСтоимостьРегл,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл,
	|	0 КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	0 КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	0 КАК СтоимостьИзменение,
	|	0 КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	0 КАК Амортизация,
	|	0 КАК АмортизацияРегл,
	|	0 КАК АмортизацияПР,
	|
	|	0 КАК АмортизацияИзменение,
	|	0 КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ КАК КорректировкаСтоимостиУУ,
	|	ЛОЖЬ КАК КорректировкаСтоимостиБУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииУУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииБУ,
	|	НЕОПРЕДЕЛЕНО КАК МетодПереоценки,
	|	ЛОЖЬ КАК ПереоценкаПоСправедливойСтоимости,
	|	ЛОЖЬ КАК ЭтоИзменения
	|ИЗ
	|	ДоначислениеАмортизацииБезИзмененийУУ КАК СписокНМА
	|ГДЕ
	|	СписокНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	СписокНМА.Период,
	|	СписокНМА.Регистратор,
	|	СписокНМА.Организация,
	|	СписокНМА.Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код,
	|	СписокНМА.ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации,
	|
	|	0 КАК СуммаУУ,
	|	0 КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|
	|	1 КАК Коэффициент,
	|
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	СписокНМА.ОстаточнаяСтоимость,
	|	СписокНМА.ОстаточнаяСтоимостьРегл,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл,
	|	0 КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|	0,
	|	0,
	|
	|	СписокНМА.Стоимость КАК Стоимость,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	СписокНМА.СтоимостьИзменение КАК СтоимостьИзменение,
	|	СписокНМА.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	СписокНМА.Амортизация КАК Амортизация,
	|	СписокНМА.АмортизацияРегл КАК АмортизацияРегл,
	|	0 КАК АмортизацияПР,
	|
	|	СписокНМА.АмортизацияИзменение КАК АмортизацияИзменение,
	|	СписокНМА.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаСтоимостиУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаСтоимостиБУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаАмортизацииУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаАмортизацииБУ,
	|
	|	СписокНМА.МетодПереоценки КАК МетодПереоценки,
	|	ЕСТЬNULL(Переоценка.ПереоценкаПоСправедливойСтоимости, ЛОЖЬ) КАК ПереоценкаПоСправедливойСтоимости,
	|
	|	ИСТИНА
	|ИЗ
	|	СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|		ПО Корректировка.Ссылка = СписокНМА.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаНМА2_4 КАК Переоценка
	|		ПО Переоценка.Ссылка = СписокНМА.Регистратор
	|
	|ГДЕ
	|	СписокНМА.ЭтоДоначисление";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	&НачалоМесяца КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код КАК НематериальныйАктивКод,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	0 КАК СуммаУУ,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ОстаточнаяСтоимость,
	|	СписокНМА.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	0 КАК ОстаточнаяСтоимостьПР,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл КАК ЛиквидационнаяСтоимостьРегл,
	|	0 КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	0 КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	0 КАК СтоимостьИзменение,
	|	0 КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	0 КАК Амортизация,
	|	0 КАК АмортизацияРегл,
	|	0 КАК АмортизацияПР,
	|
	|	0 КАК АмортизацияИзменение,
	|	0 КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ КАК КорректировкаСтоимостиУУ,
	|	ЛОЖЬ КАК КорректировкаСтоимостиБУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииУУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииБУ,
	|	НЕОПРЕДЕЛЕНО КАК МетодПереоценки,
	|	ЛОЖЬ КАК ПереоценкаПоСправедливойСтоимости,
	|	ЛОЖЬ КАК ЭтоИзменения
	|
	|ИЗ
	|	ДоначислениеАмортизацииБезИзмененийБУ_МУ КАК СписокНМА
	|
	|ГДЕ
	|	СписокНМА.НематериальныйАктив В
	|		(ВЫБРАТЬ
	|			СписокНМА.НематериальныйАктив
	|		ИЗ
	|			СписокНМАСИзмененнымиПараметрами_БУ_МУ КАК СписокНМА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Регистратор КАК Регистратор,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(СписокНМА.НематериальныйАктив КАК Справочник.НематериальныеАктивы).Код КАК НематериальныйАктивКод,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	0 КАК СуммаУУ,
	|	0 КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ОстаточнаяСтоимость,
	|	СписокНМА.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	0 КАК ОстаточнаяСтоимостьПР,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл КАК ЛиквидационнаяСтоимостьРегл,
	|	0 КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	0 КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	0 КАК Стоимость,
	|	СписокНМА.СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	0 КАК СтоимостьИзменение,
	|	СписокНМА.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	0 КАК Амортизация,
	|	СписокНМА.АмортизацияРегл,
	|	0 КАК АмортизацияПР,
	|
	|	0 КАК АмортизацияИзменение,
	|	СписокНМА.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаСтоимостиУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаСтоимостиБУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаАмортизацииУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаАмортизацииБУ,
	|
	|	СписокНМА.МетодПереоценки КАК МетодПереоценки,
	|	ЕСТЬNULL(Переоценка.ПереоценкаПоСправедливойСтоимости, ЛОЖЬ) КАК ПереоценкаПоСправедливойСтоимости,
	|
	|	ИСТИНА КАК ЭтоИзменения
	|
	|ИЗ
	|	СписокНМАСИзмененнымиПараметрами_БУ_МУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|		ПО Корректировка.Ссылка = СписокНМА.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаНМА2_4 КАК Переоценка
	|		ПО Переоценка.Ссылка = СписокНМА.Регистратор
	|
	|ГДЕ
	|	СписокНМА.ЭтоДоначисление";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииУУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокНМА.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииСУчетомИзмененийУУ
	|
	|ИЗ
	|	&АмортизацияИзменений_УУ КАК СписокНМА
	|
	|ГДЕ
	|	СписокНМА.ЭтоИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Амортизация.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	Амортизация.ПериодРасчета КАК ПериодРасчета,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|	Амортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Амортизация.Подразделение КАК Подразделение,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.СтатьяРасходов, Амортизация.СтатьяРасходов) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.АналитикаРасходов, Амортизация.АналитикаРасходов) КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|			ТОГДА Амортизация.НаправлениеДеятельности
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.НаправлениеДеятельности, Амортизация.НаправлениеДеятельностиРасходов) 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	Амортизация.СпособОтраженияАмортизации,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ПередаватьРасходыВДругуюОрганизацию, Амортизация.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	Амортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	Амортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|			ТОГДА &РаспределениеСуммыУУ
	|		ИНАЧЕ Амортизация.СуммаУУ
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|			ТОГДА &РаспределениеСуммыБУ
	|		ИНАЧЕ Амортизация.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииУУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаУУ КАК СуммаУУ,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл
	|	ИЗ
	|		ДоначислениеАмортизацииБезИзмененийУУ КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаУУ КАК СуммаУУ,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл
	|	ИЗ
	|		ДоначислениеАмортизацииСУчетомИзмененийУУ КАК СписокНМА
	|
	|	) КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизации КАК СпособыОтраженияАмортизации
	|		ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = Амортизация.СпособОтраженияАмортизации)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыУУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаУУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаБУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииБУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииСУчетомИзмененийБУ_МУ
	|
	|ИЗ
	|	&АмортизацияИзменений_БУ_МУ КАК СписокНМА
	|
	|ГДЕ
	|	СписокНМА.ЭтоИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Амортизация.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	Амортизация.ПериодРасчета КАК ПериодРасчета,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|	Амортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Амортизация.Подразделение КАК Подразделение,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.СтатьяРасходов, Амортизация.СтатьяРасходов) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.АналитикаРасходов, Амортизация.АналитикаРасходов) КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|			ТОГДА Амортизация.НаправлениеДеятельности
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.НаправлениеДеятельности, Амортизация.НаправлениеДеятельностиРасходов) 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	Амортизация.СпособОтраженияАмортизации,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ПередаватьРасходыВДругуюОрганизацию, Амортизация.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	Амортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|			ТОГДА &РаспределениеСуммыБУ
	|		ИНАЧЕ Амортизация.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииБУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл
	|	ИЗ
	|		ДоначислениеАмортизацииБезИзмененийБУ_МУ КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл
	|	ИЗ
	|		ДоначислениеАмортизацииСУчетомИзмененийБУ_МУ КАК СписокНМА
	|
	|	) КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизации КАК СпособыОтраженияАмортизации
	|		ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = Амортизация.СпособОтраженияАмортизации)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаБУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииУУ_Сгруппированная(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СУММА(СписокНМА.СуммаУУ) КАК СуммаУУ,
	|	СУММА(СписокНМА.СуммаБУ) КАК СуммаБУ
	|ПОМЕСТИТЬ ДоначислениеАмортизацииУУ_Сгруппированная
	|ИЗ
	|	ДоначислениеАмортизацииУУ КАК СписокНМА
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНМА.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииБУ_Сгруппированная(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СУММА(СписокНМА.СуммаБУ) КАК СуммаБУ
	|ПОМЕСТИТЬ ДоначислениеАмортизацииБУ_МУ_Сгруппированная
	|ИЗ
	|	ДоначислениеАмортизацииБУ_МУ КАК СписокНМА
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНМА.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизацииБезИзмененийУУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СписокНМА.Стоимость КАК Стоимость,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокНМА.Амортизация КАК Амортизация,
	|	СписокНМА.АмортизацияРегл КАК АмортизацияРегл,
	|	СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) КАК ОстаточнаяСтоимость,
	|	СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) КАК ОстаточнаяСтоимостьРегл,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			ТОГДА СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0)
	|		ИНАЧЕ СписокНМА.СтоимостьДляВычисленияАмортизации
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	|	ВЫБОР
	|		КОГДА СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			ТОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0)
	|		ИНАЧЕ СписокНМА.СтоимостьДляВычисленияАмортизацииРегл
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	СписокНМА.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл КАК ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокНМА.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	СписокНМА.ПорядокНачисленияАмортизацииУУ КАК ПорядокНачисленияАмортизацииУУ,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА &ОбесценениеУУ > СписокНМА.ОстатокОбесцененияУпр
	|				ИЛИ СписокНМА.ОстатокОбесцененияУпр - &ОбесценениеУУ < &МинимальнаяОстаточнаяСтоимостьУпр
	|			ТОГДА СписокНМА.ОстатокОбесцененияУпр
	|
	|		ИНАЧЕ &ОбесценениеУУ
	|	КОНЕЦ КАК ОбесценениеУУ,
	|
	|	ВЫБОР
	|		КОГДА &ОбесценениеБУ > СписокНМА.ОстатокОбесцененияРегл
	|				ИЛИ СписокНМА.ОстатокОбесцененияРегл - &ОбесценениеБУ < &МинимальнаяОстаточнаяСтоимостьРегл
	|			ТОГДА СписокНМА.ОстатокОбесцененияРегл
	|
	|		ИНАЧЕ &ОбесценениеБУ
	|	КОНЕЦ КАК ОбесценениеБУ,
	|
	|	ВЫБОР 
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - (&СуммаАмортизацииУУ) - (&ОбесценениеУУ)) > СписокНМА.ЛиквидационнаяСтоимость
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - (&СуммаАмортизацииУУ) - (&ОбесценениеУУ) - СписокНМА.ЛиквидационнаяСтоимость < &МинимальнаяОстаточнаяСтоимостьУпр
	|
	|						ТОГДА СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - (&ОбесценениеУУ) - СписокНМА.ЛиквидационнаяСтоимость
	|
	|					ИНАЧЕ &СуммаАмортизацииУУ
	|				КОНЕЦ
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - (&СуммаАмортизацииУУ)) > СписокНМА.ЛиквидационнаяСтоимость
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА <> &ДоначислятьКорректировкуОбесценения
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - (&СуммаАмортизацииУУ) - СписокНМА.ЛиквидационнаяСтоимость < &МинимальнаяОстаточнаяСтоимостьУпр
	|
	|						ТОГДА СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - СписокНМА.ЛиквидационнаяСтоимость
	|
	|					ИНАЧЕ &СуммаАмортизацииУУ
	|				КОНЕЦ
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - СписокНМА.ОстатокОбесцененияУпр - СписокНМА.ЛиквидационнаяСтоимость) > 0
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - СписокНМА.ОстатокОбесцененияУпр - СписокНМА.ЛиквидационнаяСтоимость)
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - СписокНМА.ЛиквидационнаяСтоимость) > 0
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА <> &ДоначислятьКорректировкуОбесценения
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимость - ЕСТЬNULL(Доначисление.СуммаУУ, 0) - СписокНМА.ЛиквидационнаяСтоимость)
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР 
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ) - (&ОбесценениеБУ)) > СписокНМА.ЛиквидационнаяСтоимостьРегл
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ) - (&ОбесценениеБУ) - СписокНМА.ЛиквидационнаяСтоимостьРегл < &МинимальнаяОстаточнаяСтоимостьРегл
	|
	|						ТОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&ОбесценениеБУ) - СписокНМА.ЛиквидационнаяСтоимостьРегл
	|
	|					ИНАЧЕ &СуммаАмортизацииБУ
	|				КОНЕЦ
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ)) > СписокНМА.ЛиквидационнаяСтоимостьРегл
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА <> &ДоначислятьКорректировкуОбесценения
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ) - СписокНМА.ЛиквидационнаяСтоимостьРегл < &МинимальнаяОстаточнаяСтоимостьРегл
	|
	|						ТОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ЛиквидационнаяСтоимостьРегл
	|
	|					ИНАЧЕ &СуммаАмортизацииБУ
	|				КОНЕЦ
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ОстатокОбесцененияРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл) > 0
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ОстатокОбесцененияРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл)
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ЛиквидационнаяСтоимостьРегл) > 0
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА <> &ДоначислятьКорректировкуОбесценения
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ЛиквидационнаяСтоимостьРегл)
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ РасчетАмортизацииБезИзмененийУУ
	|
	|ИЗ
	|	СписокНМАСПараметрами_УУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииУУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_УУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|			И ПроверкаПараметровРасчета.Организация = СписокНМА.Организация
	|ГДЕ
	|	НЕ СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииУУ();
	ПараметрыТекстаЗапроса.ТекстСтоимость = "СписокНМА.Стоимость";
	ПараметрыТекстаЗапроса.ТекстАмортизация = "СписокНМА.Амортизация";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокНМА.ОстаточнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстПервоначальнаяСтоимость = "СписокНМА.ПервоначальнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "СписокНМА.ЛиквидационнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "СписокНМА.ОстатокОбесцененияУпр";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "ЕСТЬNULL(Доначисление.СуммаУУ, 0)";

	ТекстСуммаАмортизацииУУ = ТекстЗапросаСуммаАмортизацииУУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииУУ", ТекстСуммаАмортизацииУУ);
	
	//
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииУУ();
	ПараметрыТекстаЗапроса.ТекстСтоимость = "СписокНМА.СтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстАмортизация = "СписокНМА.АмортизацияРегл";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокНМА.ОстаточнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстПервоначальнаяСтоимость = "СписокНМА.ПервоначальнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "СписокНМА.ЛиквидационнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "СписокНМА.ОстатокОбесцененияРегл";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "ЕСТЬNULL(Доначисление.СуммаБУ, 0)";
	
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииУУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);
	
	//
	ТекстОбесценениеУУ = ТекстЗапросаСуммаОбесценения("СписокНМА.ОстатокОбесцененияУпр");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеУУ", ТекстОбесценениеУУ);
	
	//
	ТекстОбесценениеБУ = ТекстЗапросаСуммаОбесценения("СписокНМА.ОстатокОбесцененияРегл");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеБУ", ТекстОбесценениеБУ);
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Период КАК Период,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокНМА.АмортизацияРегл КАК АмортизацияРегл,
	|	СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) КАК ОстаточнаяСтоимостьРегл,
	|	СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл КАК ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокНМА.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	СписокНМА.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА &ОбесценениеБУ > СписокНМА.ОстатокОбесцененияРегл
	|				ИЛИ СписокНМА.ОстатокОбесцененияРегл - &ОбесценениеБУ < &МинимальнаяОстаточнаяСтоимостьРегл
	|			ТОГДА СписокНМА.ОстатокОбесцененияРегл
	|
	|		ИНАЧЕ &ОбесценениеБУ
	|	КОНЕЦ КАК ОбесценениеБУ,
	|
	|	ВЫБОР 
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ) - (&ОбесценениеБУ)) > СписокНМА.ЛиквидационнаяСтоимостьРегл
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ) - (&ОбесценениеБУ) - СписокНМА.ЛиквидационнаяСтоимостьРегл < &МинимальнаяОстаточнаяСтоимостьРегл
	|
	|						ТОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&ОбесценениеБУ) - СписокНМА.ЛиквидационнаяСтоимостьРегл
	|
	|					ИНАЧЕ &СуммаАмортизацииБУ
	|				КОНЕЦ
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ)) > СписокНМА.ЛиквидационнаяСтоимостьРегл
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА <> &ДоначислятьКорректировкуОбесценения
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ) - СписокНМА.ЛиквидационнаяСтоимостьРегл < &МинимальнаяОстаточнаяСтоимостьРегл
	|
	|						ТОГДА СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ЛиквидационнаяСтоимостьРегл
	|
	|					ИНАЧЕ &СуммаАмортизацииБУ
	|				КОНЕЦ
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ОстатокОбесцененияРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл) > 0
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ОстатокОбесцененияРегл - СписокНМА.ЛиквидационнаяСтоимостьРегл)
	|
	|		КОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ЛиквидационнаяСтоимостьРегл) > 0
	|				И СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|			ТОГДА (СписокНМА.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокНМА.ЛиквидационнаяСтоимостьРегл)
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ РасчетАмортизацииБезИзмененийБУ_МУ
	|
	|ИЗ
	|	СписокНМАСПараметрами_БУ_МУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииБУ_МУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_БУ_МУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|			И ПроверкаПараметровРасчета.Организация = СписокНМА.Организация
	|ГДЕ
	|	НЕ СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииУУ();
	ПараметрыТекстаЗапроса.ТекстСтоимость = "СписокНМА.СтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстАмортизация = "СписокНМА.АмортизацияРегл";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокНМА.ОстаточнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстПервоначальнаяСтоимость = "СписокНМА.ПервоначальнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "СписокНМА.ЛиквидационнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "СписокНМА.ОстатокОбесцененияРегл";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "ЕСТЬNULL(Доначисление.СуммаБУ, 0)";
	
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииУУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);
	
	//
	ТекстОбесценениеБУ = ТекстЗапросаСуммаОбесценения("СписокНМА.ОстатокОбесцененияРегл");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеБУ", ТекстОбесценениеБУ);
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизацииВыборкаИзмененийУУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	&НачалоМесяца КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокНМА.СуммаУУ КАК СуммаУУ,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|	СписокНМА.ОбесценениеУУ КАК ОбесценениеУУ,
	|	СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|
	|	СписокНМА.Стоимость КАК Стоимость,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокНМА.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|
	|	0 КАК СтоимостьИзменение,
	|	0 КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	0 КАК АмортизацияИзменение,
	|	0 КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(СписокНМА.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокНМА.Амортизация + ЕСТЬNULL(Доначисление.СуммаУУ, 0) 
	|		ИНАЧЕ СписокНМА.Амортизация
	|	КОНЕЦ КАК Амортизация,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(СписокНМА.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокНМА.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0) 
	|		ИНАЧЕ СписокНМА.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	0 КАК АмортизацияПР,
	|
	|	СписокНМА.Стоимость - СписокНМА.Амортизация КАК СтоимостьДляВычисленияАмортизации,
	|	СписокНМА.СтоимостьРегл - СписокНМА.АмортизацияРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ КАК КорректировкаСтоимостиУУ,
	|	ЛОЖЬ КАК КорректировкаСтоимостиБУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииУУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииБУ,
	|	НЕОПРЕДЕЛЕНО КАК МетодПереоценки,
	|	ЛОЖЬ КАК ПереоценкаПоСправедливойСтоимости,
	|	ЛОЖЬ КАК ЭтоИзменения
	|ИЗ
	|	РасчетАмортизацииБезИзмененийУУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииУУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|
	|ГДЕ
	|	СписокНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	СписокНМА.Период,
	|	СписокНМА.Регистратор,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Организация,
	|	СписокНМА.Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации,
	|
	|	0 КАК СуммаУУ,
	|	0 КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|
	|	1 КАК Коэффициент,
	|
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	СписокНМА.ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|
	|	СписокНМА.Стоимость КАК Стоимость,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокНМА.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|
	|	СписокНМА.СтоимостьИзменение КАК СтоимостьИзменение,
	|	СписокНМА.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	СписокНМА.АмортизацияИзменение КАК АмортизацияИзменение,
	|	СписокНМА.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(СписокНМА.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокНМА.Амортизация + ЕСТЬNULL(Доначисление.СуммаУУ, 0) 
	|		ИНАЧЕ СписокНМА.Амортизация
	|	КОНЕЦ КАК Амортизация,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(СписокНМА.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокНМА.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0) 
	|		ИНАЧЕ СписокНМА.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	0 КАК АмортизацияПР,
	|
	|	СписокНМА.Стоимость - СписокНМА.Амортизация КАК СтоимостьДляВычисленияАмортизации,
	|	СписокНМА.СтоимостьРегл - СписокНМА.АмортизацияРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаСтоимостиУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаСтоимостиБУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаАмортизацииУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаАмортизацииБУ,
	|
	|	СписокНМА.МетодПереоценки КАК МетодПереоценки,
	|	ЕСТЬNULL(Переоценка.ПереоценкаПоСправедливойСтоимости, ЛОЖЬ) КАК ПереоценкаПоСправедливойСтоимости,
	|
	|	ИСТИНА
	|ИЗ
	|	СписокНМАСИзмененнымиПараметрами_УУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииУУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчетаИзменения_УУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|			И ПроверкаПараметровРасчета.Организация = СписокНМА.Организация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|		ПО Корректировка.Ссылка = СписокНМА.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаНМА2_4 КАК Переоценка
	|		ПО Переоценка.Ссылка = СписокНМА.Регистратор
	|
	|ГДЕ
	|	НЕ СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	&НачалоМесяца КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Организация КАК Организация,
	|	СписокНМА.Подразделение КАК Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	0 КАК СуммаУУ,
	|	СписокНМА.СуммаБУ КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|	0 КАК ОбесценениеУУ,
	|	СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|
	|	0 КАК Стоимость,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|
	|	0 КАК СтоимостьИзменение,
	|	0 КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	0 КАК АмортизацияИзменение,
	|	0 КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	0 КАК Амортизация,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(СписокНМА.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокНМА.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0) 
	|		ИНАЧЕ СписокНМА.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	0 КАК АмортизацияПР,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	СписокНМА.СтоимостьРегл - СписокНМА.АмортизацияРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ КАК КорректировкаСтоимостиУУ,
	|	ЛОЖЬ КАК КорректировкаСтоимостиБУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииУУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииБУ,
	|	НЕОПРЕДЕЛЕНО КАК МетодПереоценки,
	|	ЛОЖЬ КАК ПереоценкаПоСправедливойСтоимости,
	|	ЛОЖЬ КАК ЭтоИзменения
	|ИЗ
	|	РасчетАмортизацииБезИзмененийБУ_МУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииБУ_МУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|
	|ГДЕ
	|	СписокНМА.НематериальныйАктив В
	|			(ВЫБРАТЬ
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				СписокНМАСИзмененнымиПараметрами_БУ_МУ КАК СписокНМА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	СписокНМА.Период,
	|	СписокНМА.Регистратор,
	|	СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	СписокНМА.Организация,
	|	СписокНМА.Подразделение,
	|	СписокНМА.ГруппаФинансовогоУчета,
	|	СписокНМА.НаправлениеДеятельности,
	|	СписокНМА.НематериальныйАктив,
	|	СписокНМА.СтатьяРасходов,
	|	СписокНМА.АналитикаРасходов,
	|	СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокНМА.СпособОтраженияАмортизации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	1,
	|	СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|	СписокНМА.ОрганизацияПолучательРасходов,
	|	СписокНМА.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокНМА.РесурсВыработанныйЗаТекущийПериод,
	|	СписокНМА.РесурсНазначенный,
	|	СписокНМА.МетодНачисленияАмортизации,
	|	0,
	|	СписокНМА.ЛиквидационнаяСтоимостьРегл,
	|	СписокНМА.КоэффициентУскорения,
	|	СписокНМА.ОтработанныхМесяцевПолныхЛет,
	|	СписокНМА.НачислятьАмортизацию,
	|
	|	0 КАК Стоимость,
	|	СписокНМА.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьПР,
	|
	|	СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|
	|	0 КАК СтоимостьИзменение,
	|	СписокНМА.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|
	|	0 КАК АмортизацияИзменение,
	|	СписокНМА.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|
	|	0 КАК Амортизация,
	|
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(СписокНМА.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокНМА.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0) 
	|		ИНАЧЕ СписокНМА.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	0 КАК АмортизацияПР,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	СписокНМА.СтоимостьРегл - СписокНМА.АмортизацияРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	СписокНМА.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаСтоимостиУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаСтоимостиБУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаАмортизацииУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВРеглУчете, ЛОЖЬ) КАК КорректировкаАмортизацииБУ,
	|
	|	СписокНМА.МетодПереоценки КАК МетодПереоценки,
	|	ЕСТЬNULL(Переоценка.ПереоценкаПоСправедливойСтоимости, ЛОЖЬ) КАК ПереоценкаПоСправедливойСтоимости,
	|
	|	ИСТИНА
	|
	|ИЗ
	|	СписокНМАСИзмененнымиПараметрами_БУ_МУ КАК СписокНМА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииБУ_МУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.НематериальныйАктив = СписокНМА.НематериальныйАктив
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчетаИзменения_БУ_МУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокНМА.НематериальныйАктив
	|			И ПроверкаПараметровРасчета.Организация = СписокНМА.Организация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииНМА КАК Корректировка
	|		ПО Корректировка.Ссылка = СписокНМА.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаНМА2_4 КАК Переоценка
	|		ПО Переоценка.Ссылка = СписокНМА.Регистратор
	|
	|ГДЕ
	|	НЕ СписокНМА.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_УУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Амортизация.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	Амортизация.ПериодРасчета КАК ПериодРасчета,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.Подразделение КАК Подразделение,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|	ОбесценениеВНА.ЕГДС КАК ЕГДС,
	|	Амортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияАмортизации.СтатьяРасходов
	|		ИНАЧЕ Амортизация.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходов,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияАмортизации.АналитикаРасходов
	|		ИНАЧЕ Амортизация.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаРасходов,
	|
	|	Амортизация.СпособОтраженияАмортизации,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) 
	|	КОНЕЦ КАК КорПодразделение,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|			ТОГДА Амортизация.НаправлениеДеятельности
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.НаправлениеДеятельности, Амортизация.НаправлениеДеятельностиРасходов) 
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.ПередаватьРасходыВДругуюОрганизацию
	|				И СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов <> Амортизация.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Амортизация.ПередаватьРасходыВДругуюОрганизацию
	|	КОНЕЦ КАК ПередаватьРасходыВДругуюОрганизацию,
	|
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	Амортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	Амортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	Амортизация.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	Амортизация.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|
	|	Амортизация.ПорядокНачисленияАмортизацииУУ КАК ПорядокНачисленияАмортизацииУУ,
	|	Амортизация.ЭтоДоначисление КАК ЭтоДоначисление,
	|	ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК ПорядокУчетаВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНАРегл, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)) КАК ПорядокУчетаВНАРегл,
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &РаспределениеСуммыУУ
	|		ИНАЧЕ Амортизация.СуммаУУ
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &РаспределениеСуммыБУ
	|		ИНАЧЕ Амортизация.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &РаспределениеОбесцененияУУ
	|		ИНАЧЕ Амортизация.ОбесценениеУУ
	|	КОНЕЦ КАК ОбесценениеУУ,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &РаспределениеОбесцененияБУ
	|		ИНАЧЕ Амортизация.ОбесценениеБУ
	|	КОНЕЦ КАК ОбесценениеБУ
	|
	|ПОМЕСТИТЬ РасчетАмортизации_УУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		ВЫРАЗИТЬ(СписокНМА.Организация КАК Справочник.Организации).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаУУ КАК СуммаУУ,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		СписокНМА.ОбесценениеУУ КАК ОбесценениеУУ,
	|		СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		СписокНМА.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|		СписокНМА.ПорядокНачисленияАмортизацииУУ КАК ПорядокНачисленияАмортизацииУУ,
	|		ЛОЖЬ КАК ЭтоДоначисление
	|	ИЗ
	|		РасчетАмортизацииБезИзмененийУУ КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период,
	|		СписокНМА.Организация,
	|		ВЫРАЗИТЬ(СписокНМА.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
	|		СписокНМА.Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации,
	|		СписокНМА.СуммаУУ,
	|		СписокНМА.СуммаБУ,
	|		СписокНМА.ОбесценениеУУ КАК ОбесценениеУУ,
	|		СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		СписокНМА.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|		ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК ПорядокНачисленияАмортизацииБУ,
	|		ЛОЖЬ КАК ЭтоДоначисление
	|	ИЗ
	|		РасчетАмортизацииСУчетомИзмененийУУ КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.ПериодРасчета КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		ВЫРАЗИТЬ(СписокНМА.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаУУ КАК СуммаУУ,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		0 КАК ОбесценениеУУ,
	|		0 КАК ОбесценениеБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		0 КАК ОстатокОбесцененияРегл,
	|		0 КАК ОстатокОбесцененияУпр,
	|		ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК ПорядокНачисленияАмортизацииБУ,
	|		ИСТИНА КАК ЭтоДоначисление
	|	ИЗ
	|		ДоначислениеАмортизацииУУ КАК СписокНМА
	|
	|	) КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизации КАК СпособыОтраженияАмортизации
	|		ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = Амортизация.СпособОтраженияАмортизации)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = Амортизация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеВНА
	|		ПО ОбесценениеВНА.НематериальныйАктив = Амортизация.НематериальныйАктив";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыУУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаУУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаБУ"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеОбесцененияУУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.ОбесценениеУУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеОбесцененияБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.ОбесценениеБУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизации_БУ_МУ(СписокЗапросов, ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Амортизация.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|	Амортизация.ПериодРасчета КАК ПериодРасчета,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.Подразделение КАК Подразделение,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|	ОбесценениеВНА.ЕГДС КАК ЕГДС,
	|	Амортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияАмортизации.СтатьяРасходов
	|		ИНАЧЕ Амортизация.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходов,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияАмортизации.АналитикаРасходов
	|		ИНАЧЕ Амортизация.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) 
	|	КОНЕЦ КАК КорПодразделение,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|			ТОГДА Амортизация.НаправлениеДеятельности
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.НаправлениеДеятельности, Амортизация.НаправлениеДеятельностиРасходов) 
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|
	|	Амортизация.СпособОтраженияАмортизации,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.ПередаватьРасходыВДругуюОрганизацию
	|				И СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов <> Амортизация.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Амортизация.ПередаватьРасходыВДругуюОрганизацию
	|	КОНЕЦ КАК ПередаватьРасходыВДругуюОрганизацию,
	|
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	Амортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	Амортизация.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|
	|	Амортизация.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	Амортизация.ЭтоДоначисление КАК ЭтоДоначисление,
	|	ЕСТЬNULL(УчетнаяПолитика.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК ПорядокУчетаВНА,
	|	ЕСТЬNULL(УчетнаяПолитика.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &РаспределениеСуммыБУ
	|		ИНАЧЕ Амортизация.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &РаспределениеОбесцененияБУ
	|		ИНАЧЕ Амортизация.ОбесценениеБУ
	|	КОНЕЦ КАК ОбесценениеБУ
	|
	|ПОМЕСТИТЬ РасчетАмортизации_БУ_МУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		ВЫРАЗИТЬ(СписокНМА.Организация КАК Справочник.Организации).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		СписокНМА.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|		ЛОЖЬ КАК ЭтоДоначисление
	|	ИЗ
	|		РасчетАмортизацииБезИзмененийБУ_МУ КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.Период,
	|		СписокНМА.Организация,
	|		ВЫРАЗИТЬ(СписокНМА.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
	|		СписокНМА.Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации,
	|		СписокНМА.СуммаБУ,
	|		СписокНМА.ОбесценениеБУ КАК ОбесценениеБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		СписокНМА.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК ПорядокНачисленияАмортизацииБУ,
	|		ЛОЖЬ КАК ЭтоДоначисление
	|	ИЗ
	|		РасчетАмортизацииСУчетомИзмененийБУ_МУ КАК СписокНМА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокНМА.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		СписокНМА.ПериодРасчета КАК ПериодРасчета,
	|		СписокНМА.Организация КАК Организация,
	|		ВЫРАЗИТЬ(СписокНМА.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
	|		СписокНМА.Подразделение КАК Подразделение,
	|		СписокНМА.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокНМА.НематериальныйАктив КАК НематериальныйАктив,
	|		СписокНМА.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокНМА.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокНМА.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокНМА.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокНМА.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокНМА.СуммаБУ КАК СуммаБУ,
	|		0 КАК ОбесценениеБУ,
	|		СписокНМА.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокНМА.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокНМА.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		0 КАК ОстатокОбесцененияРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК ПорядокНачисленияАмортизацииБУ,
	|		ИСТИНА КАК ЭтоДоначисление
	|	ИЗ
	|		ДоначислениеАмортизацииБУ_МУ КАК СписокНМА
	|
	|	) КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизации КАК СпособыОтраженияАмортизации
	|		ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = Амортизация.СпособОтраженияАмортизации)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = Амортизация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеВНА
	|		ПО ОбесценениеВНА.НематериальныйАктив = Амортизация.НематериальныйАктив";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеСуммыБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаБУ"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РаспределениеОбесцененияБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.ОбесценениеБУ"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаНачисленнаяАмортизация(СписокЗапросов, ПараметрыРасчета)

	СписокПодзапросов = Новый Массив;
	
	ТекстПодзапроса =  
	"	ВЫБРАТЬ
	|		РасчетАмортизации.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		РасчетАмортизации.ПериодРасчета КАК ПериодРасчета,
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.Подразделение КАК Подразделение,
	|		РасчетАмортизации.КорПодразделение КАК КорПодразделение,
	|		РасчетАмортизации.НематериальныйАктив КАК НематериальныйАктив,
	|		РасчетАмортизации.ЕГДС КАК ЕГДС,
	|		РасчетАмортизации.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		РасчетАмортизации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		РасчетАмортизации.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|		РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
	|		РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|
	|		РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|
	|		РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.СтоимостьДляВычисленияАмортизацииРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|		РасчетАмортизации.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		РасчетАмортизации.ОстатокОбесцененияУпр КАК ОстатокОбесцененияУпр,
	|
	|		РасчетАмортизации.ЭтоДоначисление КАК ЭтоДоначисление,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.ЭтоДоначисление
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоДоначислениеБУ,
	|
	|		РасчетАмортизации.ПорядокУчетаВНА КАК ПорядокУчетаУУ,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.ПорядокУчетаВНА
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ПорядокУчетаБУ,
	|
	|		РасчетАмортизации.ПорядокНачисленияАмортизацииУУ КАК ПорядокНачисленияАмортизацииУУ,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.ПорядокНачисленияАмортизацииУУ
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ПорядокНачисленияАмортизацииБУ,
	|
	|		РасчетАмортизации.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|		РасчетАмортизации.СуммаУУ КАК СуммаУУ,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.СуммаБУ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаБУ,
	|
	|		0 КАК СуммаНУ,
	|		0 КАК СуммаПР,
	|		0 КАК СуммаВР,
	|		0 КАК СуммаЦФ,
	|		0 КАК СуммаНУЦФ,
	|		0 КАК СуммаПРЦФ,
	|		0 КАК СуммаВРЦФ,
	|
	|		РасчетАмортизации.ОбесценениеУУ КАК ОбесценениеУУ,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.ПорядокУчетаВНАРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНАРегл.СовпадаетСУпрУчетом)
	|				ТОГДА РасчетАмортизации.ОбесценениеБУ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОбесценениеБУ,
	|		
	|		0 КАК ОбесценениеЦФ
	|
	|	ИЗ
	|		РасчетАмортизации_УУ КАК РасчетАмортизации
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РасчетАмортизации.ВидОбъектаУчета КАК ВидОбъектаУчета,
	|		РасчетАмортизации.ПериодРасчета КАК ПериодРасчета,
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.Подразделение КАК Подразделение,
	|		РасчетАмортизации.КорПодразделение КАК КорПодразделение,
	|		РасчетАмортизации.НематериальныйАктив КАК НематериальныйАктив,
	|		РасчетАмортизации.ЕГДС КАК ЕГДС,
	|		РасчетАмортизации.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		РасчетАмортизации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		РасчетАмортизации.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|		РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
	|		РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		0 КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		0 КАК РесурсВыработанныйЗаТекущийПериод,
	|		РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|		РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|		0 КАК СтоимостьДляВычисленияАмортизации,
	|		РасчетАмортизации.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		РасчетАмортизации.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		0 КАК ОстатокОбесцененияУпр,
	|		ЛОЖЬ КАК ЭтоДоначисление,
	|		РасчетАмортизации.ЭтоДоначисление КАК ЭтоДоначислениеБУ,
	|		НЕОПРЕДЕЛЕНО КАК ПорядокУчетаУУ,
	|		РасчетАмортизации.ПорядокУчетаВНА КАК ПорядокУчетаБУ,
	|		НЕОПРЕДЕЛЕНО КАК ПорядокНачисленияАмортизацииУУ,
	|		РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|		РасчетАмортизации.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|		0 КАК СуммаУУ,
	|
	|		РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|
	|		0 КАК СуммаНУ,
	|		0 КАК СуммаПР,
	|		0 КАК СуммаВР,
	|		0 КАК СуммаЦФ,
	|		0 КАК СуммаНУЦФ,
	|		0 КАК СуммаПРЦФ,
	|		0 КАК СуммаВРЦФ,
	|
	|		0 КАК ОбесценениеУУ,
	|
	|		ВЫБОР 
	|			КОГДА НЕ &ВедетсяРегламентированныйУчетВНА
	|				ТОГДА РасчетАмортизации.ОбесценениеБУ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОбесценениеБУ,
	|		
	|		0 КАК ОбесценениеЦФ
	|
	|	ИЗ
	|		РасчетАмортизации_БУ_МУ КАК РасчетАмортизации";
	СписокПодзапросов.Добавить(ТекстПодзапроса);
	
	АмортизацияНМАЛокализация.ДополнитьТекстПодзапросаНачисленнаяАмортизация(СписокПодзапросов, ПараметрыРасчета);
	
	ТекстПодзапроса = СтрСоединить(СписокПодзапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстЗапросаВтНачисленнаяАмортизация(СписокЗапросов, ТекстПодзапроса);
	
КонецПроцедуры

Функция ТекстЗапросаКоличествоОбработанныхДанных(ПараметрыРасчета)

	ТекстЗапроса = АмортизацияНМАЛокализация.ТекстЗапросаКоличествоОбработанныхДанных(ПараметрыРасчета); 
	
	Если ТекстЗапроса = Неопределено Тогда
		
		ТекстЗапроса =  
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РасчетАмортизации.НематериальныйАктив), 0) КАК КоличествоДанных
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетАмортизации.НематериальныйАктив КАК НематериальныйАктив
		|	ИЗ
		|		РасчетАмортизации_УУ КАК РасчетАмортизации
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетАмортизации.НематериальныйАктив
		|	ИЗ
		|		РасчетАмортизации_БУ_МУ КАК РасчетАмортизации) КАК РасчетАмортизации";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Параметры:
//  ПараметрыТекстаЗапроса - см. ПараметрыТекстаЗапросаСуммаАмортизацииУУ
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаСуммаАмортизацииУУ(ПараметрыТекстаЗапроса)
	
	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокНМА.НачислятьАмортизацию 
	|			ИЛИ (&ОстаточнаяСтоимость - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения) <= 0
	|				И СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			ИЛИ &ОстаточнаяСтоимость <= 0
	|				И НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			ИЛИ СписокНМА.РесурсВыработанныйЗаТекущийПериод <= 0 
	|
	|		ТОГДА 0
	|
	|	КОГДА СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|				И (СписокНМА.РесурсВыработанныйЗаПрошлыйПериод + СписокНМА.РесурсВыработанныйЗаТекущийПериод) >= СписокНМА.РесурсНазначенный
	|
	|		ТОГДА &ОстаточнаяСтоимость - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения
	|
		// Линейный, ПропорциональноОбъемуПродукции
	|	КОГДА СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокНМА.МетодНачисленияАмортизации В (
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Линейный),
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции))
	|	 
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокНМА.ЭтоДоначисление
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ОстаточнаяСтоимость - &СуммаДоначисления КАК ЧИСЛО(20,8))
	|								* ВЫРАЗИТЬ(СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|								/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	| 
	|			ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ОстаточнаяСтоимость - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения КАК ЧИСЛО(20,8)) 
	|							* ВЫРАЗИТЬ(СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|							/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|
		// УменьшаемогоОстатка (последний год)
	|	КОГДА СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка)
	|			И (СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод - СписокНМА.РесурсВыработанныйЗаТекущийПериод) <= 12
	| 
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокНМА.ЭтоДоначисление
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ОстаточнаяСтоимость - &СуммаДоначисления КАК ЧИСЛО(20,8))
	|								* ВЫРАЗИТЬ(СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|								/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	| 
	|			ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ОстаточнаяСтоимость - &СуммаДоначисления - &ЛиквидационнаяСтоимость КАК ЧИСЛО(20,8)) 
	|							* ВЫРАЗИТЬ(СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|							/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|
		// УменьшаемогоОстатка (до последнего года)
	|	КОГДА СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка) 
	|   
	|		ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ОстаточнаяСтоимость - &СуммаДоначисления КАК ЧИСЛО(20,8))
	|				* ВЫРАЗИТЬ(СписокНМА.КоэффициентУскорения КАК ЧИСЛО(20,8))
	|				* ВЫРАЗИТЬ(СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|				/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный
	|					- СписокНМА.КоэффициентУскорения 
	|						* (СписокНМА.РесурсВыработанныйЗаПрошлыйПериод - СписокНМА.ОтработанныхМесяцевПолныхЛет) КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|
		// Линейный
	|	КОГДА НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Линейный) 
	|
	|		ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ПервоначальнаяСтоимость КАК ЧИСЛО(20,8)) 
	|						/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|   
		// ПропорциональноОбъемуПродукции
	|	КОГДА НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции) 
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокНМА.РесурсНазначенный <> 0 ТОГДА
	|				ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ПервоначальнаяСтоимость КАК ЧИСЛО(20,8))
	|							* ВЫРАЗИТЬ(СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8)) 
	|							/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|
		// УменьшаемогоОстатка
	|	КОГДА НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокНМА.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка) 
	|		ТОГДА ВЫБОР 
	|			КОГДА (СписокНМА.РесурсНазначенный - СписокНМА.ФактическийСрокИспользования + 1) > 0 ТОГДА
	|				ВЫРАЗИТЬ(ВЫРАЗИТЬ(&Стоимость - &Амортизация КАК ЧИСЛО(20,8))
	|							* ВЫРАЗИТЬ(СписокНМА.КоэффициентУскорения КАК ЧИСЛО(20,8)) 
	|							/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный - СписокНМА.ФактическийСрокИспользования + 1 КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ 0
	|			
	|		КОНЕЦ
	|КОНЕЦ";				

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Стоимость", ПараметрыТекстаЗапроса.ТекстСтоимость);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Амортизация", ПараметрыТекстаЗапроса.ТекстАмортизация);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаточнаяСтоимость", ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПервоначальнаяСтоимость", ПараметрыТекстаЗапроса.ТекстПервоначальнаяСтоимость);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЛиквидационнаяСтоимость", ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДоначисления", ПараметрыТекстаЗапроса.ТекстСуммаДоначисления);
	
	ТекстОбесценение = 
		СтрЗаменить(
			"(ВЫБОР КОГДА СписокНМА.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения ТОГДА &ОстатокОбесценения ИНАЧЕ 0 КОНЕЦ)", 
			"&ОстатокОбесценения",
			ПараметрыТекстаЗапроса.ТекстОбесценение);			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстатокОбесценения", ТекстОбесценение);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСуммаОбесценения(ТекстОстатокОбесценение)
	
	ТекстЗапроса = 
	"ВЫБОР 
	|	КОГДА НЕ СписокНМА.НачислятьАмортизацию 
	|		ИЛИ &ОстатокОбесценения <= 0
	|		ИЛИ НЕ СписокНМА.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|		ТОГДА 0
	|
	|	КОГДА (СписокНМА.РесурсВыработанныйЗаПрошлыйПериод + СписокНМА.РесурсВыработанныйЗаТекущийПериод) >= СписокНМА.РесурсНазначенный
	|
	|		ТОГДА &ОстатокОбесценения
	|
		// Линейный, ПропорциональноОбъемуПродукции
	|	КОГДА СписокНМА.МетодНачисленияАмортизации В (
	|						ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.Линейный),
	|						ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)) 
	|
	|		ТОГДА ВЫРАЗИТЬ(&ОстатокОбесценения 
	|							* (ВЫРАЗИТЬ(СписокНМА.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|							/ ВЫРАЗИТЬ(СписокНМА.РесурсНазначенный - СписокНМА.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8))) КАК ЧИСЛО(31,2))
	|
	|	ИНАЧЕ 0
	|
	|КОНЕЦ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстатокОбесценения", ТекстОстатокОбесценение);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Возвращаемое значение:
//  Структура - Параметры текста запроса сумма амортизации УУ:
// * ТекстСтоимость - Строка - 
// * ТекстАмортизация - Строка - 
// * ТекстОстаточнаяСтоимость - Строка -
// * ТекстПервоначальнаяСтоимость - Строка -
// * ТекстЛиквидационнаяСтоимость - Строка -
// * ТекстСуммаДоначисления - Строка -
// * ТекстОбесценение - Строка -
Функция ПараметрыТекстаЗапросаСуммаАмортизацииУУ()
	
	ПараметрыТекстаЗапроса = Новый Структура;
	ПараметрыТекстаЗапроса.Вставить("ТекстСтоимость", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстАмортизация", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстОстаточнаяСтоимость", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстПервоначальнаяСтоимость", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстЛиквидационнаяСтоимость", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстСуммаДоначисления", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстОбесценение", "0");
	
	Возврат ПараметрыТекстаЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
