
&НаКлиенте
Процедура Применить(Команда)
	
	Закрыть(СписокВыбранныхСтрокКолонок);
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
		
	Если Параметры.ЭтоСтроки Тогда
		
		 ЭтаФорма.Заголовок 					= Нстр("ru = 'Оформляемые строки сводной таблицы'");
		 Элементы.ДекорацияВСтроках.Заголовок 	= Нстр("ru = 'Доступные строки'");
		 Элементы.ДекорацияВыражение.Заголовок 	= Нстр("ru = 'Выбранные строки'");
		 КартинкаСтрокиСводнойТаблицы = БиблиотекаКартинок.МетаданныеРеквизиты;
         КартинкаФормулыСводнойТаблицы = БиблиотекаКартинок.СводнаяТаблицаФормулаРавно;

		 
	ИначеЕсли Параметры.ЭтоКолонки Тогда
		
		ЭтаФорма.Заголовок = Нстр("ru = 'Оформляемые колонки сводной таблицы'");
        Элементы.ДекорацияВСтроках.Заголовок 	= Нстр("ru = 'Доступные колонки'");
		Элементы.ДекорацияВыражение.Заголовок 	= Нстр("ru = 'Выбранные колонки'");
		КартинкаСтрокиСводнойТаблицы = БиблиотекаКартинок.МетаданныеРеквизитыАдресации;
        КартинкаФормулыСводнойТаблицы = БиблиотекаКартинок.СводнаяТаблицаФормулаРавно;

		
	КонецЕсли;	
	
	Для Каждого СтрДоступноеПоле Из Параметры.СписокДоступныхСтрокКолонок Цикл
		
		Если ТипЗнч(СтрДоступноеПоле.Значение) = Тип("СправочникСсылка.ФормулыСводнойТаблицы") Тогда
			НовСтрДоступноеПоле  = СписокДоступныхСтрокКолонок.Добавить(СтрДоступноеПоле.Значение,СтрДоступноеПоле.Представление,,КартинкаФормулыСводнойТаблицы);
		Иначе	
			НовСтрДоступноеПоле  = СписокДоступныхСтрокКолонок.Добавить(СтрДоступноеПоле.Значение,СтрДоступноеПоле.Представление,,КартинкаСтрокиСводнойТаблицы);
		КонецЕсли;	
			
	КонецЦикла;	
	
	Для Каждого СтрВыбранноеПоле Из Параметры.СписокВыбранныхСтрокКолонок Цикл		

		НовСтрДоступноеПоле  = СписокВыбранныхСтрокКолонок.Добавить(СтрВыбранноеПоле.Значение,СтрВыбранноеПоле.Представление,,КартинкаСтрокиСводнойТаблицы);

	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхСтрокКолонокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
	
	Для Каждого ВыделенныйЭлемент Из Элемент.ВыделенныеСтроки Цикл
		
		ТекСтрокаДанных =  СписокДоступныхСтрокКолонок.НайтиПоИдентификатору(ВыделенныйЭлемент);    	
		СписокВыбранныхСтрокКолонок.Добавить(ТекСтрокаДанных.Значение,ТекСтрокаДанных.Представление,,ТекСтрокаДанных.Картинка);
		
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбранныхСтрокКолонокПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 СтандартнаяОбработка = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбранныхСтрокКолонокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

 	 СтандартнаяОбработка = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбранныхСтрокКолонокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбранныхСтрокКолонокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Для Каждого ВыделенныйЭлемент Из Элементы.СписокДоступныхСтрокКолонок.ВыделенныеСтроки Цикл
		
		ТекСтрокаДанных =  СписокДоступныхСтрокКолонок.НайтиПоИдентификатору(ВыделенныйЭлемент);    	
		СписокВыбранныхСтрокКолонок.Добавить(ТекСтрокаДанных.Значение,ТекСтрокаДанных.Представление,,ТекСтрокаДанных.Картинка);
		
	КонецЦикла;	

КонецПроцедуры

