
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьВидимостьЭлементовФормы();

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Поиск(Команда)   

	ЗагруженИзЦБ = Ложь;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		
		Если Не ЗначениеЗаполнено(Email) И Не ЗначениеЗаполнено(ЕКС) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните ЕКС и/или адрес электронной почты и нажмите кнопку поиска повторно!"); 
			Возврат;
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура();
		ПараметрыПоиска.Вставить("Email", СокрЛП(Email));
		ПараметрыПоиска.Вставить("ЕКС", СокрЛП(ЕКС));
		
		ФизическоеЛицо = ПоискВТекущейБазе(ПараметрыПоиска);
		
		Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			
			ФизическоеЛицо = ПоискФизическогоЛицаВЦБНаСервере(ПараметрыПоиска);
			
			ЗагруженИзЦБ = ЗначениеЗаполнено(ФизическоеЛицо);
			
			Если НЕ ЗагруженИзЦБ Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("По указанным параметрам работающий сотрудник не найден!");
			КонецЕсли;
			
			ОбновитьВидимостьЭлементовФормы();
			
		Иначе
			
			ЗагруженИзЦБ = Ложь;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("По указанным параметрам в текущей базе найдено Физлицо " + ФизическоеЛицо);
			
			ПеренестиВПапкуТН_ФедеральныеСотрудники(ФизическоеЛицо);
			
		КонецЕсли;
		
	Иначе
		
		ФизическоеЛицо = Неопределено;
		ЗагруженИзЦБ = Ложь;
		Email = "";
		ЕКС = "";
		
	КонецЕсли; 
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоискВЦБ(ПараметрыПоиска)
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("КлючМаршрутизации", Справочники.тн_ПроизводственныеПодразделения.УПП_ЦБ); 
	ПараметрыСообщения.Вставить("uec", ПараметрыПоиска.ЕКС);
	ПараметрыСообщения.Вставить("Email", ПараметрыПоиска.Email);
	
	Результат = ТН_ИнтеграцияОбменМеждуЦИС.ОтправитьСообщение(Перечисления.ТН_ВидыСообщений_ОбменМеждуЦИС.requestPersons_v1, ПараметрыСообщения); 	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция РезультатВыполненияЗапросыRabbitMQНаСервере(ИдентификаторЗапроса)
	
	ПараметрыФормирования = Новый Структура();
	ПараметрыФормирования.Вставить("ИдентификаторЗапроса", Строка(ИдентификаторЗапроса));
	ПараметрыФормирования.Вставить("ВидСообщения", ПредопределенноеЗначение("Перечисление.тн_ВидыСообщений_ОбменМеждуЦИС.requestPersons_v1"));
	
	Возврат РегистрыСведений.тн_ЗапросыRabbitMQ.ПолучитьЗапись(ПараметрыФормирования);
	
КонецФункции

&НаСервере
Функция ПоискВТекущейБазе(ПараметрыПоиска)
	
	Возврат Справочники.ФизическиеЛица.ПоискФизическихЛиц(ПараметрыПоиска);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		
		Элементы.ГруппаПоиск.Видимость = Ложь;
		Элементы.ГруппаРезультат.Видимость = Истина;
		Элементы.КнопкаПоиск.Заголовок = "Новый поиск";
		
		Если ЗагруженИзЦБ Тогда
			ТекстЗаголовка = "Элемент справочника ""Физические лица"" загружен из ""Центральной"" базы:";
		Иначе
			ТекстЗаголовка = "Элемент справочника ""Физические лица"" найден в текущей базе:";
		КонецЕсли;
		Элементы.ДекорацияЗаголовок.Заголовок = ТекстЗаголовка;
		
	Иначе
	
		Элементы.ГруппаПоиск.Видимость = Истина;
		Элементы.ГруппаРезультат.Видимость = Ложь;
		Элементы.КнопкаПоиск.Заголовок = "Поиск";
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВремяОжиданияОтветаОтЗапросыRabbitMQ()

	Результат = Константы.тн_ВремяОжиданияОтветаОтЗапросыRabbitMQ.Получить();
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = 60; // по умолчанию
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПоискФизическогоЛицаВЦБНаСервере(ПараметрыПоиска)
	
	Результат = ВыполнитьЗапросПолученияФизическогоЛицаВЦБ(ПараметрыПоиска);
	
	Если Результат.Успех Тогда
		
		// Ожидание ответа от RMQ 
		
		ИдентификаторЗапроса = Результат.ИдентификаторЗапроса;
		ДатаНачалаОжидания = ТекущаяДатаСеанса();
		ИнтервалПроверкиСекунд = 3;
		
		ВремяОжидания = Константы.тн_ВремяОжиданияОтветаОтЗапросыRabbitMQ.Получить();
		
		ВремяОжидания = ?(ЗначениеЗаполнено(ВремяОжидания), ВремяОжидания, 60);
		
		ДатаЗавершенияОжидания = ДатаНачалаОжидания + ВремяОжидания;
		
		ОтветНаЗапрос = Неопределено;
		
		Пока Истина Цикл
			
			Если ТекущаяДатаСеанса() > ДатаЗавершенияОжидания Тогда
				
				ОбщегоНазначения.СообщитьПользователю(
					"Не удалось получить данные из базы ""Центральная""! "
					+ "Превышено время ожидания ответного сообщения!");
				
				Прервать;
				
			КонецЕсли; 
			
			ПараметрыФормирования = Новый Структура();
			ПараметрыФормирования.Вставить("ИдентификаторЗапроса", Строка(ИдентификаторЗапроса));
			ПараметрыФормирования.Вставить("ВидСообщения", Перечисления.ТН_ВидыСообщений_ОбменМеждуЦИС.requestPersons_v1);
			
			РезультатВыполненияЗапросыRabbitMQ = РегистрыСведений.тн_ЗапросыRabbitMQ.ПолучитьЗапись(ПараметрыФормирования);
			
			Если РезультатВыполненияЗапросыRabbitMQ = Неопределено Тогда
				
				Продолжить;
				
			Иначе 
				
				Если РезультатВыполненияЗапросыRabbitMQ.ОтветПолучен Тогда 
					
					// Ответ от Rabbit получен
					
					Если РезультатВыполненияЗапросыRabbitMQ.ЕстьОшибки Тогда
						
						ОбщегоНазначения.СообщитьПользователю("Не удалось получить данные из базы ""Центральная""!"
							+ Символы.ПС + "Описание ошибки:" + РезультатВыполненияЗапросыRabbitMQ.ТекстОшибки);
						
						Прервать;
						
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(РезультатВыполненияЗапросыRabbitMQ.Объект) Тогда
						
						ФизическоеЛицо = РезультатВыполненияЗапросыRabbitMQ.Объект;
						
					Иначе
						
						// Не найдено соответствий в ЦБ
						
						ФизическоеЛицо = Неопределено;
						
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ИнтернетПоддержкаПользователей.Пауза(ИнтервалПроверкиСекунд)
			
		КонецЦикла;
		
	Иначе
		
		ОписаниеОшибки = Неопределено;
		
		Результат.Свойство("ОписаниеОшибки", ОписаниеОшибки);
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьЗапросПолученияФизическогоЛицаВЦБ(ПараметрыПоиска) Экспорт
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("КлючМаршрутизации", Справочники.тн_ПроизводственныеПодразделения.УПП_ЦБ);
	ПараметрыСообщения.Вставить("uec", ПараметрыПоиска.ЕКС);
	ПараметрыСообщения.Вставить("Email", ПараметрыПоиска.Email);
	
	Результат = ТН_ИнтеграцияОбменМеждуЦИС.ОтправитьСообщение(Перечисления.ТН_ВидыСообщений_ОбменМеждуЦИС.requestPersons_v1, ПараметрыСообщения); 	
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПеренестиВПапкуТН_ФедеральныеСотрудники(Ссылка)
	
	ПапакаТН_ФедеральныеСотрудники = Справочники.ФизическиеЛица.тн_ФедеральныеСотрудники;
	
	Если ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(Ссылка, "Родитель") = ПапакаТН_ФедеральныеСотрудники Тогда
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицо = Ссылка.ПолучитьОбъект();
	ФизическоеЛицо.Родитель = ПапакаТН_ФедеральныеСотрудники;
	ФизическоеЛицо.ОбменДанными.Загрузка = Истина;
	
	Попытка
		ФизическоеЛицо.Записать();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 перенесен в папку ""Федеральные сотрудники (тн)""", ФизическоеЛицо.Наименование));
	Исключение
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 не удалось перенести в папку ""Федеральные сотрудники (тн)"" по причине: %2", ФизическоеЛицо.Наименование, ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти