#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	СсылкаДокумента = СсылкаТекущейСтрокиСписка();
	Если СсылкаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрисоединитьПечатнуюФормуНаСервере(СсылкаДокумента);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Документ.нп_ЗаявкаНаОткрытиеПериода",
		"ЗаявкаНаОткрытиеПериода",
		СсылкаДокумента,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	
	СсылкаДокумента = СсылкаТекущейСтрокиСписка();
	Если СсылкаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", СсылкаДокумента);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
		Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Функция СсылкаТекущейСтрокиСписка()
	
	СсылкаДокумента = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(СсылкаДокумента) <> Тип("ДокументСсылка.нп_ЗаявкаНаОткрытиеПериода") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран документ.'"));
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СсылкаДокумента;
	
КонецФункции

&НаСервере
Процедура ПрисоединитьПечатнуюФормуНаСервере(СсылкаДокумента)
	
	Документы.нп_ЗаявкаНаОткрытиеПериода.ПрисоединитьПечатнуюФормуКДокументу(СсылкаДокумента);
	
КонецПроцедуры

#КонецОбласти
