#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Не ПустаяСтрока(ТекущийОбъект.ИмяПредопределенныхДанных) Тогда
		Элементы.ГруппаПлатежи.Видимость = Ложь;
		Элементы.ГруппаПоступления.Видимость = Ложь;
		ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПроцентПоступленийПриИзменении(Элемент)
	УстановитьНаименованиеСценария(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПроцентПлатежейПриИзменении(Элемент)
	УстановитьНаименованиеСценария(ЭтотОбъект);	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНаименованиеСценария(Форма)

	Объект = Форма.Объект;
	
	ТекстНаименования = НСтр("ru = 'Поступления %1%%; Платежи %2%%'");
	Объект.Наименование = СтрШаблон(ТекстНаименования, Формат(Объект.ПроцентПоступлений, "ЧН=0"), Формат(Объект.ПроцентПлатежей, "ЧН=0"));

КонецПроцедуры


#КонецОбласти


