#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПараметрыВидаОперации(ВидОперации) Экспорт
	
	Результат = Новый Структура("ЗаголовокАктив, ЗаголовокПараметрыУчетаАктива, 
								|ЕстьКоличество, ЕстьКосвенныеНалоги, ЕстьДоли,
								|ВидимостьСодержание, ВидимостьПараметровУчета, ВидимостьПараметровАмортизации,
								|АктивОграничениеТипа, АктивПараметрыВыбора");
	ЗаполнитьЗначенияСвойств(Результат, ВидОперации);
	
	АктивТипы = Новый Массив;
	ЕстьУслуги = ВидОперации.ТипыАктивов.Найти(Истина, "Услуга") <> Неопределено;
	Для каждого т Из ВидОперации.ТипыАктивов Цикл
		
		ТекущийТип = ТипЗнч(т.ТипАктива.ЗначениеПустойСсылки);
		АктивТипы.Добавить(ТекущийТип);
		
		Если (ЕстьУслуги = Истина) 
			И Не т.Услуга 
			И ТекущийТип = Тип("СправочникСсылка.Номенклатура") Тогда
			ЕстьУслуги = Неопределено;//есть и услуги и товары
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Вставить("АктивОграничениеТипа", Новый ОписаниеТипов(АктивТипы));
	
	Отбор = ?(ЕстьУслуги = Истина, Новый Структура("Услуга", Истина), Новый Структура);
	Результат.Вставить("АктивПараметрыВыбора", МСФОУХ.ПолучитьПараметрыВыбораПоля(Отбор));
		
	Возврат Результат;
	
КонецФункции

#Область ОбновлениеПредопределенных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов справочника.
//  ТабличныеЧасти - Структура из КлючИЗначение - данные заполнения табличных частей.
//                                                Состав колонок соответствует набору реквизитов табличных частей.
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	СсылкаМПЗ	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.Номенклатура"));
	СсылкаОС	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ВстраиваниеУХКлиентСервер.ПолучитьТипОС());
	СсылкаИнв	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.Организации"));
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Товары";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Товары'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000001";
	Элемент.ЗаголовокПараметрыУчетаАктива = НСтр("ru = 'Параметры учета товара'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ЕстьКоличество = Истина;
	Элемент.ЕстьКосвенныеНалоги = Истина;
	Элемент.ЕстьДоли = Ложь;
	Элемент.ВидимостьСодержание = Ложь;
	Элемент.ВидимостьПараметровУчета = Истина;
	Элемент.ВидимостьПараметровАмортизации = Ложь;

	Элемент.ТипыАктивов = ТабличныеЧасти.ТипыАктивов.Скопировать();
	
	ЭлементТЧ = Элемент.ТипыАктивов.Добавить();
	ЭлементТЧ.ТипАктива = СсылкаМПЗ;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Услуги";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Услуги'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000002";
	Элемент.ЗаголовокАктив = НСтр("ru = 'Услуги'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ЗаголовокПараметрыУчетаАктива = НСтр("ru = 'Параметры учета услуги'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ЕстьКоличество = Истина;
	Элемент.ЕстьКосвенныеНалоги = Истина;
	Элемент.ЕстьДоли = Ложь;
	Элемент.ВидимостьСодержание = Истина;
	Элемент.ВидимостьПараметровУчета = Истина;
	Элемент.ВидимостьПараметровАмортизации = Ложь;

	Элемент.ТипыАктивов = ТабличныеЧасти.ТипыАктивов.Скопировать();
	
	ЭлементТЧ = Элемент.ТипыАктивов.Добавить();
	ЭлементТЧ.ТипАктива = СсылкаМПЗ;
	ЭлементТЧ.Услуга = Истина;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Инвестиции";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Инвестиции'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000003";
	Элемент.ЗаголовокАктив = НСтр("ru = 'Объект инвестирования'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ЗаголовокПараметрыУчетаАктива = НСтр("ru = 'Параметры учета инвестиции'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ЕстьКоличество = Истина;
	Элемент.ЕстьКосвенныеНалоги = Ложь;
	Элемент.ЕстьДоли = Истина;
	Элемент.ВидимостьСодержание = Истина;
	Элемент.ВидимостьПараметровУчета = Истина;
	Элемент.ВидимостьПараметровАмортизации = Ложь;

	Элемент.ТипыАктивов = ТабличныеЧасти.ТипыАктивов.Скопировать();
	ЭлементТЧ = Элемент.ТипыАктивов.Добавить();
	ЭлементТЧ.ТипАктива = СсылкаИнв;
	
КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.НастройкиХозяйственныхОпераций - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли