#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

// Губернаторова Дарья 06.09.2021 Выполнение задач №000038912
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);

	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаПодписиВПриказа(Запрос, ТекстыЗапроса, Регистры);
	
	//НАЧАЛО Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
	//ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	// НАЧАЛО Гутарова Екатерина 23.11.2023 Выполнение задач №000047585
	//ИнтеграцияЕГАИС.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);	
	ПроведениеСерверУХ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	// КОНЕЦ Гутарова Екатерина 23.11.2023 Выполнение задач №000047585	
	//КОНЕЦ Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
	
КонецПроцедуры

// Губернаторова Дарья 06.09.2021 Выполнение задач №000038912
Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылка);

	Запрос.Текст = 
	"ВЫБРАТЬ  
	//НАЧАЛО Качикина 25.01.2026 Выполнение задач №000056363 
	|	РАЗРЕШЕННЫЕ
	//КОНЕЦ Качикина 25.01.2026 Выполнение задач №000056363
	|	тн_ПодписиВПриказах.Дата КАК Период,
	|	тн_ПодписиВПриказах.Номер КАК Номер,
	|	тн_ПодписиВПриказах.Организация КАК Организация,
	|	тн_ПодписиВПриказах.Статус КАК Статус,
	|	тн_ПодписиВПриказах.Ссылка КАК Ссылка,
	|	тн_ПодписиВПриказах.НачалоДействия КАК НачалоДействия,
	|	тн_ПодписиВПриказах.Комментарий КАК Комментарий, 
	|	тн_ПодписиВПриказах.ПометкаУдаления КАК ПометкаУдаления,
	|	тн_ПодписиВПриказах.Проведен КАК Проведен 
	//НАЧАЛО Качикина 25.01.2026 Выполнение задач №000056363 
	|ПОМЕСТИТЬ ДанныеДокументаШапка
	//КОНЕЦ Качикина 25.01.2026 Выполнение задач №000056363
	|ИЗ
	|	Документ.тн_ПодписиВПриказах КАК тн_ПодписиВПриказах
	|ГДЕ
	|	тн_ПодписиВПриказах.Ссылка = &Ссылка";
	
	//НАЧАЛО Качикина 25.01.2026 Выполнение задач №000056363
	//Реквизиты = Запрос.Выполнить().Выбрать(); 
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Реквизиты = Результат[0].Выбрать();
	//КОНЕЦ Качикина 25.01.2026 Выполнение задач №000056363
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",			Реквизиты.Период);
	Запрос.УстановитьПараметр("Номер",			Реквизиты.Номер);
	Запрос.УстановитьПараметр("Организация",	Реквизиты.Организация);
	Запрос.УстановитьПараметр("Статус",			Реквизиты.Статус);
	Запрос.УстановитьПараметр("НачалоДействия",	Реквизиты.НачалоДействия);
	Запрос.УстановитьПараметр("Комментарий",	Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",		Реквизиты.Проведен);
			
КонецПроцедуры

// Губернаторова Дарья 06.09.2021 Выполнение задач №000038912
Функция ТекстЗапросаТаблицаПодписиВПриказа(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "тн_СведенияОПодписяхВПриказах";
	
	//НАЧАЛО Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
	//Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
	//КОНЕЦ Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ 
	//НАЧАЛО Качикина 21.01.2026 Выполнение задач №000056363
	//|	тн_ПодписиВПриказахПодписи.Ссылка.НачалоДействия КАК Период,
	//|	тн_ПодписиВПриказахПодписи.Ссылка.Организация КАК Организация, 
	|РАЗРЕШЕННЫЕ
	|	ДанныеДокументаШапка.НачалоДействия КАК Период,
	|	ДанныеДокументаШапка.Организация КАК Организация, 
	|	ЕСТЬNULL(тн_ПодписиВПриказахПодразделения.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	//КОНЕЦ Качикина 21.01.2026 Выполнение задач №000056363
	|	тн_ПодписиВПриказахПодписи.Пользователь КАК Пользователь,
	|	тн_ПодписиВПриказахПодписи.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	тн_ПодписиВПриказахПодписи.ВидПодписи.Порядок + 1 КАК СтрокаНомер,
	|	тн_ПодписиВПриказахПодписи.ВидПодписи КАК ВидПодписи,
	|	тн_ПодписиВПриказахПодписи.Приказ КАК Приказ,
	|	тн_ПодписиВПриказахПодписи.ФИОВПодписи КАК ФИОВПодписи,
	|	тн_ПодписиВПриказахПодписи.Должность КАК Должность,
	|	тн_ПодписиВПриказахПодписи.ПриказНаЭкспорт КАК ПриказНаЭкспорт,
	|	тн_ПодписиВПриказахПодписи.ФИОВПодписиНаЭкспорт КАК ФИОВПодписиНаЭкспорт,
	|	тн_ПодписиВПриказахПодписи.ДолжностьНаЭкспорт КАК ДолжностьНаЭкспорт,
	|	тн_ПодписиВПриказахПодписи.Ссылка.Статус КАК Статус
	|ИЗ 
	//НАЧАЛО Качикина 25.01.2026 Выполнение задач №000056363 
	//|	Документ.тн_ПодписиВПриказах.Подписи КАК тн_ПодписиВПриказахПодписи 
	//|ГДЕ
	//|	тн_ПодписиВПриказахПодписи.Ссылка = &Ссылка";   
	|	ДанныеДокументаШапка КАК ДанныеДокументаШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.тн_ПодписиВПриказах.Подписи КАК тн_ПодписиВПриказахПодписи  
	|		ПО ДанныеДокументаШапка.Ссылка = тн_ПодписиВПриказахПодписи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.тн_ПодписиВПриказах.Подразделения КАК тн_ПодписиВПриказахПодразделения
	|		ПО ДанныеДокументаШапка.Ссылка = тн_ПодписиВПриказахПодразделения.Ссылка"; 
	//КОНЕЦ Качикина 25.01.2026 Выполнение задач №000056363

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
