#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
// Записывает движения в набор записей читая данные из выборки запроса.
// Поля запроса должны соответствовать полям регистра.
//
Процедура ЗаполнитьДвиженияИзВыборкиЗапроса(НаборЗаписей,
											ВыборкаЗапроса) Экспорт
	Пока ВыборкаЗапроса.Следующий() Цикл
		Движение = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаЗапроса);
	КонецЦикла;	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК СпрВнешПользователи 
	|    ПО СпрВнешПользователи.ОбъектАвторизации = ЭтотСписок.ПредложениеПоставщика.АнкетаПоставщика 
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|    ЗначениеРазрешено(СпрВнешПользователи.Ссылка)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецЕсли