#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяРеквизита = ИмяРеквизитаЗначения();
	Редактируется = Параметры.Редактируется;
	
	ОписаниеТипов = ИТК_ТипыКлиентСервер.ОписаниеСтрока(Параметры.Длина);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИТК_Форма.ДобавитьРеквизит(ДобавляемыеРеквизиты, ИмяРеквизита, ОписаниеТипов);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Поля = Новый Структура;
	Поля.Вставить("ПутьКДанным", ИмяРеквизита);
	Поля.Вставить("Заголовок", НСтр("ru = 'Текст';
									|en = 'Text'"));
	Поля.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	Поля.Вставить("ТолькоПросмотр", НЕ Редактируется);
	ИТК_Форма.ДобавитьЭлемент(ЭтотОбъект, ИмяРеквизита, "ПолеТекстовогоДокумента", Поля);
	
	Элементы.ФормаСохранитьИЗакрыть.Видимость = Редактируется;
	
	ЭтотОбъект[ИмяРеквизита] = Параметры.Значение;
	
	Если Редактируется Тогда
		Заголовок = НСтр("ru = 'Редактирование текста';
						|en = 'Editing text'");
	Иначе
		Заголовок = НСтр("ru = 'Просмотр текста';
						|en = 'Viewing text'");
	КонецЕсли;
	Заголовок = ИТК_ФормаКлиентСервер.ЗаголовокСРасшифровкой(Заголовок, Параметры.Заголовок);
	
	ИТК_Форма.УстановитьНазначениеДействияКоманды(Команды.СохранитьИЗакрыть, "Завершение");
	ИТК_Форма.ОбработчикПриСозданииНаСервереПосле(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Значение = ЭтотОбъект[ИмяРеквизитаЗначения()];
	Закрыть(Значение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизитаЗначения()
	
	Возврат "Текст";
	
КонецФункции

#КонецОбласти
