#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ШаблонНаименование = НСтр("ru = 'Правило согласования %1';
								|en = 'Approval rule %1'");
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Наименование = СтрШаблон(ШаблонНаименование, Подразделение);
	ИначеЕсли ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Наименование = СтрШаблон(ШаблонНаименование, ФизическоеЛицо);
	Иначе
		Наименование = СтрШаблон(ШаблонНаименование, НСтр("ru = 'для всех (остальных) подразделений';
															|en = 'for all (other) business units'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли