
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмеющиеДоступ = Новый ФиксированныйМассив(Параметры.ИмеющиеДоступ);
	УправлениеФормойПриСозданииНаСервере(Параметры)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьИзменение(Команда)
	Закрыть("Отмена");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсем(Команда)
	
	Закрыть("Изменить всем");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормойПриСозданииНаСервере(Параметры)
	
	ЭтоПодключение = Параметры.Значение;
	
	Ссылка = Новый ФорматированнаяСтрока(НСтр("ru = 'пользователям';
												|en = 'пользователям'"),,,,"пользователи");
	
	Если ЭтоПодключение Тогда
		ПодставитьПараметры(ЭтотОбъект, НСтр("ru = 'Подключить';
											|en = 'Подключить'"), Параметры);
		
		Элементы.Пояснение.Заголовок = НСтр("ru = '%1 будет %2 пользователям, имеющим доступ ко всем гос. органам учетной записи. Продолжить подключение?';
											|en = '%1 будет %2 пользователям, имеющим доступ ко всем гос. органам учетной записи. Продолжить подключение?'");
		ПодставитьПараметры(Элементы.Пояснение, НСтр("ru = 'подключен';
													|en = 'подключен'"), Параметры);
		ПодставитьПараметры(Элементы.ЧтоДелать, НСтр("ru = 'подключить';
													|en = 'Подключить'"), Параметры);
		
		Элементы.ИзменитьВсем.Заголовок = "Подключить всем пользователям";
		
	Иначе
		
		ПодставитьПараметры(ЭтотОбъект, НСтр("ru = 'Отключить';
											|en = 'Отключить'"), Параметры);
		
		Элементы.Пояснение.Заголовок = НСтр("ru = '%1 будет %2 всем пользователям. Продолжить отключение?';
											|en = '%1 будет %2 всем пользователям. Продолжить отключение?'");
		ПодставитьПараметры(Элементы.Пояснение, НСтр("ru = 'отключен';
													|en = 'отключен'"), Параметры);
		ПодставитьПараметры(Элементы.ЧтоДелать, НСтр("ru = 'отключить';
													|en = 'Отключить'"), Параметры);
		
		Элементы.ИзменитьВсем.Заголовок = "Отключить всем пользователям";

	КонецЕсли;
	
	ДокументооборотСКОКлиентСервер.ЗаменитьСтрокуНаСсылку(
		Элементы.Пояснение.Заголовок, 
		НСтр("ru = 'пользователям';
			|en = 'пользователям'"), 
		Ссылка);
	
КонецПроцедуры

&НаСервере
Функция ПодставитьПараметры(Элемент, Действие, Параметры)
	
	Текст = Элемент.Заголовок;
	
	Текст = СтрЗаменить(Текст, "%2", Действие);
	Текст = СтрЗаменить(Текст, "%1", Параметры.ПредставлениеОргана);
	
	Элемент.Заголовок = Текст;
	
КонецФункции

&НаКлиенте
Процедура Пояснение1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МультирежимКлиент.ПоказатьЗначения(ИмеющиеДоступ, НСтр("ru = 'Перечень пользователей:';
															|en = 'Перечень пользователей:'"));
	
КонецПроцедуры


#КонецОбласти




