#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СоответствиеКурсовВалют Экспорт;
Перем ВалютаУправленческогоУчета Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Восстанавливает переменные для расчета
//
// Параметры:
//  ПеременныеДляРасчета  - Структура - Структура с переменными для расчета
//
Процедура ВосстановитьПеременныеДляРасчета(ПеременныеДляРасчета) Экспорт
		
	Если ТипЗнч(ПеременныеДляРасчета) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПеременныеДляРасчета,, "Ссылка");
		
	КонецЕсли;
			
КонецПроцедуры // ВосстановитьПеременныеДляРасчета()

#КонецОбласти

#Область ОбработчикиСобытий  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУХ.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	ОбновитьДанныеПоВалютам();
	
	СуммаДокумента = ДвиженияОперации.Итог("Сумма");
	БалансКорректировок = ДвиженияОперации.Итог("СуммаИзменение");
	
	Если ЗначениеЗаполнено(ВалютаУправленческогоУчета) Тогда
		КурсДокумента = СоответствиеКурсовВалют[ВалютаДокумента];
		КурсВалютыУпрУчета = СоответствиеКурсовВалют[ВалютаУправленческогоУчета];
		СуммаДокументаУпр 		= РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаДокумента, КурсДокумента, КурсВалютыУпрУчета);
		БалансКорректировокУпр 	= РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(БалансКорректировок, КурсДокумента, КурсВалютыУпрУчета);
	Иначе
		СуммаДокументаУпр 		= СуммаДокумента;
		БалансКорректировокУпр 	= БалансКорректировок;
		
		СтрокаШаблона = НСтр("ru = 'Не заполнена валюта управленческого учета. Сумма документа (%1) не была пересчитана в валюту управленческого учета из валюты документа (%2).'");
		
		ТекстСообщения = "";
		Если Не ПустаяСтрока(СтрокаШаблона) Тогда
			ТекстСообщения = СтрШаблон(СтрокаШаблона, Строка(СуммаДокумента), Строка(ВалютаДокумента));
		КонецЕсли;
				
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПериодОтчета) Тогда
		ПериодОтчета = КэшируемыеПроцедурыУХ.глОтносительныйПериодПоДате(Дата, Периодичность, 0);
	КонецЕсли;
	
	ДатаНачала		= ПериодОтчета.ДатаНачала;
	ДатаОкончания	= ПериодОтчета.ДатаОкончания;
	
	// Очистить поле ДокументПланирования, если оно не нужно.
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРезервирование.Новый") И ЗначениеЗаполнено(ДокументПланирования) Тогда
		ДокументПланирования = Неопределено;
	КонецЕсли;
	
	ПроверитьЗаполнениеХарактеристик(Отказ);
	
	// Очистка реквизитов шапки для аналитик в шапке не размещенных.
	ОчиститьНенужныеАналитикиШапки();
	
	//
	Если ЗначениеЗаполнено(НазначениеРезерва_ДоговорКонтрагента)
		И (ТипЗнч(НазначениеРезерва_Контрагент) <> Тип("СправочникСсылка.Контрагенты") 
		ИЛИ НЕ ЗначениеЗаполнено(НазначениеРезерва_Контрагент))
	Тогда
		НазначениеРезерва_ДоговорКонтрагента = Неопределено;
	КонецЕсли;
	
	//
	ДвиженияБюджетированиеУХ.ПроверитьНеобходимостьУстановкиСтатусаЧерновик(ЭтотОбъект, РежимЗаписи);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// Проверка заполнения табличной части Движения операции.
		Если ДвиженияОперации.Количество() = 0 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Не введено ни одной строки в список ""Данные планирования"".'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияБюджетированиеУХ.УстановитьСтатусЧерновикПриНеобходимости(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Ответственный = Пользователи.ТекущийПользователь();
	
	//
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Резервирование") Тогда
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРезервирование.Корректировка Тогда
			ВызватьИсключение(НСтр("ru = 'Документ с видом операции ""Корректировка"" не может являться источником лимитов!'"));
		Иначе
			Документы.Резервирование.ЗаполнитьПоДокументуПланирования(ЭтотОбъект, ДанныеЗаполнения);
			Возврат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВидыОперативныхПланов") Тогда
		Документы.Резервирование.ЗаполнитьПоВидуОперативногоПлана(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("ЦФО",			ЦФО);
		ДанныеЗаполнения.Свойство("Проект",			Проект);
		ДанныеЗаполнения.Свойство("Организация",	Организация);
		ДанныеЗаполнения.Свойство("ВалютаДокумента", ВалютаДокумента);
		
		Если ДанныеЗаполнения.Свойство("ВидОперативногоПлана") Тогда
			Документы.Резервирование.ЗаполнитьПоВидуОперативногоПлана(ЭтотОбъект, ДанныеЗаполнения.ВидОперативногоПлана);
		КонецЕсли;
		
	КонецЕсли;
	
	// Определение вида бюджета по умолчанию
	ВидыБюджетов = ПланыВидовХарактеристик.ВидыБюджетов;
	Если НЕ ЗначениеЗаполнено(ВидБюджета) Тогда
		ВидБюджета = ВидыБюджетов.БюджетДвиженияДенежныхСредств;
	КонецЕсли;
	
	// 
	ДатаПараметров = Дата;
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаПараметров = ДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(ПериодОтчета) Тогда
		ДатаПараметров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПериодОтчета, "ДатаНачала");
	КонецЕсли;
	
	ПараметрыОП = ОперативноеПланированиеПовтИспУХ.ПолучитьПараметрыОперПланирования(ВидБюджета, ДатаПараметров);
	
	// Если по виду бюджета нет разрешенных операций(обычно это бюджет закупок), то меняем его на БДДС
	Если НЕ ПараметрыОП.ИспользоватьПланирование И НЕ ПараметрыОП.ИспользоватьЛимитирование И НЕ ПараметрыОП.ИспользоватьРезервирование Тогда
		ВидБюджета = ВидыБюджетов.БюджетДвиженияДенежныхСредств;
		ПараметрыОП = ОперативноеПланированиеПовтИспУХ.ПолучитьПараметрыОперПланирования(ВидБюджета, ДатаПараметров);
	КонецЕсли;
	
	// Заполняем параметры горизонта
	Документы.Резервирование.ОпределитьГоризонт(ЭтотОбъект, ПараметрыОП);
	
	Если Не ЗначениеЗаполнено(ПериодОтчета) Тогда
		ПериодОтчета = ОбщегоНазначенияУХ.глОтносительныйПериодПоДате(ДатаНачала, Периодичность, 0);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = ОбщегоНазначенияПовтИспУХ.ПолучитьВалютуУправленческогоУчета();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ЦФО = ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнойЦФО");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Проект = ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнойПроект");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ВидГоризонта <> Перечисления.ВидыГоризонтовПланирования.ФиксированныйГоризонт Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйПериод");
	КонецЕсли;
	
	ТаблицаНастройкиАналитик = НастройкаАналитик.Выгрузить(, "Аналитика, Использование, ОбязательноеЗаполнение");
	
	ДополнитьТаблицуОтсутствующимиАналитиками(ТаблицаНастройкиАналитик);
	
	// Обязательность аналитик
	Для каждого СтрокаАналитика Из ТаблицаНастройкиАналитик Цикл
		
		//
		Если СтрокаАналитика.Аналитика = Справочники.АналитикиОперативногоПланирования.ДокументПланирования Тогда
			Продолжить;
		КонецЕсли;
		
		Инфо = ПолучитьИменаРеквизитовПоАналитике(СтрокаАналитика.Аналитика);
		
		Если Инфо = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаАналитика.ОбязательноеЗаполнение = Ложь Тогда
			
			Если СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.НеИспользуется Тогда
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизита);
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизитаТабличнойЧасти);
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.Уточняется Тогда
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизита);
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизитаТабличнойЧасти);
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.Колонка Тогда
				// Всегда должно быть заполнено
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.Строка Тогда
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизита);
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизитаТабличнойЧасти);
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.КлючеваяАналитика Тогда
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизита);
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизитаТабличнойЧасти);
			КонецЕсли;
			
		Иначе
			
			Если СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.НеИспользуется Тогда
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизита);
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизитаТабличнойЧасти);
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.Уточняется Тогда
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизита);
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизитаТабличнойЧасти);
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.Колонка Тогда
				// Всегда должно быть заполнено
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.Строка Тогда
				МассивНепроверяемыхРеквизитов.Добавить(Инфо.ИмяРеквизита);
			ИначеЕсли СтрокаАналитика.Использование = Перечисления.ИспользованиеАналитик.КлючеваяАналитика Тогда
				// Проверяем реквизиты шапки и табличной части
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Удаляем
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	// Проверить на последующие в цепочке документы только для проведения. Для перепроведения проверка не выполняется.
	Если ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийРезервирование.Новый")
			И НЕ Проведен Тогда
		
		Если ЗначениеЗаполнено(ДокументПланирования) Тогда
			// Проверяем актуальность документа
			ДокументПланированияНеКорректен = Документы.Резервирование.ЕстьПоследующиеДокументы(ДокументПланирования);
			Если ДокументПланированияНеКорректен Тогда
				ТекстСообщения = НСтр("ru = 'Необходимо выбрать актуальный документ планирования.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДокументПланирования", , Отказ);
				Возврат ;
			КонецЕсли;
		Иначе
			// Сообщаем о незаполненности документа планирования
			ТекстСообщения = НСтр("ru = 'Поле ""Документ планирования"" не заполнено'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДокументПланирования", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	МСФОУХ.ПроверитьРучныеКорректировкиДокумента(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.Резервирование.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУХ.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	

	// Движения по регистра
	ПланированиеПотребностей.ОтразитьОперацииБюджетов(ДополнительныеСвойства, Движения, Отказ);

	//
	СформироватьСписокРегистровДляКонтроля();
	
	//
	ПроведениеСерверУХ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУХ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУХ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	                                  
	ОтправитьНаСогласованиеПриПроведенииДокумента(Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУХ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ЦФО);
	
	Если Не ЕстьСуперПользователь Тогда
		ПроверитьВозможностьОтменыПроведения(Отказ);
	КонецЕсли;
	
	ПроверитьНаличиеДокументовБлокирующихПроведение(Отказ);
	
	ПроведениеСерверОПК.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	МодульУправленияПроцессамиУХ.ОтменитьСогласованиеПриОтменеПроведения(Ссылка); 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Не МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ОбъектКопирования.ЦФО) Тогда
		ВнеМаршрута = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции      

Процедура ПроверитьЗаполнениеХарактеристик(Отказ)
	
	// Проверка заполнения характеристик.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ДвиженияОперации.Номенклатура КАК Номенклатура,
	|	ВТ_ДвиженияОперации.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ДвиженияОперации
	|ИЗ
	|	&ТаблицаДвиженияОперации КАК ВТ_ДвиженияОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДвиженияОперации.Номенклатура КАК Номенклатура,
	|	ВТ_ДвиженияОперации.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_ДвиженияОперации КАК ВТ_ДвиженияОперации
	|ГДЕ
	|	ВТ_ДвиженияОперации.Номенклатура ССЫЛКА Справочник.Номенклатура
	|	И ВЫРАЗИТЬ(ВТ_ДвиженияОперации.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|	И ВЫРАЗИТЬ(ВТ_ДвиженияОперации.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ПустаяСсылка)
	|	И ВТ_ДвиженияОперации.Характеристика = &ПустаяХарактеристика";
	
	Запрос.УстановитьПараметр("ТаблицаДвиженияОперации", ДвиженияОперации.Выгрузить(, "Номенклатура, Характеристика"));
	Запрос.УстановитьПараметр("ПустаяХарактеристика",    КэшируемыеПроцедурыОПК.ПустаяХарактетистикаНоменклатуры());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ШаблонСообщения = НСтр("ru = 'Для номенклатуры %1 не заполнена характеристика. Запись отменена.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Строка(ВыборкаДетальныеЗаписи.Номенклатура));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);   
	КонецЦикла;  
	
КонецПроцедуры 

Процедура ОбновитьДанныеПоВалютам()
	
	ВалютаУправленческогоУчета = ОбщегоНазначенияПовтИспУХ.ПолучитьВалютуУправленческогоУчета();
	
	СоответствиеКурсовВалют = Новый Соответствие;
	СоответствиеКурсовВалют.Вставить(ВалютаУправленческогоУчета, РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУправленческогоУчета, Дата));
	                                                                                                                                            
	Если СоответствиеКурсовВалют.Получить(ВалютаДокумента) = Неопределено Тогда
		СоответствиеКурсовВалют.Вставить(ВалютаДокумента, РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата));
	КонецЕсли;
		
КонецПроцедуры // ОбновитьДанныеПоВалютам()

Процедура ПроверитьВозможностьОтменыПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.ДокументПланирования = &ДокументПланирования
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаявкаНаРасход.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасход КАК ЗаявкаНаРасход
	|ГДЕ
	|	ЗаявкаНаРасход.ДокументПланирования = &ДокументПланирования
	|	И ЗаявкаНаРасход.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланируемыйДоход.Ссылка
	|ИЗ
	|	Документ.ПланируемыйДоход КАК ПланируемыйДоход
	|ГДЕ
	|	ПланируемыйДоход.ДокументПланирования = &ДокументПланирования
	|	И ПланируемыйДоход.Проведен";
	
	Если НЕ ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОжидаемоеПоступлениеДенежныхСредств.Ссылка
		|ИЗ
		|	Документ.ОжидаемоеПоступлениеДенежныхСредств КАК ОжидаемоеПоступлениеДенежныхСредств
		|ГДЕ
		|	ОжидаемоеПоступлениеДенежныхСредств.ДокументПланирования = &ДокументПланирования
		|	И ОжидаемоеПоступлениеДенежныхСредств.Проведен";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументПланирования", Ссылка);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		ТекстСообщения = НСтр("ru = 'Существуют проведенные документы, созданные на основании документа %1. Отменить проведение может только суперпользователь.'");
		
		Сообщение = "";
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			Сообщение = СтрШаблон(ТекстСообщения, Ссылка);
		КонецЕсли;
		
		ВызватьИсключение Сообщение;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Процедура ДополнитьТаблицуОтсутствующимиАналитиками(ТаблицаНастройкиАналитик)
	
	//
	СписокАналитик = Новый СписокЗначений;
	СписокАналитик.ЗагрузитьЗначения(ТаблицаНастройкиАналитик.ВыгрузитьКолонку("Аналитика"));
	
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикиОперативногоПланирования.Ссылка КАК Аналитика
	|ИЗ
	|	Справочник.АналитикиОперативногоПланирования КАК АналитикиОперативногоПланирования
	|ГДЕ
	|	АналитикиОперативногоПланирования.Предопределенный = ИСТИНА
	|	И НЕ АналитикиОперативногоПланирования.Ссылка В (&СписокАналитик)";
	Запрос.УстановитьПараметр("СписокАналитик", СписокАналитик);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	// Добавить отсутствующие аналитики опер.плана
	Пока Выборка.Следующий() Цикл
	
		Строка = ТаблицаНастройкиАналитик.Добавить();
		Строка.Аналитика = Выборка.Аналитика;
	 	Строка.Использование = Перечисления.ИспользованиеАналитик.НеИспользуется;
		Строка.ОбязательноеЗаполнение = Ложь;
		
	КонецЦикла; 

КонецПроцедуры

Функция ПолучитьИменаРеквизитовПоАналитике(Аналитика)
	
	ИмяРеквизита = Документы.Резервирование.ПолучитьИмяРеквизитаПоВидуАналитики(Аналитика);
	Если ИмяРеквизита = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Рез = Новый Структура("ИмяРеквизита, ИмяРеквизитаТабличнойЧасти", ИмяРеквизита, "ДвиженияОперации." + ИмяРеквизита);
	
	//
	Если ИмяРеквизита = "Валюта" Тогда
		Рез.ИмяРеквизита = "ВалютаДокумента";
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Процедура очищает реквизиты шапки документа для аналитик, расположенных не в шапке.
Процедура ОчиститьНенужныеАналитикиШапки()
	
	Для каждого Строка Из НастройкаАналитик Цикл
		
		Если Строка.Использование = Перечисления.ИспользованиеАналитик.КлючеваяАналитика Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.Использование = Перечисления.ИспользованиеАналитик.Колонка Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Строка.Аналитика.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = Строка.Аналитика.ИмяПредопределенныхДанных;
		Если ИмяРеквизита = "Валюта" Тогда
			ИмяРеквизита = "ВалютаДокумента";
		КонецЕсли;
		
		Если Строка.Использование = Перечисления.ИспользованиеАналитик.НеИспользуется
				И ЗначениеЗаполнено(Строка.ЗначениеАналитики) Тогда
			ЭтотОбъект[ИмяРеквизита] = Строка.ЗначениеАналитики;
		Иначе
			ЭтотОбъект[ИмяРеквизита] = Неопределено;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура проверяет наличие последующих документов с аналогичными ключевыми реквизитами
Процедура ПроверитьНаличиеДокументовБлокирующихПроведение(Отказ)
	
	Если Документы.Резервирование.ЕстьПоследующиеДокументы(Ссылка) Тогда
		
		ТекстСообщения = НСтр("ru = 'Существуют более поздние проведенные документы с аналогичными ключевыми аналитиками. Проведение невозможно.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,,,Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьНаСогласованиеПриПроведенииДокумента(Отказ)
	
	Если Отказ Тогда    
		Возврат;
	КонецЕсли;
	
	ТекСостояние = УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(Ссылка);
	
	СостоянияПроведения = Новый Массив;
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.Утверждена);
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.НаУтверждении);
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.Отклонена);
	
	Если СостоянияПроведения.Найти(ТекСостояние) = Неопределено Тогда
		ТекСостояние = Перечисления.СостоянияСогласования.Утверждена;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТекущееСостояниеСогласования", ТекСостояние);
	
	МодульУправленияПроцессамиУХ.ОтправитьНаСогласованиеПриПроведенииДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры  

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли