#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени(
		"Обработка.ИсправлениеОшибокВУчетеОС.Команда.ИсправлениеОшибокВУчетеОС");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияФормы", "ИсправлениеОшибокВУчетеОС");
	
	ОткрытьФорму("Обработка.ИсправлениеОшибокВУчетеОС.Форма", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		Ложь, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти