
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыФормы();
	
	ЭтотОбъект.Ссылка 											= Параметры.Ссылка;
	ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты 				= Истина;
	ЭтотОбъект.Свойства_ИспользоватьСвойства 					= Истина;
	ЭтотОбъект.Свойства_НаборыДополнительныхРеквизитовОбъекта 	= Параметры.Свойства_НаборыДополнительныхРеквизитовОбъекта;
	ЭтотОбъект.Свойства_ИмяЭлементаДляРазмещения				= "ГруппаДополнительныеРеквизиты";
	
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект, Ссылка.ПолучитьОбъект());
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПеренестиЗначенияВОсновнуюФорму(Команда)
	
	Адрес = ПоместитьРезультатВоВременноеХранилище();
	ПараметрыЗакрытия = Новый Структура("Адрес", Адрес);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьРеквизитыФормы()
	//На основе процедуры УправлениеСвойствами.СоздатьОсновныеОбъектыФормы()

	Реквизиты = Новый Массив;
	
	// Проверка значения функциональной опции "Использование свойств".
	РеквизитИспользоватьСвойства = Новый РеквизитФормы("Свойства_ИспользоватьСвойства", Новый ОписаниеТипов("Булево"));
	Реквизиты.Добавить(РеквизитИспользоватьСвойства);
	РеквизитСкрытьУдаленные = Новый РеквизитФормы("Свойства_СкрытьУдаленные", Новый ОписаниеТипов("Булево"));
	Реквизиты.Добавить(РеквизитСкрытьУдаленные);

	РеквизитПараметрыСвойств = Новый РеквизитФормы("ПараметрыСвойств", Новый ОписаниеТипов());
	Реквизиты.Добавить(РеквизитПараметрыСвойств);
	
	// Добавление реквизита содержащего используемые наборы дополнительных реквизитов.
	РеквизитСвойства_НаборыДополнительныхРеквизитовОбъекта = Новый РеквизитФормы("Свойства_НаборыДополнительныхРеквизитовОбъекта", Новый ОписаниеТипов("СписокЗначений"));
	Реквизиты.Добавить(РеквизитСвойства_НаборыДополнительныхРеквизитовОбъекта);
	
	// Добавление реквизита описания создаваемых реквизитов и элементов формы.
	ИмяОписания = "Свойства_ОписаниеДополнительныхРеквизитов";
	
	РеквизитСвойства_ОписаниеДополнительныхРеквизитов = Новый РеквизитФормы(ИмяОписания, Новый ОписаниеТипов("ТаблицаЗначений"));
	Реквизиты.Добавить(РеквизитСвойства_ОписаниеДополнительныхРеквизитов);
	
	РеквизитИмяРеквизитаЗначение = Новый РеквизитФормы("ИмяРеквизитаЗначение", Новый ОписаниеТипов("Строка"), ИмяОписания);
	Реквизиты.Добавить(РеквизитИмяРеквизитаЗначение);
	
	РеквизитСвойство = Новый РеквизитФормы("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"),ИмяОписания);
	Реквизиты.Добавить(РеквизитСвойство);
	// НАЧАЛО Малахов Владимир 02.09.2025 Выполнение задач №000054991
	//РеквизитВладелецДополнительныхЗначений = Новый РеквизитФормы("ВладелецДополнительныхЗначений", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"),ИмяОписания);
	ТипДополнительныеРеквизитыИСведения = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");
	РеквизитВладелецДополнительныхЗначений = Новый РеквизитФормы("ВладелецДополнительныхЗначений", ТипДополнительныеРеквизитыИСведения ,ИмяОписания);
	// КОНЕЦ Малахов Владимир 02.09.2025 Выполнение задач №000054991
	Реквизиты.Добавить(РеквизитВладелецДополнительныхЗначений);
	
	РеквизитТипЗначения = Новый РеквизитФормы("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"), ИмяОписания);
	Реквизиты.Добавить(РеквизитТипЗначения);
	
	РеквизитМногострочноеПолеВвода = Новый РеквизитФормы("МногострочноеПолеВвода", Новый ОписаниеТипов("Число"), ИмяОписания);
	Реквизиты.Добавить(РеквизитМногострочноеПолеВвода);
	
	РеквизитУдалено = Новый РеквизитФормы("Удалено", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитУдалено);
	
	РеквизитЗаполнятьОбязательно = Новый РеквизитФормы("ЗаполнятьОбязательно", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитЗаполнятьОбязательно);
	
	РеквизитДоступен = Новый РеквизитФормы("Доступен", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитДоступен);
	
	РеквизитВиден = Новый РеквизитФормы("Виден", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитВиден);
	
	РеквизитНаименование = Новый РеквизитФормы("Наименование", Новый ОписаниеТипов("Строка"), ИмяОписания);
	Реквизиты.Добавить(РеквизитНаименование);
	
	РеквизитЭлементФормыДобавлен = Новый РеквизитФормы("ЭлементФормыДобавлен", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитЭлементФормыДобавлен);
	
	РеквизитВыводитьВВидеГиперссылки = Новый РеквизитФормы("ВыводитьВВидеГиперссылки", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитВыводитьВВидеГиперссылки);
	
	РеквизитСтрокаСсылочногоТипа = Новый РеквизитФормы("СтрокаСсылочногоТипа", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитСтрокаСсылочногоТипа);
	
	// Добавление реквизита описания зависимых реквизитов.
	ТаблицаЗависимыхРеквизитов = "Свойства_ОписаниеЗависимыхДополнительныхРеквизитов";
	
	РеквизитСвойства_ОписаниеЗависимыхДополнительныхРеквизитов = Новый РеквизитФормы(ТаблицаЗависимыхРеквизитов, Новый ОписаниеТипов("ТаблицаЗначений"));
	Реквизиты.Добавить(РеквизитСвойства_ОписаниеЗависимыхДополнительныхРеквизитов);
	
	РеквизитТЗ_ИмяРеквизитаЗначение = Новый РеквизитФормы("ИмяРеквизитаЗначение", Новый ОписаниеТипов("Строка"), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_ИмяРеквизитаЗначение);
	
	РеквизитТЗ_Доступен = Новый РеквизитФормы("Доступен", Новый ОписаниеТипов("Булево"), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_Доступен);
	
	РеквизитТЗ_УсловиеДоступности = Новый РеквизитФормы("УсловиеДоступности", Новый ОписаниеТипов(), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_УсловиеДоступности);
	
	РеквизитТЗ_Виден = Новый РеквизитФормы("Виден", Новый ОписаниеТипов("Булево"), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_Виден);
	
	РеквизитТЗ_УсловиеВидимости = Новый РеквизитФормы("УсловиеВидимости", Новый ОписаниеТипов(), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_УсловиеВидимости);
	
	РеквизитТЗ_ЗаполнятьОбязательно = Новый РеквизитФормы("ЗаполнятьОбязательно", Новый ОписаниеТипов("Булево"), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_ЗаполнятьОбязательно);
	
	РеквизитТЗ_УсловиеОбязательностиЗаполнения = Новый РеквизитФормы("УсловиеОбязательностиЗаполнения", Новый ОписаниеТипов(), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_УсловиеОбязательностиЗаполнения);
	
	РеквизитТЗ_ВыводитьВВидеГиперссылки = Новый РеквизитФормы("ВыводитьВВидеГиперссылки", Новый ОписаниеТипов("Булево"), ТаблицаЗависимыхРеквизитов);
	Реквизиты.Добавить(РеквизитТЗ_ВыводитьВВидеГиперссылки);
	
	// Добавление реквизита содержащего элементы создаваемых групп дополнительных реквизитов.
	РеквизитСвойства_ЭлементыГруппДополнительныхРеквизитов = Новый РеквизитФормы("Свойства_ЭлементыГруппДополнительныхРеквизитов", Новый ОписаниеТипов("СписокЗначений"));
	Реквизиты.Добавить(РеквизитСвойства_ЭлементыГруппДополнительныхРеквизитов);
	
	// Добавление реквизита с именем элемента в котором будут размещаться поля ввода.
	РеквизитСвойства_ИмяЭлементаДляРазмещения = Новый РеквизитФормы("Свойства_ИмяЭлементаДляРазмещения", Новый ОписаниеТипов());
	Реквизиты.Добавить(РеквизитСвойства_ИмяЭлементаДляРазмещения);
	
	// Метки
	РеквизитСвойства_ИмяЭлементаДляРазмещенияМеток = Новый РеквизитФормы("Свойства_ИмяЭлементаДляРазмещенияМеток",Новый ОписаниеТипов("Строка"));
	Реквизиты.Добавить(РеквизитСвойства_ИмяЭлементаДляРазмещенияМеток);
	
	РеквизитСвойства_УстановленныеМетки = Новый РеквизитФормы("Свойства_УстановленныеМетки",Новый ОписаниеТипов("СписокЗначений"));
	Реквизиты.Добавить(РеквизитСвойства_УстановленныеМетки);
	
	РеквизитСвойства_ИмяЭлементаДляРазмещенияЛегендыМеток = Новый РеквизитФормы("Свойства_ИмяЭлементаДляРазмещенияЛегендыМеток",Новый ОписаниеТипов("Строка"));
	Реквизиты.Добавить(РеквизитСвойства_ИмяЭлементаДляРазмещенияЛегендыМеток);
	
	// Добавление реквизита описания создаваемых меток.
	ИмяОписания = "Свойства_ОписаниеЛегендыМеток";
	РеквизитСвойства_ОписаниеЛегендыМеток = Новый РеквизитФормы(ИмяОписания, Новый ОписаниеТипов("ТаблицаЗначений"));
	Реквизиты.Добавить(РеквизитСвойства_ОписаниеЛегендыМеток);
	
	РеквизитТЗ_Метка = Новый РеквизитФормы("Метка", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"), ИмяОписания);
	Реквизиты.Добавить(РеквизитТЗ_Метка);
	
	РеквизитТЗ_ИмяМетки = Новый РеквизитФормы("ИмяМетки", Новый ОписаниеТипов("Строка"), ИмяОписания);
	Реквизиты.Добавить(РеквизитТЗ_ИмяМетки);
	
	РеквизитТЗ_ОтборПоМетке = Новый РеквизитФормы("ОтборПоМетке", Новый ОписаниеТипов("Булево"), ИмяОписания);
	Реквизиты.Добавить(РеквизитТЗ_ОтборПоМетке);

	ИзменитьРеквизиты(Реквизиты);

КонецПроцедуры

&НаСервере
Функция ПоместитьРезультатВоВременноеХранилище()
	
	ПартнерОбъект = ЭтотОбъект.Ссылка.ПолучитьОбъект();
	УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(ЭтотОбъект, ПартнерОбъект, Истина);
	Возврат ПоместитьВоВременноеХранилище(ПартнерОбъект.ДополнительныеРеквизиты.Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
