#Область ПрограммныйИнтерфейс

#Область Справочник_Организации

Процедура ОбработкаПолученияФормыОрганизации(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ВидФормы = "ФормаСписка" Тогда
		Возврат;
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
		
    	ТипОЕ = ОрганизацииВызовСервераУХ.ТипОЕ(Параметры);
		Если ТипОЕ.Количество() Тогда
			Параметры.Отбор.Вставить("ТипОЕ", ТипОЕ);	
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
		Возврат;//ЕРПУХ
	ИначеЕсли Не УчетМСФОПовтИспУХ.ЕстьРСБУ() Тогда
		Возврат;//ВЕ
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ)
		ИЛИ Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ВыбраннаяФорма = "ФормаОрганизации";
		
	ИначеЕсли Не (Параметры.Свойство("ОтключитьФормуУХ") И Параметры.ОтключитьФормуУХ = Истина) Тогда 
		
		// Новая организация
		ВыбраннаяФорма = "ФормаВыбораТипаОрганизации";
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ФормыБМ

Процедура ПолеФормыПриИзменении(Форма, Элемент) Экспорт

	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		ПолеФормыПриИзменении_ДоговорыКонтрагентов(Форма, Элемент);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаОрганизации" Тогда
		ПолеФормыПриИзменении_Организации(Форма, Элемент);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ЦенныеБумаги.Форма.ФормаЭлемента" Тогда
		ПолеФормыПриИзменении_ЦенныеБумаги(Форма, Элемент);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеФормыПриИзменении_ДоговорыКонтрагентов(Форма, Элемент)

	Элементы 	= Форма.Элементы;
	Ссылка 		= Форма.Объект.Ссылка;
	
	Если Элемент = Элементы.ПараметрыУчетаФИ Тогда
		УправлениеФормой_ДоговорыКонтрагентов(Форма);
	ИначеЕсли Элемент = Форма.Команды.ХеджируемыеДоговоры Тогда
		
		Если Ссылка.Пустая() Тогда
			Сообщение = НСтр("ru = 'Для ввода информации о хеджируемых договорах необходимо записать текущий договор'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			Возврат; 
		КонецЕсли;
		
		ВидСвязи = ПредопределенноеЗначение("Справочник.ВидыСвязейОбъектов.ДоговорНаПокупкуВалюты");
		Отбор = Новый Структура("СвязанныйДоговор, ВидСвязи", Ссылка, ВидСвязи);
		#Если Клиент Тогда
		ОткрытьФорму("РегистрСведений.СвязанныеДоговоры.ФормаСписка", Новый Структура("Отбор", Отбор), Форма, Истина);
		#КонецЕсли
		
	ИначеЕсли Элемент = Форма.Команды.ОбъектыПоФИ Тогда
		
		Если Ссылка.Пустая() Тогда
			Сообщение = НСтр("ru = 'Для ввода информации о финансируемых объектах необходимо записать текущий договор'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			Возврат; 
		КонецЕсли;
		
		Отбор = Новый Структура("ОбъектыПоФИ", Ссылка);
		#Если Клиент Тогда
		ОткрытьФорму("РегистрСведений.ОбъектыПоФИ.ФормаСписка", Новый Структура("Отбор", Отбор), Форма, Истина);
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеФормыПриИзменении_Организации(Форма, Элемент)
	
	Если Элемент.Имя = "УПМСФО0" Тогда
		
		ОткрытьУстановкуУП(Форма, Неопределено);	
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "УПМСФО") Тогда
		
		Если СтрЗаканчиваетсяНа(Элемент.Имя, "История") Тогда
		
			СтандартнаяОбработка = Ложь;
			
			Организация = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Форма.Объект.Ссылка);
			Организация.Добавить(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
			Отбор = Новый Структура("Организация", Организация);
			
			#Если Клиент Тогда
				ОткрытьФорму("РегистрСведений.УчетныеПолитикиМСФО.ФормаСписка", Новый Структура("Отбор", Отбор));
			#КонецЕсли
				
		ИначеЕсли СтрЗаканчиваетсяНа(Элемент.Имя, "Установить") Тогда
			
			СтандартнаяОбработка = Ложь;
			
			НомерУП = СтрЗаменить(Элемент.Имя, "УПМСФО", "");
			НомерУП = СтрЗаменить(НомерУП, "Установить", "");
				
			ОткрытьУстановкуУП(Форма, Число(НомерУП));
						
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОткрытьУстановкуУП(Форма, НомерУП = Неопределено)
	
	Если ЗначениеЗаполнено(НомерУП) И ЗначениеЗаполнено(Форма.УчетныеПолитикиМСФО) Тогда
		ПараметрыУП = Форма.УчетныеПолитикиМСФО.Получить(НомерУП-1); 
	Иначе
		СценарийМСФО = ПредопределенноеЗначение("Справочник.Сценарии.Факт");
		#Если Клиент Тогда
			СценарийМСФО = ОбщегоНазначенияКлиент.ОбщийМодуль("УчетМСФОПовтИспУХ").ПолучитьСценарийМСФО();
		#КонецЕсли
		ПараметрыУП = Новый Структура("Сценарий, УчетнаяПолитика", СценарийМСФО);
	КонецЕсли;
	
	ЗначенияЗаполненияУП = Новый Структура("Сценарий, Период, Организация, УчетнаяПолитика",
		ПараметрыУП.Сценарий, ТекущаяДата(), Форма.Объект.Ссылка, ПараметрыУП.УчетнаяПолитика);
		
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполненияУП);
	#Если Клиент Тогда                                                                  
		ДопПараметры = Новый Структура("Форма", Форма);
		Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбновитьУПМСФО", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("РегистрСведений.УчетныеПолитикиМСФО.ФормаЗаписи", ПараметрыФормы, Форма, Истина, ,,Оповещение);
	#КонецЕсли

КонецПроцедуры

Процедура Подключаемый_ОбновитьУПМСФО(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 

	Форма = ДополнительныеПараметры.Форма;
	
	Форма.УчетныеПолитикиМСФО = Неопределено;//надо перезаполнить УПМСФО
	УправлениеФормой(Форма);

КонецПроцедуры

Процедура ПолеФормыПриИзменении_ЦенныеБумаги(Форма, Элемент)

КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		УправлениеФормой_ДоговорыКонтрагентов(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаОрганизации" Тогда
		УправлениеФормой_Организации(Форма);
	КонецЕсли;
		
КонецПроцедуры	

Процедура УправлениеФормой_ДоговорыКонтрагентов(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ПараметрыУчетаФИ.Видимость = 
		Не ЗначениеЗаполнено(Объект.Дата)
		Или Не ЗначениеЗаполнено(Объект.СрокДействия)
		Или (ОбщегоНазначенияКлиентСерверУХ.РазностьДатВДнях(Объект.СрокДействия, Объект.Дата) >= 365);
	
	ВидОФХ = Неопределено;
	РеквизитыВидаФИ = Новый Структура("ПроизводныйФИ,СпособУчета,СпрС",Ложь, Ложь, Ложь);
		
	Если Не Объект.ПараметрыУчетаФИ.Пустая() Тогда		
		
		ВидОФХ = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(Объект.ПараметрыУчетаФИ, "ВидОбъектаФинансовогоХарактера");
		РеквизитыВидаФИ = ОбщегоНазначенияУХ.ПолучитьЗначенияРеквизитов(ВидОФХ, "ПроизводныйФИ,СпособУчета");
		РеквизитыВидаФИ.Вставить("СпрС", РеквизитыВидаФИ.СпособУчета = ПредопределенноеЗначение("Перечисление.СпособыУчетаФинансовыхИнструментов.ПоСправедливойСтоимости"));
				
	КонецЕсли;
	
	Элементы.УровеньИерархииСправедливойСтоимости.Видимость = РеквизитыВидаФИ.СпрС;
	Если Не РеквизитыВидаФИ.СпрС Тогда
		Объект.УровеньИерархииСправедливойСтоимости = ПредопределенноеЗначение("Перечисление.УровеньИерархииСправедливойСтоимости.ПустаяСсылка");
	КонецЕсли;
		
	Элементы.ХеджируемыеДоговоры.Видимость = РеквизитыВидаФИ.ПроизводныйФИ;
	Элементы.Котировка.Видимость = РеквизитыВидаФИ.ПроизводныйФИ;

КонецПроцедуры

Процедура УправлениеФормой_Организации(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("УПМСФО1") = Неопределено
		ИЛИ ЗначениеЗаполнено(Форма.УчетныеПолитикиМСФО) Тогда
		Возврат;		
	КонецЕсли;
	
	УПМСФО = МСФОВызовСервераУХ.ПараметрыУПМСФО(Форма.Объект.Ссылка);
	Форма.УчетныеПолитикиМСФО = Новый ФиксированныйМассив(УПМСФО);
	НетУП = Истина;
	
	Для НомерУП = 1 По 3 Цикл
		
		Имя = "УПМСФО" + НомерУП;
			
		Форма[Имя] = Неопределено;
		Если (УПМСФО.Количество() >= НомерУП) И ЗначениеЗаполнено(УПМСФО[НомерУП-1].УчетнаяПолитика) Тогда
			Форма[Имя] = УПМСФО[НомерУП-1].УчетнаяПолитика;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "Группа" + Имя, "Видимость", ЗначениеЗаполнено(Форма[Имя]));
				
		Если Не ЗначениеЗаполнено(Форма[Имя]) Тогда
			Продолжить;
		КонецЕсли;		
		
		ТекущаяУП = УПМСФО[НомерУП-1];
		НетУП = Ложь;
		
		Заголовок = НСтр("ru = 'Учетная политика <%1> действует с %2 (сценарий <%3>)'");
		Заголовок = СтрШаблон(Заголовок, ТекущаяУП.УчетнаяПолитика, Формат(ТекущаяУП.ПрименяетсяС, "ДЛФ=D"), ТекущаяУП.Сценарий);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "Группа" + Имя, "Заголовок", Заголовок);
		
		ТекстУП = Новый Массив;
		ДобавитьФорматСсылки(ТекстУП, НСтр("ru = 'План счетов учета: '"), 			ТекущаяУП.ПланСчетовУчета);
		ДобавитьФорматСсылки(ТекстУП, НСтр("ru = 'Валюта учета: '"), 				ТекущаяУП.ВалютаУчета);
		ДобавитьФорматСсылки(ТекстУП, НСтр("ru = 'Дополнительная валюта учета: '"),	ТекущаяУП.ВалютаУчетаДоп);
		ДобавитьФорматСсылки(ТекстУП, НСтр("ru = 'Шаблон трансляции: '"), 			ТекущаяУП.ШаблонТрансляции);
		ДобавитьФорматСсылки(ТекстУП, НСтр("ru = 'Модель учета: '"), 				ТекущаяУП.МодельУчетаМСФО, Ложь);
		ДобавитьФорматСсылки(ТекстУП, НСтр("ru = 'Способ трансляции: '"),			ТекущаяУП.СпособТрансляции, Ложь);
	    Форма[Имя + "_Описание"] = Новый ФорматированнаяСтрока(ТекстУП);
		
		Высота = СтрЧислоСтрок(Форма[Имя + "_Описание"]) + 2;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, Имя + "_Описание", "Высота", Высота);

	КонецЦикла;
    		
	Элементы.ГруппаНетУП.Видимость = НетУП;

КонецПроцедуры

Функция ДобавитьФорматСсылки(УПМСФО, ЗаголовокСсылки = Неопределено, ЗначениеСсылки = Неопределено, 
							ДобавитьСсылку = Истина, ПереносСтроки = Истина)

	Если ЗаголовокСсылки <> Неопределено Тогда
		УПМСФО.Добавить(?(ПереносСтроки И УПМСФО.Количество(), Символы.ПС, "") + ЗаголовокСсылки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСсылки) Тогда
		СсылкаФ = ?(ДобавитьСсылку, ПолучитьНавигационнуюСсылку(ЗначениеСсылки), Неопределено);
		УПМСФО.Добавить(Новый ФорматированнаяСтрока(Строка(ЗначениеСсылки), ,  , , СсылкаФ));
	ИначеЕсли ЗаголовокСсылки <> Неопределено Тогда
		УПМСФО.Добавить(НСтр("ru = '<Не установлено>'"));
	КонецЕсли;
	
	Возврат УПМСФО;

КонецФункции

#КонецОбласти

#Область Документ_ПлатежноеПоручение

Процедура ПереопределитьПолучаемуюФормуДокументаДДСУХ(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	//** ВстраиваниеУХВызовСервера.ПереопределитьПолучаемуюФормуДокументаДДС(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Документ_УведомлениеОСпецрежимахНалогообложения

Процедура ПолучениеФормыУведомленияОКонтролируемыхИООбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Ключ = Неопределено;
		ВидУведомления = Неопределено;
		Если Параметры.Свойство("Ключ", Ключ) ИЛИ Параметры.Свойство("ВидУведомления", ВидУведомления) Тогда
			Если ТипЗнч(Ключ) = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения") Тогда
				ВидУведомления = Ключ.ВидУведомления;
			КонецЕсли;
			Если ВидУведомления = ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаУ_ИО") 
					ИЛИ ВидУведомления = ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаКИК") Тогда
				ВыбраннаяФорма = "ФормаДокументаУХ";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область Справочник_ДоговорыКонтрагентов

Процедура ДоговорыКонтрагентовОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	ВстраиваниеУХВызовСервера.ДоговорыКонтрагентовОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
КонецПроцедуры

Функция ПараметрыВыбораДоговора(ЭтоПокупка = Истина, Прочие = Истина) Экспорт
	
	Если ЭтоПокупка Тогда
		ХО = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика");
	Иначе
		ХО = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияПрочихАктивов");	
	КонецЕсли;

	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый ПараметрВыбора("Отбор.ХозяйственнаяОперация", ХО));
	
КонецФункции

#КонецОбласти

#Область Справочник_ДоговорыКонтрагентов_ИменаРеквизитов_БМНМ

Функция ИмяРеквизитаКонтрагент(ТипФИ = Неопределено) Экспорт
	
	Если ТипФИ = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
		Возврат "Эмитент";
	Иначе	
		Возврат "Контрагент";
	КонецЕсли;
	
КонецФункции

Функция ИмяРеквизитаВидДоговора(ВидДоговораУХ = Неопределено) Экспорт

	Возврат "ТипДоговора";

КонецФункции

Функция ИмяРеквизитаСуммаДоговора(ТипДоговора = Неопределено) Экспорт

	Если ТипДоговора = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		Возврат "СуммаТраншей";
	ИначеЕсли ТипДоговора = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
		Возврат "Номинал";
	ИначеЕсли ТипДоговора = Тип("СправочникСсылка.ДоговорыАренды") Тогда
		Возврат НЕОПРЕДЕЛЕНО;
	Иначе 
		Возврат "Сумма";
	КонецЕсли;
	
КонецФункции

Функция ИмяРеквизитаСрокДействияДоговора(ТипДоговора = Неопределено) Экспорт
	
	Если ТипДоговора = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
		Возврат "СрокПогашения";
	ИначеЕсли ТипДоговора = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		Возврат "ДатаПоследнегоПлатежа";
	Иначе	
		Возврат "ДатаОкончанияДействия";
	КонецЕсли;
	
КонецФункции

Функция ИмяРеквизитаДатаНачала(ТипФИ = Неопределено) Экспорт
	
	Если ТипФИ = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
		Возврат "ДатаВыпуска";
	ИначеЕсли ТипФИ = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		Возврат "ДатаПервогоТранша";		
	Иначе	
		Возврат "ДатаНачалаДействия";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ВНА

Функция ПолучитьТипОС() Экспорт
	Возврат Тип("СправочникСсылка.ОбъектыЭксплуатации");
КонецФункции

Функция ПолучитьПустуюСсылкуОС() Экспорт
	Возврат ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
КонецФункции

Функция ПолучитьПустуюСсылкуРБП() Экспорт
	Возврат ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
КонецФункции

Функция ПолучитьПустуюСсылкуДБП() Экспорт
	Возврат ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
КонецФункции

Функция ПолучитьПустуюСсылкуПрочиеДоходыРасходы() Экспорт

	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
	
КонецФункции

#КонецОбласти

#Область МСФО_КлючевыеСубконто

Функция ПолучитьКлючевыеСубконтоМПЗ(РеквизитыНоменклатуры = Истина, Аналитики = Ложь) Экспорт
	
	КлючевыеСубконто = Новый Соответствие;	
	КлючевыеСубконто.Вставить(Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), "Номенклатура");
	
	Если РеквизитыНоменклатуры Тогда
		//БП КлючевыеСубконто.Вставить(Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"), "НоменклатурныеГруппы");
				
		КлючевыеСубконто.Вставить(Новый ОписаниеТипов("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры"),	"ГруппаФинансовогоУчета");
		КлючевыеСубконто.Вставить(Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы"),						"ЦеноваяГруппа");
		КлючевыеСубконто.Вставить(Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"),					"ТипНоменклатуры");
		КлючевыеСубконто.Вставить(Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"), 					"ВидНоменклатуры");
		КлючевыеСубконто.Вставить(Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаНоменклатуры"), 			"ГруппаДоступа");
	
	КонецЕсли;	
	
	Возврат КлючевыеСубконто;	
	
КонецФункции
	
#КонецОбласти 

#Область МСФО_РасчетСебестоимости

Функция ЭлементЗатрат_МатериальныеЗатраты() Экспорт

	Возврат ПредопределенноеЗначение("Перечисление.ТипыЗатрат.Материальные"); 

КонецФункции

Функция ЭлементЗатрат_Амортизация() Экспорт

	Возврат ПредопределенноеЗначение("Перечисление.ТипыЗатрат.Амортизация"); 

КонецФункции

Функция ЭлементЗатрат_ОплатаТруда() Экспорт

	Возврат ПредопределенноеЗначение("Перечисление.ТипыЗатрат.ОплатаТруда"); 

КонецФункции

Функция ЭлементЗатрат_ОтчисленияНаСоциальныеНужды() Экспорт

	Возврат ПредопределенноеЗначение("Перечисление.ТипыЗатрат.ОплатаТруда"); 

КонецФункции

Функция ЭлементЗатрат_ПрочиеЗатраты() Экспорт

	Возврат ПредопределенноеЗначение("Перечисление.ТипыЗатрат.Прочее"); 

КонецФункции

Функция ТипыСтатьиЗатрат() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(Тип("СправочникСсылка.Номенклатура"));
	Результат.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	Результат.Добавить(Тип("СправочникСсылка.ВидыРаботСотрудников"));
	
	Возврат Результат;
	
КонецФункции

Функция ТипыНезаменяемыеВНА() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(Тип("СправочникСсылка.Номенклатура"));
	Результат.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	
	Возврат Результат;	

КонецФункции

Функция ТипыЭлементыЗатрат() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Тип("ПеречислениеСсылка.ТипыЗатрат"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ИмяРеквизитаДоговорЗаказПоставщику() Экспорт

	Возврат "Договор";  
	
КонецФункции

#Область ИзменитьПараметрыВыбораПолейСубконто

//Функция ЗаполнитьПараметрыПоСчету(ЗначенияПараметров, Контекст, ИмяСчетУчета = Неопределено, 
//									ИмяСубконтоКонтрагент = Неопределено, НомерСубконто = Неопределено) Экспорт

//	Если ИмяСчетУчета <> Неопределено Тогда
//		ЗначенияПараметров.СчетУчета = Контекст[ИмяСчетУчета];
//		
//		Если ЗначениеЗаполнено(ЗначенияПараметров.СчетУчета) Тогда
//			СвойстваСчета = УчетМСФОПовтИспУХ.ПолучитьСвойстваСчета(ЗначенияПараметров.СчетУчета);
//			ЗначенияПараметров.ВидСубконто = СвойстваСчета["ВидСубконто" + НомерСубконто + "Ссылка"];
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если ИмяСубконтоКонтрагент <> Неопределено Тогда
//		ЗначенияПараметров.Контрагент = Контекст[ИмяСубконтоКонтрагент];
//	КонецЕсли;

//КонецФункции

Функция ПустыеОтборыТипов() Экспорт
	
	ПустыеПараметрыТипов = Новый Структура(
		"Организация,
		|Контрагент,
		|СчетУчета,
		|ВидСубконто,
		|ПланСчетов,
		|ПланСчетовИсточник");
	
	Возврат Новый Структура("Параметры", ПустыеПараметрыТипов);

КонецФункции

Функция ЗначенияПараметровОтбораТипов(Контекст, Форма = Неопределено) Экспорт

	//Стадия1:начальные параметры (из шапки документа)
	ЗначенияПараметров = ПустыеОтборыТипов().Параметры;
	ЗаполнитьЗначенияСвойств(ЗначенияПараметров, Контекст);
	
	Кэш = МСФОКлиентСерверУХ.ПоляОбъекта(Форма, "КэшируемыеЗначения").КэшируемыеЗначения;
	
	Если ЗначениеЗаполнено(Кэш) Тогда
		
		Если Кэш.Свойство("ШаблонТрансляции") Тогда
			
			ШаблонТР = ОбщегоНазначенияУХ.ЗначенияРеквизитовОбъекта(
				Кэш.ШаблонТрансляции, "ПланСчетовПриемник, ПланСчетовИсточник");
			
			ЗначенияПараметров.Вставить("ПланСчетов", ШаблонТР.ПланСчетовПриемник);
			ЗначенияПараметров.Вставить("ПланСчетовИсточник", ШаблонТР.ПланСчетовИсточник);
		Иначе 
			
			ЗначенияПараметров.Вставить("ПланСчетов", 
					ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Кэш, "ПланСчетовМСФО"));
			ЗначенияПараметров.Вставить("ПланСчетовИсточник", 
					ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Кэш, "ПланСчетовНСБУ"));
			
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(ЗначенияПараметров.ПланСчетов) Тогда
			
			КонтекстУП = Новый Структура("Организация, Сценарий, Дата");
			ЗаполнитьЗначенияСвойств(КонтекстУП, Контекст);
			РеквизитыУП = МСФОВызовСервераУХ.РеквизитыДляФормыУП(
				КонтекстУП.Организация, КонтекстУП.Дата, КонтекстУП.Сценарий);
				
			ЗначенияПараметров.Вставить("ПланСчетов", РеквизитыУП.ПланСчетовМСФО);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗначенияПараметров.ПланСчетовИсточник) Тогда
			
			КонтекстУП = Новый Структура("Организация, Сценарий, Дата");
			ЗаполнитьЗначенияСвойств(КонтекстУП, Контекст);
			РеквизитыУП = МСФОВызовСервераУХ.РеквизитыДляФормыУП(
				КонтекстУП.Организация, КонтекстУП.Дата, КонтекстУП.Сценарий);
				
			ЗначенияПараметров.Вставить("ПланСчетовИсточник", РеквизитыУП.ПланСчетов);
			
			Если Не ЗначениеЗаполнено(РеквизитыУП.ПланСчетов) Тогда
				ТекстСообщения = НСтр("ru = 'У организации <%1> не указан план счетов источника (национальный)'");
				Сообщить(СтрШаблон(ТекстСообщения, ЗначенияПараметров.Организация));
				Возврат Неопределено;
			КонецЕсли;

		КонецЕсли;
				
	КонецЕсли;
	
	Возврат ЗначенияПараметров;
	
КонецФункции

Функция ТипыКэшируемыеТаблицей() Экспорт

	Результат = Новый Соответствие;
	Результат.Вставить("СправочникСсылка_ДоговорыКонтрагентов", 		Истина);//владелец-Контрагент
	Результат.Вставить("СправочникСсылка_Субконто", 					Истина);//владелец-ПВХ
	Результат.Вставить("СправочникСсылка_ПроизвольныйКлассификаторУХ", 	Истина);//владелец-ПВХ
	//Результат.Вставить(Тип("СправочникСсылка.СчетаБД"), Истина);//  на каждый план счетов своя таблица
	
	Возврат Результат;

КонецФункции

Процедура ЗаполнитьНомераСубконтоКэшаСчетов(СтрокаКэшаСчетов) Экспорт
	
	НомераСубконто = Новый Структура;
	ИменаКолонок = Новый Структура("ТипыПоиска1,ТипыПоиска2,ТипыПоиска3", 1, 2, 3);
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		
		ЗначенияТипов = СтрокаКэшаСчетов[ИмяКолонки.Ключ];
		
		Если ЗначенияТипов = Неопределено Тогда
			Продолжить;
		ИначеЕсли ЗначенияТипов.Найти(Тип("СправочникСсылка.ДоговорыКонтрагентов")) <> Неопределено Тогда
			
			Для каждого ИмяК Из ИменаКолонок Цикл
				
				ТипыК = СтрокаКэшаСчетов[ИмяК.Ключ];
				Если ТипыК = Неопределено Тогда
					Продолжить;
				ИначеЕсли ТипыК.Найти(Тип("СправочникСсылка.Контрагенты"))  <> Неопределено Тогда
					НомераСубконто.Вставить("Контрагент", ИмяК.Значение);
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
		ИначеЕсли ЗначенияТипов.Найти(Тип("СправочникСсылка.ПроизвольныйКлассификаторУХ")) <> Неопределено Тогда 
			
			НомераСубконто.Вставить("ВидСубконто", СтрокаКэшаСчетов["ВидСубконто" + ИмяКолонки.Значение]); 
			
		ИначеЕсли ЗначенияТипов.Найти(Тип("СправочникСсылка.Субконто")) <> Неопределено Тогда	
			
			НомераСубконто.Вставить("ВидСубконто", СтрокаКэшаСчетов["ВидСубконто" + ИмяКолонки.Значение]);
			
		ИначеЕсли ЗначенияТипов.Найти(Тип("СправочникСсылка.СчетаБД")) <> Неопределено Тогда	
			
			НомераСубконто.Вставить("Владелец", СтрокаКэшаСчетов["ВидСубконто" + ИмяКолонки.Значение]);
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если НомераСубконто.Количество() Тогда
		СтрокаКэшаСчетов.НомераСубконто = НомераСубконто;	
	КонецЕсли;
			
КонецПроцедуры

Процедура ДоработатьУточнениеПоиска(УточненияПоиска, СтрокаТаб, КолонкаТаб, КолонкиЗагрузки, КэшСчета) Экспорт
	
	Если КэшСчета.НомераСубконто.Свойство("Контрагент") Тогда
		
		Отбор = Новый Структура("ИмяСчетаДляСубконто, НомерСубконто", 
		КолонкаТаб.ИмяСчетаДляСубконто, 
		КэшСчета.НомераСубконто.Контрагент
		);
		
		КолонкиУточнения = КолонкиЗагрузки.НайтиСтроки(Отбор);
		Для каждого КолонкаУточнение Из КолонкиУточнения Цикл
			УточненияПоиска.Вставить("Владелец", СтрокаТаб[КолонкаУточнение.Имя]);
		КонецЦикла;
		
	КонецЕсли;
	
	Если КэшСчета.НомераСубконто.Свойство("ВидСубконто") Тогда
		УточненияПоиска.Вставить("Владелец", КэшСчета.НомераСубконто.ВидСубконто);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДоработатьОтборКэша(Отбор, ТекущийТип, УточнениеПоиска) Экспорт

	Если ТекущийТип = ("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Отбор.Вставить("Владелец", УточнениеПоиска.Контрагент);
	ИначеЕсли ТекущийТип = ("СправочникСсылка.ПроизвольныйКлассификаторУХ") Тогда
		Отбор.Вставить("Владелец", УточнениеПоиска.ВидСубконто);
	ИначеЕсли ТекущийТип = ("СправочникСсылка.Субконто") Тогда
		Отбор.Вставить("Владелец", УточнениеПоиска.ВидСубконто);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Функция ИмяСправочникаПодразделения() Экспорт

	Возврат "Справочник.СтруктураПредприятия";

КонецФункции

Функция ТипДокументСсылкаПоступлениеТоваровУслуг() Экспорт
	Возврат Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
КонецФункции

Функция ИмяСправочникаБанковскиеСчетаКонтрагентов() Экспорт
	
	Если ПолучитьПодсистемуКазначейство() Тогда 
		ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер = ПолучитьМодульДенежныеСредстваВстраиваниеУХКлиентСервер();
		Возврат ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер.ИмяСправочникаБанковскиеСчетаКонтрагентов();
	Иначе
		Возврат "БанковскиеСчета";
	КонецЕсли;	
	
КонецФункции  

Функция ТипБанковскиеСчетаОрганизаций() Экспорт
	
	Если ПолучитьПодсистемуКазначейство() Тогда 
		ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер = ПолучитьМодульДенежныеСредстваВстраиваниеУХКлиентСервер();
		Возврат ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер.ТипБанковскиеСчетаОрганизаций();
	Иначе
		Возврат Тип("СправочникСсылка.БанковскиеСчетаОрганизаций");
	КонецЕсли;

КонецФункции  

Функция ПолучитьПустойБанковскийСчетКонтрагента() Экспорт
	
	Если ПолучитьПодсистемуКазначейство() Тогда 
		ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер = ПолучитьМодульДенежныеСредстваВстраиваниеУХКлиентСервер();
		Возврат ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер.ПолучитьПустойБанковскийСчетКонтрагента();
	Иначе
		Возврат ПредопределенноеЗначение("Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка");
	КонецЕсли;

КонецФункции

Функция ТипБанковскиеСчетаКонтрагентов() Экспорт  
		
	Если ПолучитьПодсистемуКазначейство() Тогда 
		ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер = ПолучитьМодульДенежныеСредстваВстраиваниеУХКлиентСервер();
		Возврат ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер.ТипБанковскиеСчетаКонтрагентов();
	Иначе
		Возврат Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов");
	КонецЕсли;

КонецФункции

Функция ПодставитьИмяТаблицыБанковскогоСчетаОрганизацийВТекстЗапроса(ТекстЗапроса) Экспорт
	Если ПолучитьПодсистемуКазначейство() Тогда 
		ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер = ПолучитьМодульДенежныеСредстваВстраиваниеУХКлиентСервер();
		Возврат ОбщийМодульДенежныеСредстваВстраиваниеУХКлиентСервер.ПодставитьИмяТаблицыБанковскогоСчетаОрганизацийВТекстЗапроса(ТекстЗапроса);
	Иначе
		Возврат ТекстЗапроса;
	КонецЕсли;

КонецФункции

#Область Подписки
	
Процедура ОбработкаПолученияДанныхВыбораОрганизацииОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Если Параметры.Отбор.Свойство("ВалютаЛимитирования") 
		И Параметры.Отбор.Свойство("СпособОпределенияВалютыЛимитирования")
		И Параметры.Отбор.СпособОпределенияВалютыЛимитирования = ПредопределенноеЗначение("Перечисление.СпособыОпределенияВалютыЛимитирования.ВалютаЛимитированияЦФО") Тогда
		
		СтандартнаяОбработка = Ложь;
		ЦФО = ВстраиваниеОПКВызовСервера.ЦФОПоВалютеЛимитирования(Параметры.Отбор.ВалютаЛимитирования, Параметры.СтрокаПоиска, Параметры.СпособПоискаСтроки);
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ЦФО);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПодсистемуКазначейство()

	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.КорпоративноеКазначейство");
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодсистемыУХ.КорпоративноеКазначейство");
	#КонецЕсли

КонецФункции // ()  

Функция ПолучитьМодульДенежныеСредстваВстраиваниеУХКлиентСервер()
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ДенежныеСредстваВстраиваниеУХКлиентСервер");
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ДенежныеСредстваВстраиваниеУХКлиентСервер");
	#КонецЕсли

КонецФункции // ()

#КонецОбласти

Функция ПолучитьПараметрыКарточкаСубконто(ДокументСсылка, ИмяРеквизитСубконто = Неопределено) Экспорт
	
	ЗначениеСубконто = Неопределено;
	Организация = Неопределено;
	Если ИмяРеквизитСубконто = Неопределено Тогда
		Если ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
			
			ЗначениеСубконто = ДокументСсылка;	
			
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			ЗначениеСубконто = ДокументСсылка;
			Организация = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(ДокументСсылка, "Организация");
			
		ИначеЕсли ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда //не БМ,НМ
			
			ТипДокумента = ТипЗнч(ДокументСсылка);
			Если (ТипДокумента = Тип("ДокументСсылка." + "ПоступлениеИнвестиций")) 
				Или (ТипДокумента = Тип("ДокументСсылка." + "ВыбытиеИнвестиций")) Тогда
				
				РеквизитыДок = ОбщегоНазначенияУХ.ПолучитьЗначенияРеквизитов(ДокументСсылка, "Организация,ОбъектИнвестирования");
				ЗначениеСубконто 	= РеквизитыДок.ОбъектИнвестирования;
				Организация 		= РеквизитыДок.Организация;
			
			КонецЕсли;
						
		Иначе 
			
			РеквизитыДок = ОбщегоНазначенияУХ.ПолучитьЗначенияРеквизитов(ДокументСсылка, "Организация,ФинансовыйИнструмент");
			
			ЗначениеСубконто 	= РеквизитыДок.ФинансовыйИнструмент;
			Организация 		= РеквизитыДок.Организация;
			
		КонецЕсли;;
	Иначе 
		
		РеквизитыДок = ОбщегоНазначенияУХ.ПолучитьЗначенияРеквизитов(ДокументСсылка, "Организация," + ИмяРеквизитСубконто);
		
		ЗначениеСубконто = РеквизитыДок[ИмяРеквизитСубконто];
		Организация = РеквизитыДок.Организация;
		
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.Организации") Тогда
		ОбъектИнвестирования = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(ДокументСсылка, "ОбъектИнвестирования");
		Контрагенты = ОрганизацииВызовСервераУХ.ПолучитьКонтрагентовПоОрганизации(ОбъектИнвестирования);
		Если Контрагенты.Количество() Тогда
			ЗначениеСубконто = Контрагенты[0];
		КонецЕсли;
	КонецЕсли;
	
	СписокВидовСубконто = Новый СписокЗначений;
	Если ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
		СписокВидовСубконто.Добавить(ПредопределенноеРСБУ("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги"));
	ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.Контрагенты") Тогда
		СписокВидовСубконто.Добавить(ПредопределенноеРСБУ("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты"));
	ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда	
		СписокВидовСубконто.Добавить(ПредопределенноеРСБУ("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры"));
	КонецЕсли;
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("НачалоПериода", Дата(1,1,1));
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КонецПериода", Дата(1,1,1));
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СписокВидовСубконто", СписокВидовСубконто);
	Если Организация <> Неопределено Тогда
		Организация = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(ДокументСсылка, "Организация");
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Организация", Организация);
	КонецЕсли;
	
	Отбор = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Субконто1", ВидСравненияКомпоновкиДанных.Равно, ЗначениеСубконто, , Истина);
	
	Возврат Новый Структура("ПользовательскиеНастройки,СформироватьПриОткрытии,ВидРасшифровки,РежимРасшифровки", 
								ПользовательскиеНастройки, Истина, 2, Истина);
	
КонецФункции

#Область ПодключаемыеКоманды

Функция ПредопределенноеРСБУ(ИмяПВХ)
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(ИмяПВХ);
КонецФункции

#КонецОбласти
