//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПартииВПроизводстве);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким партиям запущено производство?
	|В каком подразделении и на каком этапе (операции) находится выполнение?
	|Какие плановые сроки производства, есть ли задержка?';
	|en = 'Check by which lots production is running.
	|Track the business unit in charge and the execution stage (operation).
	|Verify the planned production duration and any possible delay.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
