
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсправитьДокумент(Ссылка, ИмяТипа) Экспорт

	Основание = Новый Структура("Ссылка, Действие", Ссылка, "Исправить");
	
	ОткрытьФорму(
		СтрШаблон("Документ.%1.ФормаОбъекта", ИмяТипа), 
		Новый Структура("Основание", Основание));
	
КонецПроцедуры

#Область МетодыОбслуживанияИсправленийВФормеДокумента

Процедура Исправить(Форма, ИсправляемыйДокумент = Неопределено, ПараметрыФормы = Неопределено) Экспорт

	Если ИсправляемыйДокумент = Неопределено Тогда
		Ссылка = Форма.Объект.Ссылка
	Иначе
		Ссылка = ИсправляемыйДокумент
	КонецЕсли;	
	
	Основание = Новый Структура("Ссылка, Действие", Ссылка, "Исправить");
	
	Если Форма.ВозможностиИсправления.ИсправлениеТекущимПериодом Тогда
		ДополнитьПоИсправляемомуДокументу(Основание, Форма, Ссылка);
	КонецЕсли;
	
	Параметры = Новый Структура("Основание", Основание);
	Если ПараметрыФормы <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Параметры, ПараметрыФормы, Ложь);
	КонецЕсли;
	
	ОткрытьФорму(Форма.ИмяФормы, Параметры);
	
КонецПроцедуры

Процедура ПерейтиКИсправлению(Форма, ДокументИсправление = Неопределено) Экспорт 
	ПерейтиКДокументу(
		Форма, 
		?(ДокументИсправление = Неопределено, 
			Форма.ДокументИсправление, 
			ДокументИсправление));
КонецПроцедуры

Процедура ПерейтиКИсправленному(Форма, ИсправленныйДокумент = Неопределено) Экспорт 
	ПерейтиКДокументу(
		Форма, 
		?(ИсправленныйДокумент = Неопределено, 
			Форма.Объект.ИсправленныйДокумент, 
			ИсправленныйДокумент));
КонецПроцедуры

Процедура Сторнировать(Форма, РеквизитНачислениеДокумента = "") Экспорт
	
	Ссылка = Форма.Объект.Ссылка;
	
	Основание = Новый Структура(
		"Ссылка, Действие, РеквизитНачислениеДокумента", 
		Ссылка, "Сторнировать", РеквизитНачислениеДокумента);
		
	Если Форма.ВозможностиИсправления.ИсправлениеТекущимПериодом Тогда
		ДополнитьПоИсправляемомуДокументу(Основание, Форма, Ссылка);
	КонецЕсли;	
	
	ОткрытьФорму(
		"Документ.СторнированиеНачислений.ФормаОбъекта", 
		Новый Структура("Основание", Основание),
		,
		Ссылка);
	
КонецПроцедуры

Процедура ПерейтиКСторно(Форма) Экспорт 
	ОткрытьФорму(
		"Документ.СторнированиеНачислений.ФормаОбъекта", 
		Новый Структура("Ключ", Форма.ДокументСторно));
КонецПроцедуры

Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	Документ = Форма.Объект.ИсправленныйДокумент;
	Источник = Форма.Объект.Ссылка;
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат
	КонецЕсли;
	
	ОповеститьОбИсправленииДокумента(
		Документ,
		Источник, 
		ПараметрыЗаписи.РежимЗаписи);
		
КонецПроцедуры	
	
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Ссылка = Форма.Объект.Ссылка;
	ОбновитьБлокировкуФормы = Ложь;
	Если ИмяСобытия = ИмяСобытияИсправленияДокумента() И Параметр.Документ = Ссылка Тогда
		ОбработкаОповещенияИсправленияДокумента(Форма, Параметр, Источник);
		ОбновитьБлокировкуФормы = Истина;
	ИначеЕсли ИмяСобытия = ИмяСобытияСторнированияДокумента() И Параметр.Документ = Ссылка Тогда
		ОбработкаОповещенияСторнированияДокумента(Форма, Параметр, Источник);
		ОбновитьБлокировкуФормы = Истина;
	Иначе
		ПараметрыИсправленного = Неопределено;
		ЭтоИсправление = ИсправлениеДокументовЗарплатаКадрыКлиентСервер.ЭтоИсправление(Форма, ПараметрыИсправленного);	
		Если ЭтоИсправление И Источник = ПараметрыИсправленного.Ссылка Тогда
			Форма.ПараметрыИсправленногоДокумента =
				ИсправлениеДокументовЗарплатаКадрыВызовСервера.ПрочитатьПараметрыИсправленногоДокумента(Источник);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбновитьБлокировкуФормы Тогда
		БлокировкаИзмененияОбъектовКлиентСервер.ОбновитьГруппуБлокировкиИзмененияОбъекта(Форма, Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьОповещениеСторнированияПоТипам(Форма, ИмяСобытия, Параметр, Типы) Экспорт
	
	Возврат ИмяСобытия = ИмяСобытияСторнированияДокумента() И Типы.СодержитТип(ТипЗнч(Параметр.Документ));
	
КонецФункции

#КонецОбласти

Функция ПроверитьСторнированиеОснований(ДокументСсылка, ЭтоПроведение, Отказ) Экспорт
	
	Сообщение = ИсправлениеДокументовЗарплатаКадрыВызовСервера.НайтиСторнированныеОснования(ДокументСсылка, ЭтоПроведение);
	Если Не ПустаяСтрока(Сообщение) Тогда
		ПоказатьПредупреждение(, Сообщение);
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьПоИсправляемомуДокументу(Основание, Форма, Ссылка)
	
	// Исходим из того, что исправляемые документы имеют реквизит Организация.
	Если Не Форма.Объект.Свойство("Организация") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПериодРегистрации = "ПериодРегистрации";
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, ИмяПериодРегистрации) Тогда
		ИмяПериодРегистрации = "МесяцНачисления";
	КонецЕсли;
	
	ПериодРегистрации = Форма.Объект[ИмяПериодРегистрации];
	Организация = Форма.Объект.Организация;
	
	Если Форма.ПроведенаВыплатаЗарплаты = НеОпределено Или Форма.ПроизведеноОтражение = НеОпределено Тогда
		ИсправлениеДокументовЗарплатаКадрыВызовСервера.ЗаполнитьВыплатаПроизводиласьОтражениеВУчетеПроизводилось(
			Организация, Ссылка, ПериодРегистрации, Форма.ПроведенаВыплатаЗарплаты, Форма.ПроизведеноОтражение)
	КонецЕсли;
	Основание.Вставить("ИмяПериодРегистрации", ИмяПериодРегистрации);
	Основание.Вставить("ПериодРегистрацииИсправленногоДокумента", ПериодРегистрации);
	
	Если Не(Форма.ПроведенаВыплатаЗарплаты Или Форма.ПроизведеноОтражение) Тогда
		Основание.Вставить("ДопустимоИсправлениеВТекущемПериоде", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерейтиКДокументу(Форма, Документ) 
	ОткрытьФорму(
		Форма.ИмяФормы, 
		Новый Структура("Ключ", Документ));
КонецПроцедуры

Функция ИмяСобытияИсправленияДокумента()
	Возврат "ИсправленДокумент"
КонецФункции	

Процедура ОповеститьОбИсправленииДокумента(ИсправляемыйДокумент, Источник, РежимЗаписи)
	
	Если Не ЗначениеЗаполнено(ИсправляемыйДокумент) Тогда
		Возврат
	КонецЕсли;
		
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("РежимЗаписи", РежимЗаписи); // Режим записи документа-исправления.
	ПараметрыОповещения.Вставить("Документ", ИсправляемыйДокумент);                    
	
	Оповестить(ИмяСобытияИсправленияДокумента(), ПараметрыОповещения, Источник);
	
КонецПроцедуры

Процедура ОбработкаОповещенияИсправленияДокумента(Форма, Параметр, Источник)
	
	Если Параметр.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Форма.ДокументИсправлен   = Истина;
		Форма.ДокументИсправление = Источник;
	Иначе
		Форма.ДокументИсправлен   = Ложь;
		Форма.ДокументИсправление = Неопределено;
	КонецЕсли;
	Форма.УстановитьПоляИсправленияНаКлиенте();
		
КонецПроцедуры	

Функция ИмяСобытияСторнированияДокумента()
	Возврат "ИзмененоСторнированиеНачислений"
КонецФункции	

Процедура ОповеститьОСторнированииДокумента(СторнируемыйДокумент, Источник, РежимЗаписиСторнирующего) Экспорт
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("РежимЗаписи", РежимЗаписиСторнирующего); 
	ПараметрыОповещения.Вставить("Документ", СторнируемыйДокумент);                    
	
	Оповестить(ИмяСобытияСторнированияДокумента(), ПараметрыОповещения, Источник);
	
КонецПроцедуры

Процедура ОбработкаОповещенияСторнированияДокумента(Форма, Параметр, Источник)
	
	Если Параметр.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Форма.ДокументСторнирован = Истина;
		Форма.ДокументСторно      = Источник;
	Иначе
		Форма.ДокументСторнирован = Ложь;
		Форма.ДокументСторно      = Неопределено;
	КонецЕсли;
	Форма.УстановитьПоляИсправленияНаКлиенте();
	
КонецПроцедуры	

#КонецОбласти
