#Область ПрограммныйИнтерфейс

Функция Представление() Экспорт
	
	Возврат НСтр("ru = 'Консоль кода';
				|en = 'Code console'");
	
КонецФункции

Функция Исполнить(Код, ВходныеПараметры, ИТК_Контекст, ИТК_ДополнительныеПараметры = Неопределено) Экспорт
	
	// Важно! Некоторые переменные имеет прификс ИТК чтобы не пересекатся с возможно искользуемыми
	// такими же без префикса
	
	Если ИТК_ДополнительныеПараметры = Неопределено Тогда
		ИТК_ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	// Подготовка параметров
	Параметры = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ВходныеПараметры);
	Для Каждого Параметр Из Параметры Цикл 
		
		Если ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
			
			НовоеЗначение = ИТК_ОбщийКлиентСервер.СписокЗначенийВМассив(Параметр.Значение);
			Параметры.Вставить(Параметр.Ключ, НовоеЗначение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Parameters = Параметры;
	
	ИсполняемыйКод = Код;
	Если НЕ СтрЗаканчиваетсяНа(ИсполняемыйКод, ";") Тогда // Добавим в конце ";" для более корректной ошибки
		ИсполняемыйКод = ИсполняемыйКод + ";";
	КонецЕсли;
	
	// Вставка параметров в исполняемый код
	КорректировкаНомераСтрокиОшибки = 0;
	СтрокиИнициализацииПараметров = Новый Массив;
	Для Каждого Параметр Из Параметры Цикл 
		СтрокиИнициализацииПараметров.Добавить(Параметр.Ключ + " = Параметры[""" + Параметр.Ключ + """];");
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокиИнициализацииПараметров) Тогда
		
		КорректировкаНомераСтрокиОшибки = -1;
		ИсполняемыйКод =  СтрСоединить(СтрокиИнициализацииПараметров, Символы.НПП) + Символы.ПС + ИсполняемыйКод;
		
	КонецЕсли;
	
	// Дополнение кода для возвращения значений используемых переменных
	ИТК_Переменные = Новый Структура;
	ИспользуемыеПеременные = ИТК_ЗащитаЛицензированиеВызовСервера.Код_ИспользуемыеПеременные(Код);
	Для Каждого ИмяПеременной Из ИспользуемыеПеременные Цикл 
		
		ИсполняемыйКод = ИсполняемыйКод
				+ Символы.ПС + СтрШаблон("ИТК_Переменные.Вставить(""%1"", %1);", ИмяПеременной);
		
	КонецЦикла;
		
	// Начало замера времени выполнения --------------------------------------------------------------------------------- {
	ИТК_НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Попытка
		
		// BSLLS:ExecuteExternalCodeInCommonModule-off
		Выполнить(ИсполняемыйКод);
		// BSLLS:ExecuteExternalCodeInCommonModule-on
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробнаяИнформацияОбОшибке = ИТК_КодКлиентСервер.ПодробнаяИнформацияООшибке(ИнформацияОбОшибке, КорректировкаНомераСтрокиОшибки);
		
	КонецПопытки;
	
	// Конец замера { ---------------------------------------------------------------------------------------------------
	ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - ИТК_НачалоЗамера;
	
	ОписаниеРезультата = Новый Структура;
	ОписаниеРезультата.Вставить("Контекст", ИТК_Контекст);
	ОписаниеРезультата.Вставить("Время", ВремяВыполнения / 1000);
	ОписаниеРезультата.Вставить("Ошибка", ПодробнаяИнформацияОбОшибке);
	
	// Переменные
	Переменные = Новый СписокЗначений;
	Если ИнформацияОбОшибке = Неопределено Тогда
		
		Для Каждого Имя Из ИспользуемыеПеременные Цикл 
			
			Значение = ИТК_Переменные[Имя];
			
			#Если Сервер Тогда
			ТипЗначения = ТипЗнч(Значение);
			Если ИТК_Типы.ЭтоТипОбъект(ТипЗначения) Тогда
				Значение = Новый (ТипЗначения);
			ИначеЕсли ТипЗначения = Тип("Запрос") Тогда
				
				Если Значение.МенеджерВременныхТаблиц <> Неопределено Тогда
					Значение.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				КонецЕсли;
				
			КонецЕсли;
			#КонецЕсли
			
			Переменные.Добавить(Значение, Имя);
			
		КонецЦикла;
		
	КонецЕсли;
	ОписаниеРезультата.Вставить("Переменные", Переменные);
	
	// Сообщения
	#Если Сервер Тогда
		Сообщения = ПолучитьСообщенияПользователю(Истина);
	#Иначе
		Сообщения = Неопределено;
	#КонецЕсли
	ОписаниеРезультата.Вставить("Сообщения", Сообщения);
	
	УникальныйИдентификатор = Неопределено;
	Если ИТК_ДополнительныеПараметры.Свойство("УникальныйИдентификатор", УникальныйИдентификатор) Тогда
		ОписаниеРезультата.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат ОписаниеРезультата;
	
КонецФункции

Функция ИдентификаторПараметры(Язык = "ru") Экспорт
	
	Возврат НСтр("ru = 'Параметры';
				|en = 'Parameters'", Язык);
	
КонецФункции

Функция КонтекстСервер() Экспорт
	
	Возврат "Сервер";
	
КонецФункции

Функция КонтекстКлиент() Экспорт
	
	Возврат "Клиент";
	
КонецФункции

#КонецОбласти
