#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
// Настройки размещения в панели отчетов.
//
// Параметры:
// Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
// см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
// НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
// См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
// НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
// ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); 
// Отчет
// поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	МодульВариантыОтчетов 		= ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");     
	
	НастройкиВарианта 			= МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Полный");
	НастройкиВарианта.Описание 		=
		НСтр("ru = 'Кредитный портфель с план-фактным анализом'");
	НастройкиВарианта 			= МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Факт");
	НастройкиВарианта.Описание 		=
		НСтр("ru = 'Кредитный портфель с выводом фактической задолженности'");  
    НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;  
	
	НастройкиВарианта 			= МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "График");
	НастройкиВарианта.Описание 		=
		НСтр("ru = 'Кредитный портфель с выводом сведений по графикам расчетов'");
    НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;		
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли