
&НаКлиенте
Процедура СоставГруппировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Поле.Имя = "СоставГруппировкиТипИерархии" Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ТекущиеАналитикиГруппы 	= ЗначениеИзСтрокиВнутр(Параметры.ТекущиеАналитикиГруппы);
	
	Если ЗначениеЗаполнено(Параметры.ИерархияАналитикСтрока) Тогда
		ИерархияАналитикСтрока = ЗначениеИзСтрокиВнутр(Параметры.ИерархияАналитикСтрока);
	КонецЕсли;	
	
	Для Каждого Стр Из ТекущиеАналитикиГруппы Цикл	
		нСтрока = СоставГруппировки.Добавить();
        нСтрока.АналитикаПредставление 		= Стр.Значение[0].АналитикаПредставление;
		нСтрока.АналитикаКод 				= Стр.Ключ;		
		нСтрока.СтруктураАналитикСтрока     = ЗначениеВСтрокуВнутр(Стр.Значение);
		
		//проверим, можно ли выводить иерархию по текущей аналитике
		Если Стр.Ключ = "ПериодОтчета" Тогда
			 //по пероиоду иерерхия определяется в настройках итогов периодов 
		Иначе	
			//
			МассивТипов = СтрРазделить(Стр.Значение[0].АналитикаТипСтрока,"|");
			Если МассивТипов.Количество() = 1 Тогда  //Для составных типов не поддерживаем
				
				ТипСсылка =  Новый (Стр.Значение[0].АналитикаТипСтрока);
				Если ТипСсылка.Метаданные().Иерархический И 
					(ТипСсылка.Метаданные().ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов
					ИЛИ ТипСсылка.Метаданные().ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов) Тогда 	 
					
					нСтрока.ИерархияДоступна = Истина;	 
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если НЕ ИерархияАналитикСтрока = Неопределено И ИерархияАналитикСтрока.Свойство(Стр.Ключ) Тогда
			нСтрока.ТипИерархии 			= ТипГруппировкиКомпоновкиДанных.Иерархия;
			нСтрока.ВыводитьИерархию        = Истина;
		КонецЕсли;	
		
	КонецЦикла;	
	
	ДоступныеАналитикиСтрока = Параметры.ДоступныеАналитикиСтрока;
	
	Если НЕ Параметры.РедактироватьСостав Тогда	
		 Элементы.СоставГруппировки.ИзменятьПорядокСтрок 	= Ложь;
		 Элементы.СоставГруппировки.ИзменятьСоставСтрок 	= Ложь;	 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДоступныеАналитикиСтрока",ДоступныеАналитикиСтрока);
	
	Оповещение = Новый ОписаниеОповещения("ФормаВыбораРеквизитовЗавершение", ЭтаФорма);
	ОткрытьФорму("Обработка.АналитическийБланк.Форма.ФормаВыбораРеквизитов",СтруктураПараметров,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ФормаВыбораРеквизитовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;	
		
	НэлДерева = СоставГруппировки.Добавить();
	НэлДерева.АналитикаПредставление 		 			 = Результат.ПолеПредставление;
	НэлДерева.АналитикаКод					 			 = Результат.Поле;	 
	
	СоставГруппировкиПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	 Закрыть(ПодготовитьСтруктуруПараметров());
	 
КонецПроцедуры
  
&НаСервере
Функция ПодготовитьСтруктуруПараметров()
	
	СтруктураАналитик 			= Новый Структура;
	СтруктураИерархии 			= Новый Структура;
	РасшифровкаВыводаИерархии   = Новый Структура;	
	ФлИерархииПоля 			    = Ложь;
	
	Для Каждого Стр Из СоставГруппировки Цикл		
		
		ТаблицаСвойствАналитики = Обработки.АналитическийБланк.ПолучитьОписаниеТаблицыНастроекАналитик();
		
		Нстр 					 			= ТаблицаСвойствАналитики.Добавить();
		Нстр.АналитикаКод       			= Стр.АналитикаКод;
		Нстр.АналитикаПредставление       	= Стр.АналитикаПредставление;
		
		//Если стоит признак иерархии, заполним структуру для вывода иерархии
		Если Стр.ВыводитьИерархию Тогда
			Если ФлИерархииПоля Тогда
				
				ОбщегоНазначенияУХ.СообщитьОбОшибке(Нстр("ru = 'Иерархия может быть установлена только у одного поля в группировке'"));

			Иначе	
				
				Нстр.ИерархииАналитики       					= ТипГруппировкиКомпоновкиДанных.Иерархия;
				тНастройкиИерархии                  			= НастройкиПолейСводнойТаблицы.Выгрузить().Скопировать(,"ВыводитьИерархиюЭлементов,СкрыватьЭлементыГруппы,ВыводитьДанныеСУровня,ВыводитьДанныеДоУровня");
				нтНастройкиИерархии                 			= тНастройкиИерархии.Добавить();			
				нтНастройкиИерархии.ВыводитьИерархиюЭлементов   = Истина;			
				РасшифровкаВыводаИерархии.Вставить(Стр.АналитикаКод,тНастройкиИерархии);	
				ФлИерархииПоля =  Истина;
						
			КонецЕсли;	
			
		КонецЕсли;
			
		СтруктураАналитик.Вставить(Стр.АналитикаКод,ТаблицаСвойствАналитики);	
				
	КонецЦикла;	
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("СтруктураАналитикСтрока",		ЗначениеВстрокуВнутр(СтруктураАналитик));
	СтруктураОтвета.Вставить("НастройкиИерархии",			ЗначениеВстрокуВнутр(РасшифровкаВыводаИерархии));
				
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Процедура СоставГруппировкиПриИзменении(Элемент)
	
	Элементы.ФормаВыполнить.Доступность = СоставГруппировки.Количество()>0;
	
КонецПроцедуры
  
  
  
  
