
// Белоконенко Денис 29.11.2021 Выполнение задач №000039663
Функция ПрочитатьОбъектXDTO_FinApp_Portal(СообщениеXDTO, Параметры) Экспорт
	Результат = Новый Структура("Успех,ОписаниеОшибки,ДопРезультаты", Истина, "",Новый Структура());
	
	Если СообщениеXDTO.Свойства().Получить("advanceReport") <> Неопределено Тогда //Авансовый отчет
		Результат.ДопРезультаты.Вставить("id1c", "");
		Результат.ДопРезультаты.Вставить("documentNumber", "");
		// НАЧАЛО Белоконенко Денис 18.01.2023 Выполнение задач №000044013
		Результат.ДопРезультаты.Вставить("Ссылка", Неопределено);
		// КОНЕЦ  Белоконенко Денис 18.01.2023 Выполнение задач №000044013		
		
		// НАЧАЛО Белоконенко Денис 29.11.2021 Выполнение задач №000039664
		// Опечатка
		//Параметры.Вставить("ИмяТипаПакетаОтветногоXDTO", "responceAdvanceReport");
		//Параметры.Вставить("ИмяТипаОтветногоXDTO", "responceAdvanceReport_v1");
		Параметры.Вставить("ИмяТипаПакетаОтветногоXDTO", "responseAdvanceReport");
		Параметры.Вставить("ИмяТипаОтветногоXDTO", "responseAdvanceReport_v1");
		// КОНЕЦ Белоконенко Денис 29.11.2021 Выполнение задач №000039664
		
		Если Параметры.ПроизводственноеПодразделение = Справочники.тн_ПроизводственныеПодразделения.ФинансовыйПомощник тогда
			Попытка
				УИД = Новый УникальныйИдентификатор(СообщениеXDTO.advanceReport.id);		
			Исключение
				//если переданный ключ сообщения не является гуидом, не используем его в качестве ключа записи
				
				Результат.Успех = Ложь;
				Результат.ОписаниеОшибки = "Переданный ключ сообщения не является гуидом: " + СообщениеXDTO.advanceReport.id + ": " + ОписаниеОшибки();
				Возврат Результат;		
			КонецПопытки;
			
			АвансовыйОтчетСсылка 				= Документы.АвансовыйОтчет.ПолучитьСсылку(УИД);
			АвансовыйОтчетОбъект 				= АвансовыйОтчетСсылка.ПолучитьОбъект();
			Если АвансовыйОтчетОбъект = Неопределено тогда
				АвансовыйОтчетОбъект 			= Документы.АвансовыйОтчет.СоздатьДокумент();
				АвансовыйОтчетОбъект.УстановитьСсылкуНового(АвансовыйОтчетСсылка);
			КонецЕсли; 
			//НАЧАЛО Блинова М.А. 21.11.2025 Выполнение задач №000055905 
			//проставляем по умолчанию
			АвансовыйОтчетОбъект.ЦенаВключаетНДС = Истина;
			//КОНЕЦ Блинова М.А. 21.11.2025 Выполнение задач №000055905
			//НАЧАЛО Блинова М.А. 20.01.2023 Выполнение задач №000044043
			Иначе 
			//КОНЕЦ Блинова М.А. 20.01.2023 Выполнение задач №000044043
				АвансовыйОтчетСсылка = ПолучитьСсылкуНаОбъект(Документы.АвансовыйОтчет, "по реквизиту", 
				СообщениеXDTO.advanceReport.id, Результат, Ложь, "тн_IDДокументаПортала");
			Если ЗначениеЗаполнено(АвансовыйОтчетСсылка) тогда
				АвансовыйОтчетОбъект 			= АвансовыйОтчетСсылка.ПолучитьОбъект();
			Иначе
			    АвансовыйОтчетОбъект 			= Документы.АвансовыйОтчет.СоздатьДокумент();
			КонецЕсли;
			АвансовыйОтчетОбъект.тн_IDДокументаПортала = СообщениеXDTO.advanceReport.id;
			//НАЧАЛО Блинова М.А. 15.12.2022 Выполнение задач №000043538
			//АвансовыйОтчетОбъект.Комментарий = СообщениеXDTO.advanceReport.comment;
			//КОНЕЦ Блинова М.А. 15.12.2022 Выполнение задач №000043538
		КонецЕсли;
		
		// НАЧАЛО Гутарова Екатерина 20.09.2023 Выполнение задач №000046914 
		//АвансовыйОтчетОбъект.Дата = СообщениеXDTO.advanceReport.date;			
		АвансовыйОтчетОбъект.Дата = тн_Интеграция_ERP_УХ.ПолучитьДату(СообщениеXDTO.advanceReport.date);
		// КОНЕЦ Гутарова Екатерина 20.09.2023 Выполнение задач №000046914
		АвансовыйОтчетОбъект.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		//НАЧАЛО Блинова М.А. 14.12.2022 Выполнение задач №000043538
		//АвансовыйОтчетОбъект.Комментарий = СообщениеXDTO.advanceReport.comment;
		//КОНЕЦ Блинова М.А. 14.12.2022 Выполнение задач №000043538
		ПодотчетноеЛицо = ПолучитьСсылкуНаОбъект(Справочники.ФизическиеЛица,	"по реквизиту", 
			Строка(СообщениеXDTO.advanceReport.employeeID), Результат, Истина, "тн_ЕКС");
 		// НАЧАЛО Белоконенко Денис 08.02.2023 Выполнение задач №000044324
		ОрганизацияПоАвансовомуОтчету = Неопределено;
		// КОНЕЦ  Белоконенко Денис 08.02.2023 Выполнение задач №000044324
			
		Если Параметры.ПроизводственноеПодразделение = Справочники.тн_ПроизводственныеПодразделения.Портал тогда 
			АвансовыйОтчетОбъект.тн_ЛицоСогласования = ПолучитьСсылкуНаОбъект(Справочники.ФизическиеЛица, "по реквизиту", 
				Строка(СообщениеXDTO.advanceReport.responsibleID), Результат, Ложь, "тн_ЕКС"); 
				//НАЧАЛО Блинова М.А. 15.12.2022 Выполнение задач №000043181 
				АвансовыйОтчетОбъект.тн_КомандировкаДатаНачала = СообщениеXDTO.advanceReport.businessTripStartDate;
				АвансовыйОтчетОбъект.тн_КомандировкаДатаОкончания = СообщениеXDTO.advanceReport.businessTripEndDate;
				//КОНЕЦ Блинова М.А. 15.12.2022 Выполнение задач №000043181 
		//НАЧАЛО Блинова М.А. 15.12.2022 Выполнение задач №000043538
		Иначе 
		    Если СообщениеXDTO.advanceReport.Trip <> Неопределено Тогда
				АвансовыйОтчетОбъект.тн_КомандировкаДатаНачала = СообщениеXDTO.advanceReport.Trip.StartDate;
				АвансовыйОтчетОбъект.тн_КомандировкаДатаОкончания = СообщениеXDTO.advanceReport.Trip.EndDate;
			КонецЕсли;	
        //КОНЕЦ Блинова М.А. 15.12.2022 Выполнение задач №000043538
			// НАЧАЛО Белоконенко Денис 08.02.2023 Выполнение задач №000044324
			ОрганизацияПоАвансовомуОтчету = ПолучитьСсылкуНаОбъект(Справочники.Организации, "по гуиду", 
				СообщениеXDTO.advanceReport.idOrganization, Результат, Истина);
			// КОНЕЦ  Белоконенко Денис 08.02.2023 Выполнение задач №000044324
		КонецЕсли;
		
		//НАЧАЛО Блинова М.А. 15.12.2022 Выполнение задач №000043538
		АвансовыйОтчетОбъект.Комментарий = СообщениеXDTO.advanceReport.comment;
		//КОНЕЦ Блинова М.А. 15.12.2022 Выполнение задач №000043538
		АвансовыйОтчетОбъект.ПодотчетноеЛицо = ПодотчетноеЛицо;   
				
		// НАЧАЛО Белоконенко Денис 24.08.2022 Выполнение задач №000042363
		//АвансовыйОтчетОбъект.Статус = Перечисления.СтатусыАвансовогоОтчета.Утвержден;
		// НАЧАЛО Егоров Петр 12.04.2023 Выполнение задач №000045150
		//АвансовыйОтчетОбъект.Статус = Перечисления.СтатусыАвансовогоОтчета.Подготовлен;
		Если Параметры.ПроизводственноеПодразделение = Справочники.тн_ПроизводственныеПодразделения.Портал Тогда
			АвансовыйОтчетОбъект.Статус = Перечисления.СтатусыАвансовогоОтчета.Подготовлен;
		Иначе 
			АвансовыйОтчетОбъект.Статус = Перечисления.СтатусыАвансовогоОтчета.Утвержден;
			//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
			//АвансовыйОтчетОбъект.ДатаУтверждения = тн_Интеграция_УПП.ТекущаяДатаСервера(); 
			АвансовыйОтчетОбъект.ДатаУтверждения = ТекущаяДатаСервера();
			//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
		КонецЕсли;
		// КОНЕЦ  Егоров Петр 12.04.2023 Выполнение задач №000045150
		// КОНЕЦ Белоконенко Денис 24.08.2022 Выполнение задач №000042363
		АвансовыйОтчетОбъект.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		
		// НАЧАЛО Белоконенко Денис 08.02.2023 Выполнение задач №000044324
		//КадровыеДанныеФизЛица = ПолучитьКадровыеДанныеФизЛица(ПодотчетноеЛицо, СообщениеXDTO.advanceReport.date);
		КадровыеДанныеФизЛица = ПолучитьКадровыеДанныеФизЛица(ПодотчетноеЛицо, ОрганизацияПоАвансовомуОтчету, СообщениеXDTO.advanceReport.date);
		// КОНЕЦ  Белоконенко Денис 08.02.2023 Выполнение задач №000044324
		ЗаполнитьЗначенияСвойств(АвансовыйОтчетОбъект, КадровыеДанныеФизЛица);					
		
		// НАЧАЛО Белоконенко Денис 19.09.2022 Выполнение задач №000042651
		//Если Параметры.ПроизводственноеПодразделение = Справочники.тн_ПроизводственныеПодразделения.ФинансовыйПомощник тогда
		//	АвансовыйОтчетОбъект.Подразделение = ПолучитьСсылкуНаОбъект(Справочники.СтруктураПредприятия, "по гуиду", 
		//		СообщениеXDTO.advanceReport.idFinancialResponsibilityCenter, Результат, Истина);
		//Иначе
		//	АвансовыйОтчетОбъект.Подразделение = КадровыеДанныеФизЛица.Подразделение;
		//КонецЕсли;		
		Если Не ЗначениеЗаполнено(КадровыеДанныеФизЛица.Подразделение) Тогда
			Результат.Успех = Ложь;
			Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + 
				"Не удалось найти подразделение в регистре ""Текущие кадровые данные сотрудников""" + Символы.ПС;	
		КонецЕсли;
		// КОНЕЦ Белоконенко Денис 19.09.2022 Выполнение задач №000042651		
		
		// НАЧАЛО Юдина Екатерина 02.04.2025 Выполнение задач №000053277
		РазъезднойХарактерРаботы = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(ПодотчетноеЛицо, "тн_РазъезднойХарактерРаботы");
		// КОНЕЦ Юдина Екатерина 02.04.2025 Выполнение задач №000053277
		
		АвансовыйОтчетОбъект.ПрочиеРасходы.Очистить();   
		// НАЧАЛО Гутарова Екатерина 23.11.2022 Выполнение задач №000043427	
		ЕстьКомандировка = Ложь;
		ЕстьПредставительские = Ложь;
		// КОНЕЦ Гутарова Екатерина 23.11.2022 Выполнение задач №000043427
		// НАЧАЛО Майдан Василий 24.05.2023 Выполнение задач №000045541
		ЕстьПрочиеЗакупки = Ложь;
		// КОНЕЦ Майдан Василий 24.05.2023 Выполнение задач №000045541  
		
		// НАЧАЛО Гутарова Екатерина 27.10.2023 Выполнение задач №000047298
		//Для каждого СтрокаРасхода из СообщениеXDTO.advanceReport.costs цикл  
		Если Параметры.ПроизводственноеПодразделение = Справочники.тн_ПроизводственныеПодразделения.Портал Тогда
			ДанныеЗатрат = СообщениеXDTO.advanceReport.costs;
		Иначе 
			ДанныеЗатрат = СообщениеXDTO.advanceReport.costs.cost;
		КонецЕсли;
		Для каждого СтрокаРасхода Из ДанныеЗатрат Цикл 
        // КОНЕЦ Гутарова Екатерина 27.10.2023 Выполнение задач №000047298
			НоваяСтрокаРасхода = АвансовыйОтчетОбъект.ПрочиеРасходы.Добавить();
			НоваяСтрокаРасхода.ДатаВходящегоДокумента 		= СтрокаРасхода.documentDate;
			НоваяСтрокаРасхода.НомерВходящегоДокумента 		= СтрокаРасхода.documentNumber;
			НоваяСтрокаРасхода.Содержание 					= СтрокаРасхода.content;
			НоваяСтрокаРасхода.Сумма 						= СтрокаРасхода.actualCosts;  
			// НАЧАЛО Юдина (Гутарова) Екатерина 13.05.2024 Выполнение задач №000049514
			НоваяСтрокаРасхода.СуммаСНДС 					= СтрокаРасхода.actualCosts;  
			// КОНЕЦ Юдина (Гутарова) Екатерина 13.05.2024 Выполнение задач №000049514
			// НАЧАЛО Егоров Петр 12.04.2023 Выполнение задач №000045150
			//НоваяСтрокаРасхода.СтавкаНДС					= Перечисления.СтавкиНДС.БезНДС; 
			НоваяСтрокаРасхода.СтавкаНДС					= Справочники.СтавкиНДС.БезНДС; 
			// КОНЕЦ  Егоров Петр 12.04.2023 Выполнение задач №000045150
			// НАЧАЛО Гутарова Екатерина 23.11.2022 Выполнение задач №000043427
			СтруктураСодержания = Документы.АвансовыйОтчет.ПолучитьСоответствиеПоСодержанию(СтрокаРасхода.content);  
			Если СтруктураСодержания.Количество() > 0 Тогда 
				НоваяСтрокаРасхода.НаименованиеВходящегоДокумента = СтруктураСодержания.Наименование;	
				ЕстьКомандировка      = ?(ЕстьКомандировка = Истина, ЕстьКомандировка, СтруктураСодержания.Командировка);
				ЕстьПредставительские = ?(ЕстьПредставительские = Истина, ЕстьПредставительские, СтруктураСодержания.Представительские);
				// НАЧАЛО Майдан Василий 24.05.2023 Выполнение задач №000045541
				ЕстьПрочиеЗакупки	  = ?(ЕстьПрочиеЗакупки = Истина, ЕстьПрочиеЗакупки, СтруктураСодержания.ПрочиеЗакупки);
				// КОНЕЦ Майдан Василий 24.05.2023 Выполнение задач №000045541
			КонецЕсли;
			// КОНЕЦ Гутарова Екатерина 23.11.2022 Выполнение задач №000043427	
			
			// Разные методы поиска статьи для фин помощника и портала.
			Если Параметры.ПроизводственноеПодразделение = Справочники.тн_ПроизводственныеПодразделения.ФинансовыйПомощник тогда
				НоваяСтрокаРасхода.СтатьяРасходов = ПолучитьСсылкуНаОбъект(ПланыВидовХарактеристик.СтатьиРасходов, "по коду", 
					СтрокаРасхода.idErpCostBudget, Результат);
			Иначе
				НоваяСтрокаРасхода.СтатьяРасходов 			= Константы.тн_СтатьяРасходовПриЗагрузкеАвансовыхОтчетовPortal.Получить();
				Если НЕ ЗначениеЗаполнено(НоваяСтрокаРасхода.СтатьяРасходов) тогда
					Результат.Успех = Ложь;
					Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + "Не заполнена константа ""Статья расходов при загрузке авансовых отчетов portal (тн)"""+Символы.ПС;
				КонецЕсли;	
			КонецЕсли;

			НоваяСтрокаРасхода.АналитикаРасходов 			= ПолучитьАналитикуРасходовПоУмолчанию(НоваяСтрокаРасхода.СтатьяРасходов, АвансовыйОтчетОбъект);
			НоваяСтрокаРасхода.Подразделение                = АвансовыйОтчетОбъект.Подразделение; 
			// НАЧАЛО Белышев Игорь 10.01.2023 Выполнение задач №000043904
			Если СтрНайти(НРег(НоваяСтрокаРасхода.Содержание),"суточные") > 0 Тогда
				
				// НАЧАЛО Юдина Екатерина 02.04.2025 Выполнение задач №000053277
				//РазделенияСуточных = ПолучитьРазделениеСуточных(НоваяСтрокаРасхода.Содержание);  
				РазделенияСуточных = ПолучитьРазделениеСуточных(НоваяСтрокаРасхода.Содержание, РазъезднойХарактерРаботы); 
				// КОНЕЦ Юдина Екатерина 02.04.2025 Выполнение задач №000053277
				ОбщаяСуммаСуточных = СтрокаРасхода.actualCosts;
				
				Если РазделенияСуточных <> Неопределено Тогда
					Выборка = РазделенияСуточных.Выбрать();
					Пока Выборка.Следующий() Цикл
						СуммаЗаСуточные = Выборка.СуммаНеОблагается + Выборка.СуммаОблагается;
						КоличествоДней = ОбщаяСуммаСуточных / ?(СуммаЗаСуточные = 0, 1, СуммаЗаСуточные); 
						
						Если (Цел(КоличествоДней) - КоличествоДней) = 0 Тогда
							НоваяСтрокаРасхода.Сумма = Выборка.СуммаНеОблагается * КоличествоДней;
							НоваяСтрокаРасхода.Содержание = Выборка.СодержаниеНеОблагается;
							// НАЧАЛО Юдина (Гутарова) Екатерина 13.05.2024 Выполнение задач №000049514
							НоваяСтрокаРасхода.СуммаСНДС = НоваяСтрокаРасхода.Сумма;  
							// КОНЕЦ Юдина (Гутарова) Екатерина 13.05.2024 Выполнение задач №000049514
							НоваяСтрокаРасходаСуточные = АвансовыйОтчетОбъект.ПрочиеРасходы.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаРасходаСуточные,НоваяСтрокаРасхода);
							НоваяСтрокаРасходаСуточные.Сумма = Выборка.СуммаОблагается * КоличествоДней;
							// НАЧАЛО Юдина (Гутарова) Екатерина 13.05.2024 Выполнение задач №000049514
							НоваяСтрокаРасходаСуточные.СуммаСНДС = НоваяСтрокаРасходаСуточные.Сумма;  
							// КОНЕЦ Юдина (Гутарова) Екатерина 13.05.2024 Выполнение задач №000049514
							НоваяСтрокаРасходаСуточные.Содержание = Выборка.СодержаниеОблагается;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли; 
			// КОНЕЦ Белышев Игорь 10.01.2023 Выполнение задач №000043904
		КонецЦикла;		
		
		// НАЧАЛО Гутарова Екатерина 23.11.2022 Выполнение задач №000043427	
		Если ЕстьКомандировка Тогда 
			АвансовыйОтчетОбъект.НазначениеАванса = "Командировка";
		ИначеЕсли ЕстьПредставительские Тогда
			АвансовыйОтчетОбъект.НазначениеАванса = "Представительские расходы";
		// НАЧАЛО Майдан Василий 24.05.2023 Выполнение задач №000045541
		ИначеЕсли ЕстьПрочиеЗакупки Тогда   
			АвансовыйОтчетОбъект.НазначениеАванса = "Прочие закупки";
		// КОНЕЦ Майдан Василий 24.05.2023 Выполнение задач №000045541
		Иначе 
			АвансовыйОтчетОбъект.НазначениеАванса = "Прочие расходы";
		КонецЕсли;
		// КОНЕЦ Гутарова Екатерина 23.11.2022 Выполнение задач №000043427
	    // НАЧАЛО Юдина (Гутарова) Екатерина 25.10.2024 Выполнение задач №000051314 
		АвансовыйОтчетОбъект.ДополнительныеСвойства.Вставить("БлокироватьЗаписьВЗакрытомПериоде");
		// КОНЕЦ Юдина (Гутарова) Екатерина 25.10.2024 Выполнение задач №000051314
		Попытка
			Если Результат.Успех тогда
				АвансовыйОтчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Результат.ДопРезультаты.id1c 		   = СообщениеXDTO.advanceReport.id;
				Результат.ДопРезультаты.documentNumber = АвансовыйОтчетОбъект.Номер;
				// НАЧАЛО Белоконенко Денис 18.01.2023 Выполнение задач №000044013
				Результат.ДопРезультаты.Ссылка 		   = АвансовыйОтчетОбъект.Ссылка;
				// КОНЕЦ  Белоконенко Денис 18.01.2023 Выполнение задач №000044013 
				// НАЧАЛО Юдина (Гутарова) Екатерина 04.09.2024 Выполнение задач №000050699
				// НАЧАЛО Егоров Петр 10.06.2025 Выполнение задач №000054028
				//РегистрыСведений.тн_ДокументыЗагруженныеПоОбмену.ЗарегистрироватьДокументКакЗагруженный(АвансовыйОтчетОбъект.Ссылка);
				РегистрыСведений.тн_ДокументыЗагруженныеПоОбмену.ЗарегистрироватьДокументКакЗагруженный(АвансовыйОтчетОбъект.Ссылка,
				АвансовыйОтчетОбъект.Организация,АвансовыйОтчетОбъект.Дата);
				// КОНЕЦ Егоров Петр 10.06.2025 Выполнение задач №000054028
				// КОНЕЦ Юдина (Гутарова) Екатерина 04.09.2024 Выполнение задач №000050699
			КонецЕсли;
		Исключение
			Результат.Успех = Ложь;
			Результат.ОписаниеОшибки = "Не удалось создать документ с id " + СообщениеXDTO.advanceReport.id + ": " + ОписаниеОшибки();
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	                       
	Возврат Результат;
КонецФункции	

// ~ Юдина Екатерина 02.04.2025 Выполнение задач №000053277 +РазъезднойХарактерРаботы
//
//// Белышев Игорь 10.01.2023 Выполнение задач №000043904 
//Функция ПолучитьРазделениеСуточных(СуточныеСодержание)
Функция ПолучитьРазделениеСуточных(СуточныеСодержание, РазъезднойХарактерРаботы) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тн_СуточныеРазделениеОблагаемыеНеОблагаемые.СодержаниеСуточныхСФП КАК СодержаниеСуточныхСФП,
		|	тн_СуточныеРазделениеОблагаемыеНеОблагаемые.СодержаниеНеОблагается КАК СодержаниеНеОблагается,
		|	тн_СуточныеРазделениеОблагаемыеНеОблагаемые.СуммаНеОблагается КАК СуммаНеОблагается,
		|	тн_СуточныеРазделениеОблагаемыеНеОблагаемые.СодержаниеОблагается КАК СодержаниеОблагается,
		|	тн_СуточныеРазделениеОблагаемыеНеОблагаемые.СуммаОблагается КАК СуммаОблагается
		|ИЗ
		|	РегистрСведений.тн_СуточныеРазделениеОблагаемыеНеОблагаемые КАК тн_СуточныеРазделениеОблагаемыеНеОблагаемые
		|ГДЕ   
		// НАЧАЛО Юдина Екатерина 02.04.2025 Выполнение задач №000053277  
		//|	тн_СуточныеРазделениеОблагаемыеНеОблагаемые.СодержаниеСуточныхСФП = &СодержаниеСуточныхСФП";  
		|	тн_СуточныеРазделениеОблагаемыеНеОблагаемые.РазъезднойХарактерРаботы = &РазъезднойХарактерРаботы
		|	И тн_СуточныеРазделениеОблагаемыеНеОблагаемые.СодержаниеСуточныхСФП = &СодержаниеСуточныхСФП";
		// КОНЕЦ Юдина Екатерина 02.04.2025 Выполнение задач №000053277
	
	Запрос.УстановитьПараметр("СодержаниеСуточныхСФП", СуточныеСодержание);
    // НАЧАЛО Юдина Екатерина 02.04.2025 Выполнение задач №000053277 
    Запрос.УстановитьПараметр("РазъезднойХарактерРаботы", РазъезднойХарактерРаботы);	
	// КОНЕЦ Юдина Екатерина 02.04.2025 Выполнение задач №000053277 

	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Белоконенко Денис 29.11.2021 Выполнение задач №000039663
// Функция возвращает кадровые данные физ лица на дату.
//
// Параметры:
//  ФизЛицо - СправочникСсылка.ФизическиеЛица - Ссылка на физ лицо
//	ДатаПроверки - На какую дату получаем данные.
//
// Возвращаемое значение:
//	Тип Структура с ключами (Организация, Подразделение). 
//
// НАЧАЛО Белоконенко Денис 08.02.2023 Выполнение задач №000044324
//Функция ПолучитьКадровыеДанныеФизЛица(ФизЛицо, ДатаПроверки)
Функция ПолучитьКадровыеДанныеФизЛица(ФизЛицо, Организация, ДатаПроверки)
// КОНЕЦ Белоконенко Денис 08.02.2023 Выполнение задач №000044324
	РезультатСтруктура = Новый Структура("Организация, Подразделение", 
		Справочники.Организации.ПустаяСсылка(), Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// НАЧАЛО Белоконенко Денис 20.05.2022 Выполнение задач №000041324
		//"ВЫБРАТЬ
		//|	КадроваяИсторияСотрудниковСрезПоследних.ГоловнаяОрганизация КАК Организация,
		//|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию
		//|ПОМЕСТИТЬ вт_КадровыеДанные
		//|ИЗ
		//|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаПроверки, ФизическоеЛицо = &ФизЛицо) КАК КадроваяИсторияСотрудниковСрезПоследних
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	вт_КадровыеДанные.Организация КАК Организация,
		//|	ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение
		//|ИЗ
		//|	вт_КадровыеДанные КАК вт_КадровыеДанные
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		//|		ПО вт_КадровыеДанные.ДолжностьПоШтатномуРасписанию = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция";		
		
	// НАЧАЛО Белоконенко Денис 08.02.2023 Выполнение задач №000044324
		//"ВЫБРАТЬ
		//|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК Организация,
		//|	ТекущиеКадровыеДанныеСотрудников.тнПодразделение КАК Подразделение
		//|ИЗ
		//|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		//|ГДЕ
		//|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизЛицо";
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК Организация,
		|	ТекущиеКадровыеДанныеСотрудников.тнПодразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизЛицо
		|	И ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация = &Организация
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <= &ДатаПроверки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема УБЫВ";
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация = &Организация", "");		
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("Организация", Организация);
    // КОНЕЦ Белоконенко Денис 08.02.2023 Выполнение задач №000044324
	// КОНЕЦ Белоконенко Денис 20.05.2022 Выполнение задач №000041324
	
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() тогда
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, Выборка);	
	КонецЕсли;;
	
	Возврат РезультатСтруктура;
КонецФункции

// Белоконенко Денис 29.11.2021 Выполнение задач №000039663
Функция ОтправитьОтветноеСообщениеFinAppPortal(СообщениеXDTO, ТекстСообщенияJSON, Параметры, Результат) Экспорт

	Профиль = Параметры.Профиль;
	
	КлючСообщения = Неопределено;
	
	//Основные данные
	ДанныеСообщения = Новый Структура;
	// НАЧАЛО Белоконенко Денис 15.09.2022 Выполнение задач №000042622
	//ДанныеСообщения.Вставить("messageGUID",		СообщениеXDTO.headers.messageGUID);										// Уникальный uid отправляемого пакета
	ДанныеСообщения.Вставить("messageGUID",		Строка(Новый УникальныйИдентификатор));									// Уникальный uid отправляемого пакета
	// КОНЕЦ Белоконенко Денис 15.09.2022 Выполнение задач №000042622
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ДанныеСообщения.Вставить("sendDateUTC", 	тн_Интеграция_УПП.ДатаВUTC(тн_Интеграция_УПП.ТекущаяДатаСервера()));	// Дата отправки пакета
	ДанныеСообщения.Вставить("sendDateUTC", 	тн_Интеграция_УПП.ДатаВUTC(ТекущаяДатаСервера()));	// Дата отправки пакета
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	ДанныеСообщения.Вставить("systemSender", 	тн_Интеграция_УПП.КлючОтправителя());									// Уникальный uid системы отправителя
	
	ДанныеСообщения.Вставить("incomeMessageGUID",СообщениеXDTO.headers.messageGUID);						// Такой же как и во входящем пакете									// Номер документа
	ДанныеСообщения.Вставить("success", 		Результат.Успех);
	ДанныеСообщения.Вставить("errorMessage", 	Результат.ОписаниеОшибки);

	// НАЧАЛО Белоконенко Денис 29.06.2022 Выполнение задач №000041739
	Если Результат.Успех Тогда
	// КОНЕЦ Белоконенко Денис 29.06.2022 Выполнение задач №000041739
	// НАЧАЛО Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
	// НАЧАЛО Гутарова Екатерина 16.05.2022 Выполнение задач №000041252
	//СтруктураПФ = ПолучитьПечатнуюФормуАвансовогоОтчета(Документы.АвансовыйОтчет.ПолучитьСсылку(Новый УникальныйИдентификатор(СообщениеXDTO.advanceReport.id)), "АвансовыйОтчет1", ДанныеСообщения);
	// НАЧАЛО Белоконенко Денис 18.01.2023 Выполнение задач №000044013	
	//СтруктураПФ = ПолучитьПечатнуюФормуАвансовогоОтчета(Документы.АвансовыйОтчет.ПолучитьСсылку(Новый УникальныйИдентификатор(СообщениеXDTO.advanceReport.id)), "АвансовыйОтчетБезСальдо", ДанныеСообщения);
	СтруктураПФ = ПолучитьПечатнуюФормуАвансовогоОтчета(Результат.ДопРезультаты.Ссылка, "АвансовыйОтчетБезСальдо", ДанныеСообщения);
	// КОНЕЦ  Белоконенко Денис 18.01.2023 Выполнение задач №000044013
	// КОНЕЦ Гутарова Екатерина 16.05.2022 Выполнение задач №000041252
	ДанныеПФ = Новый Структура;
	ДанныеПФ.Вставить("printedFile", СтруктураПФ);
	// КОНЕЦ Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
	// НАЧАЛО Белоконенко Денис 29.06.2022 Выполнение задач №000041739
	КонецЕсли;
	// КОНЕЦ Белоконенко Денис 29.06.2022 Выполнение задач №000041739
	
	Попытка
		XDTO_Пакет 		= тн_Интеграция.СоздатьКонтейнерXDTO(Параметры.ИмяПакетаXDTO, Параметры.ИмяТипаПакетаОтветногоXDTO);
		XDTO_Headers 	= тн_Интеграция.СоздатьКонтейнерXDTO(Параметры.ИмяПакетаXDTO, "headers");
		XDTO_Responce 	= тн_Интеграция.СоздатьКонтейнерXDTO(Параметры.ИмяПакетаXDTO, Параметры.ИмяТипаОтветногоXDTO);

		ЗаполнитьЗначенияСвойств(XDTO_Headers, ДанныеСообщения);
		ЗаполнитьЗначенияСвойств(XDTO_Responce, ДанныеСообщения);
		// НАЧАЛО Белоконенко Денис 29.06.2022 Выполнение задач №000041739
		Если Результат.Успех Тогда
		// КОНЕЦ Белоконенко Денис 29.06.2022 Выполнение задач №000041739
		// НАЧАЛО Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
		ПоместитьСтруктуруВОбъектXDTO(ДанныеПФ, XDTO_Responce);
		// КОНЕЦ Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
		// НАЧАЛО Белоконенко Денис 29.06.2022 Выполнение задач №000041739
		КонецЕсли;
		// КОНЕЦ Белоконенко Денис 29.06.2022 Выполнение задач №000041739
		
		//Дозаполним доп данными данные
		ЗаполнитьЗначенияСвойств(XDTO_Responce, Результат.ДопРезультаты);
		
		XDTO_Пакет.headers 						= XDTO_Headers;
		XDTO_Пакет[Параметры.ИмяТипаПакетаОтветногоXDTO] 	= XDTO_Responce;
		
		Параметры.Вставить("КлючМаршрутизации"		,XMLСтрока(Параметры.ПроизводственноеПодразделение));	// Уникальный uid системы отправителя первичного сообщения
		Параметры.Вставить("ИмяПакетаXDTO"			,Параметры.ИмяПакетаXDTO);
		Параметры.Вставить("ИмяТипаXDTO"			,Параметры.ИмяТипаОтветногоXDTO);
		Параметры.Вставить("КонтейнерXDTO"			,XDTO_Пакет);
		Параметры.Вставить("ФорматСообщения"		,"JSON");
		
		СтрокаJSON = тн_Интеграция.СериализоватьКонтейнерXDTO(Параметры.КонтейнерXDTO, , Параметры.ФорматСообщения);
		
		// НАЧАЛО Белоконенко Денис 29.11.2021 Выполнение задач №000039664
		УдалитьТипизациюВСтрокеJSON(СтрокаJSON);
		// Коммент отправки. Делаем свою процедуру отправки т.к. эта предназначена для УПП
		//РезультатОтправки 	= тн_Интеграция_УПП.ОтправитьПакет(СтрокаJSON, Параметры, "1cToPortal_responceAdvanceReport_v1");
		ОтправитьПакет(СтрокаJSON, Параметры);
		// КОНЕЦ  Белоконенко Денис 29.11.2021 Выполнение задач №000039664

		ЗаписатьЛогРаботы("Ответ", Параметры.ДанныеДляЛогирования, СтрокаJSON, Перечисления.тн_ВидыСобытийИнтеграции.ОтправленПакет);
		
	Исключение
		
		Результат.Успех				= Ложь;
		Результат.ОписаниеОшибки 	= ОписаниеОшибки();
		
		ОписаниеОшибки = "Ошибка отправки ответного сообщения: " + СообщениеXDTO.headers.messageGUID + " - " + ОписаниеОшибки();		
		ЗаписатьЛогРаботы("Ошибка", Параметры.ДанныеДляЛогирования, ОписаниеОшибки);
		
	КонецПопытки;
			
	Возврат Результат;
	
КонецФункции

// Белоконенко Денис 29.11.2021 Выполнение задач №000039663
Функция ПолучитьАналитикуРасходовПоУмолчанию(СтатьяРасходов, Объект)
	
	ОписаниеТипов = Новый ОписаниеТипов(СтатьяРасходов.ТипЗначения);
	АналитикаРасходов = ОписаниеТипов.ПривестиЗначение();
	
	Если СтатьяРасходов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации") тогда
	   
		АналитикаРасходов = Объект.Организация;
		
	ИначеЕсли СтатьяРасходов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия") тогда
	   
		АналитикаРасходов = Объект.Подразделение;
		
	ИначеЕсли СтатьяРасходов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица") тогда
		
		АналитикаРасходов = Объект.ПодотчетноеЛицо;
				
	КонецЕсли;
	
	Возврат АналитикаРасходов;
	
КонецФункции

// Белоконенко Денис 29.11.2021 Выполнение задач №000039663
// Получаем ссылку по различным вариантам поиска.
//
// Параметры:
//  МенеджерОбъекта - Менеджер искомого объекта
//  ВариантПоиска - Строка. Варианты значений (по гуиду, по коду, по реквизиту);
//  ЗначениеПоиска - Строка. Поисковое значение
//	РезультатОшибок - Структура. Результат записи ошибок
//	ЗаписыватьОшибкуЕслиНеНашли - Булево. Если ИСТИНА, то записываем ошибку в РезультатОшибок
//	ИмяРеквизитаПоиска - Строка. Имя реквизита если ВариантПоиска = "по реквизиту" 
//
// Возвращаемое значение:
//  Ссылка. Пустая ссылка если не нашли
//  Неопределено. Если возникла исключительная ситуация или не предусмотрен такой вариант поиска 
Функция ПолучитьСсылкуНаОбъект(МенеджерОбъекта, ВариантПоиска, ЗначениеПоиска, РезультатОшибок, ЗаписыватьОшибкуЕслиНеНашли = Истина, ИмяРеквизитаПоиска = "")
	НаименованиеОбъекта = Строка(МенеджерОбъекта);
	НаименованиеОбъекта = Прав(НаименованиеОбъекта, СтрДлина(НаименованиеОбъекта) - СтрНайти(НаименованиеОбъекта, "."));
	                         
	СсылкаНаОбъект = Неопределено;
	
	Если ВариантПоиска = "по гуиду" тогда
		Попытка
			УИД = Новый УникальныйИдентификатор(ЗначениеПоиска);		
		Исключение
			//если переданный ключ сообщения не является гуидом, не используем его в качестве ключа записи
			
			РезультатОшибок.Успех = Ложь;
			РезультатОшибок.ОписаниеОшибки = РезультатОшибок.ОписаниеОшибки + "Переданный ключ сообщения не является гуидом: " + ЗначениеПоиска + ": " + ОписаниеОшибки() + Символы.ПС;
			Возврат Неопределено;		
		КонецПопытки;
		
		СсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(УИД);
		// НАЧАЛО Белоконенко Денис 08.02.2023 Выполнение задач №000044324
		//Если Найти(Строка(СсылкаНаОбъект), "<Объект не найден") <> 0 тогда
		Если Не ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
		// КОНЕЦ Белоконенко Денис 08.02.2023 Выполнение задач №000044324
			СсылкаНаОбъект = МенеджерОбъекта.ПустаяСсылка();
			Если ЗаписыватьОшибкуЕслиНеНашли  тогда
				РезультатОшибок.Успех = Ложь;
				РезультатОшибок.ОписаниеОшибки = РезультатОшибок.ОписаниеОшибки + "Не найдена ссылка на объект "+НаименованиеОбъекта+" по ГУИДу: " + ЗначениеПоиска + Символы.ПС;		
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВариантПоиска = "по коду" тогда
		СсылкаНаОбъект = МенеджерОбъекта.НайтиПоКоду(ЗначениеПоиска);
		Если ЗаписыватьОшибкуЕслиНеНашли и НЕ ЗначениеЗаполнено(СсылкаНаОбъект) тогда
			РезультатОшибок.Успех = Ложь;
			РезультатОшибок.ОписаниеОшибки = РезультатОшибок.ОписаниеОшибки + "Не найдена ссылка на объект "+НаименованиеОбъекта+" по коду: " + ЗначениеПоиска + Символы.ПС;
		КонецЕсли;
	ИначеЕсли ВариантПоиска = "по реквизиту" тогда
		СсылкаНаОбъект = МенеджерОбъекта.НайтиПоРеквизиту(ИмяРеквизитаПоиска, ЗначениеПоиска);
		Если ЗаписыватьОшибкуЕслиНеНашли и НЕ ЗначениеЗаполнено(СсылкаНаОбъект) тогда
			РезультатОшибок.Успех = Ложь;
			РезультатОшибок.ОписаниеОшибки = РезультатОшибок.ОписаниеОшибки + "Не найдена ссылка на объект "+НаименованиеОбъекта+" по реквизиту "+ИмяРеквизитаПоиска+": " + ЗначениеПоиска + Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;
КонецФункции

//Сафиуллина З.Р. 21.02.2025 Выполнение задач №000052637: + Экспорт
//// Белоконенко Денис 29.11.2021 Выполнение задач №000039663
//Функция ЗаписатьЛогРаботы(ВидЛога, ДанныеДляЛогирования, ОбъектЛогирования, Событие = "")
Функция ЗаписатьЛогРаботы(ВидЛога, ДанныеДляЛогирования, ОбъектЛогирования, Событие = "") Экспорт
	
	ВидСообщения					= ДанныеДляЛогирования.ВидСообщения; 
	УникальныйИдентификаторЗапроса	= ДанныеДляЛогирования.ИдентификаторЗапроса;
	ИдентификаторИсточникаВызова	= ДанныеДляЛогирования.ИдентификаторИсточникаВызова;
	ВидИнтеграции					= ДанныеДляЛогирования.ВидИнтеграции;
	
	
	Если (ОбъектЛогирования <> Неопределено) 
	   И ЗначениеЗаполнено(ИдентификаторИсточникаВызова) Тогда 
	   		
		ТекстЛога = Строка(ИдентификаторИсточникаВызова) + Символы.ПС + Строка(ОбъектЛогирования);
		
	Иначе 
		
		ТекстЛога = ОбъектЛогирования;
		
	КонецЕсли;	
	
	Если ВидЛога = "Запрос" Тогда 
		
		Если ДанныеДляЛогирования.ВестиЛоги Тогда
				
			РегистрыСведений.тн_Интеграция_ЛогСообщений.ДобавитьЛогСообщенияВходящего(ВидИнтеграции, УникальныйИдентификаторЗапроса, ТекстЛога, ВидСообщения, Событие);

		КонецЕсли;  
			
	ИначеЕсли ВидЛога = "Ответ" Тогда 
		
		Если ДанныеДляЛогирования.ВестиЛоги Тогда
	
			РегистрыСведений.тн_Интеграция_ЛогСообщений.ДобавитьЛогСообщенияИсходящего(ВидИнтеграции, УникальныйИдентификаторЗапроса, ТекстЛога, ВидСообщения, Событие);

		КонецЕсли; 
			
	ИначеЕсли ВидЛога = "Ошибка" Тогда 
										
		РегистрыСведений.тн_Интеграция_ЛогСообщений.ДобавитьЛогОшибки(ВидИнтеграции, УникальныйИдентификаторЗапроса, Перечисления.тн_ВидыСобытийИнтеграции.Ошибка, ТекстЛога, ВидСообщения);								
				
	КонецЕсли;	
				
КонецФункции

//Сафиуллина З.Р. 05.03.2025 Выполнение задач №000052637: + Экспорт
//// Белоконенко Денис 29.11.2021 Выполнение задач №000039664
//Процедура УдалитьТипизациюВСтрокеJSON(СтрокаJSON)
Процедура УдалитьТипизациюВСтрокеJSON(СтрокаJSON) Экспорт
	УдалитьКолСимволовСКонца = 3; // Удаляем закрывающую скобку } и перенос строки
	СтрокаJSON = Сред(СтрокаJSON, СтрНайти(СтрокаJSON,"""#value"": ") + СтрДлина("""#value"": "), СтрДлина(СтрокаJSON));
	СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON) - УдалитьКолСимволовСКонца);
КонецПроцедуры

//Сафиуллина З.Р. 19.02.2025 Выполнение задач №000052637 : + Экспорт
//// Белоконенко Денис 29.11.2021 Выполнение задач №000039664
//Процедура ОтправитьПакет(ТекстСообщения, Параметры)
Процедура ОтправитьПакет(ТекстСообщения, Параметры) Экспорт
	
	ТочкаОбменаRabbitMQ    = Параметры.ТочкаОбменаRabbitMQ;
	КлючМаршрутизации      = Параметры.КлючМаршрутизации;
	СерверОчередейRabbitMQ = Параметры.Профиль.СерверОчередейRMQ;
	
	Если Параметры.ПроизводственноеПодразделение = Справочники.тн_ПроизводственныеПодразделения.ФинансовыйПомощник Тогда
		ПрефиксТипасообщения = "1cToFinApp_";
	Иначе
	//НАЧАЛО Сафиуллина З.Р. 05.03.2025 Выполнение задач №000052637
	//ПрефиксТипасообщения = "1cToPortal_";
		ПрефиксТипасообщения = "1cHoldingManagementToPortal_";
	//КОНЕЦ Сафиуллина З.Р. 05.03.2025 Выполнение задач №000052637	
	КонецЕсли;
	
	//НАЧАЛО Сафиуллина З.Р. 05.03.2025 Выполнение задач №000052637 
	УИДПортала = Новый УникальныйИдентификатор("8859a021-d63f-11ea-b819-00155d4d7383");
	ПроизводственноеПодразделениеПортал = Справочники.тн_ПроизводственныеПодразделения.ПолучитьСсылку(УИДПортала);
	Если Параметры.ПроизводственноеПодразделение = ПроизводственноеПодразделениеПортал Тогда
    	ВерсияОписания = "_v1"; 
	Иначе
		ВерсияОписания = "";
	КонецЕсли;
	//КОНЕЦ Сафиуллина З.Р. 05.03.2025 Выполнение задач №000052637
	СвойстваСообщения = Новый Структура;
	
	УИД = Новый УникальныйИдентификатор(Параметры.КонтейнерXDTO.headers.messageGUID);
	СвойстваСообщения.Вставить("УИД", УИД); //оставляем для присвоения ГУИДа эл-ту справочника ИсходящиеСообщения
	СвойстваСообщения.Вставить("MessageId", Строка(УИД));
	// НАЧАЛО Юдина (Гутарова) Екатерина 13.06.2024 Выполнение задач №000049861
	//СвойстваСообщения.Вставить("Timestamp", Параметры.КонтейнерXDTO.headers.sendDateUTC); 
	// НАЧАЛО Тулинов Владимир 14.11.2024 Выполнение задач №000051643
	//СвойстваСообщения.Вставить("Timestamp", тн_Интеграция_УПП.ТекущаяУниверсальнаяДатаВМиллисекундахНаСервере());
	// КОНЕЦ Тулинов Владимир 14.11.2024 Выполнение задач №000051643
	// КОНЕЦ Юдина (Гутарова) Екатерина 13.06.2024 Выполнение задач №000049861
	//НАЧАЛО Сафиуллина З.Р. 05.03.2025 Выполнение задач №000052637
	//СвойстваСообщения.Вставить("Type", ПрефиксТипасообщения + Параметры.ИмяТипаОтветногоXDTO);
	СвойстваСообщения.Вставить("Type", ПрефиксТипасообщения + Параметры.ИмяТипаОтветногоXDTO + ВерсияОписания);
	//КОНЕЦ Сафиуллина З.Р. 05.03.2025 Выполнение задач №000052637
	
	ВидСообщения = Параметры.ДанныеДляЛогирования.ВидСообщения;
		
	Справочники.ИсходящиеСообщения.Отправить(ТекстСообщения, ТочкаОбменаRabbitMQ, КлючМаршрутизации, СерверОчередейRabbitMQ, СвойстваСообщения, ВидСообщения);	
	
КонецПроцедуры

// Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
//
Функция ПолучитьПечатнуюФормуАвансовогоОтчета(ДокументСсылка, ИмяПечатнойФормы, СтруктураСообщения) Экспорт
	
	printedFile = Новый Структура("type, name, contentBase64");
	
	ТабДок = Неопределено;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		ПараметрыПечати = Новый Структура; 
		ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь); 

		ДанныеПечати = УправлениеПечатью.СформироватьПечатныеФормы("Документ.АвансовыйОтчет", ИмяПечатнойФормы, ДокументСсылка,ПараметрыПечати);
		
		Если ДанныеПечати.Свойство("КоллекцияПечатныхФорм") Тогда
			
			КоллекцияПечатныхФорм = ДанныеПечати.КоллекцияПечатныхФорм;
			Если ЗначениеЗаполнено(КоллекцияПечатныхФорм) И КоллекцияПечатныхФорм.Количество() > 0 Тогда
				ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
			КонецЕсли;
			
		Иначе
			
			Если СтруктураСообщения.Свойство("errorMessage") Тогда
				СтруктураСообщения.errorMessage = "Форма " + ИмяПечатнойФормы + " не предназначена для формата PDF.";
			КонецЕсли;
			
			Возврат printedFile;
			
		КонецЕсли;
		
	Иначе
		Возврат printedFile;
	КонецЕсли;
	
	ДвоичныеДанные = Неопределено;
	
	Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
		
		ПотокВПамяти = Новый ПотокВПамяти;
		ТабДок.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.PDF);
		ДвоичныеДанные = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
				
	Иначе
		
		Если СтруктураСообщения.Свойство("errorMessage") Тогда
			СтруктураСообщения.errorMessage = "Форма " + ИмяПечатнойФормы + " не предназначена для формата PDF.";
		КонецЕсли;
		
		Возврат printedFile;
		
	КонецЕсли;
			
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		
		printedFile.type = "PDF";
		printedFile.name = "Act.PDF";
		printedFile.contentBase64 = Base64Строка(ДвоичныеДанные);
		
	КонецЕсли;
	
	Возврат printedFile;
	
КонецФункции // ЗаполнитьАтрибутОбъектаXDTO()

// Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
//
Процедура ЗаполнитьАтрибутОбъектаXDTO(СвойствоXDTO, ИмяАтрибута, ЗначениеАтрибута)
	
	ТипBoolean  = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema","boolean");	
	ТипDateTime = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema","dateTime");
	ТипDate		= ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema","date");
	
	ТекущееСвойствоXDTO = СвойствоXDTO.Свойства().Получить(ИмяАтрибута);
		
	Если Не (ТекущееСвойствоXDTO.ЗначениеПоУмолчанию = Неопределено) Тогда 
		ЗначениеПоУмолчанию = ТекущееСвойствоXDTO.ЗначениеПоУмолчанию.Значение;	
	Иначе
		
		Если ТекущееСвойствоXDTO.Тип = ТипBoolean Тогда 
			ЗначениеПоУмолчанию = Ложь;	
		ИначеЕсли ТекущееСвойствоXDTO.Тип = ТипDateTime Тогда
			ЗначениеПоУмолчанию = Дата(1,1,1,0,0,0);
		ИначеЕсли ТекущееСвойствоXDTO.Тип = ТипDate Тогда
			ЗначениеПоУмолчанию = Дата(1,1,1);
		Иначе 	
			ЗначениеПоУмолчанию = "";
		КонецЕсли;					
		
	КонецЕсли;
	
	Если (ЗначениеАтрибута = NULL) Или (ЗначениеАтрибута = Неопределено) Тогда 
		СвойствоXDTO[ИмяАтрибута] = ЗначениеПоУмолчанию;
	Иначе
		СвойствоXDTO[ИмяАтрибута] = ЗначениеАтрибута;	
	КонецЕсли;
																						
КонецПроцедуры // ЗаполнитьАтрибутОбъектаXDTO()

// Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
//
Функция ПоместитьСтруктуруВОбъектXDTO(Данные, ОбъектXDTO)
	
	Для Каждого КлючИзначение Из Данные Цикл 
		
		ИмяАтрибута       = КлючИзначение.Ключ;
		ЗначениеАтрибута  = КлючИзначение.Значение;
		
		Если ТипЗнч(ЗначениеАтрибута) = Тип("Структура") Тогда
			ОбъектАтрибута			= ФабрикаXDTO.Создать(ОбъектXDTO.Свойства().Получить(ИмяАтрибута).Тип);
			ОбъектXDTO[ИмяАтрибута] = ПоместитьСтруктуруВОбъектXDTO(ЗначениеАтрибута, ОбъектАтрибута);
		Иначе 
			ЗаполнитьАтрибутОбъектаXDTO(ОбъектXDTO, ИмяАтрибута, ЗначениеАтрибута); 	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбъектXDTO;
	
КонецФункции // ПоместитьСтруктуруВОбъектXDTO() 

//Сафиуллина З.Р. 19.02.2025 Выполнение задач №000052637
//
Функция ДанныеДляЛогирования(ВидСообщения = "", АдресЭлектроннойПочтыДляУведомленияОбОшибках = "", ИДИсточника = "", 
		ВестиЛоги = Ложь, ВидИнтеграции = Неопределено) Экспорт
	
	ДанныеДляЛогирования = Новый Структура;
	ДанныеДляЛогирования.Вставить("ВидСообщения", 									ВидСообщения);
	ДанныеДляЛогирования.Вставить("ИдентификаторЗапроса", 							Новый УникальныйИдентификатор());
	ДанныеДляЛогирования.Вставить("АдресЭлектроннойПочтыДляУведомленияОбОшибках",	АдресЭлектроннойПочтыДляУведомленияОбОшибках);
	ДанныеДляЛогирования.Вставить("ИдентификаторИсточникаВызова", 					ИДИсточника);
	ДанныеДляЛогирования.Вставить("ВестиЛоги", 										ВестиЛоги);
	ДанныеДляЛогирования.Вставить("ВидИнтеграции",									ВидИнтеграции);
	
	Возврат ДанныеДляЛогирования;
	
КонецФункции  //ДанныеДляЛогирования()

//Сафиуллина З.Р. 25.02.2025 Выполнение задач №000052637
//
Функция РезультатЗапросаДанныхСПортала(ПараметрыФормирования) Экспорт
	
	РезультатЗапросаДанных =  Новый Структура();
	
	ДатаНачалаОжидания = ТекущаяДатаСеанса();
	ИнтервалПроверкиСекунд = 3;
	ВремяОжиданияОтветаСекунд = 900;
	
	ИдентификаторЗапроса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормирования, "ИдентификаторЗапроса");
	ВидСообщения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормирования, "ВидСообщения");  
	ВремяОжиданияОтветаСекунд = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормирования, "ВремяОжиданияОтветаСекунд");
	
	ДатаЗавершенияОжидания = ДатаНачалаОжидания + ВремяОжиданияОтветаСекунд;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тн_ЗапросыRabbitMQ.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
		|	тн_ЗапросыRabbitMQ.ВидСообщения КАК ВидСообщения,
		|	тн_ЗапросыRabbitMQ.XML_ПакетВходящий КАК XML_ПакетВходящий,
		|	тн_ЗапросыRabbitMQ.ЕстьОшибки КАК ЕстьОшибки,
		|	тн_ЗапросыRabbitMQ.ТекстОшибки КАК ТекстОшибки,
		|	тн_ЗапросыRabbitMQ.ОтветПолучен КАК ОтветПолучен
		|ИЗ
		|	РегистрСведений.тн_ЗапросыRabbitMQ КАК тн_ЗапросыRabbitMQ
		|ГДЕ
		|	тн_ЗапросыRabbitMQ.ИдентификаторЗапроса = &ИдентификаторЗапроса
		|	И тн_ЗапросыRabbitMQ.ВидСообщения = &ВидСообщения";
	
	Пока Истина Цикл
		
		Если ТекущаяДатаСеанса() > ДатаЗавершенияОжидания Тогда
			
			РезультатВыполнения = Новый Структура();
			РезультатВыполнения.Вставить("Статус", "Ошибка");
			РезультатВыполнения.Вставить("КраткоеПредставлениеОшибки", "Превышено время ожидания ответного сообщения");
			
			ВызватьИсключение ("Не удалось получить данные с портала! Превышено время ожидания ответного сообщения.");
			
		КонецЕсли; 
		
		ОбщегоНазначенияБТС.Пауза(ИнтервалПроверкиСекунд);
				
		Запрос.УстановитьПараметр("ВидСообщения", ВидСообщения);
		Запрос.УстановитьПараметр("ИдентификаторЗапроса", ИдентификаторЗапроса); 
		РезультатВыполненияЗапросыRabbitMQ = Запрос.Выполнить();
		
		Если РезультатВыполненияЗапросыRabbitMQ.Пустой() Тогда 
			
			Продолжить; 
			
		Иначе 
			
			Выборка = РезультатВыполненияЗапросыRabbitMQ.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.ОтветПолучен Тогда 
				
				РезультатЗапросаДанных.Вставить("Результат", Выборка.XML_ПакетВходящий);
				РезультатЗапросаДанных.Вставить("ЕстьОшибки", Выборка.ЕстьОшибки);
				РезультатЗапросаДанных.Вставить("ТекстОшибки", Выборка.ТекстОшибки);
				Возврат РезультатЗапросаДанных;

			Иначе 
				
				Продолжить; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат РезультатЗапросаДанных;

КонецФункции  //РезультатЗапросаДанныхСПортала()

//Сафиуллина З.Р. 19.02.2025 Выполнение задач №000052637
//
Процедура ОбработатьОтветноеСообщениеПортал(СообщениеXDTO, ТекстСообщенияJSON, Профиль, ТегXDTO) Экспорт
	
	ВидСообщенияОтвета = НайтиВидСообщенияПортал(ТегXDTO);
	ДанныеДляЛогирования = ДанныеДляЛогирования(ВидСообщенияОтвета,,, Профиль.ВестиЛоги, Перечисления.тн_ВидыИнтеграций.Портал_Получение);
	ЗаписатьЛогРаботы("Запрос", ДанныеДляЛогирования, ТекстСообщенияJSON, Перечисления.тн_ВидыСобытийИнтеграции.ПолученПакет);	
	
	Параметры = Новый Структура;
	Параметры.Вставить("Профиль", Профиль);
	Параметры.Вставить("ДанныеДляЛогирования", ДанныеДляЛогирования);
	
	ТегЗапроса = СтрЗаменить(ТегXDTO, "response", "request"); 
	ВидСообщенияЗапроса = НайтиВидСообщенияПортал(ТегЗапроса);
	
	Попытка
		
		Результат = Новый Структура("Успех,ОписаниеОшибки", Истина, "");
		
		ТекстСообщенияJSON_Структура = СтрЗаменить(ТекстСообщенияJSON, "#", "");
		
		СтруктураОтветногоСообщения = тн_Интеграция_УПП.ПолучитьСтруктуруДанныхJSON(ТекстСообщенияJSON_Структура);
		
		ИдентификаторЗапроса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтветногоСообщения.value[ТегXDTO], "idRequest");
		СтруктураЗаписи = Новый Структура();
		СтруктураЗаписи.Вставить("XML_ПакетВходящий", ТекстСообщенияJSON);
		СтруктураЗаписи.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса); 
		СтруктураЗаписи.Вставить("ВидСообщения", ВидСообщенияЗапроса);
		ЕстьОшибки 	= Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтветногоСообщения.value[ТегXDTO], "success");
		Если ЕстьОшибки Тогда 
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтветногоСообщения.value[ТегXDTO], "errorMessage");
		Иначе
			ТекстОшибки = "";
		КонецЕсли;
		СтруктураЗаписи.Вставить("ЕстьОшибки", ЕстьОшибки);
		СтруктураЗаписи.Вставить("ТекстОшибки", ТекстОшибки);
		
		РегистрыСведений.тн_ЗапросыRabbitMQ.ОбновитьЗаписьПриПолученииСообщения(СтруктураЗаписи);
		
	Исключение
		
		Результат.Успех = Ложь;
		Результат.ОписаниеОшибки = Результат.ОписаниеОшибки +  """: " + ОписаниеОшибки() + Символы.ПС;	
		
	КонецПопытки;
	
	Если Результат.Успех Тогда
		ЗаписатьЛогРаботы("Ответ", ДанныеДляЛогирования, "Объекты типа: " + ТегXDTO + " успешно обработаны", Перечисления.тн_ВидыСобытийИнтеграции.ОбработкаЗавершена);
		тн_Интеграция_ERP_УХ.ОтправитьIntegrationTicket(СообщениеXDTO, ТекстСообщенияJSON, Параметры); 
	Иначе
		ОписаниеОшибки = "Ошибка получения объектов типа " + ТегXDTO + " описание ошибки: " + Символы.ПС + Результат.ОписаниеОшибки;		
		ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры  //ОбработатьОтветноеСообщениеПортал()

//Сафиуллина З.Р. 20.02.2025 Выполнение задач №000052637
//
Функция НайтиВидСообщенияПортал(ЗначениеПоиска)
	
	ЗначениеПеречисления = Перечисления.тн_ВидыСообщенийPortal.ПустаяСсылка();
	
	Если Не Метаданные.Перечисления.тн_ВидыСообщенийPortal.ЗначенияПеречисления.Найти(ЗначениеПоиска) = Неопределено Тогда
		ЗначениеПеречисления = Перечисления.тн_ВидыСообщенийPortal[ЗначениеПоиска];	
	КонецЕсли;
	
	Возврат ЗначениеПеречисления;
	
КонецФункции  //НайтиВидСообщенияПортал()

//Сафиуллина З.Р. 24.02.2025 Выполнение задач №000052637
//
Функция ПрочитатьСообщениеJSON(ТекстСообщенияJSON) Экспорт 
	
	СообщениеXDTO = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщенияJSON);
	
	Попытка
		СообщениеXDTO = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ОписаниеОшибки = "Ошибка при преобразовании содержимого ответа в ОбъектJSON:" + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СообщениеXDTO;

КонецФункции  //ПрочитатьСообщениеJSON()

