
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВызовИзРегламента", ВызовИзРегламента);
	Параметры.Свойство("ВерсияРегламента", ВерсияРегламента);
	Параметры.Свойство("УправлениеПериодом", УправлениеПериодом);
	
	ОбработатьПараметр("ШаблонДокумента", "ШаблоныДокументов");
	ОбработатьПараметр("Организация", "Организации");
	ОбработатьПараметр("Проект", "Проекты");
	Для Сч = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		ОбработатьПараметр("Аналитика" + Сч, "Аналитики" + Сч);
	КонецЦикла;
	
	Элементы.ГруппаРегламент.ТолькоПросмотр = ВызовИзРегламента;
	Элементы.ШаблонДокумента.ТолькоПросмотр = ВызовИзРегламента;
	
	ШаблонДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		СтруктураПараметров = Новый Структура;
		ТекстВопроса = НСтр("ru = 'Применить произведенные изменения?'");
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеПрименениеЗавершение", ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПрименениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		Записать(Команды.Найти("ЗаписатьИЗакрыть"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонДокументаПриИзменении(Элемент)
	
	ШаблонДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ШаблонДокументаПриИзмененииНаСервере()
	
	МаксКлючевыхАналитик = 0;
	РазделениеПоПроектам = Ложь;
	ТипШаблона = "";
	
	Если ШаблонДокумента = Неопределено Тогда
		Элементы.ШаблонДокумента.Заголовок = НСтр("ru = 'Шаблон документа'");
	ИначеЕсли ТипЗнч(ШаблонДокумента) = Тип("СправочникСсылка.ШаблоныКорректировокЗначенийПоказателей") Тогда
		Элементы.ШаблонДокумента.Заголовок = НСтр("ru = 'Шаблон корректировок значений показателей'");
		ТипШаблона = "ШаблоныКорректировокЗначенийПоказателей";
	ИначеЕсли ТипЗнч(ШаблонДокумента) = Тип("СправочникСсылка.ШаблоныТрансляций") Тогда
		Элементы.ШаблонДокумента.Заголовок = НСтр("ru = 'Шаблон трансляций'");
		ТипШаблона = "ШаблоныТрансляций";
	ИначеЕсли ТипЗнч(ШаблонДокумента) = Тип("СправочникСсылка.ШаблоныТрансформационныхКорректировок") Тогда
		Элементы.ШаблонДокумента.Заголовок = НСтр("ru = 'Шаблон операций'");
		ТипШаблона = "ШаблоныТрансформационныхКорректировок";
	ИначеЕсли ТипЗнч(ШаблонДокумента) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
		Элементы.ШаблонДокумента.Заголовок = НСтр("ru = 'Вид отчета'");
		ТипШаблона = "ВидыОтчетов";
		ДанныеВидаОтчета = БюджетированиеИОтчетностьПовтИсп.ДанныеВидаОтчета(ШаблонДокумента);
		РазделениеПоПроектам = ДанныеВидаОтчета.РазделениеПоПроектам;
		МаксКлючевыхАналитик = ДанныеВидаОтчета.МаксКлючевыхАналитик;
	КонецЕсли;
	
	Элементы.ГруппаВидОтчета.Видимость = ТипШаблона = "ВидыОтчетов";
	Элементы.ВнешняяИнформационнаяБаза.РежимВыбораИзСписка = ТипШаблона = "ВидыОтчетов";
	
	Если РазделениеПоПроектам Тогда
		Элементы.Проект.Видимость = Проекты.Количество() = 1;
		Элементы.Проекты.Видимость = НЕ Проекты.Количество() = 1;
	Иначе
		Проект = Неопределено;
		Проекты.Очистить();
		Элементы.Проект.Видимость = Ложь;
		Элементы.Проекты.Видимость = Ложь;
	КонецЕсли;
	
	Для Сч = 1 По МаксКлючевыхАналитик Цикл
		ТекущийЭлемент = Элементы["Аналитика"+Сч];
		ТекущийЭлемент.Видимость = ЭтаФорма["Аналитики"+Сч].Количество() = 1;
		Элементы["Аналитики"+Сч].Видимость = НЕ ЭтаФорма["Аналитики"+Сч].Количество() = 1;
		ТипЗначенияАналитики = ДанныеВидаОтчета["ТипЗначенияАналитики"+Сч];
		Если ТипЗначенияАналитики.Типы().Количество() = 1 Тогда
			ТекущийЭлемент.ВыбиратьТип = Ложь;
		КонецЕсли;
		ТекущийЭлемент.ОграничениеТипа = ТипЗначенияАналитики;
		Если ТипЗначенияАналитики.СодержитТип(Тип("СправочникСсылка.ПроизвольныйКлассификаторУХ")) Тогда
			БюджетированиеИОтчетность.УстановитьПараметрыВыбора(ТекущийЭлемент, "Отбор.Владелец", ДанныеВидаОтчета["ВидАналитики"+Сч]);
		КонецЕсли;
	КонецЦикла;
	Для Сч = МаксКлючевыхАналитик+1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		ЭтаФорма["Аналитика"+Сч] = Неопределено;
		ЭтаФорма["Аналитики"+Сч].Очистить();
		Элементы["Аналитика"+Сч].Видимость = Ложь;
		Элементы["Аналитики"+Сч].Видимость = Ложь;
	КонецЦикла;
	
	ПолучитьЗначенияНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура БланкДляОтображенияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура БланкСводнойТаблицыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоПроверкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоОбработкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособФормированияОтчетаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	СпособФормированияОтчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СпособФормированияОтчетаПриИзмененииНаСервере()
	
	Если ТипШаблона = "ВидыОтчетов" Тогда
		БюджетированиеИОтчетность.НастроитьЭлементыНастройкиВидовОтчетов(ЭтаФорма);
	Иначе
		Элементы.ВнешняяИнформационнаяБаза.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БланкДляИмпортаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяИнформационнаяБазаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьСвертыванияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияРегламентаПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПериодомПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Организация", "Организации");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Проект", "Проекты");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика1ПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Аналитика1", "Аналитики1");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика2ПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Аналитика2", "Аналитики2");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика3ПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Аналитика3", "Аналитики3");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика4ПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Аналитика4", "Аналитики4");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика5ПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Аналитика5", "Аналитики5");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика6ПриИзменении(Элемент)
	
	ПолучитьЗначенияНастроек();
	
	ЗначениеВСписок("Аналитика6", "Аналитики6");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииОткрытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Организации");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыОткрытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Проекты");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитики1Открытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Аналитики1");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитики2Открытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Аналитики2");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитики3Открытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Аналитики3");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитики4Открытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Аналитики4");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика5Открытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Аналитики5");
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитики6Открытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьСписокЗначений("Аналитики6");
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	Если Модифицированность Тогда
		ЗаписатьНаСервере();
	КонецЕсли;
	
	Если Команда = Команды.Найти("ЗаписатьИЗакрыть") Тогда
		ПараметрыЗакрытия = Модифицированность;
		Модифицированность = Ложь;
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ПараметрыЗаписи = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов();
	ПараметрыЗаписи.Вставить("ВерсияРегламента", ВерсияРегламента);
	ПараметрыЗаписи.Вставить("УправлениеПериодом", УправлениеПериодом);
	
	ЭтоЗаполнениеПоШаблонамДокумента = (НЕ ЗначениеЗаполнено(ШаблонДокумента) И ЗначениеЗаполнено(ШаблоныДокументов));
	
	Для Каждого ЭлементШаблонДокумента Из ШаблоныДокументов Цикл
		ПараметрыЗаписи.Вставить("ШаблонДокумента", ЭлементШаблонДокумента.Значение);
		
		Для Каждого ЭлементОрганизация Из Организации Цикл
			ПараметрыЗаписи.Вставить("Организация", ЭлементОрганизация.Значение);
			
			Если РазделениеПоПроектам Тогда
				Для Каждого ЭлементПроект Из Проекты Цикл
					ПараметрыЗаписи.Вставить("Проект", ЭлементПроект.Значение);
					
					Если ЭтоЗаполнениеПоШаблонамДокумента Тогда
						ЗначенияНастроек = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыЗаписи);
						ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияНастроек,, "ВнешняяИнформационнаяБаза");
					КонецЕсли;
					ЦиклПоАналитикам(ПараметрыЗаписи, 1);
					
				КонецЦикла;
			Иначе
				
				Если ЭтоЗаполнениеПоШаблонамДокумента Тогда
					ЗначенияНастроек = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыЗаписи);
					ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияНастроек,, "ВнешняяИнформационнаяБаза");
				КонецЕсли;
				ЦиклПоАналитикам(ПараметрыЗаписи, 1);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЦиклПоАналитикам(ПараметрыЗаписи, Сч)
	
	Если Сч > МаксКлючевыхАналитик Тогда
		УправлениеОтчетамиУХ.УстановитьНастройкиОбработкиШаблонов(ПараметрыЗаписи, ЭтаФорма);
	Иначе
		Для Каждого ЭлементАналитика Из ЭтаФорма["Аналитики" + Сч] Цикл
			ПараметрыЗаписи.Вставить("Аналитика" + Сч, ЭлементАналитика.Значение);
			ЦиклПоАналитикам(ПараметрыЗаписи, Сч + 1);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьЗначенияНастроек()
	
	ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ЭтаФорма);
	ЗначенияНастроек = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыНастроек);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияНастроек);
	
	Модифицированность = Ложь;
	
	ЗаполнитьСпособыФормированияОтчета();
	СпособФормированияОтчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпособыФормированияОтчета()
	
	Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.РучноеЗаполнение);
	Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.ПоПравилуОбработки);
	Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Импорт);

	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ВерсияРегламента) Тогда
		
		// Можем установить доступные способы заполнения
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.ОрганизационнаяЕдиницаРодитель) КАК ЕстьКонсолидирующиеОрганизации,
			|	ЕСТЬNULL(МАКСИМУМ(ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.Ссылка.ИспользоватьРасширенныеНастройкиПериметра), ЛОЖЬ) КАК ИспользоватьРасширенныеНастройкиПериметра
			|ИЗ
			|	Справочник.ВерсииРегламентовПодготовкиОтчетности.СтруктураГруппы КАК ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы
			|ГДЕ
			|	ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.Ссылка = &ВерсияРегламента
			|	И ВерсииРегламентовПодготовкиОтчетностиСтруктураГруппы.ОрганизационнаяЕдиницаРодитель = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Организации.ЭлиминирующаяОрганизация КАК ЭлиминирующаяОрганизация
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка = &Организация";
		
		Запрос.УстановитьПараметр("ВерсияРегламента", ВерсияРегламента);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		// Консолидация
		РезультатЗапроса = ПакетРезультатовЗапроса.Получить(0);
		Если НЕ РезультатЗапроса.Пустой() Тогда
	
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.ЕстьКонсолидирующиеОрганизации Тогда
				Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Консолидация);
			КонецЕсли;
			
		КонецЕсли;
		
		// Элиминация
		РезультатЗапроса = ПакетРезультатовЗапроса.Получить(1);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.ЭлиминирующаяОрганизация Тогда
				Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Элиминация);
			КонецЕсли;
			
		КонецЕсли;
	
	Иначе
		Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Консолидация);
		Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.Элиминация);
	КонецЕсли;

	Для Сч = 1 По МаксКлючевыхАналитик Цикл
		Если НЕ ЗначениеЗаполнено(ЭтаФорма["Аналитика" + Сч]) Тогда
			Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.СвернувПоАналитикам);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СпособФормированияОтчета.СписокВыбора.Добавить(Перечисления.СпособыФормированияОтчетов.СвернувПоПериоду);
	
	Если Элементы.СпособФормированияОтчета.СписокВыбора.НайтиПоЗначению(СпособФормированияОтчета) = Неопределено Тогда
		СпособФормированияОтчета = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПараметр(ИмяЕдЧисло, ИмяМнЧисло)

	Если Параметры.Свойство(ИмяЕдЧисло) Тогда
		Параметр = Параметры[ИмяЕдЧисло];
		Если ТипЗнч(Параметр) = Тип("Массив") Тогда
			ЭтаФорма[ИмяМнЧисло].ЗагрузитьЗначения(Параметр);
			Элементы[ИмяЕдЧисло].Видимость = Ложь;
			Элементы[ИмяМнЧисло].Видимость = Истина;
		Иначе
			ЭтаФорма[ИмяЕдЧисло] = Параметр;
			ЭтаФорма[ИмяМнЧисло].Добавить(ЭтаФорма[ИмяЕдЧисло]);
			Элементы[ИмяЕдЧисло].Видимость = Истина;
			Элементы[ИмяМнЧисло].Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы[ИмяЕдЧисло].Видимость = Истина;
		Элементы[ИмяМнЧисло].Видимость = Ложь;
		ЭтаФорма[ИмяМнЧисло].Добавить(ЭтаФорма[ИмяЕдЧисло]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокЗначений(ИмяРеквизита)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заголовок", ИмяРеквизита);
	ПараметрыОткрытия.Вставить("МассивЗначений", ЭтаФорма[ИмяРеквизита].ВыгрузитьЗначения());
	
	ОткрытьФорму("ВнешнийОтчет.НастройкаОбработкиШаблоновДокументов.Форма.ФормаПросмотраСпискаЗначений", 
		ПараметрыОткрытия, ЭтаФорма);

КонецПроцедуры
	
&НаКлиенте
Процедура ЗначениеВСписок(ИмяЕдЧисло, ИмяМнЧисло)
	
	ЭтаФорма[ИмяМнЧисло].Очистить();
	ЭтаФорма[ИмяМнЧисло].Добавить(ЭтаФорма[ИмяЕдЧисло]);

КонецПроцедуры

#КонецОбласти









