
#Область ПрограммныйИнтерфейс

// Функция возвращает Функциональные направления, статьи которых доступны для данного ЦФО.
//
// Параметры:
//  ЦФО	 - 	СправочникСсылка.Организации - ЦФО, для которого определяются функциональные направления.
// 
// Возвращаемое значение:
//  Массив - массив элементов
//
Функция ФункциональныеНаправленияЦФО(Знач ЦФО) Экспорт
	Возврат ОбщегоНазначенияОПК.ФункциональныеНаправленияЦФО(ЦФО);
КонецФункции

Функция ПараметрыЦентрализованныхЗакупок() Экспорт

	Возврат ВстраиваниеОПК.ПараметрыЦентрализованныхЗакупок();

КонецФункции // ПараметрыЦентрализованныхЗакупок()    

Функция СпособРасчетаДатыОперацииПериода() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.СпособРасчетаДатыОперацииПериода.Получить();	

КонецФункции // СпособРасчетаДатыОперацииПериода()

Функция ИспользуемыеВидыБюджетовЗакупок(ДатаСреза = Неопределено) Экспорт

	Возврат ПланированиеПотребностей.ИспользуемыеВидыБюджетовЗакупок(ДатаСреза);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЕдиницыИзмеренияНоменклатуры(Номенклатура, ДанныеВыбора) Экспорт

	ЕдиницыИзмерения = ВстраиваниеОПК.ПолучитьЕдиницыИзмеренияНоменклатуры(Номенклатура);
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ЕдиницыИзмерения.ВыгрузитьКолонку("ЕдиницаИзмерения"));
	
КонецПроцедуры

#КонецОбласти
