
Функция ВернутьЗнакСравненияПоВиду(ВидСравненияПеречисление) Экспорт
	
	Если ВидСравненияПеречисление=Перечисления.ВидыСравнения.Больше Тогда
		
		Возврат ">";
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.Меньше Тогда
		
		Возврат "<";
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеБольше Тогда
		
		Возврат "<=";
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеМеньше Тогда
		
		Возврат ">=";
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеРавно Тогда
		
		Возврат "<>";
		
	Иначе
		
		Возврат "=";
		
	КонецЕсли;
	
КонецФункции // ВернутьЗнакСравненияПоВиду()

Функция ВернутьВидСравнения(ВидСравненияПеречисление) Экспорт
	
	Если ВидСравненияПеречисление=Перечисления.ВидыСравнения.Больше Тогда
		
		Возврат ВидСравнения.Больше;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.Меньше Тогда
		
		Возврат ВидСравнения.Меньше;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеБольше Тогда
		
		Возврат ВидСравнения.МеньшеИлиРавно;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеМеньше Тогда
		
		Возврат ВидСравнения.БольшеИлиРавно;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеРавно Тогда
		
		Возврат ВидСравнения.НеРавно;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.ВСписке Тогда
		
		Возврат ВидСравнения.ВСписке;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.ВСпискеПоИерархии Тогда
		
		Возврат ВидСравнения.ВСпискеПоИерархии;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеВСпискеПоИерархии Тогда
		
		Возврат ВидСравнения.НеВСпискеПоИерархии;
	
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ВернутьЗнакСравненияПоВиду()

Функция ВернутьВидСравненияКД(ВидСравненияПеречисление) Экспорт
	
	Если ВидСравненияПеречисление=Перечисления.ВидыСравнения.Больше Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.Больше;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.Меньше Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеБольше Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеМеньше Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеРавно Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.НеРавно;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.ВСписке Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.ВСписке;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.ВСпискеПоИерархии Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		
	ИначеЕсли ВидСравненияПеречисление=Перечисления.ВидыСравнения.НеВСпискеПоИерархии Тогда
		
		Возврат ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии;
	
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ВернутьЗнакСравненияПоВиду()