
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	ТребуетсяРеестрПлатежей = Константы.ИспользоватьРеестрПлатежей.Получить();
	
	Если ТребуетсяРеестрПлатежей Тогда
		Объект.ГенерацияПоРееструПлатежей = Истина;
		Элементы.ГенерацияПоРееструПлатежей.Видимость = Ложь;
	Иначе
		Если НЕ (Параметры.Свойство("НачалоПериода") И Параметры.Свойство("КонецПериода")) Тогда
			Объект.НачалоПериода = ОбщегоНазначения.ТекущаяДатаПользователя();
			Объект.КонецПериода  = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСписокНаСервере(); 
	
	УправлениеФормой(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры                       

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГенерацияПоРееструПлатежейПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РеестрПлатежейПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаявкиКИсполнениюДерево

&НаКлиенте
Процедура ЗаявкиКИсполнениюДеревоСоздаватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗаявкиКИсполнениюДерево.ТекущиеДанные;
	
	Если ТекДанные.Создавать = 2 Тогда 
		ТекДанные.Создавать = 0;
	КонецЕсли;
	
	СуммаГруппировки = 0;
	
	РодительскийЭлемент = ТекДанные.ПолучитьРодителя();
	Если РодительскийЭлемент = Неопределено Тогда
		ДочерниеЭлементы = ТекДанные.ПолучитьЭлементы();	
		Для Каждого СтрокаДерева Из ДочерниеЭлементы Цикл 
			СтрокаДерева.Создавать = ТекДанные.Создавать; 
			Если СтрокаДерева.Создавать = 1 Тогда	
				СуммаГруппировки = СуммаГруппировки + СтрокаДерева.СуммаДокумента;  
			КонецЕсли;
		КонецЦикла;    
		ТекДанные.ЕстьВыбранные = ТекДанные.Создавать; 
		Если ДочерниеЭлементы.Количество() Тогда
			ТекДанные.СуммаДокумента = СуммаГруппировки; 
		КонецЕсли;
	Иначе       
		ДочерниеЭлементы = РодительскийЭлемент.ПолучитьЭлементы();	
		СостояниеФлажка = 0;
		ЕстьВыбранные = Ложь;
		ЕстьНеВыбранные = Ложь;
		Для Каждого СтрокаДерева Из ДочерниеЭлементы Цикл 
			Если СтрокаДерева.Создавать = 1 Тогда	
				ЕстьВыбранные = Истина;
				СуммаГруппировки = СуммаГруппировки + СтрокаДерева.СуммаДокумента;
			КонецЕсли;
			Если СтрокаДерева.Создавать = 0 Тогда	
				ЕстьНеВыбранные = Истина;	
			КонецЕсли; 
		КонецЦикла; 
		
		Если ЕстьВыбранные И ЕстьНеВыбранные Тогда
			СостояниеФлажка = 2;
		ИначеЕсли ЕстьВыбранные Тогда    
			СостояниеФлажка = 1;
		Иначе  
			СостояниеФлажка = 0;
		КонецЕсли;
		
		РодительскийЭлемент.Создавать = СостояниеФлажка;
		РодительскийЭлемент.ЕстьВыбранные = ЕстьВыбранные;
		РодительскийЭлемент.СуммаДокумента = СуммаГруппировки;
	КонецЕсли;
	
	ОбновитьИтогиВПодвале();

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиКИсполнениюДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЗаявкаНаОперацию) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ЗаявкаНаОперацию);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаОбновитьСписокЗаявок(Команда)
	
	ОбновитьСписокНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериода, Объект.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	УстановитьОтметку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	УстановитьОтметку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокСозданныхОбъектов(Команда)
	ОткрытьСписокСозданныхОбъектов();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПлатежныеПоручения(Команда)
	
	Состояние(НСтр("ru = 'Формирование платежных поручений'"));
	
	СоздатьПлатежныеПорученияНаСервере();
	Если Объект.СозданныеДокументы.Количество() Тогда
		ЧтоСоздано = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				Объект.СозданныеДокументы.Количество(), НСтр("ru = 'платежное поручение, платежных поручения, платежных поручений'"));
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Создано %1'"), ЧтоСоздано);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не создано ни одного платежного поручения'");
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьСписокСозданныхОбъектов", ЭтотОбъект);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Создание завершено'"), ОписаниеОповещения, ТекстСообщения, БиблиотекаКартинок.Информация32);
	Оповестить("СозданыПлатежныеПоручения", Объект.РеестрПлатежей);
	
КонецПроцедуры

#КонецОбласти

#Область ЗавершениеНемодальныхВызовов

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоПериода = РезультатВыбора.НачалоПериода;
	Объект.КонецПериода  = РезультатВыбора.КонецПериода;
	
	ОбновитьСписокНаСервере();	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ЗаявкиКИсполнениюДерево"); 
	ФормыУХ.НовыйОтбор(ЭлементОформления.Отбор, "ОбъединятьПозицииПриСозданииПлатежныхПоручений", Истина,,ВидСравненияКомпоновкиДанных.Равно);     
	ФормыУХ.НовыйОтбор(ЭлементОформления.Отбор, "ЗаявкиКИсполнениюДерево.Уровень",1,,ВидСравненияКомпоновкиДанных.Равно);   
	ФормыУХ.НовыйОтбор(ЭлементОформления.Отбор, "ЗаявкиКИсполнениюДерево.КоличествоДочернихСтрок",1,,ВидСравненияКомпоновкиДанных.Больше);     
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,1));
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ЗаявкиКИсполнениюДеревоСчетОрганизации"); 
	ФормыУХ.НовыйОтбор(ЭлементОформления.Отбор, "ЗаявкиКИсполнениюДерево.ДетальнаяЗапись", Истина,,ВидСравненияКомпоновкиДанных.Равно);     
	ФормыУХ.НовыйОтбор(ЭлементОформления.Отбор, "ЗаявкиКИсполнениюДерево.НеЗаполненБаковскийСчет", Истина,,ВидСравненияКомпоновкиДанных.Равно);     
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ЗаявкиКИсполнениюДеревоСчетОрганизации"); 
	ФормыУХ.НовыйОтбор(ЭлементОформления.Отбор, "ЗаявкиКИсполнениюДерево.ДетальнаяЗапись", Ложь,,ВидСравненияКомпоновкиДанных.Равно);     
	ФормыУХ.НовыйОтбор(ЭлементОформления.Отбор, "ЗаявкиКИсполнениюДерево.ЕстьНезаполненныйБанковскийСчет", Истина,,ВидСравненияКомпоновкиДанных.Равно);     
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст",НСтр("ru = '<Есть незаполненный банковский счет>'"));
	
КонецПроцедуры

&НаСервере
Процедура ВывестиЗаявкиВДерево(ТекстЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДополнительныйОтбор", 	Истина);
	Запрос.УстановитьПараметр("ДатаНачало", 			НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончание", 			КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("БанковскийСчет", Объект.БанковскийСчет);
	Запрос.УстановитьПараметр("РеестрПлатежей", Объект.РеестрПлатежей);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаВерхнийУровень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Дерево =  РеквизитФормыВЗначение("ЗаявкиКИсполнениюДерево");
	Дерево.Строки.Очистить();

	Пока ВыборкаВерхнийУровень.Следующий() Цикл  //Группировка "Дата"
		
		ДанныеГруппировки = Новый Структура;
		//+Группировки
		ДанныеГруппировки.Вставить("Дата");
		ДанныеГруппировки.Вставить("Организация");
		ДанныеГруппировки.Вставить("Контрагент");
		ДанныеГруппировки.Вставить("ПодотчетноеЛицо");
		ДанныеГруппировки.Вставить("Подразделение");
		ДанныеГруппировки.Вставить("СчетОрганизации");
		ДанныеГруппировки.Вставить("Валюта"); 
		ДанныеГруппировки.Вставить("ВидОперации"); 
		ДанныеГруппировки.Вставить("СчетКонтрагента"); 
	
		//-Группировки
		ДанныеГруппировки.Вставить("СуммаДокумента");
		ДанныеГруппировки.Вставить("ЗаявкаНаОперацию");
		ДанныеГруппировки.Вставить("Создавать");
		ДанныеГруппировки.Вставить("ИдентификаторПозиции");
		ДанныеГруппировки.Вставить("ДоговорКонтрагента");
		ДанныеГруппировки.Вставить("Уровень"); 
		
		ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаВерхнийУровень);
		
		Если ОбъединятьПозицииПриСозданииПлатежныхПоручений Тогда
		
			ВыборкаОрганизация = ВыборкаВерхнийУровень.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
			
			Пока ВыборкаОрганизация.Следующий() Цикл //Группировка "Организация" 
				
				ВыборкаКонтрагент = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				
				Пока ВыборкаКонтрагент.Следующий() Цикл //Группировка "Контрагент" 
					
					ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаКонтрагент);
					
					ВыборкаПодотчетноеЛицо = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
					
					Пока ВыборкаПодотчетноеЛицо.Следующий() Цикл //Группировка "Подотчетное лицо" 
						
						ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаПодотчетноеЛицо);
						
						ВыборкаПодразделение = ВыборкаПодотчетноеЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
						
						Пока ВыборкаПодразделение.Следующий() Цикл //Группировка "Подразделение"
							
							ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаПодразделение);
							
							ВыборкаСчетОрганизации = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
							
							Пока ВыборкаСчетОрганизации.Следующий() Цикл //Группировка "Банковский счет организации" 
								
								ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаСчетОрганизации);
								
								ВыборкаВалюта = ВыборкаСчетОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
								
								Пока ВыборкаВалюта.Следующий() Цикл //Группировка "Валюта" 
									
									ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаВалюта);
									
									ВыборкаВидОперации = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									Пока ВыборкаВидОперации.Следующий() Цикл  //Группировка "Вид операции"
										
										ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаВидОперации);
										
										ВыборкаСчетКонтрагента =  ВыборкаВидОперации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
										
										Пока ВыборкаСчетКонтрагента.Следующий() Цикл  //Группировка "Счет контрагента"
											
											ЗаполнитьЗначенияСвойств(ДанныеГруппировки, ВыборкаСчетКонтрагента);
											
											СтрокаГруппировка = Дерево.Строки.Добавить();
											ЗаполнитьЗначенияСвойств(СтрокаГруппировка, ДанныеГруппировки);
											СтрокаГруппировка.Уровень = 1;
											СтрокаГруппировка.ЕстьВыбранные = Истина;
											
											ВыборкаПозиция = ВыборкаСчетКонтрагента.Выбрать(); //Детальные записи
											ЕстьНезаполненныйБанковскийСчет = Ложь;
											Если ВыборкаПозиция.Количество() > 1 Тогда  
												Пока ВыборкаПозиция.Следующий() Цикл  
													СтрокаПозиция = СтрокаГруппировка.Строки.Добавить();
													ЗаполнитьЗначенияСвойств(СтрокаПозиция, ВыборкаПозиция);  
													СтрокаПозиция.Уровень = 2;
													СтрокаПозиция.ДетальнаяЗапись = Истина;
													СтрокаПозиция.НеЗаполненБаковскийСчет = Не ЗначениеЗаполнено(СтрокаПозиция.СчетОрганизации);
													СтрокаГруппировка.КоличествоДочернихСтрок = ВыборкаПозиция.Количество(); 
													Если Не ЗначениеЗаполнено(СтрокаПозиция.СчетОрганизации) Тогда
														ЕстьНезаполненныйБанковскийСчет = Истина;
													КонецЕсли;  
													СтрокаГруппировка.ЕстьНезаполненныйБанковскийСчет = ЕстьНезаполненныйБанковскийСчет;	
												КонецЦикла;
											Иначе   
												ВыборкаПозиция.Следующий();
												ЗаполнитьЗначенияСвойств(СтрокаГруппировка, ВыборкаПозиция);
												СтрокаГруппировка.Уровень = 1; 
												СтрокаГруппировка.ДетальнаяЗапись = Истина;  
												СтрокаГруппировка.ЕстьВыбранные = Истина;  
												СтрокаГруппировка.НеЗаполненБаковскийСчет = Не ЗначениеЗаполнено(СтрокаГруппировка.СчетОрганизации);
											КонецЕсли;		
											
										КонецЦикла; 
										
									КонецЦикла;
									
								КонецЦикла;
								
							КонецЦикла; 
							
						КонецЦикла;  
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
		Иначе
			СтрокаПозиция = Дерево.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПозиция, ДанныеГруппировки);  
			СтрокаПозиция.Уровень = 1;      
			СтрокаПозиция.ДетальнаяЗапись = Истина;    
			СтрокаПозиция.ЕстьВыбранные = Истина;   
			СтрокаПозиция.НеЗаполненБаковскийСчет = Не ЗначениеЗаполнено(СтрокаПозиция.СчетОрганизации);
		КонецЕсли;
		
	КонецЦикла;   
	
	ЗначениеВРеквизитФормы(Дерево,"ЗаявкиКИсполнениюДерево");

КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЗаявкиКИсполнениюПоПараметрамОтбора()
	
	ОбъединятьПозицииПриСозданииПлатежныхПоручений = ПолучитьФункциональнуюОпцию("ОбъединятьПозицииПриСозданииПлатежныхПоручений");
	
	ТекстЗапроса = ДенежныеСредстваВстраиваниеУХ.ПолучитьТекстЗапросаТаблицаЗаявкиКИсполнению(ОбъединятьПозицииПриСозданииПлатежныхПоручений);  

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоОрганизации", "РазмещениеЗаявок.ЗаявкаНаОперацию.Организация = &Организация"); 
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоОрганизации", "Истина"); 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоСчетуОрганизации", "РазмещениеЗаявок.БанковскийСчетКасса = &БанковскийСчет"); 
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоСчетуОрганизации", "Истина"); 
	КонецЕсли;  
	
	ВывестиЗаявкиВДерево(ТекстЗапроса);
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьТаблицуЗаявкиКИсполнениюПоРееструПлатежей()
	
	Если Не ЗначениеЗаполнено(Объект.РеестрПлатежей) Тогда  
		ЗаявкиКИсполнениюДерево.ПолучитьЭлементы().Очистить();
		Возврат;
	КонецЕсли;
	
	ОбъединятьПозицииПриСозданииПлатежныхПоручений = ПолучитьФункциональнуюОпцию("ОбъединятьПозицииПриСозданииПлатежныхПоручений");

	ТекстЗапроса = ДенежныеСредстваВстраиваниеУХ.ПолучитьТекстЗапросаТаблицаЗаявкиИзРеестраПлатежей(ОбъединятьПозицииПриСозданииПлатежныхПоручений);
	ВывестиЗаявкиВДерево(ТекстЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметку(Отметка)
	
	Для каждого СтрокаДерева1 Из ЗаявкиКИсполнениюДерево.ПолучитьЭлементы() Цикл
		СтрокаДерева1.Создавать = Отметка;   
		СтрокаДерева1.ЕстьВыбранные = Отметка;   
		Для каждого СтрокаДерева2 Из СтрокаДерева1.ПолучитьЭлементы() Цикл
			СтрокаДерева2.Создавать = Отметка;   
		КонецЦикла;
	КонецЦикла;
	
	ОбновитьИтогиВПодвале();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиВПодвале()
	
	Дерево = РеквизитФормыВЗначение("ЗаявкиКИсполнениюДерево");
	КоличествоКСозданию = Дерево.Строки.НайтиСтроки(Новый Структура("ЕстьВыбранные,Уровень", Истина, 1)).Количество();
	ДокументыКСозданию = Дерево.Строки.НайтиСтроки(Новый Структура("Создавать,ДетальнаяЗапись", 1, Истина), Истина);
	
	СуммаКСозданию = 0;
	Для Каждого СтрокаДерева Из ДокументыКСозданию Цикл  
		СуммаКСозданию = СуммаКСозданию + СтрокаДерева.СуммаДокумента; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	Если Объект.ГенерацияПоРееструПлатежей Тогда
		ОбновитьТаблицуЗаявкиКИсполнениюПоРееструПлатежей();
	Иначе
		ОбновитьТаблицуЗаявкиКИсполнениюПоПараметрамОтбора();
	КонецЕсли;   
	
	ОбновитьИтогиВПодвале();
	
КонецПроцедуры  

&НаСервере
Процедура СоздатьПлатежныеПорученияНаСервере()

	Дерево = РеквизитФормыВЗначение("ЗаявкиКИсполнениюДерево");
	ДокументыКВыгрузке = Дерево.Строки.НайтиСтроки(Новый Структура("Создавать, ДетальнаяЗапись", 1, Истина), Истина);
	
	РезультатПроверки = Истина;
	Для Каждого СтрокаДерева Из ДокументыКВыгрузке Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДерева.СчетОрганизации) Тогда 
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан банковский счет'"), , , "ЗаявкиКИсполнениюДерево.СчетОрганизации");    // ИСПРАВИТЬ
			РезультатПроверки = Ложь;
		КонецЕсли;                          
		
	КонецЦикла;
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ОбъединятьПозицииПриСозданииПлатежныхПоручений") Тогда
		СозданныеДокументы = ДенежныеСредстваВстраиваниеУХ.СоздатьСписаниеБезналичныхСредствПоВыгрузкеОбъединено(
																ДокументыКВыгрузке, Объект.ГенерацияПоРееструПлатежей);
	Иначе
		СозданныеДокументы = ДенежныеСредстваВстраиваниеУХ.СоздатьСписаниеБезналичныхСредствПоВыгрузке(
																ДокументыКВыгрузке, Объект.ГенерацияПоРееструПлатежей);	
	КонецЕсли; 
	
	Для Каждого ТекСозданныеДокументы Из СозданныеДокументы Цикл
		НовыйСозданныйДокумент = Объект.СозданныеДокументы.Добавить();
		НовыйСозданныйДокумент.ПлатежноеПоручение = ТекСозданныеДокументы;
	КонецЦикла;	  
	
	ОбновитьСписокНаСервере();
	УправлениеФормой(ЭтотОбъект); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаПараметрыОтбора.Видимость = Не Объект.ГенерацияПоРееструПлатежей;
	Элементы.ГруппаРеестрПлатежей.Видимость = Объект.ГенерацияПоРееструПлатежей;
	
	КоличествоСозданныхДокументов = Объект.СозданныеДокументы.Количество();
	Если КоличествоСозданныхДокументов > 0 Тогда
		ЗаголовокКомандыСозданныеОбъекты = СтрШаблон(НСтр("ru = 'Созданные документы (%1)'"), КоличествоСозданныхДокументов);
	Иначе
		ЗаголовокКомандыСозданныеОбъекты = НСтр("ru = 'Созданные документы'");
	КонецЕсли;
	Элементы.ФормаСписокСозданныхОбъектов.Заголовок = ЗаголовокКомандыСозданныеОбъекты;
	
	Элементы.ФормаСписокСозданныхОбъектов.Доступность = (КоличествоСозданныхДокументов > 0);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыРеестра(РеестрПлатежей)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеестрПлатежей, "Организация,ДатаОплаты");
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокСозданныхОбъектов(ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Объект.СозданныеДокументы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйДокумент = Объект.СозданныеДокументы[0].ПлатежноеПоручение;
	
	Если Объект.СозданныеДокументы.Количество() = 1 Тогда
		
		ПоказатьЗначение(, ПервыйДокумент);
		
	Иначе
		
		Отбор = Новый Структура;
		Если Объект.ГенерацияПоРееструПлатежей Тогда
			РеквизитыРеестра = ПолучитьРеквизитыРеестра(Объект.РеестрПлатежей);
			Отбор.Вставить("Организация", РеквизитыРеестра.Организация);
			Отбор.Вставить("ДатаОтбора", РеквизитыРеестра.ДатаОплаты);
		Иначе
			
			Если ЗначениеЗаполнено(Объект.Организация) Тогда
				Отбор.Вставить("Организация", Объект.Организация);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
				Отбор.Вставить("СчетОрганизации", Объект.БанковскийСчет);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.НачалоПериода) И Объект.НачалоПериода = Объект.КонецПериода Тогда
				Отбор.Вставить("ДатаОтбора", Объект.НачалоПериода);
			КонецЕсли;
		КонецЕсли;
		
		СписокДокументов = Новый СписокЗначений;
		Для Каждого ТекСозданныйДокумент Из Объект.СозданныеДокументы Цикл
			СписокДокументов.Добавить(ТекСозданныйДокумент.ПлатежноеПоручение);
		КонецЦикла;
		СписокВыделения = Новый Структура("Ссылка", СписокДокументов);
		
		ДенежныеСредстваВстраиваниеУХКлиент.ОткрытьСписокСозданныхПлатежныхПоручений(
			ЭтаФорма, Отбор, СписокВыделения );
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
