
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Возвращает структуру с диапазоном допустимых дат планируемых операций
//
// Параметры:
//  Объект	 - ДокументОбъектОбъект	- Проверяемый документ. Сейчас не используется, 
//									  но возможно понадобится для привязки диапазона к дате документа.
// 
// Возвращаемое значение:
//  Структура - Структура с ключами Мин и Макс
//
Функция ДиапазонДопустимыхДатОпераций(Объект) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Мин", '20100101000000');
	Результат.Вставить("Макс", '20991231235959');
	
	Возврат Результат;
	
КонецФункции

#Область ДополнительныеДействия
	
Процедура ЗарегистрироватьДополнительныеДействия(ОписаниеКТ) Экспорт
	
	Если НЕ ОписаниеКТ.Свойство("ДополнительныеДействия") Тогда
		ОписаниеКТ.Вставить("ДополнительныеДействия", Новый СписокЗначений);
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПараметрыДополнительныхДействий(ОписаниеКТ, Форма, ИмяДополнительногоДействия) Экспорт
	
	Элементы = Форма.Элементы;
	
	ПараметрыДопДействия = Новый Структура;
	ПараметрыДопДействия.Вставить("ИдентификаторФормыОперПлана", Форма.УникальныйИдентификатор);
	ПараметрыДопДействия.Вставить("ИмяОткрываемойФормы", неопределено);
	
	Если ИмяДополнительногоДействия = "РаспределениеТоварнойКатегории" Тогда
		ПараметрыДопДействия.ИмяОткрываемойФормы = "Обработка.РаспределениеТоварнойКатегории.Форма.Форма";
		
		КроссТаблица = Форма[ОписаниеКТ.Реквизиты.КроссТаблица];
		ИдентификаторСтроки = Элементы[ОписаниеКТ.Элементы.КроссТаблица].ТекущаяСтрока;
		Если ИдентификаторСтроки = неопределено Тогда
			Возврат неопределено;
		КонецЕсли;
		
		ДанныеСтроки = КроссТаблица.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Периоды = Форма[ОписаниеКТ.Реквизиты.Периоды];
		АктивныеПериоды = Периоды.НайтиСтроки(Новый Структура("Активная", Истина));
		
		ДанныеПланирования = Новый ТаблицаЗначений;
		ДанныеПланирования.Колонки.Добавить("ЭтоКатегорияНоменклатуры");
		ДанныеПланирования.Колонки.Добавить("Номенклатура");
		ДанныеПланирования.Колонки.Добавить("Период");
		ДанныеПланирования.Колонки.Добавить("ДатаНачала");
		ДанныеПланирования.Колонки.Добавить("Сумма");
		
		АналитикиСтроки = "ЭтоКатегорияНоменклатуры, Номенклатура";
		АналитикиКолонки = "Период, ДатаНачала";
		
		// Описание полей
		ОписаниеСумма = ОписаниеКТ.Схема.Поля.СуммаРезультат;
		
		Для каждого СтрокаПериод Из АктивныеПериоды Цикл
		
			Если СтрокаПериод.НомерКолонки <= 0 Тогда 
				Продолжить 
			КонецЕсли;
			
			Строка = ДанныеПланирования.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, ДанныеСтроки, АналитикиСтроки);
			ЗаполнитьЗначенияСвойств(Строка, СтрокаПериод, АналитикиКолонки);
			Строка.Сумма = ДанныеСтроки[ОписаниеСумма.ПрефиксРеквизитаКолонки + СтрокаПериод.ИмяКолонки];
			
		КонецЦикла;
		ДанныеПланирования.Сортировать("ДатаНачала");
		ПараметрыДопДействия.Вставить("АдресДанные", ПоместитьВоВременноеХранилище(ДанныеПланирования));
		ПараметрыДопДействия.Вставить("ИмяДополнительногоДействияОперПлана", ИмяДополнительногоДействия);
		ПараметрыДопДействия.Вставить("ИдентификаторСтрокиОперПлана", ИдентификаторСтроки);
		
		// Номенклатура, использованная в ОперПлане для проверки единицы измерения и цены
		ЗарегистрированнаяНоменклатура = 
			КроссТаблица.Выгрузить(Новый Структура("ЭтоКатегорияНоменклатуры", Ложь), "Номенклатура, Характеристика, ЕдиницаИзмерения, Цена");
		ПараметрыДопДействия.Вставить("АдресЗарегистрированнаяНоменклатура", ПоместитьВоВременноеХранилище(ЗарегистрированнаяНоменклатура));
		
	КонецЕсли;
	
	Возврат ПараметрыДопДействия;
	
КонецФункции

Функция ВыполнитьОбработкуРезультатаДействия(ОписаниеКТ, Форма, ИмяДополнительногоДействия, Параметры, РезультатДействия, ДанныеКЗагрузке) Экспорт
	
	Если ИмяДополнительногоДействия = "РаспределениеТоварнойКатегории" Тогда
		
		Если НЕ Параметры.Свойство("ИдентификаторСтрокиОперПлана") Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка при получении данных для загрузки'");
		КонецЕсли;
		
		КроссТаблица = Форма[ОписаниеКТ.Реквизиты.КроссТаблица];
		РаспределяемаяСтрока = КроссТаблица.НайтиПоИдентификатору(Параметры.ИдентификаторСтрокиОперПлана);
		Если РаспределяемаяСтрока = неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Не найдена строка операционного плана'");
		КонецЕсли;
		
		// Сформировать результирующую таблицу
		Для Каждого Строка Из РезультатДействия Цикл
			СтрокаКЗагрузке = ДанныеКЗагрузке.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКЗагрузке, РаспределяемаяСтрока);
			ЗаполнитьЗначенияСвойств(СтрокаКЗагрузке, Строка);
		КонецЦикла;
		
		ДанныеПоКатегории = РезультатДействия.Скопировать();
		ДанныеПоКатегории.Свернуть("Период", "Сумма");
		Для Каждого СтрокаДляКатегории Из ДанныеПоКатегории Цикл
			Строка = ДанныеКЗагрузке.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, РаспределяемаяСтрока);
			Строка.Период = СтрокаДляКатегории.Период;
			Строка.Сумма = -СтрокаДляКатегории.Сумма;
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#КонецОбласти

