
#Область СлужебныеПроцедурыИФункцииУТ

Процедура ЗаполнитьПараметрыСканированияЧекККМ(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества) Экспорт
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ВНаличии"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Продажа";
	
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСканированияЧекККМВозврат(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества) Экспорт
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.Реализована"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Возврат";
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
