
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого СтрСпособ ИЗ Параметры.НастройкиПоиска Цикл
		
		НоваяСтрока=НастройкаПоиска.Добавить();
		НоваяСтрока.СпособПоиска=СтрСпособ.Значение;
		НоваяСтрока.ПредставлениеСпособа=СтрСпособ.Представление;
		НоваяСтрока.Использование=СтрСпособ.Пометка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СписокПоиска=Новый СписокЗначений;
	
	Для Каждого СтрСпособ ИЗ НастройкаПоиска Цикл
		
		СписокПоиска.Добавить(СтрСпособ.СпособПоиска,СтрСпособ.ПредставлениеСпособа,СтрСпособ.Использование);
		
	КонецЦикла;
	
	Закрыть(СписокПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры
