#Область ОписаниеПеременных

&НаКлиенте
Перем ПоследнееВыделение;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Закэшируем пользовательские настройки
	КэшПользовательскихНастроек = Новый Структура;
	Для Сч = 0 По Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Количество()-1 Цикл
		Настройка = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(Сч);
		КэшПользовательскихНастроек.Вставить(Строка(Настройка.Параметр), Сч);
	КонецЦикла;
	
	ПроверятьУтверждениеНастроекОтчетов = ПолучитьФункциональнуюОпцию("ПроверятьУтверждениеНастроекОтчетов")
		И ПравоДоступа("Редактирование", Метаданные.Справочники.БланкиОтчетов)
		И ПравоДоступа("Редактирование", Метаданные.Справочники.ПравилаОбработки)
		И ПравоДоступа("Редактирование", Метаданные.Справочники.ПравилаПроверки);
	Элементы.ФормаУтвердитьБланкиИПравила.Видимость = ПроверятьУтверждениеНастроекОтчетов;
	
	ЦветФонаВыделения = Метаданные.ЭлементыСтиля.ЦветВыделенияВТабличномДокументе.Значение;
	
	Если Параметры.Свойство("ОграничитьКлючевыеНастройки") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ВерсияРегламента", "ТолькоПросмотр", Параметры.ОграничитьКлючевыеНастройки);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "УправлениеПериодом", "ТолькоПросмотр", Параметры.ОграничитьКлючевыеНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	Если Параметры.Свойство("Расшифровка")
		И ТипЗнч(Параметры.Расшифровка) = Тип("ОписаниеОбработкиРасшифровкиКомпоновкиДанных") Тогда
		
		// Обработка расшифровки отчета
		// Для данного отчета возможен только один вид расшифровки "Отфильтровать"
		СтруктураНастроекКомпоновкиДанных = Параметры.Расшифровка.ПрименяемыеНастройки.Структура;
		Для Каждого ЭлементСтруктуры Из СтруктураНастроекКомпоновкиДанных Цикл
			Если ЭлементСтруктуры.Использование Тогда
				Для Каждого ЭлементПереданногоОтбора Из ЭлементСтруктуры.Отбор.Элементы Цикл
					ОтборУстановлен = Ложь;
					Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
						Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
							И ЭлементОтбора.Родитель = Неопределено
							И ЭлементОтбора.ЛевоеЗначение = ЭлементПереданногоОтбора.ЛевоеЗначение Тогда
							// Отбор совпадает
							ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементПереданногоОтбора);
							ОтборУстановлен = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ ОтборУстановлен Тогда
						ЭлементОтбора = Настройки.Отбор.Элементы.Добавить();
						ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементПереданногоОтбора);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если Параметры.Свойство("ВерсияРегламента") Тогда
		Отчет.ВерсияРегламента = Параметры.ВерсияРегламента;
	Иначе
		Отчет.ВерсияРегламента = Настройки.Элементы.Получить(КэшПользовательскихНастроек.ВерсияРегламента).Значение;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.ВерсияРегламента) Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(КэшПользовательскихНастроек.ВерсияРегламента).Значение = Отчет.ВерсияРегламента;
	КонецЕсли;
	
	Если Параметры.Свойство("УправлениеПериодом") Тогда
		Отчет.УправлениеПериодом = Параметры.УправлениеПериодом;
	Иначе
		Отчет.УправлениеПериодом = Настройки.Элементы.Получить(КэшПользовательскихНастроек.УправлениеПериодом).Значение;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.УправлениеПериодом) Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(КэшПользовательскихНастроек.УправлениеПериодом).Значение = Отчет.УправлениеПериодом;
	КонецЕсли;
	
	Если Параметры.Свойство("КомпактныйРежим") Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(КэшПользовательскихНастроек.КомпактныйРежим).Значение = Параметры.КомпактныйРежим;
	КонецЕсли;
	Если Параметры.Свойство("ИерархияВидовОтчетов") Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(КэшПользовательскихНастроек.ИерархияВидовОтчетов).Значение = Параметры.ИерархияВидовОтчетов;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначенияОтбора") Тогда
		Для Каждого ТекущийОтбор Из Параметры.ЗначенияОтбора Цикл
			Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТекущийОтбор.Ключ) Тогда
					ЭлементОтбора.Использование = Истина;
					Если ТипЗнч(ТекущийОтбор.Значение) = Тип("СписокЗначений") Тогда
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					Иначе
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					КонецЕсли;
					ЭлементОтбора.ПравоеЗначение = ТекущийОтбор.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьОписаниеНастройки();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияРегламентаПриИзменении(Элемент)
	
	КлючевыеПараметрыПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПериодомПриИзменении(Элемент)
	
	КлючевыеПараметрыПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)

	ВосстановитьФонПредудущихОбластей();
	
	Если Отчет.КомпактныйРежим Тогда
		ВыделитьОбластьНастроекКомпактныйРежим(Элемент);
	Иначе
		ВыделитьОбластьНастроек(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеРасшифровки = ДанныеРасшифровкиНаСервере(Расшифровка, ДанныеРасшифровки);
	ДополнитьЗначениеРасшифровкиНаСервере(ЗначениеРасшифровки, ДанныеРасшифровки);
	ОткрытьФормуВводаЗначенийНастройки(ЗначениеРасшифровки);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВводаЗначенийНастройки(ЗначениеРасшифровки)
	
	ЗначениеРасшифровки.Вставить("ВерсияРегламента", Отчет.ВерсияРегламента);
	ЗначениеРасшифровки.Вставить("УправлениеПериодом", Отчет.УправлениеПериодом);
	ЗначениеРасшифровки.Вставить("ВызовИзРегламента", Истина);
	
	Оповещение = Новый ОписаниеОповещения("СформироватьОтчет", ЭтаФорма);
	
	ОткрытьФорму("Отчет.НастройкаОбработкиШаблоновДокументов.Форма.ФормаВводаЗначенийНастройки", ЗначениеРасшифровки, ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	МассивДействий = Новый Массив;
	ДополнительныеДействия = Новый СписокЗначений;
	
	// Получим значения расшифровки
	МассивРасшифровок = ПолучитьДанныеРасшифровок();
	
	ОднаОрганизация = Ложь;
	ОрганизацияРасшифровки = Неопределено;
	ОдинШаблон = Ложь;
	ШаблонРасшифровки = Неопределено;
	
	Для Каждого СтруктураДанныхРасшифровки Из МассивРасшифровок Цикл
		
		Если СтруктураДанныхРасшифровки.Свойство("Организация")
			И ЗначениеЗаполнено(СтруктураДанныхРасшифровки.Организация) Тогда
			Если ОрганизацияРасшифровки = Неопределено Тогда
				ОрганизацияРасшифровки = СтруктураДанныхРасшифровки.Организация;
				ОднаОрганизация = Истина;
			ИначеЕсли СтруктураДанныхРасшифровки.Организация <> ОрганизацияРасшифровки Тогда
				ОднаОрганизация = Ложь;
			КонецЕсли;
			ОрганизацияРасшифровки = Истина;
		КонецЕсли;
		
		Если СтруктураДанныхРасшифровки.Свойство("ШаблонДокумента")
			И ЗначениеЗаполнено(СтруктураДанныхРасшифровки.ШаблонДокумента)
			И НЕ ЭтоГруппа(СтруктураДанныхРасшифровки.ШаблонДокумента) = Истина Тогда
			Если ШаблонРасшифровки = Неопределено Тогда
				ШаблонРасшифровки = СтруктураДанныхРасшифровки.ШаблонДокумента;
				ОдинШаблон = Истина;
			ИначеЕсли СтруктураДанныхРасшифровки.ШаблонДокумента <> ШаблонРасшифровки Тогда
				ОдинШаблон = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОдинШаблон Тогда
		
		ДополнительныеДействия.Добавить("ИзменитьНастройки", НСтр("ru = 'Изменить настройки'"), , БиблиотекаКартинок.Настройка);
		
		Если ОднаОрганизация Тогда
			
			// Это элемент настройки
			ДополнительныеДействия.Добавить("СкопироватьНастройки", НСтр("ru = 'Скопировать настройки'"), , БиблиотекаКартинок.СкопироватьОбъект);
			
		ИначеЕсли ОрганизацияРасшифровки = Неопределено Тогда
			
			// Это шаблон
			МассивДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
			МассивДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
			
		КонецЕсли;
		
		// Один шаблон, несколько или одна организация
		Если НастройкиКопирования <> Неопределено Тогда
			ДополнительныеДействия.Добавить("ВставитьНастройки", НСтр("ru = 'Вставить настройки'"), , БиблиотекаКартинок.Вставить);
		КонецЕсли;
		
	ИначеЕсли ОднаОрганизация Тогда
		
		// Это организация
		МассивДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
		МассивДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
		
	КонецЕсли;
	
	Если ШаблонРасшифровки <> Неопределено Тогда
		ДополнительныеДействия.Добавить("УстановитьЗначенияПоУмолчанию", НСтр("ru = 'Установить значения по умолчанию'"), , БиблиотекаКартинок.ПолеВводаОчистить);
		ДополнительныеДействия.Добавить("УстановитьСпособФормирования", НСтр("ru = 'Установить способ формирования для всех...'"));
		ДополнительныеДействия.Добавить("УстановитьВнешнююИБ", НСтр("ru = 'Установить внешнюю информационную базу для всех...'"));
		Если ПроверятьУтверждениеНастроекОтчетов Тогда
			ДополнительныеДействия.Добавить("УтвердитьБланкиИПравила", НСтр("ru = 'Утвердить бланки и правила'"), , БиблиотекаКартинок.ОформлениеФлажок);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Расшифровка", Расшифровка);
	ДополнительныеПараметры.Вставить("МассивРасшифровок", МассивРасшифровок);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораДействияРасшифровки", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
	ОбработкаРасшифровки.ПоказатьВыборДействия(ОписаниеОповещения, Расшифровка, МассивДействий, ДополнительныеДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействияРасшифровки(ВыбранноеДействие, ПараметрВыбранногоДействия, ДополнительныеПараметры) Экспорт
	
	МассивСообщений = Новый Массив;
	
	Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		
		ПоказатьЗначение(,ПараметрВыбранногоДействия);
		
	ИначеЕсли ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда
		
		ОписаниеОбработкиРасшифровки = Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ДополнительныеПараметры.Расшифровка, ПараметрВыбранногоДействия);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("Расшифровка", ОписаниеОбработкиРасшифровки);
		
		ОткрытьФорму("Отчет.НастройкаОбработкиШаблоновДокументов.ФормаОбъекта", ПараметрыФормы, , Новый УникальныйИдентификатор);
		
	ИначеЕсли ВыбранноеДействие = "ИзменитьНастройки" Тогда
		
		МассивРасшифровок = ДополнительныеПараметры.МассивРасшифровок;
		
		// Сформируем структуру для расшифровки
		ЗначениеРасшифровки = Новый Структура;
		ЗначениеРасшифровки.Вставить("ШаблонДокумента", ПолучитьЗначениеИзМассиваРасшифровок(МассивРасшифровок, "ШаблонДокумента"));
		ЗначениеРасшифровки.Вставить("Организация", ПолучитьЗначениеИзМассиваРасшифровок(МассивРасшифровок, "Организация"));
		Если Отчет.РазделениеПоПроектам Тогда
			ЗначениеРасшифровки.Вставить("Проект", ПолучитьЗначениеИзМассиваРасшифровок(МассивРасшифровок, "Проект"));
		КонецЕсли;
		Для Сч = 1 По Отчет.МаксКлючевыхАналитик Цикл
			ЗначениеРасшифровки.Вставить("Аналитика" + Сч, ПолучитьЗначениеИзМассиваРасшифровок(МассивРасшифровок, "Аналитика" + Сч));
		КонецЦикла;
		
		// Откроем форму ввода значений настройки
		ОткрытьФормуВводаЗначенийНастройки(ЗначениеРасшифровки);
		
	ИначеЕсли ВыбранноеДействие = "СкопироватьНастройки" Тогда
		
		СкопироватьНастройки(ДополнительныеПараметры.МассивРасшифровок.Получить(0));
		
	ИначеЕсли ВыбранноеДействие = "ВставитьНастройки" Тогда
		
		ВставитьНастройки(ДополнительныеПараметры.МассивРасшифровок);
		СформироватьОтчет(Истина);
		
	ИначеЕсли ВыбранноеДействие = "УстановитьЗначенияПоУмолчанию" Тогда
		
		УстановитьЗначенияПоУмолчанию(ДополнительныеПараметры.МассивРасшифровок);
		СформироватьОтчет(Истина);
		
	ИначеЕсли ВыбранноеДействие = "УстановитьСпособФормирования" Тогда
		
		ДополнительныеПараметры.Вставить("ЭлементНастройки", "СпособФормированияОтчета");
		
		ОткрытьФорму("Перечисление.СпособыФормированияОтчетов.ФормаВыбора", , ЭтаФорма, , ,,
			Новый ОписаниеОповещения("ПослеВыбораЭлементаНастройки", ЭтаФорма, ДополнительныеПараметры));
		
	ИначеЕсли ВыбранноеДействие = "УстановитьВнешнююИБ" Тогда
			
		ДополнительныеПараметры.Вставить("ЭлементНастройки", "ВнешняяИнформационнаяБаза");
		
		ОткрытьФорму("Справочник.ВнешниеИнформационныеБазы.ФормаВыбора", , ЭтаФорма, , ,,
			Новый ОписаниеОповещения("ПослеВыбораЭлементаНастройки", ЭтаФорма, ДополнительныеПараметры));
			
	ИначеЕсли ВыбранноеДействие = "УтвердитьБланкиИПравила" Тогда
			
		УтвердитьБланкиИПравилаИзРасшифровки(ДополнительныеПараметры.МассивРасшифровок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлементаНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияНастроек = Новый Структура;
	ЗначенияНастроек.Вставить(ДополнительныеПараметры.ЭлементНастройки, Результат);
	
	УстановитьЭлементНастройки(ДополнительныеПараметры.МассивРасшифровок, ЗначенияНастроек);
	
	СформироватьОтчет(Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементНастройки(МассивРасшифровок, ЗначенияНастроек)
	
	Для Каждого ЗначениеРасшифровки Из МассивРасшифровок Цикл
		
		Если ТипЗнч(ЗначенияНастроек) = Тип("Структура") 
			И ЗначенияНастроек.Свойство("СпособФормированияОтчета")
			И ТипЗнч(ЗначениеРасшифровки.ШаблонДокумента) <> Тип("СправочникСсылка.ВидыОтчетов") Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыЗаписи = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ЗначениеРасшифровки);
		
		УправлениеОтчетамиУХ.УстановитьНастройкиОбработкиШаблонов(ПараметрыЗаписи, ЗначенияНастроек);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройки(ЗначениеРасшифровки)
	
	ПараметрыРасчета = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ЗначениеРасшифровки);
	
	тЗначенияНастроек = УправлениеОтчетамиУХ.ЗначенияНастроекОбработкиШаблонов(ПараметрыРасчета);
	Если тЗначенияНастроек.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиКопирования = Новый Структура;
	СтрокаТаблицы = тЗначенияНастроек.Получить(0);
	Для Каждого КолонкаТаблицы Из тЗначенияНастроек.Колонки Цикл
		НастройкиКопирования.Вставить(КолонкаТаблицы.Имя, СтрокаТаблицы[КолонкаТаблицы.Имя]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьНастройки(МассивРасшифровок)
	
	Если НЕ ТипЗнч(НастройкиКопирования) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗначениеРасшифровки Из МассивРасшифровок Цикл
		
		ПараметрыЗаписи = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ЗначениеРасшифровки);
		
		Если ЗначениеРасшифровки.ШаблонДокумента = НастройкиКопирования.ШаблонДокумента Тогда
			
			УправлениеОтчетамиУХ.УстановитьНастройкиОбработкиШаблонов(ПараметрыЗаписи, НастройкиКопирования);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию(МассивРасшифровок)
	
	УстановитьЭлементНастройки(МассивРасшифровок, Неопределено);

КонецПроцедуры

&НаСервере
Процедура УтвердитьБланкиИПравилаИзРасшифровки(МассивРасшифровок)
	
	НачатьТранзакцию();
	
	Для Каждого Расшифровка Из МассивРасшифровок Цикл
		
		ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(Расшифровка);
		ЗначенияНастроек = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыНастроек);
		
		Для Каждого КлючИЗначение Из ЗначенияНастроек Цикл
			
			Если НЕ (КлючИЗначение.Ключ = "БланкДляОтображения"
				ИЛИ КлючИЗначение.Ключ = "БланкСводнойТаблицы"
				ИЛИ КлючИЗначение.Ключ = "БланкДляИмпорта"
				ИЛИ КлючИЗначение.Ключ = "ПравилоОбработки"
				ИЛИ КлючИЗначение.Ключ = "ПравилоПроверки") Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			СпрОбъект = КлючИЗначение.Значение.ПолучитьОбъект();
			СпрОбъект.ОбменДанными.Загрузка = истина;
			Если ТипЗнч(СпрОбъект) = Тип("СправочникОбъект.БланкиОтчетов") Тогда
				Если СпрОбъект.Утвержден Тогда
					Продолжить;
				КонецЕсли;
				СпрОбъект.Утвержден = Истина;
			Иначе
				Если СпрОбъект.Утверждено Тогда
					Продолжить;
				КонецЕсли;
				СпрОбъект.Утверждено = Истина;
			КонецЕсли;
			
			Попытка
				СпрОбъект.Записать();
			Исключение
				ОтменитьТранзакцию();
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстСообщения = НСтр("ru = 'Не удалось записать ""%1"", по причине: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
					СпрОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				Возврат;
			КонецПопытки;
			
		КонецЦикла;

	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	ТекстСообщения = НСтр("ru = 'Бланки и правила расчета утверждены'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	Элементы.ФормаНастройки.Пометка = НЕ Элементы.ФормаНастройки.Пометка;
	Элементы.ГруппаНастройки.Видимость = Элементы.ФормаНастройки.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьБланкиИПравила(Команда)
	
	Если Результат.ВысотаТаблицы = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо сначала сформировать отчет'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Вы действительно хотите утвердить все бланки и правила?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("УтвердитьБланкиИПравилаПослеВопроса", ЭтаФорма), ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте 
Процедура УтвердитьБланкиИПравилаПослеВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УтвердитьБланкиИПравилаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УтвердитьБланкиИПравилаНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Если ТекОбъект.УтвердитьБланкиИПравила() Тогда
		ТекстСообщения = НСтр("ru = 'Все бланки и правила расчета утверждены'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьОписаниеНастройки()
	
	Если Не ЗначениеЗаполнено(Отчет.ВерсияРегламента) Тогда
		ОписаниеНастройки = НСтр("ru = 'Настройки по умолчанию.'");
	Иначе
		
		ОписаниеНастройки = НСтр("ru = 'Индивидуальные настройки для регламента подготовки отчетности ""%1""'");
		
		Если ЗначениеЗаполнено(Отчет.УправлениеПериодом) Тогда
			ОписаниеНастройки = ОписаниеНастройки +
				НСтр("ru = ' и отчетного периода ""%2""'");
		КонецЕсли;
			
		ОписаниеНастройки = ОписаниеНастройки + ". " + Символы.ПС +
			НСтр("ru = 'Организации и виды отчетов из регламента.'");
		
	КонецЕсли;
	
	ОписаниеНастройки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеНастройки,
		Отчет.ВерсияРегламента, Отчет.УправлениеПериодом);

КонецПроцедуры

&НаКлиенте
Процедура КлючевыеПараметрыПриИзменении()
	
	СформироватьОписаниеНастройки();
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(КэшПользовательскихНастроек.ВерсияРегламента).Значение = Отчет.ВерсияРегламента;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(КэшПользовательскихНастроек.УправлениеПериодом).Значение = Отчет.УправлениеПериодом;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "Неактуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Истина Тогда
		// Были изменения настроек
		СкомпоноватьРезультат();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеРасшифровок()
	
	МассивРасшифровок = Новый Массив;
	
	Если Отчет.КомпактныйРежим Тогда
		
		// Возможно групповое выделение ячеек
		Для СчСтолбцы = Результат.ТекущаяОбласть.Лево По Результат.ТекущаяОбласть.Право Цикл
			Для СчСтроки = Результат.ТекущаяОбласть.Верх По Результат.ТекущаяОбласть.Низ Цикл
				
				ТекущаяОбласть = Результат.Область(СчСтроки, СчСтолбцы, СчСтроки, СчСтолбцы);
				Если ТекущаяОбласть.Расшифровка = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхРасшифровки = ДанныеРасшифровкиНаСервере(ТекущаяОбласть.Расшифровка, ДанныеРасшифровки);
				СтруктураДанныхРасшифровки.Вставить("ВерсияРегламента", Отчет.ВерсияРегламента);
				СтруктураДанныхРасшифровки.Вставить("УправлениеПериодом", Отчет.УправлениеПериодом);
				
				МассивРасшифровок.Добавить(СтруктураДанныхРасшифровки);
				
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		СтруктураДанныхРасшифровки = ДанныеРасшифровкиНаСервере(Результат.ТекущаяОбласть.Расшифровка, ДанныеРасшифровки);
		СтруктураДанныхРасшифровки.Вставить("ВерсияРегламента", Отчет.ВерсияРегламента);
		СтруктураДанныхРасшифровки.Вставить("УправлениеПериодом", Отчет.УправлениеПериодом);
			
		МассивРасшифровок.Добавить(СтруктураДанныхРасшифровки);
		
	КонецЕсли;
	
	Возврат МассивРасшифровок;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеИзМассиваРасшифровок(МассивРасшифровок, ИмяРеквизита)
	
	МассивЗначений = Новый Массив;
	Для Каждого Расшифровка Из МассивРасшифровок Цикл
		Если Расшифровка.Свойство(ИмяРеквизита)
			И МассивЗначений.Найти(Расшифровка[ИмяРеквизита]) = Неопределено Тогда
			МассивЗначений.Добавить(Расшифровка[ИмяРеквизита]);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗначений.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли МассивЗначений.Количество() = 1 Тогда
		Возврат МассивЗначений.Получить(0);
	Иначе
		Возврат МассивЗначений;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеРасшифровкиНаСервере(Расшифровка, ДанныеРасшифровки)
	
	СтруктураДанныхРасшифровки = Новый Структура;
	
	Если Расшифровка <> Неопределено Тогда
	
		ДанныеРасшифровкиЗначение = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
		
		МассивПолей = ДанныеРасшифровкиЗначение.Элементы[Расшифровка].ПолучитьПоля();
		Для Каждого Поле Из МассивПолей Цикл
			СтруктураДанныхРасшифровки.Вставить(Поле.Поле, Поле.Значение);
		КонецЦикла;
		
		// Значения всех вышестоящих группировок
		ПолучитьЗначениеГруппировки(ДанныеРасшифровкиЗначение, Расшифровка, СтруктураДанныхРасшифровки);
		
	КонецЕсли;
	
	Возврат СтруктураДанныхРасшифровки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьЗначениеРасшифровкиНаСервере(ЗначениеРасшифровки, ДанныеРасшифровки)
	
	Если ЗначениеРасшифровки.Свойство("ШаблонДокумента") И ЗначениеРасшифровки.Свойство("Организация") Тогда
		// Расшифровка на пересечении шаблона документа и организации
		Возврат;
	ИначеЕсли НЕ ЗначениеРасшифровки.Свойство("ШаблонДокумента") Тогда
		// Расшифровка по организации в шапке отчета,
		// заполнение настроек по всем шаблонам документа
		ИмяКолонки = "ШаблонДокумента";
	ИначеЕсли НЕ ЗначениеРасшифровки.Свойство("Организация") Тогда
		// Расшифровка по шаблону документа в первой колонке отчета,
		// заполнение настроек по всем организациям
		ИмяКолонки = "Организация";
	КонецЕсли;
	
	ДанныеРасшифровкиЗначение = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Настройки = ДанныеРасшифровкиЗначение.Настройки;
	СхемаКомпоновкиДанных = Отчеты.НастройкаОбработкиШаблоновДокументов.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	ТекстЗапроса = МакетКомпоновки.НаборыДанных[0].Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	Пакет8 = СхемаЗапроса.ПакетЗапросов[7];
	Пакет8.Операторы[0].ВыбираемыеПоля.Очистить();
	Пакет8.Порядок.Очистить();
	Пакет8.Операторы[0].ВыбиратьРазличные = Истина;
	Пакет8.Операторы[0].ВыбираемыеПоля.Добавить("ДанныеНастроек." + ИмяКолонки);
	КолонкаШаблонДокумента = Пакет8.Колонки[Пакет8.Колонки.Количество() - 1];
	КолонкаШаблонДокумента.Псевдоним = ИмяКолонки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Для Каждого ПараметрКомпоновки Из МакетКомпоновки.ЗначенияПараметров Цикл
		Если ПараметрКомпоновки.Имя = "ВерсияРегламента"
			ИЛИ ПараметрКомпоновки.Имя = "УправлениеПериодом"
			ИЛИ СтрНачинаетсяС(ПараметрКомпоновки.Имя, "П") Тогда
			
			Запрос.УстановитьПараметр(ПараметрКомпоновки.Имя, ПараметрКомпоновки.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	ЗначениеРасшифровки.Вставить(ИмяКолонки, Выгрузка.ВыгрузитьКолонку(ИмяКолонки));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеЭлементаРасшифровкиПоПолю(ДанныеРасшифровки, ИдентификаторРасшифровки, ИмяПоля)
	
	ЗначениеЭлемента = "";
	
	ДанныеРасшифровкиЗначение = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементРасшифровки = ДанныеРасшифровкиЗначение.Элементы[ИдентификаторРасшифровки];
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		
		Для Каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			
			Если Поле.Поле = ИмяПоля Тогда
				ЗначениеЭлемента = Поле.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЗначениеЭлемента;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьЗначениеГруппировки(ДанныеРасшифровкиЗначение, Расшифровка, СтруктураДанныхРасшифровки)
	
	МассивРодителей = ДанныеРасшифровкиЗначение.Элементы[Расшифровка].ПолучитьРодителей();
	Для СчРодителей = 1 По МассивРодителей.Количество() Цикл
		
		ПолеРодитель = МассивРодителей[СчРодителей-1];
		Если Число(ПолеРодитель.Идентификатор) > 0 Тогда
			
			// Получим текущее поле
			Если ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
				МассивПолей = ПолеРодитель.ПолучитьПоля();
			ИначеЕсли ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
				МассивПолей = ПолеРодитель.ПолучитьРодителей()[0].ПолучитьПоля();
			КонецЕсли;
			
			Для Каждого Поле Из МассивПолей Цикл
				Если НЕ СтруктураДанныхРасшифровки.Свойство(Поле.Поле)
					ИЛИ НЕ ЗначениеЗаполнено(СтруктураДанныхРасшифровки[Поле.Поле]) Тогда
					СтруктураДанныхРасшифровки.Вставить(Поле.Поле, Поле.Значение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппа(ШаблонДокумента)
	
	Если ТипЗнч(ШаблонДокумента) = Тип("СправочникСсылка.ШаблоныКорректировокЗначенийПоказателей") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонДокумента, "ЭтоГруппа");
	
КонецФункции

#Область Выделение

&НаКлиенте
Процедура ВыделитьОбластьНастроекКомпактныйРежим(Элемент)
	
	ПоследнееВыделение = Новый Соответствие;
	
	ТекущаяОбласть = Элемент.ТекущаяОбласть;
	
	Если (ТекущаяОбласть.Верх = 1 И ТекущаяОбласть.Низ = 1)
		ИЛИ (ТекущаяОбласть.Верх = 2 И ТекущаяОбласть.Низ = 2) Тогда
		
		ЯчейкаОбласти = Результат.Область(1, ТекущаяОбласть.Лево, 1, ТекущаяОбласть.Право);
			
		Если ЯчейкаОбласти.Расшифровка <> Неопределено Тогда
			СтруктураДанныхРасшифровки = ДанныеРасшифровкиНаСервере(ЯчейкаОбласти.Расшифровка, ДанныеРасшифровки);
			Если СтруктураДанныхРасшифровки.Свойство("Организация") Тогда
				Элемент.ТекущаяОбласть = Результат.Область(1, ТекущаяОбласть.Лево, 2, ТекущаяОбласть.Право);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Для СчСтроки = ТекущаяОбласть.Верх По ТекущаяОбласть.Низ Цикл
		
		Для СчСтолбцы = ТекущаяОбласть.Лево По ТекущаяОбласть.Право Цикл
			
			ЯчейкаОбласти = Результат.Область(СчСтроки, СчСтолбцы, СчСтроки, СчСтолбцы);
			
			Попытка
				ТекущаяРасшифровка = ЯчейкаОбласти.Расшифровка;
			Исключение
				Продолжить;
			КонецПопытки;
			
			Если ТекущаяРасшифровка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДанныхРасшифровки = ДанныеРасшифровкиНаСервере(ТекущаяРасшифровка, ДанныеРасшифровки);
			Если СтруктураДанныхРасшифровки.Свойство("ЕстьНастройки") Тогда
				ОбластьВыделения = ЯчейкаОбласти;
			Иначе
				Продолжить;
			КонецЕсли;
			
			Для Сч = ОбластьВыделения.Верх По ОбластьВыделения.Низ Цикл
				ЗапомнитьФонОбласти(Сч, ОбластьВыделения.Лево);
			КонецЦикла;
			ОбластьВыделения.ЦветФона = ЦветФонаВыделения;
			
			// Выделим организацию
			ОбластьВыделения = Результат.Область(1, СчСтолбцы, 1, СчСтолбцы);
			ЗапомнитьФонОбласти(1, СчСтолбцы);
			ОбластьВыделения.ЦветФона = ЦветФонаВыделения;
			ОбластьВыделения = Результат.Область(2, СчСтолбцы, 2, СчСтолбцы);
			ЗапомнитьФонОбласти(2, СчСтолбцы);
			ОбластьВыделения.ЦветФона = ЦветФонаВыделения;
			
			// Выделим аналитики
			Для Сч = 1 По Отчет.СдвигЗаголовков-1 Цикл
				ОбластьВыделения = Результат.Область(СчСтроки, Сч, СчСтроки, Сч);
				Если ЗначениеЗаполнено(ОбластьВыделения.Текст)
					И ОбластьВыделения.Текст <> "Х" Тогда
					ЗапомнитьФонОбласти(СчСтроки, Сч);
					ОбластьВыделения.ЦветФона = ЦветФонаВыделения;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьОбластьНастроек(Элемент)
	
	ПоследнееВыделение = Новый Соответствие;
	
	ТекущаяОбласть = Элемент.ТекущаяОбласть;
	
	Попытка
		ТекущаяРасшифровка = ТекущаяОбласть.Расшифровка;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ТекущаяРасшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхРасшифровки = ДанныеРасшифровкиНаСервере(ТекущаяРасшифровка, ДанныеРасшифровки);
	Если СтруктураДанныхРасшифровки.Свойство("БланкДляОтображения") Тогда
		ОбластьВыделения = Результат.Область(ТекущаяОбласть.Верх, ТекущаяОбласть.Лево, ТекущаяОбласть.Верх+4, ТекущаяОбласть.Лево);
	ИначеЕсли СтруктураДанныхРасшифровки.Свойство("БланкСводнойТаблицы") Тогда
		ОбластьВыделения = Результат.Область(ТекущаяОбласть.Верх-1, ТекущаяОбласть.Лево, ТекущаяОбласть.Верх+3, ТекущаяОбласть.Лево);
	ИначеЕсли СтруктураДанныхРасшифровки.Свойство("ПравилоОбработки") Тогда
		ОбластьВыделения = Результат.Область(ТекущаяОбласть.Верх-2, ТекущаяОбласть.Лево, ТекущаяОбласть.Верх+2, ТекущаяОбласть.Лево);
	ИначеЕсли СтруктураДанныхРасшифровки.Свойство("ПравилоПроверки") Тогда
		ОбластьВыделения = Результат.Область(ТекущаяОбласть.Верх-3, ТекущаяОбласть.Лево, ТекущаяОбласть.Верх+1, ТекущаяОбласть.Лево);
	ИначеЕсли СтруктураДанныхРасшифровки.Свойство("СпособФормирования") Тогда
		ОбластьВыделения = Результат.Область(ТекущаяОбласть.Верх-4, ТекущаяОбласть.Лево, ТекущаяОбласть.Верх, ТекущаяОбласть.Лево);
	Иначе
		Возврат;
	КонецЕсли;
		
	Для Сч = ОбластьВыделения.Верх По ОбластьВыделения.Низ Цикл
		ЗапомнитьФонОбласти(Сч, ОбластьВыделения.Лево);
	КонецЦикла;
	ОбластьВыделения.ЦветФона = ЦветФонаВыделения;
	Элемент.ТекущаяОбласть = ОбластьВыделения;
	
	// Выделим организацию
	ОбластьВыделения = Результат.Область(1, ТекущаяОбласть.Лево, 1, ТекущаяОбласть.Лево);
	ЗапомнитьФонОбласти(1, ТекущаяОбласть.Лево);
	ОбластьВыделения.ЦветФона = ЦветФонаВыделения;
	
	// Выделим аналитики
	Для Сч = 2 По Отчет.СдвигЗаголовков-1 Цикл
		ОбластьВыделения = Результат.Область(ТекущаяОбласть.Верх, Сч, ТекущаяОбласть.Верх, Сч);
		Если ЗначениеЗаполнено(ОбластьВыделения.Текст)
			И ОбластьВыделения.Текст <> "Х" Тогда
			ЗапомнитьФонОбласти(ТекущаяОбласть.Верх, Сч);
			ОбластьВыделения.ЦветФона = ЦветФонаВыделения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьФонПредудущихОбластей()

	Если ПоследнееВыделение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяОбластиЦвет Из ПоследнееВыделение Цикл 
		
		Область = Результат.Область(ИмяОбластиЦвет.Ключ);
		Область.ЦветФона = ИмяОбластиЦвет.Значение;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьФонОбласти(НомерСтроки, НомерКолонки)

	Область = Результат.Область(НомерСтроки, НомерКолонки);
	Если ПоследнееВыделение.Получить(Область.Имя) = Неопределено Тогда
		ПоследнееВыделение.Вставить(Область.Имя, Область.ЦветФона);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
