
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ЭтаФорма.ДатаДокументов = ТекущаяДата();
	ЭтаФорма.ДатаДокументов = ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	ЭтаФорма.Менеджер		= Пользователи.ТекущийПользователь();
	ЭтаФорма.ПропускатьНулевыеКолва = Истина;
	
	ПодразделениеПоУмолчанию = Справочники.СтруктураПредприятия.тн_ОтражатьТолькоВРегламентированномУчете;
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";
	ДиалогВыбора.Фильтр = "MXL (*.mxl)";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	
	ЗагрузитьТабличныйДокументИзФайла(Адрес, ИмяФайла);
	
	Элементы.СоздатьДоки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличныйДокументИзФайла(Адрес, ИмяФайла)
	
	Расширение = Прав(ИмяФайла,3);
	
	ФайлПриемник = ПолучитьИмяВременногоФайла(Расширение);
	ДанныеХранилища = ПолучитьИзВременногоХранилища(Адрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	ТабДокумент.Очистить();
	ТабДокумент.Прочитать(ФайлПриемник,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокиНаСервере()
		
	Результат.Очистить();
	
	КолОргID 		= 2;
	КолСубконто1ID 	= 4;
	КолСубконто2ID 	= 6;
	КолСубконто2	= 5;
	КолОрг	 		= 1;
	КолСубконто1 	= 3;
	
	КолБухСчет		= 8;
	КолСчет			= 9;
	КолВалюта		= 10;
	КолВалютаКод	= 11;
	КолВалСумма		= 12;
	КолКоличество	= 17;
	КолСумма		= 22;
	
	// Ищем первую строку с данными
	Для ПерваяСтрокаДанныхВФайле = 1 По ТабДокумент.ВысотаТаблицы Цикл
		Если  ТабДокумент.Область(ПерваяСтрокаДанныхВФайле,КолОрг,ПерваяСтрокаДанныхВФайле,КолОрг).Текст = "Организация" Тогда
			ПерваяСтрокаДанныхВФайле = ПерваяСтрокаДанныхВФайле +1;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если  ПерваяСтрокаДанныхВФайле > ТабДокумент.ВысотаТаблицы Тогда
		Результат.ДобавитьСтроку("Файл не соответствует");
		Возврат;
	Иначе
		Результат.ДобавитьСтроку("Обрабатываем со строки "+Строка(ПерваяСтрокаДанныхВФайле)+" по "+Строка(ТабДокумент.ВысотаТаблицы) );
		//Результат.ДобавитьСтроку("Номер строки и результат: ");
	КонецЕсли;
	
	
	ПредОрганизация = "";
	ПредСклад 	= "";
	ПредСчет	= "";
	
	Документ  = Неопределено;
	ДокументСоздан = Ложь;
	
	МассивДокументов = Новый Массив;
	
	Для Счетчик=ПерваяСтрокаДанныхВФайле По ТабДокумент.ВысотаТаблицы Цикл
		
		ТекОрганизация	= ТабДокумент.Область(Счетчик,КолОргID,Счетчик,КолОргID).Текст;
		ТекСчет			= ТабДокумент.Область(Счетчик,КолСчет,Счетчик,КолСчет).Текст;
		
		ТекСубконто1	= ТабДокумент.Область(Счетчик,КолСубконто1ID,Счетчик,КолСубконто1ID).Текст;
		ТекСубконто2	= ТабДокумент.Область(Счетчик,КолСубконто2ID,Счетчик,КолСубконто2ID).Текст;
		ВалютаКод		= ТабДокумент.Область(Счетчик,КолВалютаКод,Счетчик,КолВалютаКод).Текст;		
		Если ВалютаКод="" Тогда
			ВалютаКод = "643";
		КонецЕсли;
		
		Если ТекСчет = "07+" Тогда
			ТекСклад = ТекСубконто2;
		Иначе
			ТекСклад = "";
		КонецЕсли;		
		
		СтруктураСчета = ОпределитьСтруктуруСчета(ТекСчет);	
		
		Если НЕ(ДокументСоздан И ТекОрганизация = ПредОрганизация И ТекСчет = ПредСчет И ПредСклад = ТекСклад) Тогда  // новый документ  			
	
			Если ДокументСоздан Тогда								// не первый документ
				//ЗаполнитьПоля(Документ);
				Документ.Записать();
				Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ.Номер+ " от "+Документ.Дата);
				МассивДокументов.Добавить(Документ);
			КонецЕсли;
			
			СсылкаОрганизация = СсылкаПоГУИД(ТекОрганизация, Справочники.Организации);			
			
			Если СсылкаОрганизация = Неопределено Тогда
				ДокументСоздан = Ложь;
				СообщитьОбОшибке(Счетчик, " Не найдена Организация:"+ТабДокумент.Область(Счетчик,КолОрг,Счетчик,КолОрг).Текст, КолОргID);
			ИначеЕсли НЕ (ТекСчет = "97.1+" ИЛИ ТекСчет = "07+" ИЛИ ТекСчет = "20.1+" ИЛИ ТекСчет = "76.1+") Тогда
				ДокументСоздан = Ложь;
				СообщитьОбОшибке(Счетчик, " Не корректный счет:"+ТабДокумент.Область(Счетчик,КолБухСчет,Счетчик,КолБухСчет).Текст, КолБухСчет);
			Иначе
				Документ = СоздатьДокументВводаОстатков(СсылкаОрганизация, ТекСчет);
				ДокументСоздан = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		
		// новая строка в ТЧ
		Если ДокументСоздан Тогда
			
			СсылкаСубконто1 = Неопределено;
			Если СтруктураСчета.ИспользоватьСубконто1 Тогда
				СсылкаСубконто1 = ПолучитьСсылкуНаОбъект(Счетчик, СтруктураСчета.МетодПоискаСубконто1, 
					СтруктураСчета.МенеджерСубконто1, ТекСубконто1, СтруктураСчета.РеквизитПоискаСубконто1);
			КонецЕсли;
			
			СсылкаСубконто2 = Неопределено;
			Если СтруктураСчета.ИспользоватьСубконто2 Тогда
				СсылкаСубконто2 = ПолучитьСсылкуНаОбъект(Счетчик, СтруктураСчета.МетодПоискаСубконто2, 
					СтруктураСчета.МенеджерСубконто2, ТекСубконто2, СтруктураСчета.РеквизитПоискаСубконто2);
			КонецЕсли;
			
			Количество = ЧислоЯчейки(ТабДокумент.Область(Счетчик,КолКоличество,Счетчик,КолКоличество).Текст);
			
			СуммаВал = ЧислоЯчейки(ТабДокумент.Область(Счетчик,КолВалСумма,Счетчик,КолВалСумма).Текст);
			СуммаРег = ЧислоЯчейки(ТабДокумент.Область(Счетчик,КолСумма,Счетчик,КолСумма).Текст);
				
			СуммаВал = ?(СуммаВал<0, -СуммаВал, СуммаВал);
			СуммаРег = ?(СуммаРег<0, -СуммаРег, СуммаРег);
				
			ЗаполнитьТЧ(Документ, СсылкаСубконто1, СсылкаСубконто2, ВалютаКод, СуммаВал, СуммаРег, Количество, ТекСчет);
			
		КонецЕсли;
		
		ПредОрганизация = ТекОрганизация;
		ПредСчет		= ТекСчет;
		ПредСклад		= ТекСклад;
	КонецЦикла;
		
		
	Если Документ <> Неопределено Тогда	
		//ЗаполнитьПоля(Документ);
		Документ.Записать();
		Результат.ДобавитьСтроку("Создан документ "+Документ.Номер+ " от "+Документ.Дата);
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + Документ + " " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Для Каждого Документ Из МассивДокументов Цикл
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + Документ + " " + ОписаниеОшибки());
		КонецПопытки;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СоздатьДокументВводаОстатков(Организация, ТекСчет)
	
	Если ТекСчет = "97.1+" Тогда
		
		Документ = Документы.ВводОстатковПрочиеРасходы.СоздатьДокумент();
		Документ.Дата				= ДатаДокументов;
		Документ.Валюта 			= Константы.ВалютаРегламентированногоУчета.Получить();
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПрочихРасходов;
		Документ.Организация		= Организация;
		Документ.Ответственный      = Менеджер;
		Документ.Подразделение      = ПодразделениеПоУмолчанию;
		Документ.ОтражатьВБУиНУ     = Истина;
		Документ.ОтражатьВОперативномУчете = Истина;
		Документ.ОтражатьСебестоимость = Истина;
		Документ.ЦенаВключаетНДС 	= Истина;		
		Документ.ВидДеятельностиНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;		
		Документ.Комментарий		= "Остатки по 97 счету";
		
	ИначеЕсли ТекСчет = "07+" Тогда
		
		Документ 					= Документы.ВводОстатковТоваров.СоздатьДокумент();
		Документ.Дата				= ДатаДокументов;
		Документ.Валюта 			= Константы.ВалютаРегламентированногоУчета.Получить();
		Документ.ВидДеятельностиНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Документ.Менеджер 			= Менеджер;
		Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Документ.Организация		= Организация;
		Документ.Ответственный      = Менеджер;
		Документ.Автор			    = Менеджер;
		Документ.ОтражатьВБУиНУ     = Истина;
		Документ.ОтражатьВОперативномУчете = Истина;
		Документ.ОтражатьСебестоимость = Истина;
		Документ.ЦенаВключаетНДС 	= Истина;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковСобственныхТоваров;
		Документ.Комментарий		= "Остатки по 07 счету";
		
	ИначеЕсли ТекСчет = "76.1+" Тогда
		
		Документ = Документы.ВводОстатковПрочиеРасходы.СоздатьДокумент();
		Документ.Дата				= ДатаДокументов;
		Документ.Валюта 			= Константы.ВалютаРегламентированногоУчета.Получить();
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПрочихРасходов;
		Документ.Организация		= Организация;
		Документ.Ответственный      = Менеджер;
		Документ.Подразделение      = ПодразделениеПоУмолчанию;
		Документ.ОтражатьВБУиНУ     = Истина;
		Документ.ОтражатьВОперативномУчете = Истина;
		Документ.ОтражатьСебестоимость = Истина;
		Документ.ЦенаВключаетНДС 	= Истина;		
		Документ.ВидДеятельностиНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;		
		Документ.Комментарий		= "Остатки по 76.01 счету";
		
	ИначеЕсли ТекСчет = "20.1+" Тогда     
		
		Документ = Документы.ВводОстатков.СоздатьДокумент();
		
	КонецЕсли; 
	
	Возврат Документ;
		
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаОбъект(Счетчик, ВариантПоиска, МенеджерОбъекта, ЗначениеПоиска, ИмяРеквизитаПоиска)
	НаименованиеОбъекта = Строка(МенеджерОбъекта);
	НаименованиеОбъекта = Прав(НаименованиеОбъекта, СтрДлина(НаименованиеОбъекта) - СтрНайти(НаименованиеОбъекта, "."));
	                         
	СсылкаНаОбъект = Неопределено;
	
	Если ВариантПоиска = "ПоГУИДУ" тогда
		Попытка
			УИД = Новый УникальныйИдентификатор(ЗначениеПоиска);		
		Исключение
			СообщитьОбОшибке(Счетчик, "Переданный ключ сообщения не является гуидом: " + ЗначениеПоиска);
			Возврат Неопределено;		
		КонецПопытки;
		
		СсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(УИД);
		Если Не ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
			СсылкаНаОбъект = МенеджерОбъекта.ПустаяСсылка();
			СообщитьОбОшибке(Счетчик, "Не найдена ссылка на объект "+НаименованиеОбъекта+" по ГУИДу: " + ЗначениеПоиска);		
		КонецЕсли;
	ИначеЕсли ВариантПоиска = "ПоКоду" тогда
		СсылкаНаОбъект = МенеджерОбъекта.НайтиПоКоду(ЗначениеПоиска);
		Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) тогда
			СообщитьОбОшибке(Счетчик, "Не найдена ссылка на объект "+НаименованиеОбъекта+" по коду: " + ЗначениеПоиска);
		КонецЕсли;
	ИначеЕсли ВариантПоиска = "ПоРеквизиту" тогда
		СсылкаНаОбъект = МенеджерОбъекта.НайтиПоРеквизиту(ИмяРеквизитаПоиска, ЗначениеПоиска);
		Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) тогда
			СообщитьОбОшибке(Счетчик, "Не найдена ссылка на объект "+НаименованиеОбъекта+" по реквизиту "+ИмяРеквизитаПоиска+": " + ЗначениеПоиска);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;
КонецФункции

&НаКлиенте
Процедура СоздатьДоки(Команда)
	СоздатьДокиНаСервере();
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Результат;
КонецПроцедуры

&НаСервере
Функция ОпределитьСтруктуруСчета(ТекСчет)
	СтруктуруСчета = Новый Структура;
	СтруктуруСчета.Вставить("ИспользоватьСубконто1", Ложь);
	СтруктуруСчета.Вставить("МенеджерСубконто1", 	"");
	СтруктуруСчета.Вставить("МетодПоискаСубконто1", "");
	СтруктуруСчета.Вставить("РеквизитПоискаСубконто1", "");

	СтруктуруСчета.Вставить("ИспользоватьСубконто2", Ложь);
	СтруктуруСчета.Вставить("МенеджерСубконто2", 	"");
	СтруктуруСчета.Вставить("МетодПоискаСубконто2", "");
	СтруктуруСчета.Вставить("РеквизитПоискаСубконто2", "");
	
	Если ТекСчет = "97.1+" Тогда
		СтруктуруСчета.ИспользоватьСубконто1 = Истина;
		СтруктуруСчета.МенеджерСубконто1 = ПланыВидовХарактеристик.СтатьиРасходов;
		СтруктуруСчета.МетодПоискаСубконто1 = "ПоКоду";
	ИначеЕсли ТекСчет = "07+" Тогда
		СтруктуруСчета.ИспользоватьСубконто1 = Истина;
		СтруктуруСчета.МенеджерСубконто1 = Справочники.Номенклатура;
		СтруктуруСчета.МетодПоискаСубконто1 = "ПоГУИДУ";
		
		СтруктуруСчета.ИспользоватьСубконто2 = Истина;
		СтруктуруСчета.МенеджерСубконто2 = Справочники.Склады;
		СтруктуруСчета.МетодПоискаСубконто2 = "ПоГУИДУ";
	ИначеЕсли ТекСчет = "20.1+" Тогда
		СтруктуруСчета.ИспользоватьСубконто1 = Истина;
		СтруктуруСчета.МенеджерСубконто1 = Справочники.СтруктураПредприятия;
		СтруктуруСчета.МетодПоискаСубконто1 = "ПоГУИДУ";  
	ИначеЕсли ТекСчет = "76.1+" Тогда
		СтруктуруСчета.ИспользоватьСубконто1 = Истина;
		СтруктуруСчета.МенеджерСубконто1 = Справочники.Контрагенты;
		СтруктуруСчета.МетодПоискаСубконто1 = "ПоГУИДУ";
		
		СтруктуруСчета.ИспользоватьСубконто2 = Истина;
		СтруктуруСчета.МенеджерСубконто2 = ПланыВидовХарактеристик.СтатьиРасходов;
		СтруктуруСчета.МетодПоискаСубконто2 = "ПоКоду";
	КонецЕсли;
	
	Возврат СтруктуруСчета;
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧ(Документ, Субконто1, Субконто2, ВалютаКод, СуммаВал, СуммаРег, Количество, ТекСчет)
	
	Если ТекСчет = "97.1+" Тогда
		
		Строка 					= Документ.ПрочиеРасходы.Добавить();
		Строка.СтатьяРасходов 	= Субконто1;
		Строка.Сумма 			= СуммаРег;
		Строка.СуммаБезНДС 		= СуммаРег;
		Строка.СуммаРегл 		= СуммаРег;
		Строка.СтавкаНДС 		= Справочники.СтавкиНДС.БезНДС;   
		
	ИначеЕсли ТекСчет = "76.1+" Тогда
		
		Строка 					= Документ.ПрочиеРасходы.Добавить();
		Строка.СтатьяРасходов 	= Субконто2;
		Строка.Сумма 			= СуммаРег;
		Строка.СуммаБезНДС 		= СуммаРег;
		Строка.СуммаРегл 		= СуммаРег;
		Строка.СтавкаНДС 		= Справочники.СтавкиНДС.БезНДС;
		
	ИначеЕсли ТекСчет = "07+" Тогда
		
		Документ.Склад			= Субконто2;
		
		Строка 					= Документ.Товары.Добавить();
		Строка.Количество		= Количество;
		Строка.КоличествоУпаковок = Количество;
		Строка.Номенклатура 	= Субконто1;
		Строка.СтавкаНДС 		= Справочники.СтавкиНДС.БезНДС;
		Строка.Сумма 			= СуммаРег;
		Строка.СуммаБезНДС 		= СуммаРег;
		Строка.СуммаРегл 		= СуммаРег;
		Строка.СуммаСНДС 		= СуммаРег;
		Строка.Цена 			= СуммаРег / ?(Количество = 0, 1, Количество);
		
	ИначеЕсли ТекСчет = "20.1+" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧислоЯчейки(Текст)
	
	Текст = СтрЗаменить(СокрЛП(Текст),Символы.НПП,"");
	Если Текст="" Тогда
		Возврат 0;
	Иначе
		Возврат Число(Текст);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаПоГУИД(УИД, ОбластьПоиска)
	
	Попытка
		GUID	= Новый УникальныйИдентификатор(УИД);
		Ссылка  = ОбластьПоиска.ПолучитьСсылку(GUID);
		Если Лев(Строка(Ссылка),7)="<Объект" Тогда 
			Ссылка = Неопределено;
		КонецЕсли;
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
КонецФункции

&НаСервере
Процедура СообщитьОбОшибке(Счетчик, Текст, Колонка=0)
	
	Результат.ДобавитьСтроку(Строка(Счетчик)+Текст);
	
	ТабДокумент.Область(Счетчик,1,Счетчик,ТабДокумент.ШиринаТаблицы).ЦветФона = WebЦвета.ОранжевоКрасный;
	ТабДокумент.Область(Счетчик,Колонка,Счетчик,Колонка).ЦветФона = WebЦвета.Красный;
	
КонецПроцедуры

