
// Ситалов Дмитрий 02.12.2022 Выполнение задач №000043572
// перенесено из ОМ.УчетНДСУП.СписокНезначащихСтавок() для повторного использования
Функция тн_СписокНезначащихСтавок() Экспорт 

	СписокЗначений = новый СписокЗначений;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДС.Ссылка КАК Ссылка,
	|	СтавкиНДС.Представление КАК Представление
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 0";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокЗначений.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Представление);
	КонецЦикла;

	Возврат СписокЗначений;

КонецФункции

// Гутарова Екатерина 11.09.2023 Выполнение задач №000046808
//
Функция ПолучитьУникальныйИдентификатор(Элемент) Экспорт
	
	GUID = "";
	Если ЗначениеЗаполнено(Элемент) Тогда
		GUID = Строка(Элемент.УникальныйИдентификатор());
	КонецЕсли; 
	
	Возврат GUID;
	
КонецФункции // ПолучитьУникальныйИдентификатор()