#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Период = Год(ТекущаяДатаСеанса());
	КонецЕсли;
	ОбновитьТаблицуПериодовНаСервере(); 
	ЗаполнитьЗаголовки();
	УстановитьСтраницуГруппаТаблицПериодичности();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СохранитьДанныеТаблицыПериодовВОбъект(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмениласьТаблицаНоменклатуры" Тогда
		ИзменилосьРаспределениеПоНоменклатуре(Параметр.АдресРезультата, Параметр.ТоварнаяКатегория);
		ОбновитьТаблицуПериодовНаСервере(); 
		ЗаполнитьЗаголовки();
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры
#КонецОбласти
	 
#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоПриИзменении(Элемент)
	ОбновитьТаблицуПериодовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеПриИзменении(Элемент)
	ОбновитьТаблицуПериодовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПериодов
  
&НаКлиенте
Процедура ТаблицаПериодовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПериодовКварталПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Возврат;
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаПериодовГодПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПериодовПослеУдаления(Элемент)
	ЗаполнитьЗаголовки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПериодовКварталПослеУдаления(Элемент)
	ЗаполнитьЗаголовки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПериодовГодПослеУдаления(Элемент)
	ЗаполнитьЗаголовки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПериодовКварталПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПериодовКвартал.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено  Тогда
	    Возврат;		
	КонецЕсли; 
	Элементы.ТаблицаПериодовКварталРаспределитьПериодКвартал.Доступность = 
				НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура); 

	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Элемент.ТолькоПросмотр = Истина;
	Иначе
		Элемент.ТолькоПросмотр = Ложь;		
	КонецЕсли;			

КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаПериодовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПериодов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено  Тогда
	    Возврат;		
	КонецЕсли; 
	Элементы.ТаблицаПериодовРаспределитьПериод.Доступность = 
				НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура);
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПериодовГодПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПериодовГод.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено  Тогда
	    Возврат;		
	КонецЕсли; 
	Элементы.ТаблицаПериодовГодРаспределитьПериодГод.Доступность = 
				НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоТекущимОбъемам(Команда)
	ЗаполнитьПоТекущимОбъемамСервер();
	ОбновитьТаблицуПериодовНаСервере(); 
	ЗаполнитьЗаголовки();
	Модифицированность = Истина; 
	УстановитьСтраницуГруппаТаблицПериодичности()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоТекущимОбъемамСервер()
	
	Если Объект.Проведен Тогда
		ТекстСообщения  = НСтр("ru = 'Заполнение возможно только в непроведенном документе'");
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,);
		Возврат;
	КонецЕсли;

	Объект.ДвиженияОперации.Очистить(); 
	Объект.НоменклатураКатегорий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаПодтвержденияЗакупки.Номенклатура КАК ТоварнаяКатегория,
		|	НастройкаПодтвержденияЗакупки.Периодичность КАК Периодичность,
		|	НастройкаПодтвержденияЗакупки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.НастройкаПодтвержденияЗакупки КАК НастройкаПодтвержденияЗакупки
		|ГДЕ
		|	НастройкаПодтвержденияЗакупки.ЦФО = &ЦФО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура КАК Номенклатура,
		|	0 КАК Законтрактовано,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПодтвержденоОборот КАК КоличествоИсходное,
		|	ПодтвержденныеОбъемыЗакупокОбороты.Коэффициент КАК Коэффициент,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодМесяц КАК ПериодМесяц,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодКвартал КАК ПериодКвартал,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодГод КАК ПериодГод,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодПолугодие КАК ПериодПолугодие,
		|	ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура.КатегорияЗакупок КАК ТоварнаяКатегория
		|ИЗ
		|	РегистрСведений.НастройкаПодтвержденияЗакупки КАК НастройкаПодтвержденияЗакупки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПодтвержденныеОбъемыЗакупок.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ПодтвержденныеОбъемыЗакупокОбороты
		|		ПО НастройкаПодтвержденияЗакупки.ЦФО = ПодтвержденныеОбъемыЗакупокОбороты.ЦФО
		|			И НастройкаПодтвержденияЗакупки.Номенклатура = ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура.КатегорияЗакупок 
		|ГДЕ
		|	НастройкаПодтвержденияЗакупки.ЦФО = &ЦФО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		|	0,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПодтвержденоОборот,
		|	ПодтвержденныеОбъемыЗакупокОбороты.Коэффициент,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ЕдиницаИзмерения,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодМесяц,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодКвартал,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодГод,
		|	ПодтвержденныеОбъемыЗакупокОбороты.ПериодПолугодие,
		|	ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура
		|ИЗ
		|	РегистрСведений.НастройкаПодтвержденияЗакупки КАК НастройкаПодтвержденияЗакупки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПодтвержденныеОбъемыЗакупок.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ПодтвержденныеОбъемыЗакупокОбороты
		|		ПО НастройкаПодтвержденияЗакупки.ЦФО = ПодтвержденныеОбъемыЗакупокОбороты.ЦФО
		|			И НастройкаПодтвержденияЗакупки.Номенклатура = ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура
		|ГДЕ
		|	НастройкаПодтвержденияЗакупки.ЦФО = &ЦФО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		|	Планированиепотребностей.КоличествоПриход,
		|	0,
		|	Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.Коэффициент,
		|	Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.ЕдиницаИзмерения,
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, КВАРТАЛ),
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, ГОД),
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, ПОЛУГОДИЕ),
		|	Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура
		|ИЗ
		|	РегистрСведений.НастройкаПодтвержденияЗакупки КАК НастройкаПодтвержденияЗакупки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПланированиеПотребностей.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК Планированиепотребностей
		|		ПО НастройкаПодтвержденияЗакупки.ЦФО = Планированиепотребностей.АналитикаПланирования.АналитикаСтруктуры.ЦФО
		|			И НастройкаПодтвержденияЗакупки.Номенклатура = Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура
		|			И Планированиепотребностей.АналитикаПланирования.Этап = Значение(Перечисление.ЭтапыПланированияПотребностей.Законтрактовано)
		|ГДЕ
		|	НастройкаПодтвержденияЗакупки.ЦФО = &ЦФО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура,
		|	Планированиепотребностей.КоличествоПриход,
		|	0,
		|	Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.Коэффициент,
		|	Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.ЕдиницаИзмерения,
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, КВАРТАЛ),
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, ГОД),
		|	НАЧАЛОПЕРИОДА(Планированиепотребностей.АналитикаПланирования.ДатаОперации, ПОЛУГОДИЕ),
		|	Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура.КатегорияЗакупок
		|ИЗ
		|	РегистрСведений.НастройкаПодтвержденияЗакупки КАК НастройкаПодтвержденияЗакупки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПланированиеПотребностей.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК Планированиепотребностей
		|		ПО НастройкаПодтвержденияЗакупки.ЦФО = Планированиепотребностей.АналитикаПланирования.АналитикаСтруктуры.ЦФО
		|			И НастройкаПодтвержденияЗакупки.Номенклатура = Планированиепотребностей.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура.КатегорияЗакупок
		|			И Планированиепотребностей.АналитикаПланирования.Этап = Значение(Перечисление.ЭтапыПланированияПотребностей.Законтрактовано)
		|ГДЕ
		|	НастройкаПодтвержденияЗакупки.ЦФО = &ЦФО";

	
	Запрос.УстановитьПараметр("ЦФО", 			Объект.ЦФО); 
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоГода(Дата(Объект.Период, 1, 1)) );
	Запрос.УстановитьПараметр("КонецПериода", 	КонецГода(Дата(Объект.Период, 1, 1)));
	
	РезультатЗапроса 	= Запрос.ВыполнитьПакет(); 
	ВыборкаНоменклатура = РезультатЗапроса[0].Выбрать();
	ВыгрузкаПериоды 	= РезультатЗапроса[1].Выгрузить();
	
	ВыгрузкаПериоды.Индексы.Добавить("Номенклатура");
	
	Пока ВыборкаНоменклатура.Следующий() Цикл 
		СтруктураОтбора  = Новый Структура;
		СтруктураОтбора.Вставить("ТоварнаяКатегория", ВыборкаНоменклатура.ТоварнаяКатегория);
		ТаблицаПериодаНоменклатура = ВыгрузкаПериоды.Скопировать(СтруктураОтбора); 
		
		ИмяКолонкиСвертки = ИмяКолонкиСортировки(ВыборкаНоменклатура.Периодичность);
		ТаблицаПериодаНоменклатура.Свернуть(ИмяКолонкиСвертки + ",Номенклатура,ЕдиницаИзмерения, Коэффициент",
							"Законтрактовано, КоличествоИсходное");
		
		Для каждого СтрокаТаблицы Из ТаблицаПериодаНоменклатура Цикл
			СтрокаДвижения = Объект.ДвиженияОперации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТаблицы);
			СтрокаДвижения.Период 				= СтрокаТаблицы[ИмяКолонкиСвертки]; 
			СтрокаДвижения.Периодичность 		= ВыборкаНоменклатура.Периодичность; 
			СтрокаДвижения.ТоварнаяКатегория	= ВыборкаНоменклатура.ТоварнаяКатегория;
			СтрокаДвижения.Номенклатура			= СтрокаТаблицы.Номенклатура;
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры
			
&НаКлиенте
Процедура ПодтвердитьВсеКвартал(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаПериодовКвартал.ВыделенныеСтроки;
	
	Если НЕ ВыделенныеСтроки.Количество() Тогда
		Возврат;	
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого СтрокаСписка Из ВыделенныеСтроки Цикл
			ТекущиеДанные = Элементы.ТаблицаПериодовКвартал.ДанныеСтроки(СтрокаСписка);
			МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
	КонецЦикла; 
	
	ТекущаяПериодичность = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.Периодичность.Квартал");
	
	ПодтвердитьВсеНаСервере(МассивНоменклатуры, ТекущаяПериодичность); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПодтвердитьВсеГод(Команда)

	ВыделенныеСтроки = Элементы.ТаблицаПериодовГод.ВыделенныеСтроки;
	
	Если НЕ ВыделенныеСтроки.Количество() Тогда
		Возврат;	
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого СтрокаСписка Из ВыделенныеСтроки Цикл
			ТекущиеДанные = Элементы.ТаблицаПериодовГод.ДанныеСтроки(СтрокаСписка);
			МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
	КонецЦикла; 
	
	ТекущаяПериодичность = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.Периодичность.Год");
	
	ПодтвердитьВсеНаСервере(МассивНоменклатуры, ТекущаяПериодичность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВсе(Команда) 
		
	ВыделенныеСтроки = Элементы.ТаблицаПериодов.ВыделенныеСтроки;
	
	Если НЕ ВыделенныеСтроки.Количество() Тогда
		Возврат;	
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого СтрокаСписка Из ВыделенныеСтроки Цикл
			ТекущиеДанные = Элементы.ТаблицаПериодов.ДанныеСтроки(СтрокаСписка);
			МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
	КонецЦикла; 
	
	ТекущаяПериодичность = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.Периодичность.Месяц");
	
	ПодтвердитьВсеНаСервере(МассивНоменклатуры, ТекущаяПериодичность); 

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПоПериодам(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаПериодов.ВыделенныеСтроки;
	
	Если НЕ ВыделенныеСтроки.Количество() Тогда
		Возврат;	
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого СтрокаСписка Из ВыделенныеСтроки Цикл
			ТекущиеДанные = Элементы.ТаблицаПериодов.ДанныеСтроки(СтрокаСписка);
			МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
	КонецЦикла; 

	Периодичность = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.Периодичность.Месяц");
	
	ПодтвердитьПоПериодамНаКлиенте(Периодичность, МассивНоменклатуры);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодтвердитьПоПериодамКвартал(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаПериодовКвартал.ВыделенныеСтроки;
	
	Если НЕ ВыделенныеСтроки.Количество() Тогда
		Возврат;	
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого СтрокаСписка Из ВыделенныеСтроки Цикл
			ТекущиеДанные = Элементы.ТаблицаПериодовКвартал.ДанныеСтроки(СтрокаСписка);
			МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
	КонецЦикла; 

	Периодичность = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.Периодичность.Квартал");
	
	ПодтвердитьПоПериодамНаКлиенте(Периодичность, МассивНоменклатуры);


КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПоПериодамГод(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаПериодовГод.ВыделенныеСтроки;
	
	Если НЕ ВыделенныеСтроки.Количество() Тогда
		Возврат;	
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого СтрокаСписка Из ВыделенныеСтроки Цикл
			ТекущиеДанные = Элементы.ТаблицаПериодовГод.ДанныеСтроки(СтрокаСписка);
			МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
	КонецЦикла; 

	Периодичность = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.Периодичность.Год");
	
	ПодтвердитьПоПериодамНаКлиенте(Периодичность, МассивНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПериодовОбработка(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;	    	
	КонецЕсли;
	
	ПодтвердитьВсеПоПериодамНаСервере(ДополнительныеПараметры.МассивНоменклатуры, Результат, ДополнительныеПараметры.Периодичность)
	
КонецПроцедуры	

&НаКлиенте
Процедура РаспределитьПериодКвартал(Команда)
   ТекущиеДанные = Элементы.ТаблицаПериодовКвартал.ТекущиеДанные;
   Если ТекущиеДанные = Неопределено Тогда
		Возврат;  
   КонецЕсли;
   
   Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;  
   КонецЕсли;
   
   ПараметрыФормы = РаспределитьТоварнуюКатегориюНаСервере(ТекущиеДанные.ТоварнаяКатегория);
   ОткрытьФорму("Обработка.РаспределениеТоварнойКатегории.Форма.Форма",
						ПараметрыФормы , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

   
КонецПроцедуры  
		
&НаКлиенте
Процедура РаспределитьПериод(Команда)

   ТекущиеДанные = Элементы.ТаблицаПериодовКвартал.ТекущиеДанные;
   Если ТекущиеДанные = Неопределено Тогда
		Возврат;  
   КонецЕсли;
   
   Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;  
   КонецЕсли;
   
   ПараметрыФормы = РаспределитьТоварнуюКатегориюНаСервере(ТекущиеДанные.ТоварнаяКатегория);
   ОткрытьФорму("Обработка.РаспределениеТоварнойКатегории.Форма.Форма",
						ПараметрыФормы , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПериодГод(Команда)
	   ТекущиеДанные = Элементы.ТаблицаПериодовГод.ТекущиеДанные;
   Если ТекущиеДанные = Неопределено Тогда
		Возврат;  
   КонецЕсли;
   
   Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;  
   КонецЕсли;
   
   ПараметрыФормы = РаспределитьТоварнуюКатегориюНаСервере(ТекущиеДанные.ТоварнаяКатегория);
   ОткрытьФорму("Обработка.РаспределениеТоварнойКатегории.Форма.Форма",
						ПараметрыФормы , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти	

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИмяКолонкиСортировки(Периодичность)
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат "ПериодГод";
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда 
		Возврат "ПериодКвартал";
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда 
		Возврат "ПериодПолугодие";
	Иначе 
		Возврат "ПериодМесяц";		
	КонецЕсли;
	
КонецФункции // ()

&НаСервере
Процедура ОбновитьТаблицуПериодовНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Период)  Тогда
		Возврат;	                                  	
	КонецЕсли;
	// Месяц
	ОбновитьТаблицуПериодов(Перечисления.Периодичность.Месяц, ТаблицаПериодов, Периоды, "ТаблицаПериодов");
	// Квартал
	ОбновитьТаблицуПериодов(Перечисления.Периодичность.Квартал, ТаблицаПериодовКвартал, ПериодыКвартал, "ТаблицаПериодовКвартал");
	// Год 
    ОбновитьТаблицуПериодов(Перечисления.Периодичность.Год, ТаблицаПериодовГод, ПериодыГод, "ТаблицаПериодовГод");
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПериодов(Периодичность, ТаблицаПериодовПеременная, ПериодыПеременная, ИмяТаблицы)
	
	ТаблицаПериодовПеременная.Очистить();  
	
	// очищаем колонки 
	Если ПериодыПеременная.Количество() Тогда
		Для каждого СтрокаПериод Из ПериодыПеременная Цикл
			НомерКолонкиСтрока			= Строка(СтрокаПериод.НомерПериода);
			
			МассивУдаляемыхРеквизитов = Новый Массив;
			МассивУдаляемыхРеквизитов.Добавить(ИмяТаблицы + ".Законтрактовано"	+ НомерКолонкиСтрока);
			МассивУдаляемыхРеквизитов.Добавить(ИмяТаблицы + ".Исходное"			+ НомерКолонкиСтрока);
			МассивУдаляемыхРеквизитов.Добавить(ИмяТаблицы + ".Новое"			+ НомерКолонкиСтрока);
			ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);
			Элементы.Удалить(Элементы.Найти( ИмяТаблицы +"Группа"	+ НомерКолонкиСтрока));
			КонецЦикла;
		
	КонецЕсли;  
	
	// получаем количество периодов
	ЗаполнитьКоличествоПериодов(ПериодыПеременная, Периодичность);
 	
	// заполняем колонки 
	Для каждого СтрокаПериод Из ПериодыПеременная Цикл
		
		НомерКолонкиСтрока				= Строка(СтрокаПериод.НомерПериода);
		ГруппаПериода 					= Элементы.Добавить(ИмяТаблицы + "Группа" + НомерКолонкиСтрока, Тип("ГруппаФормы"), Элементы[ИмяТаблицы]);
		ГруппаПериода.Вид 				= ВидГруппыФормы.ГруппаКолонок;
		ГруппаПериода.Заголовок 		= ПодтверждениеЗакупокУХ.ИмяПериода(СтрокаПериод.Дата, Периодичность);
		ГруппаПериода.Группировка 		= ГруппировкаКолонок.Горизонтальная; 
		ГруппаПериода.ОтображатьВШапке 	= Истина; 
				
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Законтрактовано"	+ НомерКолонкиСтрока,
												ОбщегоНазначения.ОписаниеТипаЧисло(15,3) , ИмяТаблицы,"Законтрактовано"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Исходное"		+ НомерКолонкиСтрока,
												ОбщегоНазначения.ОписаниеТипаЧисло(15,3) , ИмяТаблицы,"Исходное"));  
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Новое"		+ НомерКолонкиСтрока,
												ОбщегоНазначения.ОписаниеТипаЧисло(15,3) , ИмяТаблицы,"Новое"));    
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);  										
											
		НоваяКолонка 				= Элементы.Добавить("Законтрактовано" + ИмяТаблицы + НомерКолонкиСтрока, Тип("ПолеФормы"), ГруппаПериода);
		НоваяКолонка.Заголовок 		= "Законтрактовано";
		НоваяКолонка.ПутьКДанным 	= ИмяТаблицы +".Законтрактовано" + НомерКолонкиСтрока;
		НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр	= Истина;	
		НоваяКолонка.Ширина			= 8;

		НоваяКолонка 				= Элементы.Добавить("Исходное" + ИмяТаблицы + НомерКолонкиСтрока, Тип("ПолеФормы"), ГруппаПериода);
		НоваяКолонка.Заголовок 		= "Подтверждено";
		НоваяКолонка.ПутьКДанным 	= ИмяТаблицы + ".Исходное"  + НомерКолонкиСтрока;
		НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр	= Истина;  
		НоваяКолонка.Ширина			= 8;
     	
		НоваяКолонка 				= Элементы.Добавить("Новое" + ИмяТаблицы + НомерКолонкиСтрока, Тип("ПолеФормы"), ГруппаПериода);
		НоваяКолонка.Заголовок 		= "Новое";
		НоваяКолонка.ПутьКДанным 	= ИмяТаблицы + ".Новое" + НомерКолонкиСтрока;
		НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Ширина			= 8;
		НоваяКолонка.КартинкаШапки	= БиблиотекаКартинок.Изменить;
		НоваяКолонка.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзменении");
	КонецЦикла;
	
	Для каждого СтрокаДвижения Из Объект.ДвиженияОперации Цикл
		
		Если СтрокаДвижения.Периодичность <> Периодичность Тогда
			Продолжить;		
		КонецЕсли;
		НайтиНоменклатуру = ТаблицаПериодовПеременная.НайтиСтроки(Новый Структура("Номенклатура, ТоварнаяКатегория", 
									СтрокаДвижения.Номенклатура, СтрокаДвижения.ТоварнаяКатегория));
		
		Если НайтиНоменклатуру.Количество() Тогда
		  	ТекСтрока = НайтиНоменклатуру[0];
		Иначе	
			ТекСтрока = ТаблицаПериодовПеременная.Добавить();
			ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаДвижения);
					
		КонецЕсли;  
		
		СтрокиПериоды = ПериодыПеременная.НайтиСтроки(Новый Структура("Дата", СтрокаДвижения.Период));
		Если НЕ СтрокиПериоды.Количество() Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаНомерПериода = Строка(СтрокиПериоды[0].НомерПериода);
     	ТекСтрока["Новое" + СтрокаНомерПериода] 			= СтрокаДвижения.КоличествоИзменение;			
		ТекСтрока["Исходное" + СтрокаНомерПериода] 			= СтрокаДвижения.КоличествоИсходное;
		ТекСтрока["Законтрактовано" + СтрокаНомерПериода] 	= СтрокаДвижения.Законтрактовано;
		
	КонецЦикла;
	

КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьКоличествоПериодов(ПериодыПеременная, Периодичность)
	
	ПериодыПеременная.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периоды.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	Периоды.Периодичность = &Периодичность
		|	И Периоды.ДатаНачала >= &ДатаНачала
		|	И Периоды.ДатаОкончания <= &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоГода(Дата(Объект.Период, 1, 1))) ;
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецГода(Дата(Объект.Период, 1, 1)));
	Запрос.УстановитьПараметр("Периодичность", 	Периодичность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НомерПериода  = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйПериод = ПериодыПеременная.Добавить();
		НовыйПериод.Дата 			= 	ВыборкаДетальныеЗаписи.ДатаНачала;	
		НовыйПериод.НомерПериода 	= 	НомерПериода;
		
		НомерПериода = НомерПериода + 1;
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеТаблицыПериодовВОбъект(ТекущийОбъект)
	
	ТекущийОбъект.ДвиженияОперации.Очистить();
    СохранитьДанныеТаблицы(ТекущийОбъект.ДвиженияОперации, ТаблицаПериодов, Периоды, Перечисления.Периодичность.Месяц);
	СохранитьДанныеТаблицы(ТекущийОбъект.ДвиженияОперации, ТаблицаПериодовКвартал, ПериодыКвартал, Перечисления.Периодичность.Квартал);	
	СохранитьДанныеТаблицы(ТекущийОбъект.ДвиженияОперации, ТаблицаПериодовГод, ПериодыГод, Перечисления.Периодичность.Год);	
	
КонецПроцедуры	 
  
&НаСервере
Процедура СохранитьДанныеТаблицы(ДвиженияОперации, ТаблицаПериодовПеременная, ПериодыПеременная, Периодичность)
	
	Для каждого СтрокаТаблицыПериодов Из ТаблицаПериодовПеременная Цикл
		
		Для каждого СтрокаПериод Из ПериодыПеременная Цикл
			СтрокаНомераКолонки = Строка(СтрокаПериод.НомерПериода);		
			ЗначениеНовое 		= СтрокаТаблицыПериодов["Новое" + СтрокаНомераКолонки];
			Законтрактовано 	= СтрокаТаблицыПериодов["Законтрактовано" + СтрокаНомераКолонки];
			ЗначениеИсходное 	= СтрокаТаблицыПериодов["Исходное" + СтрокаНомераКолонки];
			СтрокаДвижения 		= ДвиженияОперации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТаблицыПериодов); 
			СтрокаДвижения.КоличествоИзменение  = ЗначениеНовое;
			СтрокаДвижения.Период 				= СтрокаПериод.Дата;
			СтрокаДвижения.КоличествоИсходное	= ЗначениеИсходное;
			СтрокаДвижения.Законтрактовано		= Законтрактовано;  
			СтрокаДвижения.Периодичность		= Периодичность;

		КонецЦикла;	

	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЗаголовки()

	КоличествоСтрок  = ТаблицаПериодов.Количество();
	Если КоличествоСтрок <> 0  Тогда
    	Элементы.ГруппаМесяц.Заголовок  = СтрШаблон(НСтр("ru = 'Периодичность: Месяц (%1)'"),КоличествоСтрок);
	Иначе 
		Элементы.ГруппаМесяц.Заголовок  = НСтр("ru = 'Периодичность: Месяц'");
    КонецЕсли;
	
	КоличествоСтрок  = ТаблицаПериодовКвартал.Количество();
	Если КоличествоСтрок <> 0  Тогда
    	Элементы.ГруппаКвартал.Заголовок  = СтрШаблон(НСтр("ru = 'Периодичность: Квартал (%1)'"),КоличествоСтрок);
	Иначе 
		Элементы.ГруппаКвартал.Заголовок  = НСтр("ru = 'Периодичность: Квартал'");
    КонецЕсли;
	
	КоличествоСтрок  = ТаблицаПериодовГод.Количество();
	Если КоличествоСтрок <> 0  Тогда
    	Элементы.ГруппаГод.Заголовок  = СтрШаблон(НСтр("ru = 'Периодичность: Год (%1)'"),КоличествоСтрок);
	Иначе 
		Элементы.ГруппаГод.Заголовок  = НСтр("ru = 'Периодичность: Год'");
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзменении(Элемент)
		
		ИмяЭлемента 	= Элемент.Имя; 
		ИмяТЧ  			= Элемент.Родитель.Родитель.Имя;
		НомерПериода 	= СтрЗаменить(ИмяЭлемента, "Новое" + ИмяТЧ,"");  
		Если ИмяТЧ = "ТаблицаПериодов" Тогда
			ТекущиеДанныеСтрока = Элементы.ТаблицаПериодов.ТекущиеДанные;			
		ИначеЕсли ИмяТЧ = "ТаблицаПериодовКвартал" Тогда
			ТекущиеДанныеСтрока = Элементы.ТаблицаПериодовКвартал.ТекущиеДанные;			
		Иначе
			ТекущиеДанныеСтрока = Элементы.ТаблицаПериодовГод.ТекущиеДанные;			
		КонецЕсли;
		
		Законтрактовано = ТекущиеДанныеСтрока["Законтрактовано" + НомерПериода]; 
		Исходное 		= ТекущиеДанныеСтрока["Исходное" + НомерПериода];
		Новое 			= ТекущиеДанныеСтрока["Новое" + НомерПериода];
		
		Если НЕ ЗначениеЗаполнено(Законтрактовано) Тогда
				ТекущиеДанныеСтрока["Новое" + НомерПериода] = 0;
		ИначеЕсли Законтрактовано < Новое Тогда
				ТекущиеДанныеСтрока["Новое" + НомерПериода] = Законтрактовано;
		КонецЕсли;    
				
		
КонецПроцедуры

&НаСервере
Функция РаспределитьТоварнуюКатегориюНаСервере(ТоварнаяКатегория)
	
	ПараметрыФормы = Новый Структура();
	Товары = Объект.ДвиженияОперации.Выгрузить(Новый Структура("ТоварнаяКатегория, Номенклатура",ТоварнаяКатегория, Справочники.Номенклатура.ПустаяСсылка()));
	Товары = ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор); 
	
	ТЧНоменклатура = Объект.НоменклатураКатегорий.Выгрузить(Новый Структура("ТоварнаяКатегория",ТоварнаяКатегория));
	ТЧНоменклатура = ПоместитьВоВременноеХранилище(ТЧНоменклатура, УникальныйИдентификатор); 
	
	
	ПараметрыФормы.Вставить("ЦенаВключаетНДС",			Истина);
	ПараметрыФормы.Вставить("ТоварнаяКатегория",		ТоварнаяКатегория);
	ПараметрыФормы.Вставить("ТЧПодтверждениеЗакупки",  	Товары);
	ПараметрыФормы.Вставить("ТЧНоменклатура",  			ТЧНоменклатура);
	
	Возврат ПараметрыФормы;
КонецФункции     

&НаСервере
Процедура ПодтвердитьВсеНаСервере(МассивНоменклатуры, ТекущаяПериодичность)
	
	Для каждого МассивЭлемент Из МассивНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(МассивЭлемент) Тогда
			Продолжить;
		КонецЕсли;
		
		ДвиженияОперации = Объект.ДвиженияОперации.НайтиСтроки((Новый Структура("Номенклатура,Периодичность", МассивЭлемент, ТекущаяПериодичность)));
		
		Для каждого СтрокаДвижения Из ДвиженияОперации Цикл
			
			СтрокаДвижения.КоличествоИзменение = СтрокаДвижения.Законтрактовано;
			
		КонецЦикла;
		
		
	КонецЦикла;
	
	ОбновитьТаблицуПериодовНаСервере(); 
	ЗаполнитьЗаголовки();
	Модифицированность = Истина;
	
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьВсеПоПериодамНаСервере(МассивНоменклатуры, МассивДат, ТекущаяПериодичность)
	
	Для каждого МассивЭлемент Из МассивНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(МассивЭлемент) Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ЭлементМассивДат Из МассивДат Цикл
			ДвиженияОперации = Объект.ДвиженияОперации.НайтиСтроки((Новый Структура("Номенклатура,Периодичность, Период", МассивЭлемент, ТекущаяПериодичность,ЭлементМассивДат)));
			
			Для каждого СтрокаДвижения Из ДвиженияОперации Цикл
				
				СтрокаДвижения.КоличествоИзменение = СтрокаДвижения.Законтрактовано;
				
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЦикла;
	
	ОбновитьТаблицуПериодовНаСервере(); 
	ЗаполнитьЗаголовки();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере 
Процедура ИзменилосьРаспределениеПоНоменклатуре(АдресРезультата, ТоварнаяКатегория);
	
	ТаблицаРаспределения = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ИтогСумма = 0;
	Для Каждого Строки ИЗ ТаблицаРаспределения Цикл
		
		ОтборПериод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строки.Период, "ДатаНачала");
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ТоварнаяКатегория", 	ТоварнаяКатегория);
		ПараметрыОтбора.Вставить("Номенклатура", 		Строки.Номенклатура);
		ПараметрыОтбора.Вставить("Период", 				ОтборПериод);
		СтрокиНоменклатура = Объект.НоменклатураКатегорий.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиНоменклатура.Количество() Тогда
		    СтрокиНоменклатура = СтрокиНоменклатура[0];
		Иначе				
			СтрокиНоменклатура  = Объект.НоменклатураКатегорий.Добавить();		
			СтрокиНоменклатура.Номенклатура 		= Строки.Номенклатура;
			СтрокиНоменклатура.ТоварнаяКатегория 	= ТоварнаяКатегория;			
			СтрокиНоменклатура.Период 				= ОтборПериод;			
		КонецЕсли;
		
		СтрокиНоменклатура.КоличествоИзменение 	= Строки.Количество;
		СтрокиНоменклатура.Сумма 				= Строки.СуммаСНДС; 
		СтрокиНоменклатура.ЕдиницаИзмерения		= Строки.ЕдиницаИзмерения;
		СтрокиНоменклатура.Коэффициент			= Строки.Коэффициент;
	
	КонецЦикла;
	
	ДанныеТК = ТаблицаРаспределения.Скопировать();
	ДанныеТК.Свернуть("Период","СуммаСНДС");
	
	Для каждого  СтрокаДанныеТК Из ДанныеТК Цикл
		
		ОтборПериод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанныеТК.Период, "ДатаНачала");
			
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ТоварнаяКатегория", 	ТоварнаяКатегория);
		ПараметрыОтбора.Вставить("Номенклатура",	 	Справочники.Номенклатура.ПустаяСсылка());
		ПараметрыОтбора.Вставить("Период", 				ОтборПериод);
		СтрокиТоварнойКатегории = Объект.ДвиженияОперации.НайтиСтроки(ПараметрыОтбора);
		Для каждого СтрокаТоварнойКатегории Из СтрокиТоварнойКатегории Цикл
			СтрокаТоварнойКатегории.КоличествоИзменение = СтрокаДанныеТК.СуммаСНДС;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодтвердитьПоПериодамНаКлиенте(Периодичность, МассивНоменклатуры)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Периодичность", Периодичность);
	ПараметрыОтбора.Вставить("НачалоПериода", НачалоГода(Дата(Объект.Период, 1, 1)) );
	ПараметрыОтбора.Вставить("КонецПериода",  КонецГода(Дата(Объект.Период, 1, 1)));  
	ПараметрыОтбора.Вставить("МассивДат",	  ПолучитьНаСервереМассивДат(Периодичность, МассивНоменклатуры));

	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Периодичность", 		Периодичность);
	ДополнительныеПараметры.Вставить("МассивНоменклатуры", 	МассивНоменклатуры);	
	ОповещениеВыбораПериодов = Новый ОписаниеОповещения("ПодтверждениеПериодовОбработка",ЭтотОбъект, ДополнительныеПараметры); 
	ОткрытьФорму("Документ.ПодтверждениеЗакупки.Форма.ФормаВыборПериода",ПараметрыОтбора,
						ЭтотОбъект, ,,,ОповещениеВыбораПериодов,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры   

&НаСервере 
Функция ПолучитьНаСервереМассивДат(Периодичность, МассивНоменклатура)

	МассивДат = Новый Массив;
	

	Для каждого МассивЭлемент  Из МассивНоменклатура Цикл
	   	ДвиженияОперации = Объект.ДвиженияОперации.НайтиСтроки((Новый Структура("Номенклатура,Периодичность", МассивЭлемент, Периодичность)));
			
		Для каждого СтрокаДвижения Из ДвиженияОперации Цикл

			Если НЕ СтрокаДвижения.Законтрактовано Тогда
				Продолжить;		
			КонецЕсли;
			
			Если МассивДат.Найти(СтрокаДвижения.Период) = Неопределено Тогда
			
				МассивДат.Добавить(СтрокаДвижения.Период);		
			
			КонецЕсли;
				
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивДат;
	
КонецФункции	

&НаСервере 
Процедура УстановитьСтраницуГруппаТаблицПериодичности()
	
	Если ТаблицаПериодов.Количество() Тогда
		Элементы.ГруппаТаблицПериодичности.ТекущаяСтраница = Элементы.ГруппаМесяц;
	ИначеЕсли ТаблицаПериодовКвартал.Количество() Тогда		
		Элементы.ГруппаТаблицПериодичности.ТекущаяСтраница = Элементы.ГруппаКвартал;		
	ИначеЕсли таблицаПериодовГод.Количество() Тогда		
		Элементы.ГруппаТаблицПериодичности.ТекущаяСтраница = Элементы.ГруппаГод;			
	Иначе
		Элементы.ГруппаТаблицПериодичности.ТекущаяСтраница = Элементы.ГруппаМесяц;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти	
