////////////////////////////////////////////////////////////////////////////
// Модуль "ВнутренняяПереработкаКлиентСервер" содержит процедуры и функции для 
// работы с механизмом внутренней переработки.
//
////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область СтруктураДействий

// Добавляет действие "ЗаполнитьВладелецИзделияДоступен" в структуру действий
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - форма, в которой формируется структура действий
//  СтруктураДействий - Структура        - структура действий
// 
Процедура ДобавитьДействиеЗаполнитьВладелецИзделияДоступен(Форма, СтруктураДействий) Экспорт
	
	Если Не Форма.ИспользоватьВнутреннююПереработку Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДействий.Вставить("ЗаполнитьВладелецИзделияДоступен");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти