////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с электронными торговыми площадками".
// ОбщийМодуль.ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Описание представлений событий сервиса Бидзаар.
// 
// Возвращаемое значение:
//  Соответствие - Состояния запроса коммерческих предложений Бидзаар:
// * Ключ - Число - значение состояния
// * Значение - Строка - представление состояния
Функция СостоянияЗапросаКоммерческогоПредложенияБидзаар() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(0, СостояниеЧерновик());
	Соответствие.Вставить(1, СостояниеОпубликован());
	Соответствие.Вставить(2, СостояниеИзменен());
	Соответствие.Вставить(3, СостояниеСборПредложений());
	Соответствие.Вставить(4, СостояниеЭтапСбораПредложенийЗавершен());
	Соответствие.Вставить(5, СостояниеСборПредложенийАвтопродление());
	Соответствие.Вставить(6, СостояниеСборПредложений());
	Соответствие.Вставить(7, СостояниеСборПредложенийЗавершен());
	Соответствие.Вставить(8, СостояниеПодведениеИтогов());
	Соответствие.Вставить(9, СостояниеСборПредложений());
	Соответствие.Вставить(10, СостояниеСборПредложений());
	Соответствие.Вставить(11, СостояниеСборПредложений());
	Соответствие.Вставить(12, СостояниеСборПредложений());
	Соответствие.Вставить(13, СостояниеСборПредложений());
	Соответствие.Вставить(14, СостояниеСборПредложений());
	Соответствие.Вставить(15, СостояниеСборПредложений());
	Соответствие.Вставить(16, СостояниеСборПредложений());
	Соответствие.Вставить(17, СостояниеСборПредложений());
	Соответствие.Вставить(18, СостояниеСборПредложений());
	Соответствие.Вставить(19, СостояниеСборПредложений());
	Соответствие.Вставить(20, СостояниеСборПредложений());
	Соответствие.Вставить(21, СостояниеСборПредложений());
	Соответствие.Вставить(22, СостояниеСборПредложений());
	Соответствие.Вставить(23, СостояниеСборПредложений());
	Соответствие.Вставить(24, СостояниеСборПредложений());
	Соответствие.Вставить(25, СостояниеСборПредложений());
	Соответствие.Вставить(26, СостояниеСборПредложений());
	Соответствие.Вставить(27, СостояниеПеренесенВАрхив());
	Соответствие.Вставить(28, СостояниеВозвращенИзАрхива());
	Соответствие.Вставить(29, СостояниеСборПредложений());
	Соответствие.Вставить(30, СостояниеСборПредложений());
	Соответствие.Вставить(32, СостояниеСборПредложений());
	Соответствие.Вставить(33, СостояниеСборПредложений());
	Соответствие.Вставить(34, СостояниеСборПредложений());
	Соответствие.Вставить(35, СостояниеСборПредложений());
	Соответствие.Вставить(36, СостояниеСборПредложений());
	Соответствие.Вставить(37, СостояниеСборПредложений());
	Соответствие.Вставить(38, СостояниеСборПредложений());
	Соответствие.Вставить(53, СостояниеСборПредложений());
	Соответствие.Вставить(54, СостояниеСборПредложений());
	
	Возврат Соответствие;
	
КонецФункции

#Область Словарь

Функция СостояниеНеопределено() Экспорт
	
	Возврат Нстр("ru = 'Неопределено';
				|en = 'Undefined'");
	
КонецФункции

Функция СостояниеЧерновик() Экспорт
	
	Возврат Нстр("ru = 'Черновик';
				|en = 'Draft'");
	
КонецФункции

Функция СостояниеОпубликован() Экспорт
	
	Возврат Нстр("ru = 'Опубликован';
				|en = 'Published'");
	
КонецФункции

Функция СостояниеИзменен()
	
	Возврат Нстр("ru = 'Изменен в сервисе';
				|en = 'Changed in the service'");
	
КонецФункции

Функция СостояниеСборПредложений() Экспорт
	
	Возврат Нстр("ru = 'Сбор предложений';
				|en = 'Quotation collection'");
	
КонецФункции

Функция СостояниеСборПредложенийАвтопродление() Экспорт
	
	Возврат Нстр("ru = 'Сбор предложений (Автопродление)';
				|en = 'Quotation collection (Auto renewal)'");
	
КонецФункции

Функция СостояниеЭтапСбораПредложенийЗавершен() Экспорт
	
	Возврат Нстр("ru = 'Этап сбора предложений завершен';
				|en = 'Quotation collection stage is completed'");
	
КонецФункции

Функция СостояниеСборПредложенийЗавершен() Экспорт
	
	Возврат Нстр("ru = 'Сбор предложений завершен';
				|en = 'Quotations are collected'");
	
КонецФункции

Функция СостояниеСборПредложенийЗавершенБезПобедителя() Экспорт
	
	Возврат Нстр("ru = 'Сбор предложений завершен без выбора победителя';
				|en = 'Quotations are collected without a winner'");
	
КонецФункции

Функция СостояниеПодведениеИтогов() Экспорт
	
	Возврат Нстр("ru = 'Подведение итогов';
				|en = 'Summary'");
	
КонецФункции

Функция СостояниеПеренесенВАрхив() Экспорт
	
	Возврат Нстр("ru = 'Перенесен в архив';
				|en = 'Moved to archive'");
	
КонецФункции

Функция СостояниеВозвращенИзАрхива() Экспорт
	
	Возврат Нстр("ru = 'Возвращен из архива';
				|en = 'Returned from archive'");
	
КонецФункции

Функция ИмяСервисаБидзаар() Экспорт
	
	Возврат "Бидзаар";
	
КонецФункции

// Раздел учета продажи.
// 
// Возвращаемое значение:
//  Строка - Раздел учета поставщики
Функция РазделУчетаПоставщики() Экспорт
	
	Возврат "Поставщики";
	
КонецФункции

// Раздел учета закупки.
// 
// Возвращаемое значение:
//  Строка - Раздел учета покупатели
Функция РазделУчетаПокупатели() Экспорт
	
	Возврат "Покупатели";
	
КонецФункции

Функция КодОтветаОК() Экспорт
	
	Возврат 200;
	
КонецФункции

#КонецОбласти // Словарь

#КонецОбласти // СлужебныйПрограммныйИнтерфейс