
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПолучитьДанныеВыбораСтавки();
	
КонецПроцедуры

Функция ПолучитьДанныеВыбораСтавки()

 	ДоступныеЗначения = Новый СписокЗначений;
		
	//все кроме Удалить_СтавкаДисконтирования
	
	ДоступныеЗначения.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.РыночнаяСтавка);
	ДоступныеЗначения.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.СтавкаПоДоговору);
	ДоступныеЗначения.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.ЭффективнаяСтавка);
	
	Возврат ДоступныеЗначения;

КонецФункции

