
#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеНазначений

// См. ОбеспечениеПроизводства.ПараметрыДействияЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства
// 
// Возвращаемое значение:
//  Булево - Необходимо обновить параметры заполнения назначений при изменении изделий
Функция НеобходимоОбновитьПараметрыЗаполненияНазначенийПриИзмененииИзделий(Объект, ТекущиеДанные, КэшированныеЗначения) Экспорт
	
	Возврат Объект.ДинамическаяСтруктура
		И (
			ТекущиеДанные.Назначение <> КэшированныеЗначения.Назначение
			ИЛИ ТекущиеДанные.Отменено <> КэшированныеЗначения.Отменено
		);
	
КонецФункции

#КонецОбласти

#КонецОбласти
