#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СтрШаблон(НСтр("ru = 'Расшифровка данных строки %1';
								|en = 'String data decryption %1'"),
								ИТК_ОбработкаРезультатаКлиентСервер.ПредставлениеИндексаОбъекта(Параметры.НомерСтроки));
	
	// Добавляем реквизиты
	Если Параметры.Свойство("Данные") Тогда
		
		Для Каждого ЭлементДанных Из Параметры.Данные Цикл 
			
			Значение = ЭлементДанных.Значение;
			
			НоваяСтрока = Данные.Добавить();
			НоваяСтрока.Имя = ЭлементДанных.Ключ;
			НоваяСтрока.Значение = Значение;
			НоваяСтрока.Гиперссылка = ЗначениеЗаполнено(Значение) И ИТК_ТипыКлиентСервер.ЭтоСсылочный(ТипЗнч(Значение), Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатыОбработки = ПолучитьИзВременногоХранилища(Параметры.АдресРезультатов);
	Результат = РезультатыОбработки[Параметры.НомерСтроки];
	
	// Добавляем сообщения
	ЕстьСообщения = Результат.Свойство("Сообщения");
	Если ЕстьСообщения Тогда
		
		Для Каждого Сообщение Из Результат.Сообщения Цикл 
			
			НоваяСтрока = Сообщения.Добавить();
			НоваяСтрока.Текст = Сообщение;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Ошибка = ИТК_ОбщийКлиентСервер.Свойство(Результат, "Ошибка", "");
	ОписаниеОшибки = ИТК_ЗапросКлиентСервер.ИнформацияООшибке(Ошибка);
	
	Элементы.Ошибка.Видимость = ЗначениеЗаполнено(Ошибка);
	Элементы.ПерейтиКМестуОшибкиЗакрыть.Видимость = (ТипЗнч(ОписаниеОшибки) = Тип("Структура"));
	
	ДанныеКоличество = Данные.Количество();
	Элементы.ГруппаДанные.Видимость = ЗначениеЗаполнено(ДанныеКоличество);
	
	СообщенияКоличество = Сообщения.Количество();
	Элементы.Сообщения.Видимость = ЗначениеЗаполнено(СообщенияКоличество);
	
	УстановитьУсловноеОформление();
	
	ИТК_Форма.ОбработчикПриСозданииНаСервереПосле(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанные

&НаКлиенте
Процедура ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДанныеЗначение Тогда
		
		ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
		
		Если ТекущиеДанные.Гиперссылка Тогда
			
			ПоказатьЗначение(, ТекущиеДанные.Значение);
			
		Иначе
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСообщения

&НаКлиенте
Процедура СообщенияТекстОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияТекстОткрытие(Элемент, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОткрытьМногострочныйТекст(Элемент, Элемент.ТекстРедактирования, Ложь, , СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКМестуОшибкиЗакрыть(Команда)
	
	ОписаниеОшибки = ИТК_ЗапросКлиентСервер.ИнформацияООшибке(Ошибка);
	Закрыть(ОписаниеОшибки);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОформлениеПоля = Новый Структура;
	ОформлениеПоля.Вставить("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	ОформлениеПоля.Вставить("ЦветТекста", ИТК_ОбщийКлиентСервер.ЦветТекстаГиперссылки());
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДанныеЗначение", ОформлениеПоля, "Данные.Гиперссылка", Истина);
	
КонецПроцедуры

#КонецОбласти