
Процедура CPM_Data_Exchange_To_CPMОбработкаПолученияСообщения(Сообщение, Отказ)
	
	GUIDВнешнейИБ=Сообщение.Параметры.Получить("GUIDТекущейИБ"); 
	
	Если ЗначениеЗаполнено(GUIDВнешнейИБ) Тогда
		
		ОбработатьЗапросВнешнейИБ(GUIDВнешнейИБ,Сообщение,Отказ);
		
	Иначе
		
		ОбработатьДанныеВнешнейИБ(Сообщение, Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ОбработатьДанныеВнешнейИБ(Сообщение, Отказ)
	
	СтрокаИдентификатор=Сообщение.Параметры.Получить("ИдентификаторСообщения");
	
	Если Не ЗначениеЗаполнено(СтрокаИдентификатор) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторСообщения=Новый УникальныйИдентификатор(СтрокаИдентификатор);
	
	НаборЗаписей=РегистрыСведений.ЖурналОбменаСообщениямиШина.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	
	НоваяСтрока=НаборЗаписей.Добавить();
	НоваяСтрока.ИдентификаторСообщения=ИдентификаторСообщения;
	НоваяСтрока.ДанныеОтвета=Новый ХранилищеЗначения(РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьДанныеИзТелаСообщения(Сообщение),Новый СжатиеДанных(9));
	
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры // ОбработатьДанныеВнешнейИБ()

Процедура ОбработатьЗапросВнешнейИБ(GUIDВнешнейИБ,Сообщение,Отказ)
	
	ДочерняяБаза=Справочники.ВнешниеИнформационныеБазы.ПолучитьСсылку(Новый УникальныйИдентификатор(GUIDВнешнейИБ));
	
	ПараметрыСообщения=Новый Структура;
	ПараметрыСообщения.Вставить("КодОтправителя",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВнешниеИнформационныеБазы.ТекущаяИБ,"КодИнформационнойСистемы"));
	ПараметрыСообщения.Вставить("КодПолучателя",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДочерняяБаза,"КодИнформационнойСистемы"));
	ПараметрыСообщения.Вставить("СервисИнтеграции",	"CPMExchangeMaster");
	ПараметрыСообщения.Вставить("КаналОтправки",	"CPM_Data_Exchange_From_CPM");
	ПараметрыСообщения.Вставить("ТипСообщения",		"CPMExchangeMaster");
	ПараметрыСообщения.Вставить("ИдентификаторСообщения",Сообщение.Параметры.Получить("ИдентификаторСообщения"));
	
	Попытка
		
		ДанныеОтвета=РаботаСОбъектамиМетаданныхВнешнийУХ.ВыполнитьДействиеПоСообщению(Сообщение);
		
		РаботаСОбъектамиМетаданныхВнешнийУХ.ОтправитьСообщение1СШина(ПараметрыСообщения,ДанныеОтвета);
		
	Исключение 
		
		РаботаСОбъектамиМетаданныхВнешнийУХ.ОтправитьСообщение1СШина(ПараметрыСообщения,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		СервисыИнтеграции.CPMExchangeMaster.CPM_Data_Exchange_To_CPM.УдалитьСообщения();
				
	КонецПопытки;
	
КонецПроцедуры // ОбработатьЗапросВнешнейИБ()
