
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновлениеКодовДеклараций(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДоходовИРасходовКИК.Ссылка КАК Ссылка,
		|	СтатьиДоходовИРасходовКИК.КодЭлементаНалоговойДекларации КАК КодЭлементаНалоговойДекларации,
		|	СтатьиДоходовИРасходовКИК.КодЭлементаНДФЛ КАК КодЭлементаНДФЛ
		|ИЗ
		|	Справочник.СтатьиДоходовИРасходовКИК КАК СтатьиДоходовИРасходовКИК
		|ГДЕ
		|	СтатьиДоходовИРасходовКИК.ПометкаУдаления = ЛОЖЬ
		|	И (СтатьиДоходовИРасходовКИК.КодЭлементаНалоговойДекларации <> """"
		|			ИЛИ СтатьиДоходовИРасходовКИК.КодЭлементаНДФЛ <> """")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ВыборкаДетальныеЗаписи.КодЭлементаНалоговойДекларации <> "" Тогда
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчетПрибыль.ФормаОтчета2016Кв4";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНалоговойДекларации;
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчетПрибыль.ФормаОтчета2019Кв4";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНалоговойДекларации;
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.КодЭлементаНДФЛ <> "" Тогда
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчет3НДФЛ.ФормаОтчета2017кв1";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНДФЛ;
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчет3НДФЛ.ФормаОтчета2018кв1";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНДФЛ;
		КонецЕсли;
		Объект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ОбновлениеПредопределенныхЭлементов(Параметры = Неопределено) Экспорт
	
	СтрокаПредопределенныхКодов = "П0009А0001101,П0009А0001102,П0009А0001103,П0009А0001104,П0009А0001105,П0009А0001106,П0009А0001107,П0009А0001108,П0009А0001109,ПВ_3,ПВ_4,ПВ_5,ПВ_6";
	СоответствиеПредопределенныхЭлементов = Новый Соответствие;
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001101", Справочники.СтатьиДоходовИРасходовКИК.Код1001);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001102", Справочники.СтатьиДоходовИРасходовКИК.Код1002);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001103", Справочники.СтатьиДоходовИРасходовКИК.Код1003);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001104", Справочники.СтатьиДоходовИРасходовКИК.Код1004);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001105", Справочники.СтатьиДоходовИРасходовКИК.Код1005);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001106", Справочники.СтатьиДоходовИРасходовКИК.Код1006);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001107", Справочники.СтатьиДоходовИРасходовКИК.Код1007);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001108", Справочники.СтатьиДоходовИРасходовКИК.Код1008);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001109", Справочники.СтатьиДоходовИРасходовКИК.Код1009);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_3", Справочники.СтатьиДоходовИРасходовКИК.ДатаФинОтчетности);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_4", Справочники.СтатьиДоходовИРасходовКИК.ДатаСоставления);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_5", Справочники.СтатьиДоходовИРасходовКИК.ДатаПрибыли);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_6", Справочники.СтатьиДоходовИРасходовКИК.ДатаАудита);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДоходовИРасходовКИК.Ссылка КАК Ссылка,
		|	СтатьиДоходовИРасходовКИК.Код КАК Код
		|ИЗ
		|	Справочник.СтатьиДоходовИРасходовКИК КАК СтатьиДоходовИРасходовКИК
		|ГДЕ
		|	СтатьиДоходовИРасходовКИК.Код В(&Код)
		|	И СтатьиДоходовИРасходовКИК.ПометкаУдаления = ЛОЖЬ
		|	И СтатьиДоходовИРасходовКИК.Предопределенный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Код", СтрРазделить(СтрокаПредопределенныхКодов, ","));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяПредопределенныхДанных = СоответствиеПредопределенныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Код).ИмяПредопределенныхДанных;
		Объект1 = СоответствиеПредопределенныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Код).ПолучитьОбъект();
		Объект1.ИмяПредопределенныхДанных = "";
		Объект1.Записать();
		Объект2 = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Объект2.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
		Объект2.Записать();
		Объект1.ПометкаУдаления = Истина;
		Объект1.Записать();
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры    

Функция КоличествоАналитикСтатьиКИК() Экспорт

	Возврат 1;
	
КонецФункции // КоличествоАналитикСтатьиКИК() 
	
#КонецЕсли
