#Область СлужебныйПрограммныйИнтерфейс

Функция Настройки(Ссылка = Неопределено) Экспорт
	
	КлючОбъекта = ИТК_ТуллкитКлиентСервер.ОсновнойКлючОбъектаНастроек();
	КлючНастроек = КлючНастроекОтладкаДополнительныхОтчетовИОбработок();
	
	ВсеНастройкиОтладки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастроек);
	Если ВсеНастройкиОтладки = Неопределено Тогда
		ВсеНастройкиОтладки = Новый Соответствие;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Результат = ВсеНастройкиОтладки.Получить(Ссылка);
	Иначе
		Результат = ВсеНастройкиОтладки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьНастройки(Ссылка, ПолноеИмяФайла, Пользователь) Экспорт
	
	КлючОбъекта = ИТК_ТуллкитКлиентСервер.ОсновнойКлючОбъектаНастроек();
	КлючНастроек = КлючНастроекОтладкаДополнительныхОтчетовИОбработок();
	
	ВсеНастройкиОтладки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастроек);
	Если ВсеНастройкиОтладки = Неопределено Тогда
		ВсеНастройкиОтладки = Новый Соответствие;
	КонецЕсли;
	
	ОписаниеНастройки = Новый Структура;
	ОписаниеНастройки.Вставить("Файл", ПолноеИмяФайла);
	ОписаниеНастройки.Вставить("Пользователь", Пользователь);
	
	Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		ВсеНастройкиОтладки.Вставить(Ссылка, ОписаниеНастройки);
	КонецЕсли;
	
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, КлючНастроек, ВсеНастройкиОтладки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючНастроекОтладкаДополнительныхОтчетовИОбработок()
	Возврат "ОтладкаДополнительныхОтчетовИОбработок";
КонецФункции

#КонецОбласти