
&НаСервере
Функция ОпределитьВидРегистра(МетаданныеРегистра)

	Если Метаданные.РегистрыНакопления.Индекс(МетаданныеРегистра) >= 0 Тогда
		Результат = "Накопления";
	ИначеЕсли Метаданные.РегистрыСведений.Индекс(МетаданныеРегистра) >= 0 Тогда
		Результат = "Сведений";
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ДобавитьКолонкуВТаблицу(МетаданныеПоля, ТаблицаПолей)		
	
	ТаблицаПолей.Колонки.Добавить(МетаданныеПоля.Имя, , МетаданныеПоля.Синоним);
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкуПериодВТаблицу(ТаблицаПолей)

	ТаблицаПолей.Колонки.Добавить("Период", , "Период");
	
КонецПроцедуры

&НаСервере
Процедура ПрисоединитьОбласть(ТабличныйДокумент, ОбластьМакета, Таблица)

	Для Каждого Колонка Из Таблица.Колонки Цикл

		ОбластьМакета.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
		ТабличныйДокумент.Присоединить(ОбластьМакета);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, Область, СтрокаТаблицы)

	Для Каждого Колонка Из СтрокаТаблицы.Владелец().Колонки Цикл

		Область.Параметры.Значение = СтрокаТаблицы[Колонка.Имя];			
		ТабличныйДокумент.Присоединить(Область);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТаблицуКоллекций(ТаблицаКоллекций,ИмяКоллекции,ИмяТаблицы)
	
	НоваяСтрока=ТаблицаКоллекций.Добавить();
	НоваяСтрока.ИмяКоллекции=ИмяКоллекции;
	НоваяСтрока.ИмяТаблицы=ИмяТаблицы;
	
КонецПроцедуры // ДобавитьСтрокуВТаблицуКоллекций()

&НаСервере
Функция ПолучитьМассивПропускаемыхПолей()
	
	МассивПолей=Новый Массив;
	МассивПолей.Добавить("ЗначениеЗаблокировано");
	МассивПолей.Добавить("ИндексСостояния");
	МассивПолей.Добавить("ЕстьКомментарий");
	МассивПолей.Добавить("ТекстКомментария");
	МассивПолей.Добавить("ДатаИзмененияMs");
	МассивПолей.Добавить("ПравилоОбработки");
	МассивПолей.Добавить("ИспользуемаяИБ");
	
	Возврат МассивПолей;
	
КонецФункции // ПолучитьМассивПропускаемыхПолей()
	
&НаСервере
Функция ПолучитьДанныеПоДвижениям(МетаданныеРегистра, ВидРегистра)

	ТаблицаРесурсов    	= Новый ТаблицаЗначений;
	ТаблицаИзмерений   	= Новый ТаблицаЗначений;
	ТаблицаРеквизитов  	= Новый ТаблицаЗначений;
	ТаблицаВидДвижений 	= Неопределено;
	ИмяРегистра			= МетаданныеРегистра.Имя;

	СтруктураПолей = Новый Структура("Измерения, Реквизиты, Ресурсы",
			Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив),
			Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив),
			Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив));

	НуженПериод = Не (ВидРегистра = "Сведений"
				И МетаданныеРегистра.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);

	Если НуженПериод Тогда

		ИмяКоллекции = "Измерения";
		ИмяТаблицы   = ТаблицаИзмерений;

		ДобавитьКолонкуПериодВТаблицу(ТаблицаИзмерений);

		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
								+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",") + "Период";

	КонецЕсли;

	ТекстСоединения   = "";
	ТекстПолейВыборки = "";
	
	МассивПропускаемыхПолей=ПолучитьМассивПропускаемыхПолей();
	
	ТаблицаКоллекций=Новый ТаблицаЗначений;
	ТаблицаКоллекций.Колонки.Добавить("ИмяКоллекции");
	ТаблицаКоллекций.Колонки.Добавить("ИмяТаблицы");
	
	ДобавитьСтрокуВТаблицуКоллекций(ТаблицаКоллекций,"Измерения",ТаблицаИзмерений);
	ДобавитьСтрокуВТаблицуКоллекций(ТаблицаКоллекций,"Ресурсы",ТаблицаРесурсов);
	ДобавитьСтрокуВТаблицуКоллекций(ТаблицаКоллекций,"Реквизиты",ТаблицаРеквизитов);
	
	Для Индекс=0 ПО 2 Цикл
		
		СтрКоллекция=ТаблицаКоллекций[Индекс];
		ИмяКоллекции=СтрКоллекция.ИмяКоллекции;
		ИмяТаблицы	=СтрКоллекция.ИмяТаблицы;
		
		Для Каждого Измерение Из МетаданныеРегистра[ИмяКоллекции] Цикл
			
			Если НЕ МассивПропускаемыхПолей.Найти(Измерение.Имя)=Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			
			ДобавитьКолонкуВТаблицу(Измерение, ИмяТаблицы);
			
			ТекстПоля = "Таблица." + Измерение.Имя + " КАК " + Измерение.Имя;
			
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
			+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",") + Измерение.Имя;
			
			ТекстПолейВыборки = ТекстПолейВыборки +","+ Символы.ПС + ТекстПоля;
			
			Если СтрНайти(ИмяРегистра,"ЗначенияПоказателей")>0 И Измерение.Имя="Версия" Тогда
				
				ТаблицаИзмерений.Колонки.Добавить("Период",,"Период");
				
				ТекстПоля = " Таблица.Версия.ПериодОтчета КАК Период";
				
				СтруктураПолей["Измерения"].СтрокаПолей = СтруктураПолей["Измерения"].СтрокаПолей
				+ ?(ПустаяСтрока(СтруктураПолей["Измерения"].СтрокаПолей),"", ",") + "Период";
				
				ТекстПолейВыборки = ТекстПолейВыборки +","+ Символы.ПС + ТекстПоля;
				
				ТаблицаИзмерений.Колонки.Добавить("ВидОтчета",,"ВидОтчета");
				
				ТекстПоля = " Таблица.Версия.ВидОтчета КАК ВидОтчета";
				
				СтруктураПолей["Измерения"].СтрокаПолей = СтруктураПолей["Измерения"].СтрокаПолей
				+ ?(ПустаяСтрока(СтруктураПолей["Измерения"].СтрокаПолей),"", ",") + "ВидОтчета";
				
				ТекстПолейВыборки = ТекстПолейВыборки +","+ Символы.ПС + ТекстПоля;
				
				Если ИмяДокумента="КорректировкаЗначенийПоказателей" Тогда
					
					ТаблицаИзмерений.Колонки.Добавить("Организация",,"Организация");
					
					ТекстПоля = " Таблица.Версия.Организация КАК Организация";
					
					СтруктураПолей["Измерения"].СтрокаПолей = СтруктураПолей["Измерения"].СтрокаПолей
					+ ?(ПустаяСтрока(СтруктураПолей["Измерения"].СтрокаПолей),"", ",") + "Организация";
					
					ТекстПолейВыборки = ТекстПолейВыборки +","+ Символы.ПС + ТекстПоля;	
					
				КонецЕсли;
				
				ТаблицаИзмерений.Колонки.Добавить("Валюта",,"Валюта");
				
				ТекстПоля = " Таблица.Версия.Валюта КАК Валюта";
				
				СтруктураПолей["Измерения"].СтрокаПолей = СтруктураПолей["Измерения"].СтрокаПолей
				+ ?(ПустаяСтрока(СтруктураПолей["Измерения"].СтрокаПолей),"", ",") + "Валюта";
				
				ТекстПолейВыборки = ТекстПолейВыборки +","+ Символы.ПС + ТекстПоля;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ВидРегистра = "Накопления"
	   И МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда

		ТаблицаВидДвижений = Новый ТаблицаЗначений;
		ТаблицаВидДвижений.Колонки.Добавить("ВидДвижения", , НСтр("ru = 'Вид движения'; en = 'Register record kind';tr = 'Hareket türü'"));

		ТекстПолейВыборки = ТекстПолейВыборки + ",Таблица.ВидДвижения КАК ВидДвижения";
		ТекстПолейВыборки = ТекстПолейВыборки + ",Таблица.НомерСтроки КАК НомерСтроки";

	КонецЕсли;

	Если НуженПериод Тогда

		ТекстПолейВыборки = ТекстПолейВыборки + ",Таблица.Период КАК Период";

	КонецЕсли;

	ТекстЗапроса = 
	"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|" + Сред(ТекстПолейВыборки,2) + "
	|ИЗ
	|	" + МетаданныеРегистра.ПолноеИмя() + " КАК Таблица 
	|" + ТекстСоединения;
	
	
	Если ТаблицаИзмерений.Колонки.Найти("Версия") = Неопределено Тогда
					
			ТекстЗапроса = ТекстЗапроса + " 	
			|ГДЕ
			|	Таблица.Регистратор = &Документ";
		
		
		Если СтрНайти(ТекстПолейВыборки, "Таблица.НомерСтроки") > 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		КонецЕсли;
		
	Иначе
				
		Если СписокОбъектов.Количество() = 0 тогда
			
			ТекстЗапроса = ТекстЗапроса + " 	
			|ГДЕ
			|	Таблица.Версия.Регистратор = &Документ
			|Упорядочить ПО";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + " 	
			|ГДЕ
			|	Таблица.Версия.Владелец В (&СписокОбъектов)
			|Упорядочить ПО";
						
		КонецЕсли; 
		
		ТекстЗапроса = ТекстЗапроса + "
		|Показатель,";
				
		Если ОбщегоНазначенияПовтИспУХ.ИспользуетсяМногопериоднаяОтчетность() Тогда
			
			ТекстЗапроса = ТекстЗапроса+"
			|Версия.ПериодОтчета.ДатаНачала,";
			
		КонецЕсли;
			
		ТекстЗапроса = ТекстЗапроса+"
		|Версия.ЗаписьВДополнительнойВалюте,
		|Версия.Валюта,
		|Версия.Код";
		
	КонецЕсли;

	Возврат Новый Структура("ТекстЗапроса, СтруктураПолей, ТаблицаРесурсов, ТаблицаИзмерений, ТаблицаРеквизитов, ТаблицаВидДвижений",
						ТекстЗапроса, СтруктураПолей, ТаблицаРесурсов, ТаблицаИзмерений, ТаблицаРеквизитов, ТаблицаВидДвижений);

КонецФункции

&НаСервере
Функция ПолучитьЗначенияВСтроку(ВыборкаДанных, МассивПолей)

	Результат = "";
	Для Каждого ИмяПоля Из МассивПолей Цикл
		Если ЗначениеЗаполнено(ВыборкаДанных[ИмяПоля]) Тогда

			Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ВыборкаДанных[ИмяПоля];

		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет)

	ВидРегистра = ОпределитьВидРегистра(МетаданныеРегистра);

	Результат = ПолучитьДанныеПоДвижениям(МетаданныеРегистра, ВидРегистра);

	ТаблицаРесурсов    = Результат.ТаблицаРесурсов;
	ТаблицаИзмерений   = Результат.ТаблицаИзмерений;
	ТаблицаРеквизитов  = Результат.ТаблицаРеквизитов;
	ТаблицаВидДвижений = Результат.ТаблицаВидДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Отчет.Документ);
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
	Запрос.Текст = Результат.ТекстЗапроса;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Если ТаблицаВидДвижений <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаВидДвижений.Добавить(), Выборка, "ВидДвижения");
		КонецЕсли;

		СтрокаРесурсов   = ТаблицаРесурсов.Добавить();
		СтрокаИзмерений  = ТаблицаИзмерений.Добавить();
		СтрокаРеквизитов = ТаблицаРеквизитов.Добавить();

		Для Каждого ЭлементАналитики Из Результат.СтруктураПолей.Измерения.МассивРеквизитовАналитики Цикл

			СтрокаИзмерений[ЭлементАналитики.Поле] = ПолучитьЗначенияВСтроку(Выборка, ЭлементАналитики.МассивПолей);

		КонецЦикла;

		Для Каждого ЭлементАналитики Из Результат.СтруктураПолей.Реквизиты.МассивРеквизитовАналитики Цикл

			СтрокаРеквизитов[ЭлементАналитики.Поле] = ПолучитьЗначенияВСтроку(Выборка, ЭлементАналитики.МассивПолей);

		КонецЦикла;

		ЗаполнитьЗначенияСвойств(СтрокаРесурсов,   Выборка, Результат.СтруктураПолей.Ресурсы.СтрокаПолей);
		ЗаполнитьЗначенияСвойств(СтрокаИзмерений,  Выборка, Результат.СтруктураПолей.Измерения.СтрокаПолей);
		ЗаполнитьЗначенияСвойств(СтрокаРеквизитов, Выборка, Результат.СтруктураПолей.Реквизиты.СтрокаПолей);

	КонецЦикла;

	ЦветЗеленый = WebЦвета.Зеленый;
	ЦветКрасный = WebЦвета.Кирпичный;

	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовок.Параметры.СинонимРегистра = СтрШаблон(Нстр("ru = 'Регистр %1 ""%2""'; en = 'Register %1 %2';tr = '""%2"" %1 kaydı'"),НРег(ВидРегистра),МетаданныеРегистра.Синоним);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.НачатьГруппуСтрок();

	КоличествоСтрокРезультата = Выборка.Количество();

	Если ПоГоризонтали = 1 Тогда //Перечисления.СпособыВыводаОтчета.ПоГоризонтали

		ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокЯчейки");
		ОбластьЯчейка    = Макет.ПолучитьОбласть("Ячейка");
		ОбластьОтступ    = Макет.ПолучитьОбласть("Отступ1");

		ТабличныйДокумент.Вывести(ОбластьОтступ);

		Если ТаблицаВидДвижений <> Неопределено Тогда

			ОбластьЗаголовок.Параметры.ЗаголовокКолонки = НСтр("ru = 'Вид движения'; en = 'Register record kind';tr = 'Hareket türü'");
			ТабличныйДокумент.Присоединить(ОбластьЗаголовок);

		КонецЕсли;

		ПрисоединитьОбласть(ТабличныйДокумент, ОбластьЗаголовок, ТаблицаИзмерений);
		ПрисоединитьОбласть(ТабличныйДокумент, ОбластьЗаголовок, ТаблицаРесурсов);
		
		Если ТаблицаРеквизитов.Колонки.Количество()>0 Тогда
			ПрисоединитьОбласть(ТабличныйДокумент, ОбластьЗаголовок, ТаблицаРеквизитов);
		КонецЕсли;

		Для НомерСтроки = 1 По КоличествоСтрокРезультата Цикл

			ТабличныйДокумент.Вывести(ОбластьОтступ);
			Если ТаблицаВидДвижений <> Неопределено Тогда

				ОбластьЯчейка.Параметры.Значение = ТаблицаВидДвижений[НомерСтроки-1].ВидДвижения;
				ТабличныйДокумент.Присоединить(ОбластьЯчейка);

				Область = ТабличныйДокумент.Область("Ячейка");
				Область.ШиринаКолонки = 13;

				Если ТаблицаВидДвижений[НомерСтроки-1].ВидДвижения = ВидДвиженияНакопления.Расход Тогда
					Область.ЦветТекста = ЦветКрасный;
				Иначе
					Область.ЦветТекста = ЦветЗеленый;
				КонецЕсли;

			КонецЕсли;

			ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, ОбластьЯчейка, ТаблицаИзмерений[НомерСтроки-1]);
			ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, ОбластьЯчейка, ТаблицаРесурсов[НомерСтроки-1]);
			
			Если ТаблицаРеквизитов.Колонки.Количество()>0 Тогда
				ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, ОбластьЯчейка, ТаблицаРеквизитов[НомерСтроки-1]);
			КонецЕсли;

		КонецЦикла;
	Иначе
		// Вывод таблицы
		
		Если ТаблицаВидДвижений <> Неопределено Тогда

			ОбластьШапки                  = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьДеталиШапки            = Макет.ПолучитьОбласть("ДеталиШапки");
			ОбластьДетали                 = Макет.ПолучитьОбласть("Детали");
			ОбластьШапкиВидДвижения       = Макет.ПолучитьОбласть("ШапкаТаблицыВидДвижения");
			ОбластьДеталиШапкиВидДвижения = Макет.ПолучитьОбласть("ДеталиШапкиВидДвижения");
			ОбластьДеталиВидДвижения      = Макет.ПолучитьОбласть("ДеталиВидДвижения");
			ОбластьОтступ                 = Макет.ПолучитьОбласть("Отступ");

		Иначе

			Если ТаблицаРеквизитов.Колонки.Количество()>0 Тогда 
				
				ОбластьШапки       = Макет.ПолучитьОбласть("ШапкаТаблицы1");
				ОбластьДеталиШапки = Макет.ПолучитьОбласть("ДеталиШапки1");
				ОбластьДетали      = Макет.ПолучитьОбласть("Детали1");
				
			Иначе
				
				ОбластьШапки       = Макет.ПолучитьОбласть("ШапкаТаблицы2");
				ОбластьДеталиШапки = Макет.ПолучитьОбласть("ДеталиШапки2");
				ОбластьДетали      = Макет.ПолучитьОбласть("Детали2");
				
			КонецЕсли;
			
			ОбластьОтступ      = Макет.ПолучитьОбласть("Отступ2");

		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьОтступ);

		Если ТаблицаВидДвижений <> Неопределено Тогда
			ТабличныйДокумент.Присоединить(ОбластьШапкиВидДвижения);
		КонецЕсли;

		ТабличныйДокумент.Присоединить(ОбластьШапки);

		КоличествоКолонокШапки = Макс(ТаблицаРесурсов.Колонки.Количество(), ТаблицаИзмерений.Колонки.Количество(),
									ТаблицаРеквизитов.Колонки.Количество());
		ТонкаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);

		Для НомерСтроки = 1 По КоличествоКолонокШапки Цикл

			ОбластьДеталиШапки.Параметры.Ресурсы   = "";
			ОбластьДеталиШапки.Параметры.Измерения = "";
			
			Если ТаблицаРеквизитов.Колонки.Количество()>0 Тогда 
				ОбластьДеталиШапки.Параметры.Реквизиты = "";
			КонецЕсли;

			Если ТаблицаРесурсов.Колонки.Количество() >= НомерСтроки Тогда
				ОбластьДеталиШапки.Параметры.Ресурсы = ТаблицаРесурсов.Колонки[НомерСтроки-1].Заголовок;
				ОбластьДеталиШапки.Область(1,2,1,2).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
			Иначе
				ОбластьДеталиШапки.Область(1,2,1,2).Обвести(ТонкаяЛиния,,ТонкаяЛиния,);
			КонецЕсли;

			Если ТаблицаИзмерений.Колонки.Количество() >= НомерСтроки Тогда
				ОбластьДеталиШапки.Параметры.Измерения = ТаблицаИзмерений.Колонки[НомерСтроки-1].Заголовок;
				ОбластьДеталиШапки.Область(1,1,1,1).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
			Иначе
				ОбластьДеталиШапки.Область(1,1,1,1).Обвести(ТонкаяЛиния,,ТонкаяЛиния,);
			КонецЕсли;

			Если ТаблицаРеквизитов.Колонки.Количество() >= НомерСтроки Тогда
				ОбластьДеталиШапки.Параметры.Реквизиты = ТаблицаРеквизитов.Колонки[НомерСтроки-1].Заголовок;
				ОбластьДеталиШапки.Область(1,3,1,3).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
			ИначеЕсли ТаблицаРеквизитов.Колонки.Количество()>0 Тогда 
				ОбластьДеталиШапки.Область(1,3,1,3).Обвести(ТонкаяЛиния,,ТонкаяЛиния,);
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьОтступ);
			Если ТаблицаВидДвижений <> Неопределено Тогда
				ТабличныйДокумент.Присоединить(ОбластьДеталиШапкиВидДвижения);
			КонецЕсли;

			ТабличныйДокумент.Присоединить(ОбластьДеталиШапки);

			Если НомерСтроки = КоличествоКолонокШапки Тогда
				Если ТаблицаВидДвижений <> Неопределено Тогда

					ТабличныйДокумент.Область("ДеталиШапкиВидДвижения").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
					ТабличныйДокумент.Область("ДеталиШапки").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);

				Иначе

					Если ТаблицаРеквизитов.Колонки.Количество()>0 Тогда 
						ТабличныйДокумент.Область("ДеталиШапки1").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
					Иначе
						ТабличныйДокумент.Область("ДеталиШапки2").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
		
		Для НомерСтроки = 1 По КоличествоСтрокРезультата Цикл

			ВыведенВидДвижения = Ложь;

			Для НомерКолонки = 1 По КоличествоКолонокШапки Цикл

				ОбластьДетали.Параметры.Ресурсы   = "";
				ОбластьДетали.Параметры.Измерения = "";
				
				Если ТаблицаРеквизитов.Колонки.Количество()>0 Тогда 
					ОбластьДетали.Параметры.Реквизиты = "";
				КонецЕсли;
				
				Если ТаблицаРесурсов.Колонки.Количество() >= НомерКолонки Тогда

					ИмяКолонки = ТаблицаРесурсов.Колонки[НомерКолонки-1].Имя;
					ОбластьДетали.Параметры.Ресурсы = ТаблицаРесурсов[НомерСтроки-1][ИмяКолонки];
					ОбластьДетали.Область(1,2,1,2).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);

				Иначе

					ОбластьДетали.Область(1,2,1,2).Обвести(ТонкаяЛиния,, ТонкаяЛиния,);

				КонецЕсли;

				Если ТаблицаИзмерений.Колонки.Количество() >= НомерКолонки Тогда

					ИмяКолонки = ТаблицаИзмерений.Колонки[НомерКолонки-1].Имя;
					ОбластьДетали.Параметры.Измерения = ТаблицаИзмерений[НомерСтроки-1][ИмяКолонки];
					ОбластьДетали.Область(1,1,1,1).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);

				Иначе

					ОбластьДетали.Область(1,1,1,1).Обвести(ТонкаяЛиния, , ТонкаяЛиния,);

				КонецЕсли;

				Если ТаблицаРеквизитов.Колонки.Количество() >= НомерКолонки Тогда

					ИмяКолонки = ТаблицаРеквизитов.Колонки[НомерКолонки-1].Имя;
					ОбластьДетали.Параметры.Реквизиты = ТаблицаРеквизитов[НомерСтроки-1][ИмяКолонки];
					ОбластьДетали.Область(1,3,1,3).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);

				ИначеЕсли ТаблицаРеквизитов.Колонки.Количество()>0 Тогда

					ОбластьДетали.Область(1,3,1,3).Обвести(ТонкаяЛиния, , ТонкаяЛиния,);

				КонецЕсли;

				ТабличныйДокумент.Вывести(ОбластьОтступ);
				
				Если ТаблицаВидДвижений <> Неопределено Тогда

					ВидДвижения = ?(ВыведенВидДвижения, "", ТаблицаВидДвижений[НомерСтроки-1]["ВидДвижения"]);

					ОбластьДеталиВидДвижения.Параметры.ВидДвижения = ВидДвижения;
					ТабличныйДокумент.Присоединить(ОбластьДеталиВидДвижения);

					Если Не ВыведенВидДвижения Тогда
						Если ВидДвижения = ВидДвиженияНакопления.Расход Тогда
							ТабличныйДокумент.Область("ДеталиВидДвижения").ЦветТекста = ЦветКрасный;
						Иначе
							ТабличныйДокумент.Область("ДеталиВидДвижения").ЦветТекста = ЦветЗеленый;
						КонецЕсли;
					КонецЕсли;

					ВыведенВидДвижения = Истина;

				КонецЕсли;
				
				ТабличныйДокумент.Присоединить(ОбластьДетали);
				
				Если НомерКолонки = КоличествоКолонокШапки Тогда
					Если ТаблицаВидДвижений <> Неопределено Тогда
						
						ТабличныйДокумент.Область("ДеталиВидДвижения").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
						ТабличныйДокумент.Область("Детали").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
						
					Иначе
						Если ТаблицаРеквизитов.Колонки.Количество()>0 Тогда 
							ТабличныйДокумент.Область("Детали1").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
						Иначе
							ТабличныйДокумент.Область("Детали2").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	ТабличныйДокумент.ЗакончитьГруппуСтрок();

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
				
	Если Не ЗначениеЗаполнено(Отчет.Документ) И СписокОбъектов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран документ или список версий'; en = 'Document or version list is not selected';tr = 'Belge ya da sürüm listesi seçilmedi'"), , "Отчет.Документ");
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент.Очистить();

	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	МетаданныеДокумента = Отчет.Документ.Метаданные();
	
	Если Метаданные.Документы.Содержит(МетаданныеДокумента) тогда
				
		МассивРегистров = ОбщегоНазначенияУХ.ПолучитьМассивИспользуемыхРегистров(Отчет.Документ, МетаданныеДокумента.Движения);
		
		Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл
			
			Если СтрНайти(МетаданныеРегистра.Имя, "Удалить", , 1) = 1 Тогда
				Продолжить;
			КонецЕсли;

			Если МассивРегистров.Найти(МетаданныеРегистра.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет);
			
		КонецЦикла;
		
	Иначе
		
		МассивРегистров = Новый Массив;
				
	КонецЕсли;
		
	Если ИмяДокумента="НастраиваемыйОтчет" 
		ИЛИ ИмяДокумента="Трансляция"
		ИЛИ ИмяДокумента="ТрансформационнаяКорректировка"
		ИЛИ ИмяДокумента="ОписаниеВерсий"
		ИЛИ ИмяДокумента="КорректировкаЗначенийПоказателей" Тогда
		
		// Регистры сведений "ЗначенияПоказателейОтчетов";
		
		Если МассивРегистров.Найти("ЗначенияПоказателейОтчетовСинтетика") = Неопределено Тогда
			
			МетаданныеРегистра=Метаданные.РегистрыСведений.ЗначенияПоказателейОтчетовСинтетика;
			ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет);
			
		КонецЕсли;
		
		Если МассивРегистров.Найти("ЗначенияПоказателейОтчетовВалютные") = Неопределено Тогда
			
			МетаданныеРегистра=Метаданные.РегистрыСведений.ЗначенияПоказателейОтчетовВалютные;
			ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет);
			
		КонецЕсли;
		
		Для Индекс=1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
			
			Если МассивРегистров.Найти("ЗначенияПоказателейОтчетов"+Индекс) = Неопределено Тогда
				
				МетаданныеРегистра=Метаданные.РегистрыСведений["ЗначенияПоказателейОтчетов"+Индекс];
				ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивРегистров.Найти("ЗначенияПоказателейОтчетовНечисловые") = Неопределено Тогда
			
			МетаданныеРегистра=Метаданные.РегистрыСведений.ЗначенияПоказателейОтчетовНечисловые;
			ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет);
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Документ", Отчет.Документ);
	
	СписокОбъектов.Очистить();
	
	Если Параметры.Свойство("СписокОбъектов") тогда
		СписокОбъектов.ЗагрузитьЗначения(Параметры.СписокОбъектов.ВыгрузитьЗначения()); 
	КонецЕсли;
	
	Если СписокОбъектов.Количество() = 0 тогда
		Элементы.СписокОбъектов.Видимость = Ложь;
		Элементы.Документ.Видимость = Истина;
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(СписокОбъектов[0].Значение));	
		ОписаниеТиповОбъекта = Новый ОписаниеТипов(МассивТипов);
		СписокОбъектов.ТипЗначения = ОписаниеТиповОбъекта;
		Отчет.Документ = ОписаниеТиповОбъекта.ПривестиЗначение();
		
		Элементы.СписокОбъектов.Видимость = Истина;
		Элементы.Документ.Видимость = Ложь;
	КонецЕсли;
		
	ПриИзмененииДокумента();
				
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДокумента()
	
	Если Отчет.Документ=Неопределено Тогда
		
		ПоГоризонтали = 1;
		Возврат;
		
	КонецЕсли;
	
	МетаданныеДокумента = Отчет.Документ.Метаданные();
	
	ИмяДокумента=МетаданныеДокумента.Имя;
	
	Если ИмяДокумента="НастраиваемыйОтчет" Тогда
		
		ПоГоризонтали = 1;
		
	ИначеЕсли ИмяДокумента="Трансляция"
		ИЛИ ИмяДокумента="ТрансформационнаяКорректировка"
		ИЛИ ИмяДокумента="КорректировкаЗначенийПоказателей"
		ИЛИ ИмяДокумента="УправлениеЛимитами" Тогда

		ПоГоризонтали = 1; //Перечисления.СпособыВыводаОтчета.ПоГоризонтали
		
	ИначеЕсли ИмяДокумента="ОписаниеВерсий" Тогда
		
		ПоГоризонтали = 1;
		
	Иначе
		
		ПоГоризонтали = 0; //Перечисления.СпособыВыводаОтчета.ПоВертикали;
		
	КонецЕсли;
	
	СформироватьОтчет();
	
КонецПроцедуры // ПриИзмененииДокумента() 

&НаКлиенте
Процедура СформироватьВыполнить()
	
	СформироватьОтчет();

КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ПриИзмененииДокумента();
	
КонецПроцедуры
