#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИТК_Перечисления.ЗаполнитьСписок(Элементы.Консоли_СохранятьДанныеПоУмолчаниюВ, ИТК_Перечисления.ТипыХраненияДанных());
	ЗагрузитьЗначенияНастроек();
	ИТК_Форма.УстановитьНазначениеДействияКоманды(Команды.Сохранить, "Завершение");
	
	ИТК_Форма.ОбработчикПриСозданииНаСервереПосле(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если Модифицированность Тогда
		
		СохранитьЗначенияНастроек();
		Оповестить(ИТК_НастройкиКлиентСервер.ИмяСобытияНастройкиИзменены());
	
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЗначенияНастроек()
	
	Для Каждого ВидНастройки Из ВидыНастроек() Цикл 
		
		ГруппаНастроек = ВидНастройки.Значение;
		
		НастройкиГруппы = ИТК_НастройкиКлиентСерверПовтИсп.Список(ГруппаНастроек);
		Для Каждого ОписаниеНастройки Из НастройкиГруппы Цикл 
			
			ИмяНастройки = ОписаниеНастройки.Ключ;
			ЗначениеНастройки = ИТК_Настройки.Значение(ГруппаНастроек, ИмяНастройки);
			
			ЭтотОбъект[ВидНастройки.Ключ + "_" + ИмяНастройки] = ЗначениеНастройки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияНастроек()

	Для Каждого ВидНастройки Из ВидыНастроек() Цикл 
		
		ГруппаНастроек = ВидНастройки.Значение;
		
		НастройкиГруппы = ИТК_НастройкиКлиентСерверПовтИсп.Список(ГруппаНастроек);
		Для Каждого ОписаниеНастройки Из НастройкиГруппы Цикл 
			
			ИмяНастройки = ОписаниеНастройки.Ключ;
			ЗначениеНастройки = ЭтотОбъект[ВидНастройки.Ключ + "_" + ИмяНастройки];
			ИТК_Настройки.ЗаписатьЗначение(ГруппаНастроек, ИмяНастройки, ЗначениеНастройки);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидыНастроек()
	
	Результат = Новый Соответствие;
	//Результат.Вставить("Общие", Неопределено);
	Результат.Вставить("Консоли", ИТК_Перечисления.ГруппаИнструментовКонсоли());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
