
#Область СлужебныеПроцедурыИФункции

// Возвращает список констант для сервиса.
//
// Параметры:
//   ВВерхнемРегистре - Булево - Истина, если получать строковые значения констант в верхнем регистре.
//
// Возвращаемое значение:
//   Соответствие Из КлючИЗначение - имена и значения констант.
//
Функция КонстантыСервиса(Знач ВВерхнемРегистре = Истина) Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("СпособОтраженияПродажРеализация", 0);
	Результат.Вставить("СпособОтраженияПродажКомиссия",   1);
	
	Результат.Вставить("УПД_Штрихкод",                    "штрихкод");	//@NON-NLS-1
	
	Если ВВерхнемРегистре Тогда
		Для Каждого КлючИЗначение Из Результат Цикл
			Если ТипЗнч(КлючИЗначение.Значение) = Тип("Строка") Тогда
				Результат.Вставить(КлючИЗначение.Ключ, ВРег(КлючИЗначение.Значение));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
