//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.НормативныйГрафикПроизводстваПоЗаказам);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Просмотр нормативного графика производства продукции.';
									|en = 'View the standard production schedule.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НормативныйГрафикПроизводстваПоЗаказам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие желаемые даты запуска/выпуска продукции и полуфабрикатов по заказам?
										|Какие этапы необходимо выполнить за период?
										|Какой объем номенклатуры запланирован к производству?';
										|en = 'What are the desired launch/release dates of manufactured products and semi-finished products under orders?
										|What stages need to be completed during the period?
										|What volume of products is planned for production?'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
