
&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	РеквизитыИсполнительногоДокумента = Новый Структура("ДатаВыдачи, ОрганВыдавшийИсполнительныйДокумент, НомерИсполнительногоДокумента");
	ЗаполнитьЗначенияСвойств(РеквизитыИсполнительногоДокумента, ЭтаФорма);
	
	Оповестить("ИзмененыРеквизитыИсполнительногоДокумента", РеквизитыИсполнительногоДокумента, ВладелецФормы);
	
	Закрыть();
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаВыдачи = Параметры.ДатаВыдачи;
	НомерИсполнительногоДокумента = Параметры.НомерИсполнительногоДокумента;
	ОрганВыдавшийИсполнительныйДокумент = Параметры.ОрганВыдавшийИсполнительныйДокумент;
	
КонецПроцедуры




