#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
		
		УстановитьОтобрПредопределенных = Истина;
		Если Параметры.Отбор.Свойство("ПоказыватьТрудовыеФункцииДоговоровГПХ") Тогда
			Если Параметры.Отбор.ПоказыватьТрудовыеФункцииДоговоровГПХ Тогда
				УстановитьОтобрПредопределенных = Ложь;
			КонецЕсли;
			Параметры.Отбор.Удалить("ПоказыватьТрудовыеФункцииДоговоровГПХ");
		КонецЕсли;
		
		Если УстановитьОтобрПредопределенных Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Предопределенный", Ложь, ВидСравненияКомпоновкиДанных.Равно, ,
				Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	УстановитьОтобрСписка(ЭтотОбъект, ПоказыватьУстаревшие);
	
	ЗачеркнутыйШрифт = Новый Шрифт(Элементы.Список.Шрифт,,,,,,Истина,);
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Зачеркивать устаревшие.';
											|en = 'Зачеркивать устаревшие.'");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ВАрхиве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт",ЗачеркнутыйШрифт);
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Список");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьУстаревшиеПриИзменении(Элемент)
	УстановитьОтобрСписка(ЭтотОбъект, ПоказыватьУстаревшие);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтобрСписка(УправляемаяФорма, ПоказыватьУстаревшие)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		УправляемаяФорма.Список, "ВАрхиве", Ложь, ВидСравненияКомпоновкиДанных.Равно, ,
		Не ПоказыватьУстаревшие, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти
