
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаполнитьРегистр(Команда)
	ПерезаполнитьРегистрНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПерезаполнитьРегистрНаСервере()
	
	НаборЗаписей = РегистрыСведений.РабочиеМестаСотрудниковИнтервальный.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать();
	
	РегистрыСведений.РабочиеМестаСотрудников.ЗаполнитьИнтервальныйРегистр();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
