
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда		
		Запись.РучнойВвод = Истина;		
	КонецЕсли;                       
	
	Элементы.ТекстРежимаРедактирования.Заголовок = ?(Запись.РучнойВвод, "Ручной режим редактирование записи.", "Запись добавлена автоматически. Режим изменения заблокирован!");;
		
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ДокументОплаты) Тогда
		ТекущийОбъект.ДокументОплаты = Неопределено; //Если выбрали тип документа оплаты, но не выбрали сам документ, то сбрасываем в Неопределено!			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

 &НаКлиенте
Процедура ДокументОтгрузкиПриИзменении(Элемент)  
	
	Запись.ДоговорКонтрагента = ПолучитьВерсиюСоглашенияДокумента(Запись.ДокументОтгрузки);      
	Запись.ИдентификационныйКодЗакупки = ПолучитьИдентификационныйКодЗакупки(Запись.ДоговорКонтрагента);
	УстановитьВидимостьДоступность();

КонецПроцедуры  

&НаКлиенте
Процедура ДокументОплатыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Запись.ДокументОтгрузки) Тогда
		Запись.ДоговорКонтрагента = ПолучитьВерсиюСоглашенияДокумента(Запись.ДокументОплаты);	 
	КонецЕсли;
		
	Запись.ИдентификационныйКодЗакупки = ПолучитьИдентификационныйКодЗакупки(Запись.ДоговорКонтрагента);
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ЭтаФорма.ТолькоПросмотр = Не Запись.РучнойВвод;                               
	Элементы.ИдентификационныйКодЗакупки.ТолькоПросмотр = Не (Запись.РучнойВвод И ЭтоИсполнениеКонтрактаГОЗ(Запись.ДоговорКонтрагента))
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВерсиюСоглашенияДокумента(Документ)  
	
	ВерсияСоглашения = Неопределено;
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат ВерсияСоглашения;	
	КонецЕсли;
	
	ПроверяемыйДокумент = ?(Не ТипЗнч(Документ) = Тип("ДокументСсылка.Сторно"), Документ, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "СторнируемыйДокумент"));			
			
	Возврат РаботаСДоговорамиКонтрагентовУХ.ВерсияСоглашенияОбъекта(ПроверяемыйДокумент);
	
КонецФункции      

&НаСервереБезКонтекста
Функция ПолучитьИдентификационныйКодЗакупки(ВерсияДоговораКонтрагента) 
	
	ИдентификационныйКодЗакупки = Неопределено;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.НаправлениеДеятельности.тн_ИдентификационныйКодЗакупки КАК ИдентификационныйКодЗакупки
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВерсияСоглашения = &ВерсияДоговораКонтрагента";
	
	Запрос.УстановитьПараметр("ВерсияДоговораКонтрагента", ВерсияДоговораКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
		ВыборкаДетальныеЗаписи.Следующий();    
		
		ИдентификационныйКодЗакупки = ВыборкаДетальныеЗаписи.ИдентификационныйКодЗакупки;
		
	КонецЕсли;		
	
	Возврат ИдентификационныйКодЗакупки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоИсполнениеКонтрактаГОЗ(ВерсияДоговораКонтрагента) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК СсылкаДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВерсияСоглашения = &ВерсияДоговораКонтрагента
		|	И ДоговорыКонтрагентов.НаправлениеДеятельности.ТипНаправленияДеятельности = ЗНАЧЕНИЕ(Перечисление.ТипыНаправленийДеятельности.КонтрактГОЗ)";
	
	Запрос.УстановитьПараметр("ВерсияДоговораКонтрагента", ВерсияДоговораКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции 

#КонецОбласти
