////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотКлиентСервер: клиент, сервер
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает представление типа объекта XDTO Документооборота по имени типа.
//
// Параметры:
//   ТипXDTO - Строка - имя типа объекта XDTO.
//
// Возвращаемое значение:
//   Строка - представление типа объекта XDTO Документооборота по имени типа.
//
Функция ПредставлениеТипаОбъектаXDTO(ТипXDTO) Экспорт
	
	ПредставленияТипов = Новый Соответствие;
	
	// Справочники.
	ПредставленияТипов.Вставить("DMParty", НСтр("ru = 'Контрагенты, Организации, Пользователи';
												|en = 'Counterparties, Companies, Users'"));
	ПредставленияТипов.Вставить("DMProject", НСтр("ru = 'Проекты';
													|en = 'Projects'"));
	ПредставленияТипов.Вставить("DMProjectTask", НСтр("ru = 'Проектные задачи';
														|en = 'Project tasks'"));
	ПредставленияТипов.Вставить("DMActivity", НСтр("ru = 'Мероприятия';
													|en = 'Activities'"));
	ПредставленияТипов.Вставить("DMDiscussionTopic", НСтр("ru = 'Темы обсуждений';
															|en = 'Discussion topics'"));
	ПредставленияТипов.Вставить("DMDiscussionMessage", НСтр("ru = 'Сообщения обсуждений';
															|en = 'Discussion messages'"));
	ПредставленияТипов.Вставить("DMFile", НСтр("ru = 'Файлы';
												|en = 'Files'"));
	ПредставленияТипов.Вставить("DMFileFolder", НСтр("ru = 'Папки файлов';
													|en = 'File folders'"));
	ПредставленияТипов.Вставить("DMUser", НСтр("ru = 'Пользователи';
												|en = 'Users'"));
	ПредставленияТипов.Вставить("DMUserGroup",  НСтр("ru = 'Группы пользователей';
													|en = 'User groups'"));
	ПредставленияТипов.Вставить("DMActivityMatter", НСтр("ru = 'Вопросы деятельности';
														|en = 'Activity issues'"));
	ПредставленияТипов.Вставить("DMCurrency",НСтр("ru = 'Валюты';
													|en = 'Currencies'"));
	ПредставленияТипов.Вставить("DMInternalDocument", НСтр("ru = 'Внутренние документы';
															|en = 'Internal documents'"));
	ПредставленияТипов.Вставить("DMIncomingDocument", НСтр("ru = 'Входящие документы';
															|en = 'Incoming documents'"));
	ПредставленияТипов.Вставить("DMOutgoingDocument", НСтр("ru = 'Исходящие документы';
															|en = 'Outgoing documents'"));
	ПредставленияТипов.Вставить("DMOrganization", НСтр("ru = 'Организации';
														|en = 'Companies'"));
	ПредставленияТипов.Вставить("DMCorrespondent", НСтр("ru = 'Контрагенты';
														|en = 'Counterparties'"));
	ПредставленияТипов.Вставить("DMContactPerson", НСтр("ru = 'Контактные лица';
														|en = 'Contact persons'"));
	ПредставленияТипов.Вставить("DMAccessLevel", НСтр("ru = 'Грифы доступа';
														|en = 'Access labels'"));
	ПредставленияТипов.Вставить("DMDeliveryMethod", НСтр("ru = 'Способы доставки';
														|en = 'Delivery methods'"));
	ПредставленияТипов.Вставить("DMSubdivision", НСтр("ru = 'Структура предприятия';
														|en = 'Business units'"));
	ПредставленияТипов.Вставить("DMInternalDocumentType", НСтр("ru = 'Виды внутренних документов';
																|en = 'Kinds of internal documents'"));
	ПредставленияТипов.Вставить("DMIncomingDocumentType", НСтр("ru = 'Виды входящих документов';
																|en = 'Kinds of incoming documents'"));
	ПредставленияТипов.Вставить("DMOutgoingDocumentType", НСтр("ru = 'Виды исходящих документов';
																|en = 'Kinds of outgoing documents'"));
	ПредставленияТипов.Вставить("DMWorkType", НСтр("ru = 'Виды работ';
													|en = 'Activity kinds'"));
	ПредставленияТипов.Вставить("DMInternalDocumentFolder", НСтр("ru = 'Папки внутренних документов';
																|en = 'Internal document folders'"));
	ПредставленияТипов.Вставить("DMRelationType", НСтр("ru = 'Типы связей';
														|en = 'Link types'"));
	ПредставленияТипов.Вставить("DMObjectPropertyValue", НСтр("ru = 'Значения свойств объектов';
																|en = 'Object property values'"));
	ПредставленияТипов.Вставить("DMPrivatePerson", НСтр("ru = 'Физические лица';
														|en = 'Persons'"));
	ПредставленияТипов.Вставить("DMRoutingCondition", НСтр("ru = 'Условия маршрутизации';
															|en = 'Routing conditions'"));
	ПредставленияТипов.Вставить("DMPersonalRecipient", НСтр("ru = 'Личные адресаты';
															|en = 'Personal addressees'"));
	ПредставленияТипов.Вставить("DMPersonalRecipientGroup", НСтр("ru = 'Группы личных адресатов';
																|en = 'Personal addressee groups'"));
	ПредставленияТипов.Вставить("DMBusinessProcessExecutorRole", НСтр("ru = 'Роли исполнителей';
																		|en = 'Assignee roles'"));
	ПредставленияТипов.Вставить("DMCashFlowItem", НСтр("ru = 'Статьи движения денежных средств';
														|en = 'Cash flow items'"));
	ПредставленияТипов.Вставить("DMMeasurementUnit", НСтр("ru = 'Единицы измерения';
															|en = 'Units'"));
	ПредставленияТипов.Вставить("DMProduct", НСтр("ru = 'Товары и услуги';
													|en = 'Goods and services'"));
	ПредставленияТипов.Вставить("DMVATRateUniversal", НСтр("ru = 'Ставки НДС';
															|en = 'VAT rates'"));
	
	// Письма электронной почты.
	ПредставленияТипов.Вставить("DMIncomingEMail", НСтр("ru = 'Входящее письмо';
														|en = 'Incoming email'"));
	ПредставленияТипов.Вставить("DMOutgoingEMail", НСтр("ru = 'Исходящее письмо';
														|en = 'Outgoing email'"));
	
	// Рабочие отчеты.
	ПредставленияТипов.Вставить("DMDailyReport", НСтр("ru = 'Ежедневный отчет';
														|en = 'Daily report'"));
	
	// Фактические трудозатраты.
	ПредставленияТипов.Вставить("DMActualWork", НСтр("ru = 'Фактические трудозатраты';
													|en = 'Actual labor costs'"));
	
	// Используемые перечисления.
	ПредставленияТипов.Вставить("DMEMailAnswerType", НСтр("ru = 'Типы ответа';
															|en = 'Response types'"));
	ПредставленияТипов.Вставить("DMIssueType", НСтр("ru = 'Виды вопросов выполнения задач';
													|en = 'Issue kinds of task execution'"));
	ПредставленияТипов.Вставить("DMProlongationProcedure", НСтр("ru = 'Порядок продления';
																|en = 'Extension procedure'"));
	ПредставленияТипов.Вставить("DMDocumentStatus", НСтр("ru = 'Состояния документов';
														|en = 'Document states'"));
	ПредставленияТипов.Вставить("DMLegalPrivatePerson", НСтр("ru = 'Юридическое\физическое лицо';
															|en = 'Business entity\person'"));
	ПредставленияТипов.Вставить("DMApprovalType", НСтр("ru = 'Варианты маршрутизации задач';
														|en = 'Task routing options'"));
	ПредставленияТипов.Вставить("DMTaskExecutionOrder", НСтр("ru = 'Порядок выполнения задач';
															|en = 'Task fulfillment procedure '"));
	ПредставленияТипов.Вставить("DMApprovalOrder", НСтр("ru = 'Порядок выполнения задач';
														|en = 'Task fulfillment procedure '"));
	ПредставленияТипов.Вставить("DMApprovalResult", НСтр("ru = 'Результаты согласования';
														|en = 'Approval results '"));
	ПредставленияТипов.Вставить("DMConfirmationResult", НСтр("ru = 'Результаты утверждения';
															|en = 'Confirmation results'"));
	ПредставленияТипов.Вставить("DMRegistrationResult", НСтр("ru = 'Результаты регистрации';
															|en = 'Registration results'"));
	ПредставленияТипов.Вставить("DMInvitationResult", НСтр("ru = 'Результаты приглашения';
															|en = 'Invitation results'"));
	ПредставленияТипов.Вставить("DMGeneralInvitationResult", НСтр("ru = 'Общие результаты приглашения';
																	|en = 'General invitation results'"));
	ПредставленияТипов.Вставить("DMBusinessProcessState", НСтр("ru = 'Состояния бизнес процессов';
																|en = 'Business process states'"));
	ПредставленияТипов.Вставить("DMEMailImportance", НСтр("ru = 'Важность писем';
															|en = 'Email importance '"));
	ПредставленияТипов.Вставить("DMBusinessProcessRoutingType", НСтр("ru = 'Варианты маршрутизации задач';
																	|en = 'Task routing options'"));
	ПредставленияТипов.Вставить("DMPredecessorsStageConsiderationCondition", НСтр("ru = 'Условия рассмотрения предшественников этапа';
																					|en = 'Review conditions of step predecessors'"));
	ПредставленияТипов.Вставить("DMBusinessProcessTaskImportance", НСтр("ru = 'Варианты важности задачи';
																		|en = 'Task importance options'"));
	ПредставленияТипов.Вставить("DMBusinessProcessImportance", НСтр("ru = 'Варианты важности задачи';
																	|en = 'Task importance options'"));
	ПредставленияТипов.Вставить("DMTimeInputMethod", НСтр("ru = 'Способы указания времени';
															|en = 'Time specification methods '"));
	ПредставленияТипов.Вставить("DMVATRate", НСтр("ru = 'Ставки НДС';
													|en = 'VAT rates'"));
	
	ПредставленияТипов.Вставить("DMAdditionalProperty", НСтр("ru = 'Дополнительные реквизиты и сведения';
															|en = 'Additional attributes and information'"));
	
	// Шаблоны бизнес-процессов.
	ПредставленияТипов.Вставить("DMBusinessProcessOrderTemplate", НСтр("ru = 'Шаблоны поручения';
																		|en = 'Order templates'"));
	ПредставленияТипов.Вставить("DMBusinessProcessConsiderationTemplate", НСтр("ru = 'Шаблоны рассмотрения';
																				|en = 'Review templates'"));
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTemplate", НСтр("ru = 'Шаблоны регистрации';
																				|en = 'Registration templates'"));
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTemplate", НСтр("ru = 'Шаблоны согласования';
																			|en = 'Approval templates'"));
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTemplate", НСтр("ru = 'Шаблоны утверждения';
																				|en = 'Confirmation templates'"));
	ПредставленияТипов.Вставить("DMBusinessProcessPerformanceTemplate", НСтр("ru = 'Шаблоны исполнения';
																			|en = 'Execution templates'"));
	ПредставленияТипов.Вставить("DMBusinessProcessAcquaintanceTemplate", НСтр("ru = 'Шаблоны ознакомления';
																				|en = 'Preview templates'"));
	ПредставленияТипов.Вставить("DMCompoundBusinessProcessTemplate", НСтр("ru = 'Шаблоны составных бизнес процессов';
																			|en = 'Templates of multiple business processes'"));
	
	// Бизнес-процессы.
	ПредставленияТипов.Вставить("DMBusinessProcessOrder", НСтр("ru = 'Поручение';
																|en = 'Instruction'"));
	ПредставленияТипов.Вставить("DMBusinessProcessConsideration", НСтр("ru = 'Рассмотрение';
																		|en = 'Review'"));
	ПредставленияТипов.Вставить("DMBusinessProcessRegistration", НСтр("ru = 'Регистрация';
																		|en = 'Registration'"));
	ПредставленияТипов.Вставить("DMBusinessProcessApproval", НСтр("ru = 'Согласование';
																	|en = 'Approval'"));
	ПредставленияТипов.Вставить("DMBusinessProcessApproval_1.2.1.11", НСтр("ru = 'Согласование';
																			|en = 'Approval'"));
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmation", НСтр("ru = 'Утверждение';
																		|en = 'Confirmation'"));
	ПредставленияТипов.Вставить("DMBusinessProcessPerformance", НСтр("ru = 'Исполнение';
																	|en = 'Execution'"));
	ПредставленияТипов.Вставить("DMBusinessProcessPerformance_1.2.1.11", НСтр("ru = 'Исполнение';
																				|en = 'Execution'"));
	ПредставленияТипов.Вставить("DMBusinessProcessAcquaintance", НСтр("ru = 'Ознакомление';
																		|en = 'Preview'"));
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolution", НСтр("ru = 'Решение вопросов выполнения задач';
																		|en = 'Resolve Task execution issues'"));
	ПредставленияТипов.Вставить("DMBusinessProcessIncomingDocumentProcessing", НСтр("ru = 'Обработка входящего документа';
																					|en = 'Incoming document processing'"));
	ПредставленияТипов.Вставить("DMBusinessProcessInternalDocumentProcessing", НСтр("ru = 'Обработка внутреннего документа';
																					|en = 'Internal document processing'"));
	ПредставленияТипов.Вставить("DMBusinessProcessOutgoingDocumentProcessing", НСтр("ru = 'Обработка исходящего документа';
																					|en = 'Outgoing document processing'"));
	
	// Типизированные задачи.
	ПредставленияТипов.Вставить("DMBusinessProcessTask", НСтр("ru = 'Задача исполнителя';
																|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessOrderTaskCheckup", НСтр("ru = 'Задача исполнителя';
																			|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTaskApproval", НСтр("ru = 'Задача исполнителя';
																				|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTaskCheckup", НСтр("ru = 'Задача исполнителя';
																			|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTaskConfirmation", НСтр("ru = 'Задача исполнителя';
																						|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTaskCheckup", НСтр("ru = 'Задача исполнителя';
																				|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTaskRegistration", НСтр("ru = 'Задача исполнителя';
																						|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTaskCheckup", НСтр("ru = 'Задача исполнителя';
																				|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessPerfomanceTaskCheckup", НСтр("ru = 'Задача исполнителя';
																				|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessConsiderationTaskAcquaint", НСтр("ru = 'Задача исполнителя';
																					|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolutionTaskQuestion", НСтр("ru = 'Задача исполнителя';
																					|en = 'Task of assignee'"));
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolutionTaskAnswer", НСтр("ru = 'Задача исполнителя';
																					|en = 'Task of assignee'"));
	
	ПредставлениеТипа = ПредставленияТипов.Получить(ТипXDTO);
	
	Если ЗначениеЗаполнено(ПредставлениеТипа) Тогда
		Возврат ПредставлениеТипа;
	Иначе
		Возврат ТипXDTO;
	КонецЕсли;
	
КонецФункции

// Преобразует длительность интервала времени в строку вида час:мин.
//
// Параметры:
//   Длительность - Число - длительность интервала времени в секундах.
//   ПредставлениеНуля - Строка - представление интервала нулевой длительности.
//
// Возвращаемое значение:
//   Строка - представление интервала в виде час:мин.
//
Функция ЧислоВСтроку(Длительность, ПредставлениеНуля = "'") Экспорт
	
	Если Длительность = 0 Тогда
		Возврат ПредставлениеНуля;
	КонецЕсли;
	
	Час = Цел(Длительность / 3600);
	Мин = (Длительность - Час*3600) / 60;
	
	Возврат Формат(Час, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=") + ":" + Формат(Мин, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=");
	
КонецФункции

// Преобразует строку вида час:мин в длительность интервала времени.
//
// Параметры:
//   ДлительностьСтр - Строка - представление интервала времени в виде строки час:мин.
//
// Возвращаемое значение:
//   Число - длительность интервала времени в секундах.
//
Функция ЧислоИзСтроки(ДлительностьСтр) Экспорт
	
	Если Не ЗначениеЗаполнено(ДлительностьСтр) Тогда
		Возврат 0;
	КонецЕсли;
	
	Поз = Найти(ДлительностьСтр, ":");
	Если Поз = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Час = Лев(ДлительностьСтр, Поз-1);
	Мин = Сред(ДлительностьСтр, Поз+1);
	
	Возврат Число(Час) * 3600 + Число(Мин) * 60;
	
КонецФункции

// Выполняет проверку строки на соответствие представлению интервала времени в виде час:мин.
//
// Параметры:
//   ДлительностьСтр - Строка - проверяемая строка.
//
// Возвращаемое значение:
//   Булево - Истина, если переданная строка соответствует виду час:мин, и Ложь в противном случае.
//
Функция ПроверитьФормат(ДлительностьСтр) Экспорт
	
	Поз = Найти(ДлительностьСтр, ":");
	Если Поз = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧасСтр = Лев(ДлительностьСтр, Поз-1);
	МинСтр = Сред(ДлительностьСтр, Поз+1);
	
	Если Не ЗначениеЗаполнено(ЧасСтр) Тогда
		ЧасСтр = "00";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(МинСтр) Тогда
		МинСтр = "00";
	КонецЕсли;
	
	Час = Число(ЧасСтр);
	Мин = Число(МинСтр);
	Если (Час >= 24) Или (Мин >= 60) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Час < 10 Тогда
		ЧасСтр = "0" + Час;
	КонецЕсли;
	Если Мин < 10 Тогда
		МинСтр = "0" + Мин;
	КонецЕсли;
	
	ДлительностьСтр = ЧасСтр + ":" + МинСтр;
	
	Возврат Истина;
	
КонецФункции

// Возвращает строку представления проекта и проектной задачи для одного поля.
//
// Параметры:
//   Проект - ЛюбаяСсылка, Строка - ссылка или строка представления проекта.
//   ПроектнаяЗадача - ЛюбаяСсылка, Строка - ссылка или строка представления проектной задачи.
//
// Возвращаемое значение:
//   Строка
//
Функция ПредставлениеПроектаЗадачи(Проект, ПроектнаяЗадача) Экспорт
	
	ПредставлениеПроектаЗадачи = "";
	
	Если ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		
		ПредставлениеПроектаЗадачи = Строка(Проект) + " (" + Строка(ПроектнаяЗадача) + ")";
		
	ИначеЕсли ЗначениеЗаполнено(Проект) Тогда
		
		ПредставлениеПроектаЗадачи = Строка(Проект);
		
	КонецЕсли;
	
	Возврат ПредставлениеПроектаЗадачи;
	
КонецФункции

// Добавляет к Строке Разделитель и ДобавляемоеЗначение в случае, если Строка и
// ДобавляемоеЗначение не пустые. Если Строка пустая или ДобавляемоеЗначение
// не заполнено - то добавляет к Строке ДобавляемоеЗначение.
//
// Параметры:
//   ИсходнаяСтрока - Строка - Модифицируется в процедуре.
//   Разделитель - Строка - Разделитель.
//   ДобавляемоеЗначение - Строка - Добавляемое значение.
//
Процедура ДобавитьЗначениеКСтрокеЧерезРазделитель(ИсходнаяСтрока, Разделитель, ДобавляемоеЗначение) Экспорт
	
	Если ПустаяСтрока(ИсходнаяСтрока) Тогда
		ИсходнаяСтрока = Строка(ДобавляемоеЗначение);
	ИначеЕсли Не ПустаяСтрока(ДобавляемоеЗначение) Тогда
		ИсходнаяСтрока = Строка(ИсходнаяСтрока) + Разделитель + ДобавляемоеЗначение;
	КонецЕсли;
	
КонецПроцедуры

// Получает картинку предмета из библиотеки согласно его роли.
//
// Параметры:
//   РольПредмета - Строка - роль предмета.
//
// Возвращаемое значение:
//   Картинка - картинка из библиотеки.
//
Функция КартинкаПоРолиПредмета(РольПредмета) Экспорт
	
	Если РольПредмета = "Заполняемый" Тогда //@NON-NLS-1
		Возврат БиблиотекаКартинок.ПредметЗаполняемый16;
	ИначеЕсли РольПредмета = "Вспомогательный" Тогда //@NON-NLS-1
		Возврат БиблиотекаКартинок.ПредметВспомогательный16;
	Иначе
		Возврат БиблиотекаКартинок.ПредметОсновной16;
	КонецЕсли;
	
КонецФункции

// Получает номер картинки предмета в коллекции согласно его роли.
//
// Параметры:
//   РольПредмета - Строка - роль предмета.
//
// Возвращаемое значение:
//   Число - номер картинки из КоллекцияРолиПредметов
//
Функция НомерКартинкиПоРолиПредмета(РольПредмета) Экспорт
	
	Если РольПредмета = "Заполняемый" Тогда //@NON-NLS-1
		Возврат 5;
	ИначеЕсли РольПредмета = "Вспомогательный" Тогда //@NON-NLS-1
		Возврат 3;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Проверяет, является ли справочником тип объекта ДО.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует справочнику ДО.
//
Функция ЭтоСправочник(Тип) Экспорт
	
	Возврат Тип = "DMCorrespondent"
		Или Тип = "DMCurrency"
		Или Тип = "DMOrganization"
		Или Тип = "DMFile"
		Или Тип = "DMProject"
		Или Тип = "DMSubdivision";
	
КонецФункции

// Проверяет, является ли документом в прикладном смысле тип объекта ДО.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует документу ДО (в прикладном смысле).
//
Функция ЭтоДокумент(Тип) Экспорт
	
	Возврат Тип = "DMInternalDocument"
		Или Тип = "DMIncomingDocument"
		Или Тип = "DMOutgoingDocument";
	
КонецФункции

// Проверяет, является ли тип объекта ДО бизнес-процессом.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует бизнес-процессу ДО.
//
Функция ЭтоБизнесПроцесс(Тип) Экспорт
	
	// Проверка родительского типа средствами фабрики слишком медленна.
	Возврат Тип = "DMBusinessProcess"
		Или Тип = "DMBusinessProcessAcquaintance"
		Или Тип = "DMBusinessProcessApproval"
		Или Тип = "DMBusinessProcessApproval_1.2.1.11"
		Или Тип = "DMBusinessProcessConfirmation"
		Или Тип = "DMBusinessProcessConsideration"
		Или Тип = "DMBusinessProcessInvitation"
		Или Тип = "DMBusinessProcessIssuesSolution"
		Или Тип = "DMBusinessProcessOrder"
		Или Тип = "DMBusinessProcessPerformance"
		Или Тип = "DMBusinessProcessPerformance_1.2.1.11"
		Или Тип = "DMBusinessProcessRegistration"
		Или Тип = "DMBusinessProcessIncomingDocumentProcessing"
		Или Тип = "DMBusinessProcessInternalDocumentProcessing"
		Или Тип = "DMBusinessProcessOutgoingDocumentProcessing"
		Или Тип = "DMComplexBusinessProcess";
	
КонецФункции

// Проверяет, является ли тип объекта ДО задачей бизнес-процесса.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует задаче ДО.
//
Функция ЭтоЗадачаБизнесПроцесса(Тип) Экспорт
	
	// Проверка родительского типа средствами фабрики слишком медленна.
	Возврат Тип = "DMBusinessProcessTask"
		Или Тип = "DMBusinessProcessApprovalTaskApproval"
		Или Тип = "DMBusinessProcessApprovalTaskCheckup"
		Или Тип = "DMBusinessProcessConfirmationTaskCheckup"
		Или Тип = "DMBusinessProcessConfirmationTaskConfirmation"
		Или Тип = "DMBusinessProcessConsiderationTaskAcquaint"
		Или Тип = "DMBusinessProcessInvitationTaskAcquaint"
		Или Тип = "DMBusinessProcessInvitationTaskInvitation"
		Или Тип = "DMBusinessProcessInvitationTaskNotify"
		Или Тип = "DMBusinessProcessIssuesSolutionTaskAnswer"
		Или Тип = "DMBusinessProcessIssuesSolutionTaskQuestion"
		Или Тип = "DMBusinessProcessOrderTaskCheckup"
		Или Тип = "DMBusinessProcessPerfomanceTaskCheckup"
		Или Тип = "DMBusinessProcessRegistrationTaskCheckup"
		Или Тип = "DMBusinessProcessRegistrationTaskRegistration";
	
КонецФункции

// Получает строковое представление срока действия по значениям реквизитов формы.
//
// Параметры:
//   ДатаНачала - Дата - дата начала действия.
//   Бессрочный - Булево - Истина, если документ бессрочный.
//   ДатаОкончания - Дата - дата окончания действия.
//   ПорядокПродленияID - Строка - порядок продления.
//   ПорядокПродления - Строка - описание порядка продления.
//
// Возвращаемое значение:
//   Строка - представление срока действия.
//
Функция ПредставлениеСрокаДействияДокумента(ДатаНачала, Бессрочный, ДатаОкончания,  ПорядокПродленияID,
		ПорядокПродления) Экспорт
	
	Результат = "";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'с %1';
				|en = 'from %1'"),
			Формат(ДатаНачала, "ДЛФ=D"));
	КонецЕсли;
	
	Если Бессрочный = Истина Тогда
		Результат = СтрШаблон(НСтр("ru = '%1, бессрочный';
									|en = '%1, indefinite'"),
			Результат);
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		Результат = СтрШаблон(НСтр("ru = '%1 по %2';
									|en = '%1 for %2'"),
			Результат,
			Формат(ДатаОкончания, "ДЛФ=D"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПорядокПродленияID) Тогда
		Если ПорядокПродленияID = "НеПродлевается" Тогда //@NON-NLS-1
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
					НСтр("ru = 'Не продлевается';
						|en = 'Not extended'"));
		ИначеЕсли ПорядокПродленияID = "ДопускаетПродление" Тогда //@NON-NLS-1
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
					НСтр("ru = 'Допускает продление';
						|en = 'Allows extension'"));
		Иначе
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Продлевается %1';
						|en = 'Extended %1'"),
					НРег(ПорядокПродления)));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает HTML-представление документа для показа в карточке по объекту XDTO.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки ИнтеграцияС1СДокументооборот с данными документа.
//
// Возвращаемое значение:
//   Строка - HTML-представление документа.
//
Функция ПолучитьОбзорДокумента(Форма) Экспорт
	
	HTMLЗаголовок =
		"<html>
		|<head>
		|<style type=""text/css"">
		|	body {
		|		overflow:    auto;
		|		margin-top:  6px;
		|		margin-left: 10px;
		|		margin-bottom: 0px;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|	table {
		|		width:       100%;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|	td {vertical-align: top;}
		| 	a:link {
		|		color: #006699; text-decoration: none;}
		|	a:visited {
		|		color: #006699; text-decoration: none;}
		|	a:hover {
		|		color: #006699; text-decoration: underline;}
		|	p {
		|		margin-top: 7px;}
		|</style>
		|<body>";
	
	HTMLЗавершение = "</body></html>";
	HTMLТекст = HTMLЗаголовок;
	
	HTMLТекст = HTMLТекст + "<table>";
	HTMLТекст = HTMLТекст + "<tr>";
	
	Если Форма.Тип = "DMIncomingDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td width=""40%"" align=center >";
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'От кого:';
												|en = 'From:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Отправитель,
			Форма.ОтправительID, Форма.ОтправительТип);
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + ВРег(Форма.ВидДокумента);
		HTMLТекст = HTMLТекст + "<p>";
		
		Если ЗначениеЗаполнено(Форма.НомерОтправителя) И ЗначениеЗаполнено(Форма.ДатаОтправителя) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				Формат(Форма.ДатаОтправителя, "ДЛФ=D") + " № " + Форма.НомерОтправителя);
		Иначе
			ДобавитьРеквизитКHTML(HTMLТекст, "__________ №__________", "");
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td width=""40%"">";
		
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Кому:';
												|en = 'To:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
		Если ЗначениеЗаполнено(Форма.Адресат) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Адресат);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:';
													|en = 'Business unit:'"), Форма.Подразделение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.ДатаРегистрации) И ЗначениеЗаполнено(Форма.РегистрационныйНомер) Тогда
			
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Рег. № %1 от %2';
						|en = 'Reg. No. %1 from %2'"),
					Форма.РегистрационныйНомер, Формат(Форма.ДатаРегистрации, "ДЛФ=D")));
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Срок исполнения:';
													|en = 'Due date:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"),,,
				?(Форма.СостояниеИсполнениеID <> "Исполнен" И Форма.СрокИсполнения < НачалоДня(ТекущаяДата()),
					"B22222",
					"")); //@NON-NLS-3
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:';
													|en = 'Amount:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
		КонецЕсли;
		
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		Если ЗначениеЗаполнено(Форма.Подписал) Тогда
			
			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<td colspan=""3"">";
			
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
													|en = 'Signed:'"), Форма.Подписал);
			
			HTMLТекст = HTMLТекст + "</td></tr>";
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		Если ЗначениеЗаполнено(Форма.Ответственный)
			Или ЗначениеЗаполнено(Форма.Подразделение) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:';
													|en = 'Responsible person:'"), Форма.Ответственный);
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</tr>";
		
	ИначеЕсли Форма.Тип = "DMInternalDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
		
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 № %2 от %3';
				|en = '%1 No. %2 from %3'"),
			ВРег(Форма.ВидДокумента),
			?(ЗначениеЗаполнено(Форма.РегистрационныйНомер), Форма.РегистрационныйНомер, "_____"),
			?(ЗначениеЗаполнено(Форма.ДатаРегистрации), Формат(Форма.ДатаРегистрации, "ДЛФ=D"), "_____"));
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"" >";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" >";
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(
				HTMLТекст,
				НСтр("ru = 'Срок исполнения:';
					|en = 'Due date:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"),,,
				?(Форма.СостояниеИсполнениеID <> "Исполнен" И Форма.СрокИсполнения < НачалоДня(ТекущаяДата()),
					"B22222",
					"")); //@NON-NLS-3
		КонецЕсли;
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:';
													|en = 'Amount:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
			
			Если Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВнутреннийДокумент"
					И Форма.УчитыватьНДС Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма НДС:';
														|en = 'VAT amount:'"),
					Формат(Форма.СуммаНДС, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
			КонецЕсли;
			
			Если Форма.ВестиУчетТоваровИУслуг И Форма.Товары.Количество() > 0 Тогда
				КоличествоПозиций = Форма.Товары.Количество();
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Товары и услуги:';
														|en = 'Goods and services:'"),
					Формат(КоличествоПозиций, "ЧГ=") + " "
						+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(
							КоличествоПозиций,
							"",
							НСтр("ru = 'позиция,позиции,позиций,,,,,,0';
								|en = 'position,positions,positions,,,,,,0'")));
			КонецЕсли;
			
			Если Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВнутреннийДокумент"
					И Форма.ВестиУчетПоСтатьямДДС Тогда
				СтатьиДДС = Форма.СтатьиДДС;
				КоличествоСтатей = СтатьиДДС.Количество();
				Если КоличествоСтатей = 1 Тогда
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Статья ДДС:';
															|en = 'Cash flow item:'"),
						СтатьиДДС[0].СтатьяДДС);
				ИначеЕсли КоличествоСтатей > 1 Тогда
					ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Статьи ДДС:';
														|en = 'Cash flow items:'"));
					Разделитель = "";
					Для Каждого Строка Из СтатьиДДС Цикл
						HTMLТекст = HTMLТекст + Разделитель;
						ДобавитьЗначениеКHTML(HTMLТекст, Строка.СтатьяДДС, "");
						Разделитель = "; ";
					КонецЦикла;
					HTMLТекст = HTMLТекст + "<br>";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ДобавитьПредставлениеСрокаДействия(HTMLТекст, Форма);
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		Если Форма.ВестиУчетПоКонтрагентам
				И (ЗначениеЗаполнено(Форма.Контрагент)
					Или Форма.Контрагенты.Количество()
					Или Форма.ЯвляетсяЗаявкойНаОплату) Тогда
			HTMLТекст = HTMLТекст + "<tr>";
			
			HTMLТекст = HTMLТекст + "<td width=""70%"">";
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Наша организация:';
													|en = 'Our company:'"), "");
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
			
			Если ЗначениеЗаполнено(Форма.Подписал) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
														|en = 'Signed:'"), Форма.Подписал);
			КонецЕсли;
			HTMLТекст = HTMLТекст + "</td>";
			
			ИспользоватьТерминКорреспонденты = Ложь;
			
			Если Не Форма.НесколькоКонтрагентов Тогда
				Если ЗначениеЗаполнено(Форма.Контрагент) Тогда
					HTMLТекст = HTMLТекст + "<td>";
					HTMLТекст = HTMLТекст + "<p>";
					
					Если ИспользоватьТерминКорреспонденты Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Корреспондент:';
																|en = 'Correspondent:'"), "");
					Иначе
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагент:';
																|en = 'Counterparty:'"), "");
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "<p>";
					
					ДобавитьРеквизитКHTML(HTMLТекст, "",
						Форма.Контрагент,
						Форма.КонтрагентID,
						Форма.КонтрагентТип);
					
					Если ЗначениеЗаполнено(Форма.ПодписалОтКонтрагента) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
																|en = 'Signed:'"), Форма.ПодписалОтКонтрагента);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Форма.КонтактноеЛицо) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контакт:';
																|en = 'Contact:'"), Форма.КонтактноеЛицо);
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "</td></tr>";
				КонецЕсли;
			Иначе
				HTMLТекст = HTMLТекст + "<td>";
				HTMLТекст = HTMLТекст + "<p>";
				
				Количество = 0;
				Для Каждого СтрокаКонтрагент Из Форма.Контрагенты Цикл
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтрагентID) Тогда
						Количество = Количество + 1;
					КонецЕсли;
				КонецЦикла;
				
				Если Количество = 1 Тогда
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагент:';
															|en = 'Counterparty:'"), "");
				Иначе
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагенты:';
															|en = 'Counterparties:'"), "");
				КонецЕсли;
				
				HTMLТекст = HTMLТекст + "<p>";
				
				Для Каждого СтрокаКонтрагент Из Форма.Контрагенты Цикл
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтрагентID) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, "",
							СтрокаКонтрагент.Контрагент,
							СтрокаКонтрагент.КонтрагентID,
							СтрокаКонтрагент.КонтрагентТип);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаКонтрагент.ПодписалОтКонтрагента) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст,
							НСтр("ru = 'Подписал:';
								|en = 'Signed:'"),
							СтрокаКонтрагент.ПодписалОтКонтрагента);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтактноеЛицо) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст,
							НСтр("ru = 'Контакт:';
								|en = 'Contact:'"),
							СтрокаКонтрагент.КонтактноеЛицо);
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "<p>";
				КонецЦикла;
				
				// Удаление лишнего отступа
				HTMLТекст = Лев(HTMLТекст, СтрДлина(HTMLТекст) - 3);
			КонецЕсли;
			HTMLТекст = HTMLТекст + "</tr>";
		Иначе
			ДобавитьСтороны(HTMLТекст, Форма);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		
		Если ЗначениеЗаполнено(Форма.Ответственный)
				Или ЗначениеЗаполнено(Форма.Подразделение)
				Или ЗначениеЗаполнено(Форма.Подготовил) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подготовил) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подготовил:';
													|en = 'Prepared:'"), Форма.Подготовил);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:';
													|en = 'Business unit:'"), Форма.Подразделение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:';
													|en = 'Responsible person:'"), Форма.Ответственный);
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</tr>";
		
	ИначеЕсли Форма.Тип = "DMOutgoingDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td width=""40%"" align=center >";
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'От кого:';
												|en = 'From:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + ВРег(Форма.ВидДокумента);
		HTMLТекст = HTMLТекст + "<p>";
		
		Если ЗначениеЗаполнено(Форма.ДатаРегистрации) И ЗначениеЗаполнено(Форма.РегистрационныйНомер) Тогда
			
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				Формат(Форма.ДатаРегистрации, "ДЛФ=D") + " № " +  Форма.РегистрационныйНомер);
			
		Иначе
			
			ДобавитьРеквизитКHTML(HTMLТекст, "__________ №__________", "");
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td width=""40%"">";
		
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Кому:';
												|en = 'To:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Получатель,
			Форма.ПолучательID, Форма.ПолучательТип);
		Если ЗначениеЗаполнено(Форма.Адресат) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Адресат);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Срок ответа:';
													|en = 'Period for response:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"));
		КонецЕсли;
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:';
													|en = 'Amount:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
		КонецЕсли;
		
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		Если ЗначениеЗаполнено(Форма.Подписал) Или ЗначениеЗаполнено(Форма.Подготовил)
				Или ЗначениеЗаполнено(Форма.Подразделение) Тогда
			
			Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
				HTMLТекст = HTMLТекст + "<p>";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Форма.Подписал) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
														|en = 'Signed:'"), Форма.Подписал);
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.Подготовил) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подготовил:';
														|en = 'Prepared:'"), Форма.Подготовил);
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:';
														|en = 'Business unit:'"), Форма.Подразделение);
			КонецЕсли;
			
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:';
													|en = 'Responsible person:'"), Форма.Ответственный);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</tr>";
		
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td colspan=""3"">";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если Форма.Тип = "DMInternalDocument" И ЗначениеЗаполнено(Форма.Папка) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Папка:';
												|en = 'Folder:'"), Форма.Папка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ГрифДоступа) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Гриф:';
												|en = 'Label:'"), Форма.ГрифДоступа);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ВопросДеятельности) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Вопрос:';
												|en = 'Question:'"), Форма.ВопросДеятельности);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Проект) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Проект:';
												|en = 'Project:'"), Форма.Проект);
	КонецЕсли;
	
	ДобавитьПредставлениеСостояний(HTMLТекст, Форма);
	
	Если ЗначениеЗаполнено(Форма.Комментарий) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Комментарий:';
												|en = 'Comment:'"), Форма.Комментарий);
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
	HTMLТекст = HTMLТекст + "</table>";
	
	HTMLТекст = HTMLТекст + HTMLЗавершение;
	
	Возврат HTMLТекст;
	
КонецФункции

// Формирует текстовое представление состава документа.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения -  форма обработки ИнтеграцияС1СДокументооборот с данными документа.
//
// Возвращаемое значение:
//   Строка - текстовое представление состава документа.
//
Функция ПолучитьСтрокуСоставДокумента(Форма) Экспорт
	
	СтрокаСостав = ?(Форма.КоличествоЛистов > 0, СтрШаблон(
		НСтр("ru = 'листов %1,';
			|en = 'pages %1,'") + " ", Форма.КоличествоЛистов), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.КоличествоПриложений > 0, СтрШаблон(
		НСтр("ru = 'приложений %1,';
			|en = 'appendices %1,'") + " ", Форма.КоличествоПриложений), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.ЛистовВПриложениях > 0, СтрШаблон(
		НСтр("ru = 'листов в приложениях %1,';
			|en = 'pages in appendices %1,'") + " ", Форма.ЛистовВПриложениях), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.КоличествоЭкземпляров > 0, СтрШаблон(
		НСтр("ru = 'экземпляров %1,';
			|en = 'copies %1,'") + " ", Форма.КоличествоЭкземпляров), "");
			
	СтрокаСостав = ВРег(Лев(СтрокаСостав,1)) + Прав(СтрокаСостав, СтрДлина(СтрокаСостав) - 1);
	
	Если Прав(СтрокаСостав, 2) = ", " Тогда
		СтрокаСостав = Лев(СтрокаСостав, СтрДлина(СтрокаСостав) - 2);
	КонецЕсли;
	
	Возврат СтрокаСостав;
	
КонецФункции

// Строковое описание разности дат в днях с учетом склонений
//
// Параметры:
//   Дата1 - Дата - первая дата.
//   Дата2 - Дата - вторая дата.
//   ИспользоватьДатуИВремяВСрокахЗадач - Булево - признак использования даты в сроках задач.
//
// Возвращаемое значение:
//   Строка - текстовое представление разности дат.
//
Функция РазностьДатВДнях(Дата1, Дата2, ИспользоватьДатуИВремяВСрокахЗадач = Истина) Экспорт
	
	Если ИспользоватьДатуИВремяВСрокахЗадач Тогда
		ЧислоЧасов = Окр((Дата1 - Дата2) / (60*60));
		ЧислоДней = Окр(ЧислоЧасов / 24);
		ЧислоЧасов = ЧислоЧасов - ЧислоДней * 24;
	Иначе
		ЧислоЧасов = 0;
		ЧислоДней = (НачалоДня(Дата1) - НачалоДня(Дата2)) / (60*60*24);
	КонецЕсли;
		
	Если ЧислоЧасов < 0 Тогда
		ЧислоДней = ЧислоДней - 1;
		ЧислоЧасов = ЧислоЧасов + 24;
	КонецЕсли;
	ПодписьДней = ПолучитьПодписьДней(ЧислоДней);
	ПодписьЧасов = ПолучитьПодписьЧасов(ЧислоЧасов);
	
	Если ИспользоватьДатуИВремяВСрокахЗадач Тогда
		Если ЧислоДней > 0 И ЧислоЧасов > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 %2 и %3 %4';
					|en = '%1 %2 and %3 %4'"),
				Строка(ЧислоДней),
				ПодписьДней,
				Строка(ЧислоЧасов),
				ПодписьЧасов);
		ИначеЕсли ЧислоДней > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоДней),
				ПодписьДней);
		ИначеЕсли ЧислоЧасов > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоЧасов),
				ПодписьЧасов);
		Иначе
			Возврат НСтр("ru = 'Менее 1 часа';
						|en = 'Less than 1 hour'");
		КонецЕсли;
	Иначе
		Если ЧислоДней > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоДней),
				ПодписьДней);
		Иначе
			Возврат НСтр("ru = 'Менее 1 дня';
						|en = 'Less than 1 day'");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет подпись к HTML-представлению объекта.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Подпись - Строка - текст подписи.
//
Процедура ДобавитьПодписьКHTML(HTMLТекст, Подпись)
	
	Если ЗначениеЗаполнено(Подпись) Тогда
		HTMLТекст = HTMLТекст + "<FONT color=#413003>";
		HTMLТекст = HTMLТекст + Подпись + " ";
		HTMLТекст = HTMLТекст + "</FONT>";
	КонецЕсли;
	
КонецПроцедуры

// Добавляет значение к HTML-представлению, оформляя его как ссылку при необходимости.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Представление - Строка - добавляемое значение.
//   Идентификатор - Строка - идентификатор добавляемого значения.
//   Тип - Строка - тип добавляемого значения.
//
Процедура ДобавитьЗначениеКHTML(HTMLТекст, Представление, Идентификатор = Неопределено, Тип = Неопределено, Цвет = "")
	
	Если ЗначениеЗаполнено(Идентификатор) И ЗначениеЗаполнено(Тип) Тогда
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<A href=dmil:%1>%2</A>",
			Тип + ":" + Идентификатор,
			Представление);
	Иначе
		Если ЗначениеЗаполнено(Цвет) Тогда
			HTMLТекст = HTMLТекст + "<FONT color=#"+Цвет+">";
			HTMLТекст = HTMLТекст + Представление;
			HTMLТекст = HTMLТекст + "</FONT>";
		Иначе
			HTMLТекст = HTMLТекст + Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет реквизит (подпись и значение) к HTML-представлению объекта
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Подпись - Строка - подпись реквизита.
//   Представление - Строка - добавляемое значение.
//   Идентификатор - Строка - идентификатор добавляемого значения.
//   Тип - Строка - тип добавляемого значения.
//
Процедура ДобавитьРеквизитКHTML(HTMLТекст, Подпись, Представление, Идентификатор = Неопределено, Тип = Неопределено,
		Цвет = "")
	
	ДобавитьПодписьКHTML(HTMLТекст, Подпись);
	ДобавитьЗначениеКHTML(HTMLТекст, Представление, Идентификатор, Тип, Цвет);
	HTMLТекст = HTMLТекст + "<br>";
	
КонецПроцедуры

// Добавляет представление состояний документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьПредставлениеСостояний(HTMLТекст, Форма)
	
	ПредставлениеМассив = Новый Массив;
	Последовательность = Новый Структура;
	Последовательность.Вставить("СостояниеСогласование");
	Последовательность.Вставить("СостояниеУтверждение");
	Последовательность.Вставить("СостояниеРегистрация");
	Последовательность.Вставить("СостояниеРассмотрение");
	Если Форма.Тип = "DMInternalDocument" Тогда
		Последовательность.Вставить("СостояниеПодписание");
	КонецЕсли;
	Последовательность.Вставить("СостояниеИсполнение");
	Для Каждого ТипСостояния Из Последовательность Цикл
		Состояние = Форма[ТипСостояния.Ключ];
		Если ЗначениеЗаполнено(Состояние) Тогда
			ПредставлениеМассив.Добавить(Состояние);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСостояний = ПредставлениеМассив.Количество();
	Если КоличествоСостояний > 1 Тогда
		Для Индекс = 0 По КоличествоСостояний - 1 Цикл
			Если ПредставлениеМассив[Индекс] = "Проект" Тогда
				ПредставлениеМассив.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Представление = СтрСоединить(ПредставлениеМассив, ", ");
	
	// Старые версии сервиса дают только одно состояние.
	Представление = ?(Представление = "", Форма.Состояние, Представление);
	Если Представление = "" Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Состояние:';
										|en = 'State:'"));
	HTMLТекст = HTMLТекст
		+ ?(Форма.ДоступенФункционалКОРП,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<A href=dmil:%1:%2:%3>%4</A>",
				Форма.Тип, Форма.ID, "status",
				Представление),
			Представление)
		+ "<br>";
	
КонецПроцедуры

// Добавляет представление срока действия документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьПредставлениеСрокаДействия(HTMLТекст, Форма)
	
	Представление = ПредставлениеСрокаДействияДокумента(
		Форма.ДатаНачалаДействия, Форма.Бессрочный, Форма.ДатаОкончанияДействия,
		Форма.ПорядокПродленияID, Форма.ПорядокПродления);
	Если Представление = "" Тогда
		Возврат;
	КонецЕсли;
		
	ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Срок действия:';
										|en = 'Validity period:'"));
	HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<A href=dmil:%1:%2:%3>%4</A>",
		Форма.Тип, Форма.ID, "term",
		Представление)
		+ "<br>";
		
КонецПроцедуры

// Добавляет дополнительные свойства документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьДополнительныеСвойства(HTMLТекст, Форма)
	
	Для Каждого СтрокаСвойства Из Форма.Свойства Цикл
		Если ЗначениеЗаполнено(СтрокаСвойства.Значение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст,
				СтрокаСвойства.Свойство + ":",
				СтрокаСвойства.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет стороны документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьСтороны(HTMLТекст, Форма)
	
	Если Не Форма.ВестиУчетСторон И Форма.Стороны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОрганизации = Новый Массив;
	СтрокиКонтрагенты = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Форма.Стороны Цикл
		Если СтрокаТаблицы.СторонаТип = "DMOrganization"
				Или ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИмяТипаXDTO(
					СтрокаТаблицы.СторонаТип) = "DMOrganization" Тогда
			СтрокиОрганизации.Добавить(СтрокаТаблицы);
		Иначе
			СтрокиКонтрагенты.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если Не СтрокиКонтрагенты.Количество() Тогда
		ИндексПоследнего = СтрокиОрганизации.ВГраница();
		Для Счетчик = 1 По ИндексПоследнего Цикл
			СтрокиКонтрагенты.Добавить(СтрокиОрганизации[Счетчик]);
		КонецЦикла;
		Для Счетчик = 0 По ИндексПоследнего - 1 Цикл
			СтрокиОрганизации.Удалить(ИндексПоследнего - Счетчик);
		КонецЦикла;
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
	HTMLТекст = HTMLТекст + "<p>";
	ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'СТОРОНЫ';
											|en = 'PARTIES'"), "");
	HTMLТекст = HTMLТекст + "</td></tr>";

	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td width=""70%"">";
	
	ДобавитьОписаниеСтороны(HTMLТекст, СтрокиОрганизации);
	ДобавитьОписаниеСтороны(HTMLТекст, СтрокиКонтрагенты);
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
КонецПроцедуры

// Добавляет стороны документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Сторона - Массив из СтрокаТаблицыЗначений - строки таблицы "Стороны" с формы внутреннего документа.
//
Процедура ДобавитьОписаниеСтороны(HTMLТекст, Сторона)
	
	Для Каждого ОписаниеСтороны Из Сторона Цикл
		
		Если ЗначениеЗаполнено(ОписаниеСтороны.Наименование) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, СокрЛП(ОписаниеСтороны.Наименование) + ":", "");
		КонецЕсли;
		ДобавитьРеквизитКHTML(HTMLТекст, "", ОписаниеСтороны.Сторона);
		
		Если ОписаниеСтороны.Подписан Тогда
			Подписант = ОписаниеСтороны.Подписал;
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
													|en = 'Signed:'"), Подписант);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеСтороны.КонтактноеЛицо) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контакт:';
													|en = 'Contact:'"), ОписаниеСтороны.КонтактноеЛицо);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
	КонецЦикла;
	
	HTMLТекст = HTMLТекст + "</td><td>";
	
КонецПроцедуры

// Подпись к количеству дней по склонениям
//
Функция ПолучитьПодписьДней(ЧислоДней)
	
	Если ЧислоДней > 10 И ЧислоДней < 20 Тогда
		Подпись = НСтр("ru = 'дней';
						|en = 'days'");
	Иначе
		ПоследниеДвеЦифры = ЧислоДней - Цел(ЧислоДней / 100) * 100;
		ПоследняяЦифра = ЧислоДней - Цел(ЧислоДней / 10) * 10;
		
		Если ПоследняяЦифра = 0 Тогда
			Подпись = НСтр("ru = 'дней';
							|en = 'days'");
		ИначеЕсли ПоследниеДвеЦифры > 10 И ПоследниеДвеЦифры < 20 Тогда
			Подпись = НСтр("ru = 'дней';
							|en = 'days'");
		ИначеЕсли ПоследниеДвеЦифры < 10 Или ПоследниеДвеЦифры > 20 Тогда
			Если ПоследняяЦифра = 1 Тогда
				Подпись = НСтр("ru = 'день';
								|en = 'day'");
			ИначеЕсли ПоследняяЦифра < 5 Тогда
				Подпись = НСтр("ru = 'дня';
								|en = 'days'");
			Иначе
				Подпись = НСтр("ru = 'дней';
								|en = 'days'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Подпись;
	
КонецФункции

// Подпись к количеству часов по склонениям
//
Функция ПолучитьПодписьЧасов(ЧислоЧасов)
	
	Если ЧислоЧасов > 10 И ЧислоЧасов < 20 Тогда
		Подпись = НСтр("ru = 'часов';
						|en = 'hours'");
	Иначе
		Срок = ЧислоЧасов - Цел(ЧислоЧасов / 10) * 10;
		Если Срок = 0 Тогда
			Подпись = НСтр("ru = 'часов';
							|en = 'hours'");
		ИначеЕсли Срок = 1 Тогда
			Подпись = НСтр("ru = 'час';
							|en = 'hour'");
		ИначеЕсли Срок < 5 Тогда
			Подпись = НСтр("ru = 'часа';
							|en = 'hours'");
		Иначе
			Подпись = НСтр("ru = 'часов';
							|en = 'hours'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Подпись;
	
КонецФункции

#КонецОбласти