
#Область ПрограммныйИнтерфейс

// Возвращает структуру с параметрами расчета курса в платежных позициях
Функция СтруктураПараметровРасчетаКурса() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("СпособОпределенияКурсаПлатежа");
	Результат.Вставить("КурсПлатежа");
	Результат.Вставить("КратностьПлатежа");
	Результат.Вставить("ДатаПлатежа");
	Результат.Вставить("ДатаФиксацииКурсаПлатежа");
	Результат.Вставить("СдвигДатыФиксацииКурсаПлатежа");
	Результат.Вставить("ВалютаДокумента");
	Результат.Вставить("ВалютаОплаты");
	Результат.Вставить("КурсПлатежаНеБолее");
	Результат.Вставить("КурсПлатежаНеМенее");
	Результат.Вставить("КурсПлатежаНеМенееВВалютеОплаты");
	Результат.Вставить("КурсПлатежаНеБолееВВалютеОплаты");  
	Результат.Вставить("ВалютаВзаиморасчетов");   
	Результат.Вставить("ОсновнаяВалютаПлатежей"); 
	
	// ЕРПУХ ++
	Результат.Вставить("ДатаОтгрузки"); //Не является реквизитом документа   
	Результат.Вставить("ДоговорКонтрагента"); // ссылка на документ
	Результат.Вставить("КурсУстановленВЗаявке"); // ссылка на документ
	// ЕРПУХ --
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает представление для платежной позиции
// Замена функции: Обработки.РаботаСЗаявкамиНаОперации.ПредставлениеПлатежнойПозиции(Форма.ПлатежнаяПозиция)
// Возвращает: форматированную строку с описанием платежной позиции
Функция ПредставлениеПлатежнойПозиции(ПлатежнаяПозиция) Экспорт
	
	ШаблонТекста = НСтр("ru = '%1: <b>%2 %3</b> (%4)'");
	ФорматнаяСтрокаДатыИсполнения = НСтр("ru = 'ДФ=dd.MM.yy; ДП=""<Дата не указана>""'");
	
	ОписанияПозиций = Новый Массив;
	Если ПлатежнаяПозиция.Количество() > 0 Тогда
		СтруктураПоиска = Новый Структура("ПриходРасход", ПлатежнаяПозиция[0].ПриходРасход);
		Для Каждого ТекСтрока Из ПлатежнаяПозиция.НайтиСтроки(СтруктураПоиска) Цикл
			Текст = СтрШаблон(ШаблонТекста, ТекСтрока.СостояниеИсполнения, ТекСтрока.Сумма, ТекСтрока.ВалютаОплаты, 
				Формат(ТекСтрока.ДатаИсполнения, ФорматнаяСтрокаДатыИсполнения));
			ОписанияПозиций.Добавить(Текст);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(СтрСоединить(ОписанияПозиций, ";    "));
	
КонецФункции

// Процедура обновляет представление платежной позиции на форме документа
Процедура ОбновитьПредставлениеПлатежнойПозиции(Форма, ПослеЗаписиДокумента = Ложь) Экспорт
	
	Если Форма.Элементы.Найти("СтрокаПлатежнаяПозиция") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Форма.СтрокаПлатежнаяПозиция = ПредставлениеПлатежнойПозиции(Форма.ПлатежнаяПозиция);
	
	ГиперСсылка = Форма.Элементы.СтрокаПлатежнаяПозиция;
	ИзмененаНеЗаписана = НЕ ПослеЗаписиДокумента И ЗначениеЗаполнено(Объект.Ссылка) И Форма.Модифицированность = Истина;
	Если ИзмененаНеЗаписана = Истина Тогда
		ГиперСсылка.Подсказка = НСтр("ru = 'Позиция изменена и будет записана вместе с документом.'");
		ГиперСсылка.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		ГиперСсылка.Подсказка = "";
		ГиперСсылка.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет действия с платежной позицией, при изменении суммы взаиморасчетов документа-заявки
Процедура УстановитьСуммуДокумента(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Если ВидыОперацийУХВызовСервераПовтИсп.ЭтоКонвертацияВалюты(Объект.ВидОперацииУХ) Тогда
		ПриПересчетеПараметровКонвертации(Форма);
	Иначе
		//
		ОперацииПлатежнойПозиции = ОперацииПлатежнойПозиции(Форма);
		Коэффициенты = Новый Массив;
		Для Каждого П1 Из ОперацииПлатежнойПозиции.Основная Цикл
			Коэффициенты.Добавить(П1.СуммаВзаиморасчетов);
		КонецЦикла;
		
		Если Коэффициенты.Количество() = 1 И Коэффициенты[0] = 0 Тогда
			Коэффициенты[0] = 1;
		КонецЕсли;
		
		НовыеСуммы = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(Объект.СуммаДокумента, Коэффициенты);
		
		Если НовыеСуммы <> неопределено Тогда
			
			Для Поз = 0 По НовыеСуммы.Количество() - 1 Цикл
				
				П1 = ОперацииПлатежнойПозиции.Основная[Поз];
				П1.СуммаВзаиморасчетов = НовыеСуммы[Поз];
				
				Если ЗначениеЗаполнено(П1.ИдентификаторВстречнойПозиции) Тогда
					П2 = ОперацииПлатежнойПозиции.КлючиПоискаВстречной[П1.ИдентификаторВстречнойПозиции];
					П2.СуммаВзаиморасчетов = П1.СуммаВзаиморасчетов;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПереоценитьПлатежнуюПозициюНаФорме(Форма);
	
КонецПроцедуры

Процедура ПриПересчетеПараметровКонвертации(Форма) Экспорт
	
	//
	Объект = форма.Объект;
	
	//
	Позиция = Форма.ПлатежнаяПозиция[0];
	Позиция.СуммаВзаиморасчетов = Объект.СуммаДокумента;
	Позиция.Сумма = Позиция.СуммаВзаиморасчетов;
	Позиция.ВалютаВзаиморасчетов = ЗаявкиНаОперацииКлиентСервер.РеквизитЗаявки(Объект, Форма.РеквизитыДокумента.ВалютаДокумента);
	Позиция.ВалютаОплаты = Позиция.ВалютаВзаиморасчетов;
	
	Если Форма.ПлатежнаяПозиция.Количество() > 1 Тогда
		ПозицияОбратная = Форма.ПлатежнаяПозиция[1];
		ПозицияОбратная.СуммаВзаиморасчетов = Объект.СуммаКонвертации;
		ПозицияОбратная.Сумма = ПозицияОбратная.СуммаВзаиморасчетов;
		ПозицияОбратная.ВалютаВзаиморасчетов = ЗаявкиНаОперацииКлиентСервер.РеквизитЗаявки(Объект, Форма.РеквизитыДокумента.ВалютаКонвертации);
		ПозицияОбратная.ВалютаОплаты = ПозицияОбратная.ВалютаВзаиморасчетов;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает структуру с полями Основная и Встречная
Функция ОперацииПлатежнойПозиции(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Результат = Новый Структура("Основная,Встречная,КлючиПоискаВстречной");
	
	ОсновноеНаправление = ЗаявкиНаОперацииКлиентСервер.РеквизитЗаявки(Объект, Форма.РеквизитыДокумента.ПриходРасход);
	ОбратноеНаправление = ОбратныйПриходРасход(ОсновноеНаправление);

	Результат.Основная = Форма.ПлатежнаяПозиция.НайтиСтроки(Новый Структура("ПриходРасход", ОсновноеНаправление));
	Результат.Встречная = Форма.ПлатежнаяПозиция.НайтиСтроки(Новый Структура("ПриходРасход", ОбратноеНаправление));
	
	Результат.КлючиПоискаВстречной = Новый Соответствие;
	Для Каждого П2 Из Результат.Встречная Цикл
		Результат.КлючиПоискаВстречной.Вставить(П2.ИдентификаторПозиции, П2);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПереоценитьПлатежнуюПозициюНаФорме(Форма) Экспорт
	
	Объект = Форма.Объект;
	ПараметрыКурса = ПлатежныеПозицииКлиентСервер.СтруктураПараметровРасчетаКурса();
	ЗаполнитьЗначенияСвойств(ПараметрыКурса, Объект); 
	ПлатежныеПозицииВызовСервера.ЗаполнитьПараметрыКурса(ПараметрыКурса, Объект);
	ПереоценитьПлатежнуюПозицию(Форма.ПлатежнаяПозиция, ПараметрыКурса);
	
КонецПроцедуры

Функция ОбратныйПриходРасход(ПриходРасход) экспорт
	
	Если ПриходРасход = ПредопределенноеЗначение("Перечисление.ВидыДвиженийПриходРасход.Приход") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыДвиженийПриходРасход.Расход");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ВидыДвиженийПриходРасход.Приход");
	КонецЕсли;
	
КонецФункции

// Функция переоценивает платежную позицию
// Замена процедуры Обработки.РаботаСЗаявкамиНаОперации.ПереоценитьПлатежнуюПозицию
Процедура ПереоценитьПлатежнуюПозицию(ПлатежнаяПозиция, ПараметрыПлатежнойПозиции) Экспорт 
	
	Для Каждого СтрокаПП Из ПлатежнаяПозиция Цикл
		ПараметрыПлатежнойПозиции.ДатаПлатежа = СтрокаПП.ДатаИсполнения;
		ПараметрыПлатежнойПозиции.ВалютаДокумента = СтрокаПП.ВалютаВзаиморасчетов;
		ПараметрыПлатежнойПозиции.ВалютаОплаты = СтрокаПП.ВалютаОплаты;
		
		ПараметрыПлатежнойПозиции.Вставить("КурсУстановленВЗаявке", СтрокаПП.КурсУстановленВЗаявке);
		Если СтрокаПП.КурсУстановленВЗаявке Тогда
			ПараметрыПлатежнойПозиции.Вставить("КурсПлатежа", СтрокаПП.КурсПлатежа);
			ПараметрыПлатежнойПозиции.Вставить("КратностьПлатежа", СтрокаПП.КратностьПлатежа);
		КонецЕсли;	
		СтруктураКурса = ДвиженияБюджетированиеУХ.ПолучитьАктуальныйКурсПоПараметрам(ПараметрыПлатежнойПозиции);
		СтрокаПП.КурсПлатежа = СтруктураКурса.Курс;
		СтрокаПП.КратностьПлатежа = СтруктураКурса.Кратность;
		СтрокаПП.Сумма = СтрокаПП.СуммаВзаиморасчетов * СтруктураКурса.РезультирующийКурс; 
	КонецЦикла;  
	
КонецПроцедуры // ПереоценитьПлатежнуюПозицию()

// Функция переоценивает бюджетирование по позиции
Процедура ПереоценитьДвиженияБюджетированияПоПозициям(ПлатежнаяПозиция, ПараметрыПлатежнойПозиции) Экспорт 
	
	ДвиженияБюджетированиеУХ.ПереоценитьДвиженияБюджетированияПоПозициям(ПлатежнаяПозиция, ПараметрыПлатежнойПозиции);
	
КонецПроцедуры


#КонецОбласти